{
	"title": "Snow White and the Seven Dwarfs",
	"release_year": "1937",
	"runtime": "83",
	"tags": [
		"Adventure",
		"Animation",
		"Family",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Adriana Caselotti",
		"Adriana Caselotti",
		"Harry Stockwell",
		"Harry Stockwell",
		"Lucille La Verne",
		"Lucille La Verne",
		"Lucille La Verne",
		"Lucille La Verne",
		"Roy Atwell",
		"Roy Atwell",
		"Stuart Buchanan",
		"Stuart Buchanan",
		"Eddie Collins",
		"Eddie Collins",
		"Eddie Collins",
		"Eddie Collins",
		"Pinto Colvig",
		"Pinto Colvig",
		"Pinto Colvig",
		"Pinto Colvig",
		"Pinto Colvig",
		"Pinto Colvig",
		"Marion Darlington",
		"Marion Darlington",
		"Billy Gilbert",
		"Billy Gilbert",
		"Otis Harlan",
		"Otis Harlan"
	],
	"staff": [
		"William Cottrell",
		"David Hand",
		"Wilfred Jackson",
		"Larry Morey",
		"Jacob Grimm",
		"Wilhelm Grimm",
		"Ted Sears",
		"Richard Creedon",
		"Frank Churchill",
		"Leigh Harline",
		"Paul J. Smith"
	],
	"votes": 218597,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTQwMzE2Mzc4M15BMl5BanBnXkFtZTcwMTE4NTc1Nw@@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "A prologue in the form of text from an ornately decorated book explains that the Evil Queen, who cares only for being \"the fairest one of all\", is jealous of her stepdaughter, Snow White. Out of fear that Snow White's beauty will one day overshadow her own, she dresses her in rags and forces her to become a scullery maid in her castle. Each morning, she consults her magic mirror, asking it who is the fairest of all. It tells her that she is, and for a while, she is content.One morning, the Mirror tells the Queen that there is a maiden fairer than she: Snow White. Meanwhile, Snow White is in the courtyard, singing \"I'm Wishing\" to herself as she works. A handsome prince, riding by the castle, hears her voice and is enchanted by it. He climbs over the castle wall, unseen by her, who is singing to her reflection at the bottom of a well. He joins in, which startles and surprises her; she runs indoors, but when he pleads for her to return, she comes to the balcony and listens as he sings \"One Song\" to her. Unseen by both, the Queen watches from her window high above. Infuriated at Snow White's beauty (and perhaps jealous for the Prince's affections), she closes the curtains in anger. The Prince smiles at Snow White before leaving.The Queen summons the Huntsman, and orders him to take Snow White far into the forest, and kill her; she demands Snow White's heart as proof. He is reluctant to do so, but is bound by his orders; he takes her deep into the forest, where he lets her gather flowers. As Snow White helps a baby bird find its parents, he unsheathes his dagger and advances on her. When she sees him approaching, she screams in terror; however, he is unable to fulfill his orders and drops his dagger. Taking pity on her, he begs for her forgiveness and, warning her of the Queen's intentions, pleads for her to run away and never come back. Snow White obeys, and as she flees through the forest, her fear manifests itself in what she sees around her; eventually, she falls to the ground in fright and breaks down sobbing. She is comforted and befriended by the forest animals; she sings \"With a Smile and a Song\" and asks them if they know of a place where she can stay.The animals lead her to the Cottage of the Seven Dwarfs, which she finds empty and dirty. Thinking that cleaning it may persuade the owners to let her stay, she and the animals clean it and its contents while singing \"Whistle While You Work\". The dwarfs, meanwhile, are working in their mine, digging for diamonds. When it is time for them to go home for the day, they march through the forest, singing \"Heigh-Ho\".After cleaning the cottage, Snow White falls asleep on several of the dwarfs' beds. When the dwarfs see light coming from the cottage, they approach cautiously, thinking that a monster has taken up residence in there. They search the ground floor but are afraid to go upstairs. After an unsuccessful attempt by Dopey to chase the \"monster\" down, they all venture upstairs to discover Snow White sleeping. She wakes up and befriends each of them. They allow her to stay (though Grumpy is reluctant). She remembers that she has left soup downstairs and rushes to prepare it, ordering the dwarfs to wash while they wait. They proceed outside to a trough, where all but Grumpy wash; the others later wash him, dumping him into the trough when supper is ready.That evening, the Queen once again consults her Magic Mirror, who tells her that Snow White still lives and that the Huntsman had given her a pig's heart. Furious at being tricked and his betrayal, she descends a spiral staircase, entering her dungeon, where she resolves to do away with Snow White herself. She uses a potion to transform herself into a witch-like peddler - a disguise to deceive Snow White. She then decides to use a poisoned apple to send Snow White into the Sleeping Death (a magically-induced coma).At the cottage, the dwarfs perform \"The Silly Song\", with Snow White singing and dancing along with them. She then sings \"Someday My Prince Will Come\" (referring to her romance with him) before sending them up to bed; however, they decide to sleep downstairs, allowing her to sleep in their beds, where she, looking towards the window, says thankful prayers about her and their protection, and wishes for Grumpy to like her more.Meanwhile, the Queen prepares the poisoned apple and, dismissing the possibility that Snow White may be revived by \"love's first kiss\" (the only cure for the Sleeping Death), gleefully proclaims that she will appear dead and be \"buried alive\". She leaves the castle and makes her way to the dwarfs' cottage, kicking the skeleton of a long-deceased prisoner on the way out.As the dwarfs leave for the mine in the morning, Snow White kisses each one on the forehead, though Grumpy initially resists. He warns her not to let any strangers into the cottage. After the dwarfs have left, the Queen in disguise goes to Snow White and offers her the poisoned apple, which she is about to accept until the animals, sensing danger from the vultures, try to attack her. This causes Snow White to take pity on her and she takes her into the cottage.The animals then rush to the mine and try to tell the dwarfs of the danger. They eventually realize what is happening, thanks to Sleepy, and, led by Grumpy, hurry back to the cottage with the animals.The Queen persuades Snow White to take a bite from the apple by telling her that it is a \"wishing apple\", which will make any wish of hers come true; after taking a bite, she collapses into a deep sleep as the Queen cackles in triumph. She then proudly exits the cottage to return home, but her victory gets cut short as the dwarfs arrive and chase her, eventually cornering her up a cliff, where she attempts to crush them with a boulder, but before she can do so, a bolt of lightning strikes the ledge she is standing on, causing her to fall off the cliff followed by the boulder, crushing her to death. Afterward, her dead body remains are devoured (off-screen) by the vultures that were following her.Back at the cottage, the dwarfs and animals hold a vigil for their sleeping Snow White. Although the other dwarfs are silent, Grumpy sobs, feeling sorry for how he mistreated Snow White, and Dopey sobs, being the one who loved her most of all.Unable to find it in their hearts to bury Snow White because she's still beautiful, they build a glass coffin in a peaceful forest glade and let her sleep there. The Prince arrives upon hearing about her sleep, and after singing a reprise of \"One Song\", he kisses her, which breaks the spell.Awakened, she bids farewell to the dwarfs and animals, then rides off with the Prince to his castle to live happily ever after.",
	"links": [
		"https://www.amazon.com/White-Dwarfs-Special-Subtitles-Language/dp/B00H7HBA4E"
	],
	"netflix": []
}