{
	"title": "Annie Hall",
	"release_year": "1977",
	"runtime": "93",
	"tags": [
		"Comedy",
		"Romance",
		"amazon"
	],
	"rating": 8.0,
	"actors": [
		"Woody Allen",
		"Diane Keaton",
		"Diane Keaton",
		"Tony Roberts",
		"Carol Kane",
		"Paul Simon",
		"Shelley Duvall",
		"Janet Margolin",
		"Colleen Dewhurst",
		"Christopher Walken",
		"Donald Symington"
	],
	"staff": [
		"Woody Allen",
		"Woody Allen",
		"Marshall Brickman",
		"Charles H. Joffe",
		"Gordon Willis",
		"Wendy Greene Bricmont",
		"Ralph Rosenblum",
		"Juliet Taylor"
	],
	"votes": 280499,
	"cover": "https://m.media-amazon.com/images/M/MV5BNjZlOWE5N2UtMTdhZC00NjU5LTg2MjYtOGU4NDhhNWNlMmRlXkEyXkFqcGc@._V1_QL75_UX190_CR0,5,190,281_.jpg",
	"description": "The comedian Alvy Singer (Woody Allen) is trying to understand why his relationship with Annie Hall (Diane Keaton) ended a year ago. Growing up in New York, he vexed his mother (Joan Newman) with impossible questions about the emptiness of existence, but he was precocious about his innocent sexual curiosity. Alvy is almost 40 years old.\nAlvy is a pessimist at heart and believes that life is full of misery and suffering and then the whole thing is over much too quickly. He believes that he would never be part of the club that would want him as a member, and that is his attitude towards life.As a child Alvy got depressed when he found that the Universe is expanding. He reckoned that the expanding Universe will eventually burst and that would be the end of everything. He lived underneath the roller coaster section of Coney Island and developed a nervous personality. Alvy's father (Mordecai Lawner) ran the bumper car section at the Island.\nHe had bad teachers and even stupider classmates. As a 6 year old, he kissed the first girl and displayed a healthy sexual curiosity.Annie and Alvy are standing in line to see a Bergman film and another man loudly misinterprets the work of Marshall McLuhan. McLuhan himself steps in to correct the mistake. Meanwhile, Annie is in a bad mood and Alvy is only focusing on himself. Annie believes that Alvy is extremely egocentric and sees every event in other's lives in relation to only how it affects him. Alvy thinks Annie is having her period and hence is in a bad mood. Annie and Alvy are having trouble in bed, but Alvy is reluctant to talk about it.That night, Annie isn't interested in having sex with him; instead, they discuss Alvy's first wife, Allison (Carol Kane), with whom there was little sexual pleasure. Allison and Alvy had met at a political convention where Allison was the organizer and Alvy was a comic. Later, Alvy would rather discuss the fine minutiae of the JFK assassination, rather than have sex with Allison. Alvy thinks that there was a second assassin.His second marriage was to a New York intellectual, but their sexual relationship was not enjoyable for him. Alvy was more interested in watching basketball than spending time with his socialite wife. But in this case, the wife was not interested in having sex with Alvy and would always reduce his sexual urges to psychoanalytical stereotypes: like using sex to express hostility towards her ideas and desires.With Annie, it is different. The two of them have uproarious fun making a meal of boiled lobster together. Alvy enjoys mocking the unusual men that Annie had been involved with. Dennis, the guy from her high school, Jerry the actor who talked in art related cliches and Annie found him creepy.Alvy met Annie on the tennis court. After the game, their awkward small talk led her to offer him first a ride up town (Annie had a car, but still jumped at the chance when Alvy offered her a lift in a cab) and then a glass of wine on her balcony. There, what seemed a mild exchange of trivial personal data is revealed in \"mental subtitles\" as an escalating flirtation. Alvy is physically attracted to Annie and wonders what she looks like naked, while Annie thinks that Alvy is a jerk and pretentious.\nTheir first date follows Annie's audition for a singer in a night club (she wraps herself around \"It Had to be You\"). Alvy suggests they kiss first thing to get it out of the way. After their lovemaking that night, Alvy is \"a wreck\", while Annie relaxes with a joint.Soon Annie admits she loves him; he buys her books on death and claims his feelings for her are more than just love. When she moves in with him, it gets very tense. Alvy is always pushing Annie to take college courses and she feels that Alvy thinks of her as dumb. Alvy is horrified to learn that Annie paid $400 per month for an apartment with bugs and bad plumbing.\nAlvy feels that Annie is \"removed\" from him during sex as if her mind in somewhere else.Alvy feels strange when they visit her family in Chippewa Falls, Wisconsin, for Easter. He has never felt more Hebrew than with her \"Hebrew-hating\" grandmother, and his imagined conversation between their two families reveals a gulf in style, substance, and background.\nAnnie has a brother Duane (Christopher Walken), mother (Colleen Dewhurst) and father (Donald Symington).Finding her arm in arm with one of her college professors, Alvy argues with Annie whether this is the flexibility they had discussed. He searches for the truth of relationships, asking strangers on the street about the nature of love, questioning his formative years, until he becomes an animated Snow White to Annie's evil queen. It's over between them.Alvy returns to dating, but the effort is marred by neurosis, bad sex, and finally an interruption from Annie, who insists he come over immediately. It turns out she needs him to kill a spider. A reconciliation follows, coupled with a vow to stay together come what may. However, their separate discussions with their therapists make it evident there is an unspoken divide. When Alvy accepts an offer to present an award on television, they fly out to Los Angeles, but on the return, they agree that it's not working.After losing her to her record producer, he unsuccessfully attempts to rekindle the flame with a marriage proposal. Back in New York, he stages a play of this episode but changes the ending: now she accepts.The last meeting for them is a wistful coda on New York's Upper West Side when they have both moved on to someone new. Alvy's voice returns with a summation: love is essential, especially if it's neurotic. Annie torches \"Seems Like Old Times\" and the credits roll.",
	"links": [
		"https://www.amazon.com/Annie-Hall-Blu-ray-Woody-Allen/dp/B006FSRSFQ"
	]
}