{
	"title": "The Abyss",
	"release_year": "1989",
	"runtime": "140",
	"tags": [
		"Adventure",
		"Drama",
		"Mystery",
		"amazon"
	],
	"rating": 7.5,
	"actors": [
		"Ed Harris",
		"Mary Elizabeth Mastrantonio",
		"Michael Biehn",
		"Leo Burmester",
		"Todd Graff",
		"John Bedford Lloyd",
		"J.C. Quinn",
		"Kimberly Scott",
		"Captain Kidd Brewer Jr.",
		"George Robert Klek"
	],
	"staff": [
		"James Cameron",
		"James Cameron",
		"Gale Anne Hurd",
		"Van Ling",
		"Alan Silvestri",
		"Mikael Salomon",
		"Conrad Buff IV",
		"Joel Goodman",
		"Steven Quale",
		"Howard E. Smith",
		"Howard Feuer",
		"Leslie Dilley"
	],
	"votes": 196754,
	"cover": "https://m.media-amazon.com/images/M/MV5BMGRkNzJlNjgtZmUwYS00Y2U3LTljZDctMTQxYWIxOWVjMzNjXkEyXkFqcGc@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "In January 1994, the U.S. Ohio-class submarine USS Montana has an encounter with an unidentified submerged object that moves at high speed, making detection difficult. Close contact with the strange object disables power and the Montana drifts into some under ocean mountain ridges and sinks near the Cayman Trough. Its bow ruptures and it quickly floods. Before the crew drowns, one of the officers launches a buoy as a locator. The US Navy brass believe Soviet ships might try to salvage the sub and with a hurricane moving over the area, the U.S. government sends a SEAL team to Deep Core, a privately-owned experimental underwater oil drilling platform near the Cayman Trough to use as a base of operations. The platform's designer, Dr. Lindsey Brigman (Mary Elizabeth Mastrantonio), insists on going along with the SEAL team, despite her estranged husband Virgil \"Bud\" Brigman (Ed Harris) being the current foreman.Bud's crew includes Alan \"Hippy\" Carnes (Todd Graff), a conspiracy theorist whom carries a pet rat on his shoulder, Catfish De Vries (Leo Burmester), a worker on the rig and a Marine Corps Vietnam veteran who is skeptical of the SEALs and Lisa \"One Night\" Standing (Kimberly Scott), is an expert operator of the rig's submersibles. Rounding out the crew are Jammer (John Bedford Lloyd), Sonny (J.C. Quinn), and Finler (Captain Kidd Brewer Jr.). Lindsay herself has a forceful, A-type personality, is not liked by many of the rig's crew, and balks at the idea of the military commandeering the rig she designed. She argues with Kirkhill (Ken Jenkins), the officer of the company, Benthic Petroleum, that currently funds the rig, its crew's salaries, and operations.The rig and it's supporting vehicles are moved 22 miles to near the last known location of the USS Montana. Deep Core can move into position under the storm front and conduct the salvage op. The Deep Core maintains comms with the surface via a long umbilical cable attached to a large catamaran-style ship on the surface. Lindsey takes the SEAL team from the surface ship down to the rig with a small submersible. At location, the sub lies at 2000 ft, 300m away from the Deep Core. The Deep core rests at the edge of a precipice, part of the Cayman Trough, about two miles in depth at their location. The sub is carrying 24 trident missiles, each with 8 warheads, of 50 kilotons each.During the initial investigation of the Montana, a power outage (exactly like the one that disabled the Montana) in the team's submersibles and diving lights leads to Lindsey seeing a strange light circling the sub. While they explore the interior of the sub for survivors, Jammer encounters a strange, glowing being. He panics, trying to escape the compartment, and slams his air tank on the doorframe. His breathing mixture becomes unstable and he convulses heavily until his crewmates can stabilize him. Back aboard the rig, the SEAL team's medic, Monk, says that Jammer is in a coma and doesn't know how long it'll last.Lt. Hiram Coffey (Michael Biehn), the SEAL team leader, is ordered by his commodore on the surface to accelerate their mission (the SEALS thinks that the strange light was a Russian spy vehicle) and takes largest of the rig's minisubs, Flatbed, without Deep Core's permission to recover a Trident missile warhead from the Montana just as the storm hits above, leaving the crew unable to disconnect from their surface support ship in time. In the storm, the surface ship loses its thrusters and drifts out of position, dragging DeepCore with it. The cable's crane is torn from the surface ship and falls into the trench. However, it rolls to the edge and drifts over the side, dragging the Deep Core to the precipice before it stops. The rig is partially flooded, killing several crew members and one of the SEALs and damaging its power systems.The crew wait out the storm so they can restore communications and be rescued. Lindsey takes a walk in a deep dive suit to examine the wreckage of the rig and access a couple of exterior oxygen tanks, encounters 2 of the strange lights, one little one and another big one. She is able to snap a few pictures before they zip into the trench at high speed. The crew are humorously skeptical but mostly believe the photo evidence she got of the vehicles luminescent characteristics. She later coins the term \"non-terrestrial intelligence\" or \"NTI\" for them. Lindsey further suggests that they were both machines, but alive. Bud confronts her about it, thinking she may be having a hallucinatory episode associated with HPNS but she's able to convince him that she's perfectly stable.Coffey, already suffering strong paranoia from HPNS, believes the NTI vehicles are enemies, possibly Russian. Still cut off from the surface, he and another SEAL arm the warhead, either as a defensive or offensive measure. Hippy shoots some video of them in their compartment with one of his ROVs (remote-operated vehicles) and shows it to Bud. Lindsey overhears their conversation and becomes infuriated, angrily confronting Coffey and uncovering the warhead.As they struggle against the cold and harsh living conditions, the NTIs have formed an animated tentacle of water that explores the rig. When it reaches the compartment most of the crew is sleeping in, Lindsey is the most curious and it forms itself into hers and Bud's faces. When she touches it, she confirms it's made of seawater. It extends itself and finds Coffey's chamber and is curious about the warhead. Coffey finds it's origin in the sub bay and out of panic closes a pressure bulkhead on it, cutting it off and prompting it to hiss at him and retreat, adding to the paranoia he's already experiencing. Lindsey theorizes that the NTIs have the ability to control water at a molecular level, shaping it to whatever form they wish.Coffey thinks the NTI went straight for the warhead and treats the incident as a preemptive attack. Since surface communications are still down he decides to launch the warhead into the trench tied to the ROV \"Big Geek\", which Hippy had Pre-Programmed to go to the bottom of the trench. Coffey takes everyone prisoner and leaves one of his number to watch them. He locks off the only door to the rig's sub bay and waits for his time to launch the ROV.Bud and Cat volunteer to use an access hatch to swim to another hatch but are unable to open it. Cat stays behind and Bud swims to the moon pool (the rig's sub bay) and tries to sneak up on Coffey, intending to strike him with a length of pipe or disarm him. Coffey notices him and tries to shoot him but Ensign Monk had emptied the pistol when his lieutenant was distracted taking the crew prisoner. Bud fights Coffey hand-to-hand but is quickly overpowered. While Coffey tries to strangle him with loose cabling, Cat suddenly appears and hits Coffey, knocking him backwards. Coffey retreats to Flatbed and escapes. Moments later he releases the ROV. Bud is able to tie a rope around it but is attacked by Coffey, who tries to run him down. He's stopped when Lindsey runs her own sub into Flatbed.Bud joins Lindsey but they fail to stop the ROV from disappearing into the trench. Coffey chases them across the sea floor until Lindsey is able to smash her sub into Flatbed, disabling them both. Coffey, who ends up hanging off the precipice, sinks moments later and dies when the sub implodes because of the immense pressure.Lindsey's mini-sub is inoperable and taking on water; with only one functional diving suit, Lindsey opts to enter deep hypothermia when the ocean's cold water engulfs her. Bud swims back to the platform with her body; there, he and the crew use a defibrillator and administer CPR but she seems to be gone. Bud becomes more desperate and tries again, telling her she's never backed down from any challenge, and furiously slaps her. Lindsey finally sucks in a deep breath and is revived. In her last moments of unconsciousness, the water in the sub bay glows, seemingly from the NTIs, who might have had a hand in reviving her.Monk (Adam Nelson), helps Bud use an experimental diving suit equipped with a liquid breathing apparatus to survive to that depth, though he will only be able to communicate through a keypad on the suit. Bud begins his dive, assisted by Lindsey's voice to keep him coherent against the effects of the mounting pressure, and reaches the warhead. Monk guides him in successfully disarming it. With little breathable fluid left in the system, Bud explains he knew it was a one-way trip, and tells Lindsey he loves her. As he waits for death, an NTI approaches Bud, takes his hand, and guides him to an alien city deep in the trench. Inside the city, the NTIs create an atmospheric pocket for Bud, allowing him to breathe normally. After Bud greets them they show him the news footage of the tense conflict the salvage operation has created in the world, which seems on the brink of war. The aliens have created massive mega-tsunamis each over 1000 feet high that threaten the world's coastlines. Bud argues they shouldn't judge humanity and the aliens show him a rapid montage of human conflict from history to the present. However, they relent when they show Bud his last message to Lindsey and his expression of love and devotion to her. The tsunamis are withdrawn.On Deep Core the crew is waiting for rescue when they see a message from Bud that he met some \"new friends down here\" and warns them to hold on. The rig vibrates and lights from the trench bring the arrival of the alien ship. It rises to the ocean's surface, with Deep Core and several of the surface ships run aground on its hull. The crew of Deep Core exit the platform, surprised they are not suffering from decompression sickness. They see Bud walking out of the alien ship and Lindsey races to him. They greet each other as Mrs. and Mr. Brigman and kiss.",
	"links": [
		"https://www.amazon.com/Abyss-Special-Ed-Harris/dp/B0CGPJFHW5"
	]
}