{
	"title": "Spaceballs",
	"release_year": "1987",
	"runtime": "96",
	"tags": [
		"Adventure",
		"Comedy",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Mel Brooks",
		"Mel Brooks",
		"John Candy",
		"Rick Moranis",
		"Bill Pullman",
		"Daphne Zuniga",
		"Dick Van Patten",
		"George Wyner",
		"Michael Winslow",
		"Joan Rivers",
		"Lorene Yarnell Jansson"
	],
	"staff": [
		"Mel Brooks",
		"Mel Brooks",
		"Thomas Meehan",
		"Ronny Graham",
		"Mel Brooks",
		"John Morris",
		"Nick McLean",
		"Conrad Buff IV",
		"David Rubin",
		"Bill Shepard",
		"Terence Marsh"
	],
	"votes": 210076,
	"cover": "https://m.media-amazon.com/images/M/MV5BZWNhNWM3NWQtNTMwNy00NThiLWFkZDYtYzBlZTQyZGU2YzE1XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Spoof on StarWars.\nPlanet Spaceball, led by President Skroob (Brooks), has wasted all of its air. Skroob schemes to steal air from the planet Druidia by kidnapping the daughter of King Roland (Dick Van Patten), Princess Vespa (Zuniga), on the day of her already arranged wedding to the narcoleptic Prince Valium (Jim J. Bullock). Skroob sends Dark Helmet (Moranis) to complete this task with Spaceball One, an impossibly huge ship piloted by Colonel Sandurz (George Wyner). Before they can arrive, Vespa herself abandons her marriage and flees the planet along with her Droid of Honor, Dot Matrix (voiced by Rivers), in her personal Mercedes spaceship.King Roland contacts the mercenary Captain Lone Starr (Pullman) and his Mawg (half-man, half-dog) sidekick, Barf (Candy), offering a lucrative reward to retrieve Vespa before she is captured. Lone Starr readily accepts, as he is in major debt with the space gangster Pizza the Hutt (voice of Dom DeLuise). Lone Starr and Barf, in their Winnebago space ship (Eagle 5), reach Vespa before Spaceball One, rescue her and Dot, and escape into hyperspace. Running out of fuel, they crash on the nearby desert \"Moon of Vega\", and find their way to a cave occupied by the wise old Yogurt (Brooks). Yogurt introduces Lone Starr to the power of \"The Schwartz\". Yogurt also introduces the audience to the film's merchandising campaign, which becomes prevalent throughout the rest of the film. During their respite on the moon, Lone Starr and Vespa begin to flirt, but Vespa insists she can only be married to a prince.Spaceball One, by breaking the fourth wall, has been able to track down Lone Starr, capture Vespa, and return with her to the planet Spaceball. The Spaceballs threaten to reverse Vespa's nose job, forcing Roland to give over the code to the shield that protects Druidia. Dark Helmet takes Spaceball One to Druidia, and transforms the ship into Mega Maid, a giant robotic maid with a vacuum cleaner that begins sucking the air from the planet. Lone Starr, with Yogurt's help in repairing his ship and training in the Schwartz, races to the planet Spaceball to rescue Vespa, and then returns to Druidia, using the Schwartz to reverse the robot's sucking action and returning the air to the planet. Lone Starr and his allies enter the Mega Maid to attempt to destroy the robot.Lone Starr is forced to fight against Dark Helmet near the ship's self-destruct button, and manages to best him, causing Dark Helmet to accidentally strike the button himself. Lone Starr and his friends escape the ship, while Skroob, Dark Helmet, and Colonel Sandurz fail to reach any escape pods in time, and are left stranded aboard the robot's head as the robot explodes. They land on a nearby planet, much to the regret of its ape population.Lone Starr returns Vespa to Druidia, but quietly leaves with enough of the reward to pay for fuel, his debt to Pizza nullified from Pizza's death. As Lone Starr stops to refuel, he gets a final message from Yogurt that he is actually a prince. Lone Starr arrives in time to stop Vespa's marriage, announcing himself as a prince, and he and Vespa are quickly married.",
	"links": [
		"https://www.amazon.com/Spaceballs-Mel-Brooks/dp/B003UAHIM0"
	]
}