{
	"title": "Dumbo",
	"release_year": "1941",
	"runtime": "64",
	"tags": [
		"Adventure",
		"Animation",
		"Drama"
	],
	"rating": 7.2,
	"actors": [
		"Sterling Holloway",
		"Sterling Holloway",
		"Edward Brophy",
		"Edward Brophy",
		"Herman Bing",
		"Herman Bing",
		"Billy Bletcher",
		"Billy Bletcher",
		"Hall Johnson Choir",
		"Hall Johnson Choir",
		"Cliff Edwards",
		"Cliff Edwards",
		"Verna Felton",
		"Verna Felton",
		"Verna Felton",
		"Verna Felton",
		"Stan Freberg",
		"Noreen Gammill",
		"Noreen Gammill",
		"Eddie Holden",
		"Eddie Holden"
	],
	"staff": [
		"Samuel Armstrong",
		"Norman Ferguson",
		"Wilfred Jackson",
		"Jack Kinney",
		"Joe Grant",
		"Dick Huemer",
		"Otto Englander",
		"Bill Peet",
		"Frank Churchill",
		"Oliver Wallace"
	],
	"votes": 143786,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzIzZWZmM2ItNGMzOC00MGFiLTgxODgtNTQ2Mzk3ZWE1MzYxXkEyXkFqcGc@._V1_QL75_UX190_CR0,3,190,281_.jpg",
	"description": "While a large circus spends the off-season in the \"Winter Grounds\" in Florida, a flock of white storks delivers babies to the animals. One elephant, Mrs. Jumbo (Verna Felton), does not receive her baby, and keeps scanning the sky. The circus sets out on a new tour, and a belated stork (Sterling Holloway) catches up with the moving train and drops off the expected baby elephant, Jumbo Junior. Casey Junior (Margaret Wright), the sentient 2-4-0 tender locomotive hauling the circus train.\nThe other elephants (Catty (Noreen Gammill), Giddy (Dorothy Scott), Prissy (Sarah Selby)) are initially delighted, until they see the baby has far-oversized ears, and promptly nickname him \"Dumbo\". However, Mrs. Jumbo shows her baby great care and love, defending him from the teasing of the other elephants.The circus reaches its new destination and sets up camp. The crews work all night in heavy rains to set up the main tent.\nDumbo, clumsy due to his ears (he keeps tripping himself on his ears), is made into a sideshow attraction. When some rowdy boys start blowing in and pulling Dumbo's ears, Mrs. Jumbo spanks their leader and throws hay bales at them. Circus staff remove Dumbo from the pen, and Mrs. Jumbo flies into a rage, eventually dousing the ringmaster (Herman Bing) (who, though not truly evil, is a strict, greedy, and arrogant man who exploits workers and animals) in a water tub. She is subsequently deemed mad and locked in a cage. Dumbo is blamed for the incident and shunned by the other elephants.Timothy, a mouse (Edward Brophy) (an anthropomorphic mouse who becomes the only friend of Dumbo, along with the crows) that travels with the circus, befriends Dumbo and decides to make him a star. He whispers in the ringmaster's ear while the latter sleeps, and convinces him to try a new stunt with Dumbo as the top of a pyramid of elephants. However, Dumbo trips on his ears during the show and knocks over the pyramid, injuring the other elephants and bringing the big top crashing down. After this, the other elephants exile Dumbo completely, and he is put in with the clowns' firemen act, regularly jumping from a \"burning building\" prop into a vat of pie filling. Despite his newfound popularity, he hates the job and becomes depressed.Timothy decides to take Dumbo to see Mrs. Jumbo, but they cannot see each other's faces and can only intertwine trunks. Meanwhile, the clowns decide to increase the popularity of their fireman act by dangerously raising the platform Dumbo jumps from. In celebration of the plan, they drink champagne, and a bottle of it falls into a water vat. Dumbo, crying after visiting his mother, gets the hiccups, so Timothy takes him to the vat for water. Both of them get drunk, and hallucinate pink elephants.Dumbo and Timothy are later discovered asleep high up in a tree by Dandy Crow (Cliff Edward) (the leader of a group of crows) and his friends (Deacon (Hall Johnson), Fats (James Baskett), Specks (Nick Stewart), Dopey (Jim Carmichael)). Initially making fun of Timothy's assertion that Dumbo flew with his ears while drunk, the crows are soon moved by Dumbo's sad story. They decide to help Timothy, giving him a \"magic feather\" to help Dumbo fly. Holding the feather, Dumbo does indeed take off a second time, and he and Timothy return to the circus with plans to surprise the audience.During the clowns' act, Dumbo jumps off the platform and prepares to fly. He drops the feather, but Timothy assures him it was only a psychological aid, and Dumbo successfully flies about the big top, much to the delight of the public. Dumbo gains fame and fortune, Timothy becomes his new manager and signs him to a Hollywood contract, and Mrs. Jumbo is freed. She and Dumbo are given a private coach on the train, and the crows wave goodbye to the elephants as they travel away.",
	"links": []
}