{
	"title": "A Streetcar Named Desire",
	"release_year": "1951",
	"runtime": "122",
	"tags": [
		"Drama",
		"amazon"
	],
	"rating": 7.9,
	"actors": [
		"Vivien Leigh",
		"Marlon Brando",
		"Kim Hunter",
		"Karl Malden",
		"Rudy Bond",
		"Nick Dennis",
		"Peg Hillias",
		"Wright King",
		"Richard Garrick",
		"Ann Dere"
	],
	"staff": [
		"Elia Kazan",
		"Tennessee Williams",
		"Oscar Saul",
		"Charles K. Feldman",
		"Alex North",
		"Harry Stradling Sr.",
		"David Weisbart"
	],
	"votes": 115385,
	"cover": "https://m.media-amazon.com/images/M/MV5BNTdmZDY1ODQtNzFjYy00MGM4LWJmNDItN2MxMmQ2OTgxZGNmXkEyXkFqcGc@._V1_QL75_UX190_CR0,3,190,281_.jpg",
	"description": "Blanche DuBois (Vivien Leigh), a middle-aged high school English teacher, arrives in New Orleans. She takes a streetcar named \"Desire\" to the French Quarter, where her sister, Stella (Kim Hunter), and Stella's husband, Stanley Kowalski (Marlon Brando), live in a dilapidated tenement apartment. She is horrified at the condition of the neighborhood that Stella lives in.\nBlanche claims to be on leave from her teaching job due to her nerves and wants to stay with Stella and Stanley. Blanche's demure, refined manner is a stark contrast to Stanley's crude, brutish behavior, making them mutually wary and antagonistic. Stella welcomes having her sister as a guest, but Blanche often patronizes and criticizes her. Stella left Blanche 10 yrs ago, just after their dad died. The house has only 2 rooms, with a collapsible bed, no door between the rooms.Blanche reveals that the family estate, Belle Reve, was lost to creditors (She claims all the money was spent on treating the illness of their parents. Stella was only around for the funerals and not the illness), and Blanche is broke and had nowhere to go, since she was widowed at a young age after her husband's suicide. When Stanley suspects Blanche may be hiding an inheritance (she had not shown any proof of the sale of property. She claims it was taken by creditors but has very fine clothes & Jewels in her luggage which is out of sync with her meager teacher's salary), she shows him proof of the foreclosure. Stanley, looking for further proof, knocks some of Blanche's private papers to the floor. Weeping, she gathers them, saying they are poems from her dead husband. Stanley explains he was only looking out for his family, then announces Stella is pregnant.Blanche meets Stanley's friend, Mitch (Karl Malden), whose courteous manner is a contrast to Stanley's other pals. Mitch is attracted to Blanche's flirtatious charm, and a romance blossoms. During a poker night with his friends, Stanley explodes in a drunken rage (after he throws out Stella's radio as Blanche won't shut it despite repeated threats from Stanley. This prompts Stella to disrupt the game and she tries to throw Stanley's friends out), striking Stella and ending the game; Blanche and Stella flee upstairs to neighbor Eunice's (Peg Hillias) apartment. After his anger subsides, Stanley remorsefully bellows for Stella from the courtyard below. Irresistibly drawn by her physical passion for him, she goes to Stanley, who carries her off to bed. The next morning, Blanche urges Stella to leave Stanley, calling him a sub-human animal. Stella disagrees and wants to stay.As weeks pass into months, tension mounts between Blanche and Stanley. Blanche is hopeful about Mitch (she continues her light flirting with him while repelling him when he craves physical contact with her), but anxiety and alcoholism have her teetering on mental collapse while anticipating a marriage proposal. Finally, Mitch says they should be together. Meanwhile, Stanley uncovers Blanche's hidden history of mental instability, promiscuity, and being fired for sleeping with an underage student (He had spoken to one of his sales colleagues, who covers the town where Blanche lives and he knew all the stories about her, which circulated the local rumor mill). Stanley then passes this news (Blanche was a prostitute at the Hotel Flamingo back at her hometown. She was fired from her job as teacher for sleeping with a 17-year-old boy) on to Mitch, in full knowledge this will end Blanche's marriage prospects and leave her with no future. Stella angrily blames Stanley for the catastrophic revelation, but their fight is interrupted when Stella goes into labor.Later, Mitch arrives and confronts Blanche about Stanley's claims. She initially denies everything, then breaks down confessing. She pleads for forgiveness, but Mitch, hurt and humiliated, roughly ends the relationship. Later that night, while Stella's labor continues, Stanley returns from the hospital to get some sleep. Blanche, dressed in a tattered old gown, pretends she is departing on a trip with an old admirer. She spins tale after tale about her fictitious future plans, and he pitilessly destroys her illusions. They engage in a struggle, and Stanley sexually assaults her. Now on perilous mental ground, Blanche tries to tell Stella what Stanley had done. Stella refuses to believe Blanche, causing her to have a mental breakdown.Weeks later, during another poker game at the Kowalski apartment, doctors arrive to take Blanche to a mental hospital. Blanche resists at first but, believing she is going on a vacation, eventually leaves. Mitch, present at the poker game, is visibly upset. Stella, now realizing that Blanche had told her the truth, takes the baby upstairs to Eunice's, ignoring Stanley's calls and vowing not to return.",
	"links": [
		"https://www.amazon.com/Streetcar-Named-Desire-Vivien-Leigh/dp/B00124LYHQ"
	]
}