{
	"title": "Cinderella",
	"release_year": "1950",
	"runtime": "74",
	"tags": [
		"Animation",
		"Family",
		"Fantasy",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"Ilene Woods",
		"James MacDonald",
		"James MacDonald",
		"James MacDonald",
		"Eleanor Audley",
		"Verna Felton",
		"Claire Du Brey",
		"Rhoda Williams",
		"Helene Stanley",
		"Luis Van Rooten",
		"Luis Van Rooten",
		"Don Barclay",
		"Lucille Bliss"
	],
	"staff": [
		"Clyde Geronimi",
		"Wilfred Jackson",
		"Hamilton Luske",
		"Charles Perrault",
		"Bill Peet",
		"Erdman Penner",
		"Ted Sears",
		"Donald Halliday"
	],
	"links": [
		"https://www.amazon.com/Cinderella-Ilene-Woods/dp/B0B6BDYZ75"
	],
	"votes": 176304,
	"cover": "https://m.media-amazon.com/images/M/MV5BZmNmNjZhYTQtY2I4OC00ZDAzLWE2MTEtZjdiMzIzMjRjNWZkXkEyXkFqcGc@._V1_QL75_UX190_CR0,3,190,281_.jpg",
	"description": "A wealthy widower has a daughter named Cinderella. He remarries to a woman Lady Tremaine who has two daughters of her own, Anastasia and Drizella, thinking she will love Cinderella as a mother. But her father dies & the stepmother is jealous of Cinderella's grace & beauty & turns her into a maid, while pampering Anastasia & Drizella.\nCinderella's stepsisters, Anastasia and Drizella, also take advantage of her meekness, mocking her and adding to her workload. Despite this, Cinderella remains kind of heart, obediently doing her chores whilst taking care of the mice and birds that live in the chateau, making friends of them, mainly of two mice named Jaq and Gus. She also protects them from being eaten by her stepmother's cat Lucifer, who makes her duties even harder in retaliation.The King is old & wants to see grand-kids before he dies. But the Prince doesn't like anyone. So, he organizes a ball & invites all eligible maidens in his Kingdom.\nCinderella too gets it, but stepmom says she can go if she completes housework & finds something to wear.But Cinderella is kept busy with housework, so the mice decide to sew her a dress. They use her mother's wedding gown & modify it using trimmings from Drizella & Anastasia's pearl. Cinderella is delighted & thanks the mice. But when she arrives to get into the carriage, Drizella & Anastasia rip her dress apart while getting their trimmings & pearls.A distraught Cinderella runs out to the garden in tears, kneeling on a stone bench. There, she is met by her Fairy Godmother, who has come to help. She transforms Jaq, Gus, and two other mice into four white horses, a pumpkin into a coach, Cinderella's old horse Major into a coachman, and her bloodhound Bruno into a footman. The fairy godmother also gives Cinderella a shimmering ball gown and glass slippers but warns her that all the magic will end on the stroke of midnight.Cinderella arrives at the ball, and is not recognized by her stepsisters, though her stepmother believes something is familiar about her. The Prince has eyes for no one but her. They fall in love. However, when Cinderella hears the clock tolling midnight, she runs away before she and the Prince can exchange names. Despite the efforts of the Grand Duke, Cinderella flees the palace, losing one of her slippers on the staircase. The palace guards pursue, but when the magic ends on the stroke of 12, Cinderella and the animals revert to their former appearances and hide in the woods. Cinderella discovers the other glass slipper is still on her foot and takes it home with her.The Prince declares that he will marry the one who fits the slipper & assigns The Grand Duke on the mission to find the girl. Eventually the Grand Duke reaches the residence of Cinderella, but stepmother had locked her in her room realizing that she was the girl from the ball who had smitten the Prince. While the stepsisters unsuccessfully try on the slipper, Jaq and Gus steal the key back from Lady Tremaine. As they take the key to Cinderella, Lucifer attempts to stop them by trapping Gus and battling the other mice. The birds summon Bruno who scares Lucifer out of the house, and a freed Cinderella hurries to meet the Grand Duke.The Grand Duke is about to leave as Cinderella finally appears. He orders the messenger to bring forth the glass slipper, yet the stepmother in a last-minute attempt to prevent her stepdaughter from better things, causes the messenger to trip, thus breaking the fragile shoe into pieces. Yet the arrogant woman hadn't bet on Cinderella producing the other glass slipper, which fits onto Cinderella's foot perfectly. Very soon, wedding bells ring, and Cinderella marries her prince, and they live happily ever after."
}