{
	"title": "Licence to Kill",
	"release_year": "1989",
	"runtime": "133",
	"tags": [
		"Action",
		"Adventure",
		"Thriller",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Timothy Dalton",
		"Robert Davi",
		"Carey Lowell",
		"Talisa Soto",
		"Anthony Zerbe",
		"Frank McRae",
		"Everett McGill",
		"Wayne Newton",
		"Benicio Del Toro",
		"Anthony Starke"
	],
	"staff": [
		"John Glen",
		"Michael G. Wilson",
		"Richard Maibaum",
		"Ian Fleming",
		"Albert R. Broccoli",
		"Michael G. Wilson",
		"Michael Kamen",
		"Alec Mills",
		"John Grover",
		"Janet Hirshenson",
		"Jane Jenkins",
		"Peter Lamont"
	],
	"votes": 113215,
	"cover": "https://m.media-amazon.com/images/M/MV5BYjY3OWJkMjMtYTgwYS00MjJjLWE4M2ItOWVhOWMxNGM1NDk3XkEyXkFqcGc@._V1_QL75_UX190_CR0,4,190,281_.jpg",
	"description": "DEA agents collect MI6 agent James Bond (Timothy Dalton) and his friend, CIA agent Felix Leiter (David Hedison), on their way to Leiter's wedding in Key West, to have them assist in capturing drugs lord Franz Sanchez (Robert Davi). Bond and Leiter capture Sanchez by attaching a hook and cord to Sanchez's plane and pulling it out of the air with a Coast Guard helicopter. Afterwards, Bond and Leiter parachute down to the church in time for the ceremony.Sanchez bribes DEA agent Ed Killifer (Everett McGill) (with $2MM) and escapes (Ed forces the prison van off the bridge into the water, where divers arrive and smuggle Sanchez away). Meanwhile, Sanchez's henchman Dario (Benicio Del Toro) and his crew ambush Leiter and his wife Della (Priscilla Barnes) and take Leiter to an aquarium owned by one of Sanchez's accomplices, Milton Krest (Anthony Zerbe). Sanchez has Leiter lowered into a tank holding a tiger shark. When Bond learns Sanchez has escaped, he returns to Leiter's house to find Leiter has been maimed (left leg chewed off below the knee) and that Della has been murdered-and by implication raped. Bond, with Leiter's friend Sharkey (Frank McRae), start their own investigation.\nThey discover a marine research center run by Krest (which is where Sanchez had brought Felix and fed him to the sharks), where Sanchez has hidden cocaine and a submarine for smuggling it (the same min-sub was used to smuggle Sanchez underwater from the prison van).Bond comes back at night and enters the facility and finds the drugs under the maggots (used as fish feed). After Bond kills Killifer using the same shark tank used for Leiter, M (Robert Brown) meets Bond in Key West's Hemingway House and orders him to an assignment in Istanbul, Turkey. Bond resigns after turning down the assignment, but M suspends Bond instead and revokes his license to kill. Bond becomes a rogue agent, although he later receives unauthorized assistance from Q (Desmond Llewelyn).\nMiss Moneypenny (Caroline Bliss), M's personal secretaryBond boards Krest's ship Wavekrest and foils Sanchez's latest drug shipment (by hijacking the mini-sub being used to transfer the drugs underwater from the seaplane to the yacht and destroying the drug pouches), stealing five million dollars in the process (by then hijacking the seaplane before it takes off with the money that Krest paid in exchange for the drugs). He discovers that Sharkey has been killed by Sanchez's henchmen. Bond meets and teams up with Pam Bouvier (Carey Lowell), a pilot and DEA informant (after getting her details from the CIA database), at a Bimini bar (where they are attacked by Dario and his men, who were waiting to see who came to meet Pam, as Felix is still hospitalized. Dario shoots Pam in the back, but she survives as she was wearing a vest), and journeys with her to the Republic of Isthmus (He pays Pam $75K for the same, out of the $5MM he stole).He seeks Sanchez's employment by posing as an assassin for hire (Bond enters Sanchez's casino and gambles with his money. He wins big, getting Sanchez's attention and then gains access to him via Lupe Lamora, whom he had met on Krest's yacht earlier). Bond plants plastic explosives on Sanchez's bulletproof window when he is meeting with Asian mob bosses to sell drug franchises for $100M per territory for 5 yrs. Plan is to blow the window and the shoot Sanchez with a rifle.\nTwo Hong Kong Narcotics Bureau officers foil Bond's attempt to assassinate Sanchez and take him to an abandoned warehouse. They are joined by Fallon, an MI6 agent who was sent by M to apprehend Bond. Sanchez's men rescue him and kill the officers, believing them to be the assassins. Bond plants the idea that someone close to him has betrayed Sanchez.\nLater, with the aid of Bouvier, Q, and Sanchez's girlfriend Lupe Lamora (Talisa Soto) (who rebelled against Sanchez as he would physically abuse her), Bond frames Krest by planting the $5 million in Wavekrest (Krest had come in his yacht to meet Sanchez and explain the missing payment for the last shipment. Sanchez's men find the money in the decompression chamber, where Bond had put it, with the help of Lupe Lamora) . Sanchez shuts Krest into a decompression chamber and cuts the oxygen cord, causing Krest to explosively decompress to his death. Bond is then admitted into the inner circle.\nLupe Lamora is afraid that Bond is pursuing Sanchez and begs Pam + Q to help him (Sanchez is taking Bond out to his secret HQ)Sanchez takes Bond to his base, which is disguised as the headquarters of a religious cult. Bond learns that Sanchez's scientists can dissolve cocaine in petrol and then sell it disguised as fuel to Asian drug dealers. The televangelist Joe Butcher (Wayne Newton) serves as middleman, working under Sanchez's business manager Truman-Lodge (Anthony Starke), who uses Butcher's TV broadcasts to communicate with Sanchez's customers in the United States.\nDuring Sanchez's presentation to potential Asian customers, Dario discovers Bond and betrays him to Sanchez. Bond starts a fire in the laboratory, but is captured again and placed on the conveyor belt that drops the brick-cocaine into a giant shredder. Pam Bouvier arrives (pretending to be a rich donor and gaining a private audience with Butcher, who she holds at gunpoint) and shoots Dario, allowing Bond to pull Dario into the shredder, killing him.Sanchez flees as fire consumes his base, taking with him four tankers full of the cocaine and petrol mixture. Bond pursues them by plane, with Bouvier at the controls. During the course of a stunt-filled chase through the desert, Bond destroys three of the tankers and kills several of Sanchez's men. Sanchez attacks Bond with a machete aboard the final remaining tanker, which crashes down a hillside. A petrol-soaked Sanchez attempts to kill Bond with his machete. Bond then reveals his cigarette lighter-the Leiters' gift for being the best man at their wedding-and sets Sanchez on fire. Burning alive, Sanchez stumbles into the wrecked tanker, destroying it. Bouvier arrives shortly afterward, and picks up Bond.\nLater, a party is held at Sanchez's former residence. Bond receives a call from Leiter telling him that M has congratulated him for his work and offers him his job back. He then rejects Lupe's advances and romances Bouvier instead.",
	"links": [
		"https://www.amazon.com/Licence-Kill-UHD-Timothy-Dalton/dp/B07JKCMJ1H"
	]
}