{
	"title": "The Jungle Book",
	"release_year": "1967",
	"runtime": "78",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Phil Harris",
		"Sebastian Cabot",
		"Louis Prima",
		"Bruce Reitherman",
		"George Sanders",
		"Sterling Holloway",
		"J. Pat O'Malley",
		"J. Pat O'Malley",
		"Verna Felton",
		"Clint Howard",
		"Chad Stuart"
	],
	"staff": [
		"Wolfgang Reitherman",
		"Larry Clemmons",
		"Ralph Wright",
		"Ken Anderson",
		"Vance Gerry",
		"George Bruns",
		"Tom Acosta",
		"Norman Carlisle"
	],
	"votes": 201208,
	"cover": "https://m.media-amazon.com/images/M/MV5BNGE4M2NiZDktY2E2MC00ZTY5LWIyMDktZWIxNzQ2OWU2NmQzXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "The story of \"The Jungle Book\" concerns an orphaned small boy named Mowgli. The movie starts off with an anthropomorphic black panther named Bahgeera trekking across a rain-forest in India. One day, he comes across an abandoned ship-wrecked boat, finding a small baby whose parents died is seen in the basket. Taking pity on the baby, Bagheera decides that the little man cub should be cared for by a pack of wolves and takes him to a small family of wolves, who adopt the boy, now raised by wolves in the forest. As Mowgli grows older, he becomes a beloved part of the wolf pack.A decade later, Mowgli has grown into a wiry, street smart loincloth cloth diaper-clad nine year old feral child, who has long since been adopted into his wolf pack, despite his differences. However, when news reaches the pack that the tiger Shere Khan has been spotted in the jungle, they decide that its not safe for Mowgli to be around them. The pack knows of Khan's hatred of man, and wish to send Mowgli away for protection. That's when Bagheera says he knows of a nearby human village inhabited by people who can safeguard Mowgli so he won't get devoured or mauled by Shere Khan. Bagheera volunteers to escort Mowgli to safety there himselfMowgli and Bagheera set out sometime after dark. Mowgli adamantly clashes with Bahgeera about relocating out of the jungle and staunchly refuses to to the village because he thinks he can take care of himself. They decide it'd be best to go during the day. They perch up in a tree for the night, but are ambushed and threatened by Kaa, a python with a hypnotic gaze. Kaa hypnotizes Mowgli into a drowsy trance and strangles the boy by wrapping his coils around his neck. Kaa nearly devours the boy but Bahgeera wakes up and disrupts the hypnosis. The duo team up and get Kaa to leave and go back to sleep.In the morning of the next day, they are awakened by 'The Dawn Patrol,' a pack of elephants led by Colonel Hathi. Mowgli meets a group of elephants marching in military formation. An elephant named Hathi leads them. Mowgli wants to join in the march and follows behind Junior, a baby elephant. Mowgli spends quality time bonding with the baby elephant, who is their son, who one day dreams of following in his Father's footsteps. They stop in a line for an inspection check and Hathi sees Mowgli in line with the rest of the elephants. He gets angry and says there will be no man cub in his jungle. Then Bagheera catches up to the group and says he's there to take Mowgli to the man village. Bagheera orders Mowgli to continue on their way to the man-village, but Mowgli refuses. Still being stubborn, Mowgli refuses to go to come and hugs a tree to signify him staying put. After unsuccessfully coercing the kid by tugging on his thick, durable cotton cloth diaper loincloth, resulting in the panther unceremoniously tumbling into a nearby river. A drenched Bagheera becomes fed up with Mowgli's antics, says he's had enough and leaves Mowgli behind to die.As Mowgli sulks alone by a rock, he is discovered by Baloo the bear. Baloo is a carefree, cordial, affable, free-spirited, laid-back and jocular large bear. A grumpy Mowgli initially finds him annoying, even demanding the bear to get lost, but soon becomes intrigued when Baloo playfully dares and challenges him. After teaching him how to growl like a bear, Bagheera overhears the commotion ruckus caused by their horseplay, and hurriedly returns, dismayed that Mowgli has encountered the 'jungle bum.' Baloo shows Mowgli the \"Bare-necessities\" of life and how to live in the jungle by just sitting back, chill-axing and having fun. Baloo assures Mowgli that he will look after the boy, ignoring an uptight Bagheera's warnings that Shere Khan can't be fended off that easily. The boy and the bear perform seemingly perilous activities, such as eating ants, using a cactus to be able to reach high up and collect fruit, and scratching their backs, much to an annoyed Bagheera's ire. To top it all off, much to Bagheera's horror, Baloo takes the boy to a large, wide and deep lagoon, where they decide go for a swim. Bagheera is nervously worried sick seeing Mowgli take a dip as the boy did not know how to swim. However, Mowgli impulsively dives head first into the deep water, without hesitation. After a few moments, his head bobs up to the surface, spluttering out freshwater he swallowed. While treading water with Baloo, Mowgli quickly masters his skinny body's buoyancy and learns swimming. After witnessing them narrowly survive from drowning in the rapids and going over a waterfall, an exasperated Bagheera slips away, fed up with their antics. Ecstatic by Baloo's adventurous, free-spirited 'philosophy' of living care-free in the wild without having to worry about anything, which consequently takes hold of the very young, gullible, overconfident and naively foolish man-cub, Mowgli eagerly wishes to stay in the jungle more than ever.As they went skinny dipping in the river, a group of monkeys (who were eavesdropping on both of them splashing in the water earlier) ambush the duo, abduct Mowgli and forcibly drag the struggling boy away. After messing with Baloo thrice (first with a monkey who hits him on the nose, then pelting the bear with fruit, and finally sending him tumbling down a steep embankment after playing a game of 'hot potato' with Mowgli), Mowgli is taken to a derelict ancient temple in ruins, lorded over by an orangutan named King Louie, wanting to be just like man, strikes a deal with Mowgli to live in the jungle. Mowgli is initially annoyed by the monkeys dangling him over their ruler, but after force-feeding the boy gulping down a mouthful of bananas, Louie tries to placate Mowgli by showing him how to make fire. However, Mowgli doesn't know how to make fire. Bagheera and Baloo show up to rescue Mowgli from King Louie. Baloo disguises himself as a monkey and starts dancing with King Louie. The plan nearly works, but his disguise fell apart, blowing his cover. They grab Mowgli and make a run for it, but the monkeys pursue them. The monkeys play another game of 'hot potato with Bagheera and Baloo. King Louie grabs the boy last, wanting Mowgli all for himself. As King Louie grabbed Mowgli, he accidentally tore down the foundation of the temple and threw Mowgli to Baloo to save his home. With King Louie preoccupied, Bagheera, Baloo, and Mowgli make their escape.The trio arrive at a secluded area, where Mowgli falls asleep from the ordeal. Bagheera tries to talk some sense into Baloo about how perilous it is for Mowgli to live in the jungle under Baloo's watch, pointing out that the duo nearly drowned in a deep river while treading water and were ambushed by monkeys, resulting in a dangerous escape. Baloo initially opposes this but after Bagheera rationally explains to Baloo why Mowgli must leave the jungle, even warning Baloo of the danger that Shere Khan poses to him. After some convincing, Baloo reluctantly agrees that the jungle is too dangerous for Mowgli to stay. Baloo offers to explain this to Mowgli, even though he had promised Mowgli he could stay in the jungle with him. In the morning, Baloo takes Mowgli out for a casual stroll. After discussing their adventures, the bear tells the boy that he's escorting Mowgli to the man village for his own safety. When Mowgli finds out about this, he suddenly becomes outraged and flees on foot, abandoning his friend. Bagheera and Baloo both decide to start looking for Mowgli before it gets too late.Shere Khan appears in the movie as he stalks a deer that looks eerily similar to Bambi. The deer flees because it hears the roar from Colonel Hathi and his group of elephants walking in military formation. Shere Khan stalks the elephants and then Bagheera appears and says that Mowgli is lost and has ran away. Shere Khan overhears their conversation and is delighted to know that Mowgli is alone and unprotected.After some time wandering through the jungle floor alone, Mowgli encounters Kaa, who hypnotizes the boy. Kaa tries to tell Mowgli that he can help him to not leave the jungle. Mowgli asks how Kaa can do that and Kaa says he has his own subtle ways, but first he must be trusted by Mowgli. Then, Mowgli gets hypnotized. While Mowgli is under hypnosis Shere Khan is right under them looking for him. Kaa is about to devour Mowgli, when he is alerted to Shere Khan, who pulls on Kaa's tail and asks if he's seen Mowgli to which Kaa responds he hasn't. Kaa manages to carry on a conversation with the tiger, and just barely hides the fact that the man-cub is nearby. Shere Khan leaves after Kaa proves he doesn't have anything to hide. Once Shere Khan leaves, Kaa's plans to eat Mowgli are foiled when Mowgli comes out of his trance, and is able to escape Kaa's grasp.Sometime afterward, a dejected and lonely Mowgli continues wandering around a wasteland part of a haunted forest. He is spotted by a group of four vultures, named Buzzie, Dizzie, Flaps, and Ziggie, who are sitting on a tree wondering what to do with their day. They see Mowgli wandering aimlessly alone and proceed to make fun of him for his human form, such as having skinny legs like a stork but not having any feathers. Quite upset and offended by this, Mowgli chokes up and is about to slip away but the vultures feel bad and try to cheer him up by making him an honorary vulture who is part of their group, willing to take him in as one of their own.While Mowgli and the Vultures are hanging out, Shere Khan sees them and shows up. The vultures make a run for it telling Mowgli to do the same, but Mowgli stands his ground, refusing to flee even though the tiger is feared by the vultures. Shere Khan says he'll turn around and plans to count to ten to make the chase more exciting. Mowgli uses that time to search for a weapon and finds a wooden stick. Shere Khan aggressively pounces and lunges at Mowgli, scaring him enough to drop the stick. However, just as it seems that Shere Khan may devour Mowgli, Baloo comes just in time to grab Shere Khan's tail holding him back and wrestles with the tiger, who charges at the large bear. As Mowgli runs for his life, Baloo grabs onto Shere Khans tail to save the boy. After the vultures rescue Mowgli and take to the skies, Shere Khan throws Baloo off of him, punches and slashes Baloo across the face with his claws, knocking the bear out unconscious. A wounded Baloo collapses, unconscious. Lightning strikes a tree and becomes engulfed in flames. Mowgli grabs one of the lit branches and in the ensuing chaos, Mowgli ties a flaming branch to Shere Khan's tail, and the fire spooks the tiger, sending him fleeing in fear with the burning branch still tied to his tail hitting him.Baloo is lying still and Mowgli starts mourning for his friend. Bagheera arrives and says a few nice words about Baloo. Just when it appears that Baloo has died, he recovers from the ordeal. Baloo slowly starts waking up and listens to what is being said about him. After Bagheera stops he says to keep going. Everyone is happy he's alive. Bagheera soon joins the group, and they then make their way back to the other side of the jungleIt seems that Bagheera's plan to get Mowgli to the man-village has failed, when a beautiful song wafts through their ears. Mowgli also overhears a girl melodiously singing and heads towards the riverbank. As the trio peer through some shrubs, they see the man-village, and by a small freshwater stream, a little girl appears, fetching water. This intrigues Mowgli, who tries to go for a closer look after he finds the girl going towards a freshwater creek to collect water from the freshwater riverbank. Baloo says they should leave, but Mowgli, never seeing a girl before, wants to get a closer look.The curious boy climbs up a thick tree to get a better view of the girl as she stares at her reflection, braiding her hair whilst singing about her family. Seeing the boy perched up towering over her, the girl seduces him with bedroom eyes, causing Mowgli to become love-blind, mesmerized and captivated by her beauty. As their eyes meet, an infatuated Mowgli awkwardly wrinkles his nose with a half-smile. A few moments after making eye contact, the brittle branch snaps like a twig and he plunges belly-flopped into the water with a mighty splash right in front of her, much to the girl's amusement. Embarrassed, the drenched man-cub sloshes, and wades away from her while she giggles. He hides behind the undergrowth while she continues to sing and fill up her pot. She starts walking back home and Mowgli follows her. The girl notices that Mowgli is following her and pretends to spill her water jug by dropping it on purpose. Mowgli instinctively retrieves it, refills it, but instead of taking it, the girl leads him back to the man-village, humming her 'siren song.' Baloo whispers for Mowgli to come back, but the love-struck boy follows the girl into the village while carrying her filled water pot.Bagheera happily explains that Mowgli is now where he belongs. Baloo, although partly wishing that the boy would still be with them, accepts this fact and says he's happy for Mowgli starting the next chapter of his life in the village, before wrapping his arm around the panther, stating that they should get going as well. The film ends with the two of them happily returning to the jungle, as they stroll off into the sunset.",
	"links": [
		"https://www.amazon.com/Jungle-Book-Animated-Phil-Harris/dp/B00HBX6WH4"
	]
}