{
	"title": "Rocky",
	"release_year": "1976",
	"runtime": "120",
	"tags": [
		"Drama",
		"Sport",
		"amazon"
	],
	"rating": 8.1,
	"actors": [
		"Sylvester Stallone",
		"Talia Shire",
		"Burt Young",
		"Carl Weathers",
		"Burgess Meredith",
		"Thayer David",
		"Joe Spinell",
		"Jimmy Gambina",
		"Bill Baldwin",
		"Al Silvani"
	],
	"staff": [
		"John G. Avildsen",
		"Sylvester Stallone",
		"Robert Chartoff",
		"Irwin Winkler",
		"Bill Conti",
		"James Crabe",
		"Scott Conrad",
		"Richard Halsey",
		"Caro Jones",
		"William J. Cassidy"
	],
	"votes": 638571,
	"cover": "https://m.media-amazon.com/images/M/MV5BZDEyY2M2MGMtYjg5OC00ZWFjLWFkZDQtNmQzZTdiYmYzZTBkXkEyXkFqcGc@._V1_QL75_UX190_CR0,4,190,281_.jpg",
	"description": "Philadelphia Pennsylvania, home to Rocky Balboa (Sylvester Stalone). Nov 1975, Rocky is fighting Spider Rico who headbutts Rocky & Rocky KOs him. He gets $ 44 for his efforts. Rocky likes Adrian (Talia Shire) , but she is very shy. Rocky is doing some random collection jobs for a local loan shark Gazzo who gives him $20 a pop. Gazzo wants Rocky to be ruthless, but Rocky cant pummel a deadbeat guy for anything. Rocky is kicked out of the local Mickey's Gym as Mickey, now a trainer, has rented his locker to a newcomer Dipper Brown, who Mickey thinks has potential.Adrian's brother Paulie is Rocky's best friend. Apollo Creed (Carl Weathers) is the current world boxing champion & Rocky is in awe of him. Apollo wants to fight a small time underdog for the New Year Day's boxing event. His promoter Jergans agrees. They pick Rocky \"The Italian Stallion\" from a catalog of Philadelphia fighters.Gazzo gives Rocky 50$ for his date with Adrian. Adrian doesn't want to go when Paulie screams at her, but is ready when Rocky talks to her nicely. They kiss.\nMickey is not happy that Rocky is a leg breaker & tells him about Jergen's offer. Rocky meets Jergen & agrees. Apollo mocks Rocky on a TV interview.Gazzo gives Rocky $500 to train & wishes him best of luck. Mickey becomes Rocky's manager.\nRocky starts training. Paulie helps Rocky train by making him punch meat bags. Adrian gets closer to Rocky & emerges out of her shell. Paulie arranges for interviews with Rocky boxing meat & Apollo's team knows Rocky is serious, but Apollo doesn't take Rocky seriously. Paulie is forever screaming at Adrian & distraught Adrian begs Rocky to let her move in with him. Mickey gets cut-man Mike to be in their squad.\nPaulie becomes jealous of Rocky's success, but Rocky placates him by agreeing to advertise the meat packing business where Paulie works as part of the upcoming fight. Rocky trains really hard for the championship fight and he is ready. The night before the fight, a sleepless Rocky visits the Philadelphia Spectrum and begins to lose confidence. He confesses to Adrian that he does not believe he can win, but strives to go the distance against Creed, which no other fighter has done, to prove himself to everyone.On New Year's Day, the fight is held with Creed making a dramatic entrance dressed as George Washington and then Uncle Sam. Taking advantage of his overconfidence, Rocky knocks him down in the first round-the first time that Creed has ever been knocked down. Humbled and worried, Creed takes Rocky more seriously for the rest of the fight, though his ego never fully fades. The fight goes on for the full fifteen rounds, with both combatants sustaining various injuries. Rocky, with hits to the head and swollen eyes, requires his right eyelid to be cut to restore his vision. Apollo, with internal bleeding and a broken rib, struggles to breathe. As the fight concludes, Creed's superior skill is countered by Rocky's apparently unlimited ability to absorb punches and his dogged refusal to go down. As the final bell sounds, with both fighters embracing each other, they promise each other there will be no rematch.After the fight, the sportscasters and the audience go wild. Jergens announces over the loudspeaker that the fight was \"the greatest exhibition of guts and stamina in the history of the ring\", and Rocky calls out repeatedly for Adrian, who runs down and Paulie distracts security to help her get into the ring. As Jergens declares Creed the winner by virtue of a split decision, Rocky and Adrian embrace and profess their love for each other, not caring about the outcome of the fight.",
	"links": [
		"https://www.amazon.com/Rocky-Sylvester-Stallone/dp/B0017VT5E8"
	]
}