{
	"title": "Back to the Future Part III",
	"release_year": "1990",
	"runtime": "118",
	"tags": [
		"Adventure",
		"Comedy",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Michael J. Fox",
		"Michael J. Fox",
		"Christopher Lloyd",
		"Mary Steenburgen",
		"Tom Wilson",
		"Tom Wilson",
		"Lea Thompson",
		"Lea Thompson",
		"Elisabeth Shue",
		"Matt Clark",
		"Richard Dysart",
		"Pat Buttram",
		"Harry Carey Jr."
	],
	"staff": [
		"Robert Zemeckis",
		"Robert Zemeckis",
		"Bob Gale",
		"Neil Canton",
		"Bob Gale",
		"Alan Silvestri",
		"Dean Cundey",
		"Harry Keramidas",
		"Arthur Schmidt",
		"Mike Fenton",
		"Valorie Massalas",
		"Judy Taylor",
		"Rick Carter"
	],
	"votes": 488035,
	"cover": "https://m.media-amazon.com/images/M/MV5BNTNkNzJmY2MtOGNjYi00NDJmLWIyZTQtNmFmMGQ5M2VlOTI0XkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "On November 12, 1955, Marty McFly (Michael J. Fox) discovers that his friend Dr. Emmett \"Doc\" Brown (Christopher Lloyd) has become trapped in the year 1885. Marty, with Doc's 1955 self, uses the information in Doc's 1885 letter to locate and repair the DeLorean. While retrieving the car, Marty spots a tombstone with Doc's name, dated six days after the letter. Learning that Doc was killed by Biff Tannen's great-grandfather, Buford \"Mad Dog\" Tannen (Tom Wilson), Marty decides to go back to 1885 to save Doc.Marty arrives on September 2, 1885, in the middle of a United States Cavalry pursuit of Indians. While evading the pursuit, the DeLorean's fuel line is torn, forcing Marty to hide the car in a cave and walk to Hill Valley. Marty meets his Irish-born great-great-grandparents, Seamus (also played by Michael J. Fox) and Maggie McFly (Lea Thompson), and also runs afoul of Buford and his gang. Buford tries to hang Marty, but Doc saves him. Doc agrees to leave 1885, but with the DeLorean out of gasoline and no more available, there is no way to accelerate the car to 88 miles per hour.After some experimentation, Doc devises a scheme to use a locomotive to push the DeLorean up to speed. As Doc and Marty explore the rail spur they intend to use, they spot an out-of-control horse-drawn wagon. Doc saves the passenger, Clara Clayton (Mary Steenburgen), and the two fall in love. Buford tries killing Doc at a town festival, but Marty intervenes. Buford then goads Marty into a showdown in two days. Consulting the photograph of Doc's tombstone, Marty and Doc note that Doc's name has disappeared, but the date on the tombstone remains unchanged. Doc warns Marty that he, not Doc, might be killed by Buford.The night before their departure, Marty and Doc place the DeLorean onto the rail spur. At Clara's house, Doc tells Clara he is from the future, but Clara believes it is an excuse to end their relationship and angrily dismisses him. Distraught, Doc returns to the town saloon to get drunk, but Marty rides to the saloon and convinces Doc to leave with him. However, Doc drinks a single shot of whiskey and (due to extreme alcohol intolerance) passes out instantly. Buford arrives early and calls out Marty, but Marty has finally realized his reputation is unimportant and refuses to fight. Doc revives after drinking the bartender's special \"Wake-Up Juice\" and tries fleeing with Marty, but Buford's gang captures Doc, forcing Marty to duel. Marty uses a firebox door from a stove as a bulletproof vest. During the fistfight that follows, Buford destroys the tombstone, is knocked unconscious and is arrested for an earlier robbery. Marty and Doc depart to \"borrow\" the locomotive.Clara is leaving on the train when she overhears a salesman discussing a man he met in the saloon, despondent about his lost love. Realizing the man is Doc, Clara triggers the emergency brake and runs back to town. She discovers Doc's model of the time machine and rides after him. Doc and Marty, having stolen the train at gunpoint, begin pushing the DeLorean along the spur line, attempting to get it up to 88 miles per hour. Clara boards the locomotive while Doc is climbing towards the DeLorean. Doc encourages Clara to join him, intending to bring her to 1985. As she climbs to Doc, Clara falls and is left hanging by her dress. Marty passes the hoverboard to Doc, who saves Clara. They coast away from the train as the DeLorean disappears through time, while the locomotive roars over the edge of the incomplete bridge.Marty arrives on October 27, 1985. He escapes the powerless DeLorean before it is hit by a freight train and destroyed. Marty discovers that everything has returned to the improved timeline. Marty finds Jennifer (Elisabeth Shue) sleeping on her front porch. Later, he uses the lessons he learned in 1885 to avoid being goaded into a street race with Needles (Flea), avoiding a potential automobile accident. Jennifer opens the fax message she kept from 2015 and finds that the message regarding Marty being fired has been erased.Marty takes Jennifer to the time machine wreckage. As they survey the remains, a locomotive equipped with a flux capacitor appears, manned by Doc, Clara, and their two children Jules (Todd Cameron Brown) and Verne (Dannel Evans). Doc gives Marty a photo of the two of them by the clockworks at the 1885 festival. Jennifer inquires about the fax, and Doc tells them it means that the future has not been written yet. After the Browns bid farewell to their friends, Doc's train converts into an aerial craft and roars off into an unknown time.",
	"links": [
		"https://www.amazon.com/Back-Future-Part-III-Michael/dp/B00439KW2U"
	]
}