{
	"title": "Austin Powers: The Spy Who Shagged Me",
	"release_year": "1999",
	"runtime": "95",
	"tags": [
		"Action",
		"Adventure",
		"Comedy",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Mike Myers",
		"Mike Myers",
		"Mike Myers",
		"Heather Graham",
		"Michael York",
		"Robert Wagner",
		"Rob Lowe",
		"Seth Green",
		"Mindy Sterling",
		"Verne Troyer",
		"Elizabeth Hurley",
		"Gia Carides"
	],
	"staff": [
		"Jay Roach",
		"Mike Myers",
		"Michael McCullers",
		"John S. Lyons",
		"Eric McLeod",
		"Demi Moore",
		"Mike Myers",
		"George S. Clinton",
		"Ueli Steiger",
		"Debra Neil-Fisher",
		"Jon Poll",
		"Juel Bestrop",
		"Jeanne McCarthy",
		"Rusty Smith"
	],
	"votes": 251626,
	"cover": "https://m.media-amazon.com/images/M/MV5BY2I3ZTBjOGQtYjQ3My00M2RlLTk3MjgtOTVmMWExNmU3ZjBkXkEyXkFqcGc@._V1_QL75_UX190_CR0,4,190,281_.jpg",
	"description": "Austin (Mike Myers) is with Vanessa (Elizabeth Hurley) & finds that she is a Fembot sent by Dr Evil to kill him. She self-destructs.NATOs monitoring facility observes the return of Dr. Evil (Mike Myers). Its 1999 & Evil has been frozen for 3 decades. At Dr. Evils Seattle headquarters, Dr. Evil is presented with a 1/8 clone of himself Mini-Me. # 2 (Robert Wagner) also reveals the enormous profits they have made by legitimately investing in a startup called \"Starbucks\". However, Dr. Evil is unimpressed and unveils his latest plan, time machine to go back to the 60's and steal Austin Powers Mojo.Dr. Evil and Mini-Me go back to 1969 and meet a younger # 2 (Rob Lowe) and Frau Farbissina (Mindy Sterling). A disgruntled Scottish Guard called Fat Bastard (again, Mike Myers) is bribed to extract Austins Mojo from his frozen body at the Ministry of Defense Cryogenic Chamber.\nAs Fat bastard steals the Mojo in 60's, Austin finds it missing in 1999 while having sex with a Russian agent Ivana Humpalot.The MOD sends Austin back to 1969 with its own time travel device. Austin arrives at his London pad and with CIA agent, Felicity Shagwell (Heather Graham), escapes another assassination attempt by Dr. Evils operatives. However, the two of them are chased by Mustafa (Will Ferrell), yet another of Dr. Evil's henchmen, and when caught he reveals the existence of a secret volcano lair. Mini Me kills Mufasa. Austin identifies Fat Bastard as the perpetrator.Felicity wants to have sex with Austin, but he can't as he doesn't have his Mojo. Evil drinks Austin's Mojo & has sex with Fran & she gets pregnant & it is implicated that Scott is the offspring. Scott, Evil's real son, also travels back in time. Evil's plan now is to hold world ransom to a laser he has put on the moon. Felicity seduces Fat Bastard & gets a stool sample & traces it to the Caribbean.Austin & Fecility arrive in Caribbean & are captured by Evil. Felicity frees them by flashing the guards who fall into the volcano lava. Evil leaves for moon with Mini me to install the laser & Austin follows with Felicity in Apollo 11. Austin fights Mini Me & flushes him into space.As Austin confronts Dr. Evil, the giant laser is fired, but Austin manages to divert it and save Washington D.C., although Felicity is killed by poison gas. However, using Dr. Evils time portal Austin travels back 10 min and meets up with himself to save both the world and Felicity.Dr. Evil initiates the self-destruction mechanism of the moon base and escapes in his rocket after throwing the bottle of Austin's Mojo in the air. The Mojo bottle breaks but Felicity points out that Austin never lost it They travel the time portal to return to 1999.Fat Bastard makes another attempt to assassinate Austin but is kicked in the crotch by Felicity. Finally, Dr. Evil recovers Mini-Me from space and once again vows to \"get\" Austin Powers.\nThere are two Austins in 1999 as both Austins escaped Dr. Evil's moon base using the time machine, Austin #1 finds Felicity sleeping with Austin #2.",
	"links": [
		"https://www.amazon.com/Austin-Powers-Spy-Who-Shagged/dp/B000YABNA2"
	]
}