{
	"title": "Out of Sight",
	"release_year": "1998",
	"runtime": "123",
	"tags": [
		"Comedy",
		"Crime",
		"Drama",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"George Clooney",
		"Jennifer Lopez",
		"Ving Rhames",
		"Steve Zahn",
		"Jim Robinson",
		"Mike Malone",
		"Donna Frenzel",
		"Manny Suárez",
		"Keith Hudson",
		"Luis Guzmán"
	],
	"staff": [
		"Steven Soderbergh",
		"Elmore Leonard",
		"Scott Frank",
		"Danny DeVito",
		"Michael Shamberg",
		"Stacey Sher",
		"David Holmes",
		"Elliot Davis",
		"Anne V. Coates",
		"Kathy Driscoll",
		"Francine Maisler",
		"Gary Frutkoff"
	],
	"votes": 100601,
	"cover": "https://m.media-amazon.com/images/M/MV5BM2U3OGQ0NTMtNmQxYS00MmRiLTg2OTctZDI3ZjNjZjM5N2NlXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "A career bank robber (& a smooth operator, who only got caught because his getaway car was a junk and wouldn't start), Jack Foley (George Clooney), and a U.S. Marshal, Karen Sisco (Jennifer Lopez), are forced to share a car trunk during his escape from a Florida prison. Sisco was at the prison meeting her client, when the escape attempt by Jack was launched and Sisco got caught up in it. Jack escaped from a tunnel dug by 2 other inmates and Sisco saw him emerge from the tunnel and tried to stop him. Jack takes Sisco's gun and forces her into the trunk of Buddy's car, who at the prison to pick up Jack.After he completes his getaway, Foley is chased by Sisco while he and his friends-right-hand man Buddy Bragg (Ving Rhames) and unreliable associate Glenn Michaels (Steve Zahn)-work their way north to Bloomfield Hills, a wealthy northern suburb of Detroit. There they plan to pay a visit to shady businessman Richard Ripley (Albert Brooks), who bragged to them in prison years before about a cache of uncut diamonds hidden in his home. Ripley worked at Wall Street and ripped off many of his clients. He was imprisoned for 3 years and fined $ 50 M. Ripley spoke to Glenn when they were in prison together 2 years ago and said that he has $5 M in uncut diamonds in his house.Sisco escapes by convincing Glenn to driver her away and ditch Buddy and Jack. In return she will not classify Glenn as an accessory to Jack's prison escape. Glenn is taken in by Sisco's sweet talk, but he is a terrible driver and ends up crashing the car.Sisco has a dream where she tracks down Foley, but instead of arresting him, they have sex. Sisco wakes up in a hospital, where her FBI colleague Daniel Burdon (Wendell B. Harris Jr.) interrogates her on why she didn't shoot Jack and Buddy when she had the chance (twice, once while Jack was escaping the tunnel and the other when she was in the trunk and had the Sig in her hands).. Sisco refuses to answer. Ray Nicolette (Michael Keaton) is Sisco's partner and is on the task force to apprehend Jack and Buddy, but Burdon keeps Sisco out.Sisco investigates on her own and contacts Adele (Catherine Keener), who is Jack's girlfriend (and was the last person Jack called before his escape from prison. Adele was the one who arranged Buddy to pick up Jack during his escape). Chino (Luis Guzmán), one of the inmates who escaped before Jack, reaches Adele's and Sisco arrests him. Burdon is forced to accept Sisco on the task force, but he assigns her menial tasks, like guarding the elevator, when the force goes to the hotel where Jack and Buddy have been reportedly staying after their escape. Karen sees Buddy and Jack coming out of the elevator, but doesn't inform Burdon, allowing them to escape.Glenn spills the diamond plot to vicious criminal Maurice Miller (Don Cheadle), who also did time with Jack and Ripley. Maurice then plans to rob Ripley's mansion with his own crew, including Kenneth (Isaiah Washington) and White Boy Bob (Keith Loneker). Jack sees Maurice with Glenn, outside Ripley's mansion and decides to intervene. Maurice and Foley agree to team up on the job and split the earnings.\nSisco tracks Glenn to his meeting with Maurice in Detroit. Maurice had arranged a meeting to plan the heist with Jack, Buddy, Glenn and his guys at a boxing fight venue. Buddy knew Sisco was tracking Glenn and was sure that all of them will get picked up at the night of the fight.It is revealed that Jack protected Ripley in prison from being sexually assaulted and other things. In exchange, Ripley offered Jack a job in his company when he got out. When Jack did get out (the time before last), he went to Ripley, only to find that he was offered a job of a security guard. This angered Jack and he vows revenge against Ripley. Immediately after this meeting, Jack goes to rob another bank and gets caught and lands back into prison.\nBefore the robbery, a romantic interlude between Foley and Sisco takes place in a Detroit hotel. The question of whether she is really pursuing Foley to arrest him or for love ends in a showdown during the robbery at Ripley's home and adds to \"the fun\" Foley claims they are having.Glenn gets cold feet (after seeing how violent Maurice is and that Maurice had taken full control of the heist from Glenn) and ducks out after Maurice forces him to help kill a drug dealer, and Sisco allows him to escape. Before that, Glenn tells Sisco that Buddy and Jack haven't showed up yet and that's good, since Maurice plans to kill Jack and claim the reward on his head. Shortly thereafter Jack and Buddy reach the fight venue to sync up with Maurice and his crew.\nIn the course of the heist, White Boy Bob accidentally shoots and kills himself tripping on the stairs, while Foley shoots and kills Kenneth as he attempts to sexually assault Ripley's housekeeper/lover, Midge (Nancy Allen). Midge was supposed to be alone in the house, but Jack found Ripley hiding inside the house and found the diamonds in his fish tank. Buddy and Jack were about to leave with the diamonds, but Jack knew that Maurice and his crew would rape the maid and then kills both Midge and Ripley. So, he goes back in.\nSisco, having followed them to Ripley's home, shoots and kills Maurice, and arrests Foley after he implores her to kill him, telling her to \"pretend [he's] someone else\". Buddy (Ving Rhames) slips away with some of Ripley's diamonds.The next morning, Foley is loaded aboard a van to be returned to prison in Florida. Another detainee, Hejira Henry (Samuel L. Jackson), boards the van and mentions to Foley that he has escaped from prison nine previous times, and was deliberately placed by Sisco in the same van as Foley. Sisco smiles as the van leaves for Florida.",
	"links": [
		"https://www.amazon.com/George-Clooney-Jennifer-NON-USA-Format/dp/B0771N1BXN",
		"https://www.amazon.com/Out-Sight-George-Clooney/dp/B000I9WWCW"
	]
}