{
	"title": "Alien Resurrection",
	"release_year": "1997",
	"runtime": "109",
	"tags": [
		"Action",
		"Horror",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.2,
	"actors": [
		"Sigourney Weaver",
		"Winona Ryder",
		"Dominique Pinon",
		"Ron Perlman",
		"Gary Dourdan",
		"Michael Wincott",
		"Kim Flowers",
		"Dan Hedaya",
		"J.E. Freeman",
		"Brad Dourif"
	],
	"staff": [
		"Jean-Pierre Jeunet",
		"Dan O'Bannon",
		"Ronald Shusett",
		"Joss Whedon",
		"Bill Badalato",
		"Gordon Carroll",
		"David Giler",
		"Walter Hill",
		"John Frizzell",
		"Darius Khondji",
		"Hervé Schneid",
		"Richard Pagano",
		"Nigel Phelps"
	],
	"votes": 272664,
	"cover": "https://m.media-amazon.com/images/M/MV5BNDMyNmU5ZGQtNzhiZi00NjRjLTk3NGUtMmQ5YWU4ODlkNTBhXkEyXkFqcGc@._V1_QL75_UY281_CR2,0,190,281_.jpg",
	"description": "Two hundred years after the events of Alien 3, military scientists on the outer space vessel USM Auriga create a clone of Ellen Ripley (Sigourney Weaver) using DNA from blood samples taken before her death. The Alien queen's DNA was mixed in with Ripley's, and the clone grows up with an embryo already inside it. The scientists extract the embryo, raise it, and collect its eggs. The Ripley clone is kept alive for further study. As a result of the alien's DNA inside her, she develops enhanced strength and reflexes, has acidic blood and a psychic link with the Aliens. Also, the alien's genetic memory allows the clone to have some of Ripley's memories.A group of mercenaries, Elgyn (Michael Wincott), Johner (Ron Perlman), Christie (Gary Dourdan), Vriess (Dominique Pinon), Hillard (Kim Flowers), and Call (Winona Ryder), arrive at Auriga on their ship Betty. They deliver several kidnapped humans in stasis. The military scientists use the kidnapped humans as hosts for the Aliens, raising several adult Aliens for study.The Betty crew soon encounters Ripley. Call recognizes her name and tries to kill her, suspecting she may be used to create more Aliens. However, the Aliens have already matured and escape confinement by killing off one of their own and using the acidic blood to burn through their enclosures. They damage the Auriga and kill the crew members who do not manage to evacuate, including General Perez (Dan Hedaya) and Elgyn. Military scientist Dr. Wren (J. E. Freeman) reveals that the ship's default command in an emergency is to return to Earth. Realizing this will unleash the Aliens on Earth, Ripley, the mercenaries, Wren, a Marine named DiStephano (Raymond Cruz), and surviving Alien host Purvis (Leland Orser), decide to head for the Betty and use it to destroy the Auriga. Along the way, Ripley encounters the grotesque products of 7 failed attempts to clone Ripley. The surviving one begs Ripley to mercy kill her, and she complies.As the group make their way through the damaged ship, they swim through a flooded kitchen. They are chased by two Aliens. One is killed, while the other snatches Hillard. As they escape the kitchen, the Alien returns and blinds Christie, who sacrifices himself to kill the Alien so the others can escape. After Wren betrays the group, Call is revealed to be an android. Using her ability to interface with the Auriga's systems, Call sets it on a collision course with Earth, hoping to destroy the Aliens in the crash. She cuts off Wren's route of escape and directs the Aliens towards him. Ripley is captured by the Aliens, while the other survivors head for the Betty. There, Wren shoots Purvis and takes Call hostage, demanding that she abort the collision. An injured Purvis violently attacks Wren and forces his head to his chest just as the Alien embryo he is carrying bursts through his rib-cage, causing it to go through Wren's head and kill them both. The survivors then shoot at the embryo.Ripley is taken to the Alien nest, where she witnesses the Queen, now possessing a womb as a result of the genetic mixture, gives birth to a Newborn, a Xenomorph with human traits, such as human teeth, mouth, pale skin color and a human-like face with actual eyes. The hybrid Alien recognizes Ripley as its mother, kills the queen Alien and Dr. Jonathan Gediman (Brad Dourif), a scientist previously captured and cocooned. Ripley takes advantage of the distraction to escape. She makes her way to the Betty.The Newborn reaches the Betty and attacks Call. It kills DeStephano when he arrives to help her. Ripley finds her way onto the ship and saves Call by distracting the Newborn. Using her acidic blood, Ripley melts the glass of a window and pushes the Newborn towards the hole. It is violently sucked through the hole due to explosive decompression, while Ripley tearfully watches.The countdown on the Auriga continues as the survivors escape in the Betty. The Auriga collides with Earth, causing a large explosion. Call and Ripley look down at Earth, and when Call asks what Ripley wants to do next, she says, \"I'm a stranger here myself.\"\nIn an alternate ending that is used in some extended adaptions, The Betty lands in a ruined Paris.",
	"links": [
		"https://www.amazon.com/Alien-Resurrection-Sigourney-Weaver/dp/B000NDHQG0"
	]
}