{
	"title": "As Good as It Gets",
	"release_year": "1997",
	"runtime": "139",
	"tags": [
		"Comedy",
		"Drama",
		"Romance",
		"max",
		"amazon"
	],
	"rating": 7.7,
	"actors": [
		"Jack Nicholson",
		"Helen Hunt",
		"Greg Kinnear",
		"Cuba Gooding Jr.",
		"Skeet Ulrich",
		"Shirley Knight",
		"Yeardley Smith",
		"Lupe Ontiveros",
		"Jill the Dog",
		"Timer the Dog"
	],
	"staff": [
		"James L. Brooks",
		"Mark Andrus",
		"James L. Brooks",
		"James L. Brooks",
		"Bridget Johnson",
		"Kristi Zea",
		"Hans Zimmer",
		"John Bailey",
		"Richard Marks",
		"Francine Maisler",
		"Bill Brzeski"
	],
	"links": [
		"https://www.max.com/movies/as-good-as-it-gets/b2bd3ce7-1d68-49eb-b6cc-ecfdb5cbe061",
		"https://www.amazon.com/As-Good-Gets-Jack-Nicholson/dp/B000I8HIO0"
	],
	"votes": 322444,
	"cover": "https://m.media-amazon.com/images/M/MV5BMzBiMWJhYmQtOWYzNS00NjgxLWE5NDItNzZlZDQwODBmODNjXkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Melvin Udall (Jack Nicholson) is a misanthrope who works at home as a best-selling novelist in New York City. He suffers from obsessive-compulsive disorder (he uses a bar of soap only once before discarding it in trash) which, paired with his misanthropy, alienates nearly everyone with whom he interacts.\nHe eats breakfast at the same table in the same restaurant every day using disposable plastic utensils he brings with him due to his pathological Mysophobia. If there are customers sitting at his table, Melvin will be mean to them, till they get up and leave.\nHe takes an interest in his waitress, Carol Connelly (Helen Hunt), the only server at the restaurant who can tolerate his behavior.One day, Melvin's apartment neighbor, gay artist Simon Bishop, starts working with a new model, Vincent Lopiano. Vincent uses the opportunity to case Simon's apartment and allow his friends inside, who assault and nearly kill Simon during the robbery. Simon's agent, Frank Sachs, intimidates Melvin into caring for Simon's Griffon Bruxellois, Verdell, while he is hospitalized. Now, Melvin had once put Verdell in the garbage chute of the building since it went urinating in the hallway.\nMelvin is a bit racist and had once insulted Frank, for being a colored person.Although he initially does not enjoy caring for the dog, Melvin becomes emotionally attached to it.\nHe simultaneously receives more attention from Carol. When Bishop is released from the hospital, Melvin is unable to cope emotionally with returning the dog. Even Simon can see that Verdell pines for Melvin.Melvin's life is further altered when Carol decides to work closer to her home in Brooklyn so she can care for her acutely asthmatic son Spencer \"Spence\" Connelly (Jesse James). Carol's mother Beverly (Shirley Knight) stays with them to take care of Spence while Carol works. Melvin cannot adjust to another waitress and the cafe manager Brian (Shane Black) kicks Melvin out for being rude to his waitresses.\nMelvin visits Carol at her home and arranges to pay for her son's medical expenses if Carol agrees to continue working at her previous restaurant in Manhattan. Melvin asks his publisher's husband (who is Dr. Martin Bettes (Harold Ramis)), to personally take of Spencer. Martin assures Carol that Spencer will feel a lot better under his care.\nCarol is worried that Melvin is interested in her sexually. Carol meets Melvin at his home and says that she will never sleep with him.Meanwhile, Simon's assault and rehabilitation, coupled with Verdell's preference for Melvin, causes Simon to lose his creative muse. Simon is approaching bankruptcy due to his medical bills. Simon's agent, Frank Sachs (Cuba Gooding Jr.), convinces Simon to go to Baltimore and ask his estranged parents for money. Simon's parents had disinherited him for being homosexual.Because Frank is too busy to take the injured Simon to Baltimore himself, Melvin reluctantly agrees to do so; Frank lends Melvin his Saab 900 convertible for the trip. Melvin invites Carol to accompany them on the trip to lessen the awkwardness. She reluctantly accepts, and relationships among the three develop. Melvin says that he needs Carol to chaperon Simon. Melvin is clear that paying her son's medical bills obligates her to this favor.Once in Baltimore, Carol persuades Melvin to take her out to have dinner when she learns that back home Spencer went outside to play soccer.\nMelvin's comments during the dinner greatly upset Carol, and she abruptly leaves. Carol wanted to know why Melvin brought her along for the trip and hoped to hear that Melvin was attracted to her and wanted to sleep with her. Instead Melvin says that he hoped Carol would sleep with Simon, and treat him of his depression.\nUpon seeing the frustrated Carol, Simon begins to sketch her and rekindles his creativity, once more feeling a desire to paint.\nHe briefly reconnects with his parents but is able to tell them that he'll be fine.After returning to New York City, Carol tells Melvin that she does not want him in her life anymore.\nShe later regrets her statement and calls him to apologize. The relationship between Melvin and Carol remains complicated until Simon, whom Melvin has allowed to move in with him until he can get a new apartment, convinces Melvin to declare his love for her at her apartment in Brooklyn, where the two realize the depth of their personal connection.\nThe film ends with Melvin and Carol walking together to buy fresh rolls at the corner bakery."
}