{
	"title": "Corpse Bride",
	"release_year": "2005",
	"runtime": "77",
	"tags": [
		"Animation",
		"Comedy",
		"Drama",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Johnny Depp",
		"Helena Bonham Carter",
		"Emily Watson",
		"Tracey Ullman",
		"Tracey Ullman",
		"Paul Whitehouse",
		"Paul Whitehouse",
		"Paul Whitehouse",
		"Joanna Lumley",
		"Albert Finney",
		"Richard E. Grant",
		"Christopher Lee",
		"Michael Gough"
	],
	"staff": [
		"Tim Burton",
		"Mike Johnson",
		"Tim Burton",
		"Carlos Grangel",
		"John August",
		"Caroline Thompson",
		"Allison Abbate",
		"Tim Burton",
		"Danny Elfman",
		"Pete Kozachik",
		"Chris Lebenzon",
		"Jonathan Lucas",
		"Michelle Guish",
		"Alex McDowell"
	],
	"links": [
		"https://www.amazon.com/Burtons-Corpse-Bride-Johnny-Depp/dp/B000GOWSF0"
	],
	"votes": 303163,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTk1MTY1NjU4MF5BMl5BanBnXkFtZTcwNjIzMTEzMw@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Victor Van Dort (Johnny Depp), the son of newly rich fish merchants, and Victoria Everglot (Emily Watson), the neglected daughter of impoverished aristocrats, prepare for their arranged marriage, which will simultaneously raise the social class of Victor's parents and restore the wealth of Victoria's family (\"According to Plan\"). Although they fall in love instantly, the nervous Victor ruins their wedding rehearsal by forgetting his vows, dropping the wedding ring and clumsily setting Lady Everglot's dress on fire. Fleeing to a nearby forest, he practices his vows with a tree and places his wedding ring on a root. However, the root is revealed to be the finger of a dead woman named Emily (Helena Bonham Carter), who rises from the grave claiming that she is now Victor's wife, and spirits him away to the Land of the Dead.During his time with her, Victor learns that Emily was murdered years ago by an unnamed perpetrator, on the night of her elopement, and he stole the family jewels she had brought (\"Remains of the Day\").\nEmily reunites Victor with his long deceased dog, Scraps, and they bond. Desperate to return to Victoria, Victor tricks Emily into returning them to the Land of the Living by claiming he wants her to meet his parents. Emily brings Victor to see Elder Gutknecht (Michael Gough), the kindly ruler of the underworld, who grants them temporary passage. Victor, feeling guilty for tricking Emily, asks the bride to wait in the forest.He successfully reunites with Victoria and confesses his wish to marry her as soon as possible. Before the pair can share a kiss, Emily discovers them and, feeling betrayed and hurt, drags Victor back to the Land of the Dead (\"Tears to Shed\").\nVictoria quickly tries to tell her parents of Victor's situation, but neither believe her nor assume he has left her. Against her will, they decide to marry her to a presumed-wealthy visitor named Lord Barkis Bittern (Richard E. Grant), who appeared at the wedding rehearsal. Lady Everglot is relieved since their financial situation is perilous and nobody would ever marry Victoria if the word got out that she is mad.After reconciling with Emily (Victor tells him that it was wrong to trick her but he wanted to let Victoria know so she didn't worry about him), Victor learns of Victoria's impending marriage to Barkis from his family's newly deceased coachman. Upset over this news, Victor decides to marry Emily, learning that this will require him to repeat his wedding vows in the Land of the Living and drink a deadly poison in order to join her in death.The dead swiftly prepare for the ceremony and head \"upstairs\" (\"The Wedding Song\"), where the town erupts into a temporary panic upon their arrival until everyone recognizes their departed loved ones, and joyously reunite. The chaos causes a panicked Barkis to expose his own poor financial standing and his intentions to marry Victoria only for her supposed wealth, leading her to reject him.Victoria follows everyone to Victor and Emily's wedding as Victor completes his vows and prepares to drink the poison, only for Emily to stop him when she realizes she is denying Victoria her chance to live happily with him. Just as Emily reunites Victor and Victoria, Barkis arrives to kidnap Victoria.\nEmily recognizes him as her previous fiance and reveals he was also her murderer. Victor duels with Barkis to protect Victoria, and Emily intervenes to save Victor's life.Barkis mockingly toasts Emily for dying unwed and unwittingly drinks the poison that Victor nearly took, causing him to die and allowing the dead - who cannot interfere in the affairs of the living - to take retribution against him for his crimes. Emily, now freed from her torment, frees Victor of his vow to marry her and returns his ring, allowing him to marry Victoria, whom she throws her wedding bouquet to. As she steps into the moonlight, she fades away into hundreds of butterflies and flies into the sky, finding peace, as Victor and Victoria watch and embrace."
}