{
	"title": "U.S. Marshals",
	"release_year": "1998",
	"runtime": "131",
	"tags": [
		"Action",
		"Crime",
		"Thriller",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Tommy Lee Jones",
		"Wesley Snipes",
		"Robert Downey Jr.",
		"Joe Pantoliano",
		"Daniel Roebuck",
		"Tom Wood",
		"LaTanya Richardson Jackson",
		"Irène Jacob",
		"Kate Nelligan",
		"Patrick Malahide"
	],
	"staff": [
		"Stuart Baird",
		"Roy Huggins",
		"John Pogue",
		"Anne Kopelson",
		"Arnold Kopelson",
		"Jerry Goldsmith",
		"Andrzej Bartkowiak",
		"Terry Rawlings",
		"Cathy Sandrich Gelfond",
		"Amanda Mackey",
		"Maher Ahmad"
	],
	"votes": 115303,
	"cover": "https://m.media-amazon.com/images/M/MV5BZTdlYTU2OGYtZjljOS00ZjFhLTk5NjAtZDQwZmNkYzk4YWQ5XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The film opens with closed-circuit television footage of an exchange between two men taking place in a parking garage, which appears to be foiled by agents of the U.S. State Department's Diplomatic Security Service (DSS). The two agents appear to be gunned down one of the two men making the meeting.\nIn Chicago, a tow truck driver named Mark Warren (Wesley Snipes) is driving down a highway while he returns a car to an impound lot. He suddenly has to swerve to avoid a distracted driver, and loses control of his truck. The truck crashes through several construction barriers, then is launched into the air and turned over its side as it skids into an intersection. Warren survives, although his left arm is broken in the accident. Within minutes, emergency workers arrive to extricate Warren from the truck. While Warren is taken to the hospital, a firefighter discovers a gun stashed inside the truck, and hands it to one of the first police officers to arrive on the scene.\nDown on the South Side, Deputy US Marshal Samuel Gerard (Tommy Lee Jones) along with his team, comprised of Cosmo Renfro (Joe Pantoliano), Bobby Biggs (Daniel Roebuck), Noah Newman (Tom Wood), and Savannah Cooper (LaTanya Richardson), are staking out an apartment building where they two fugitive brothers, Michael and Greg Conroy, who escaped from a Tennessee state prison, are hiding with their girlfriends. Gerard is stationed on a street corner, disguised as a chicken mascot offering free samples to passerby while advertising his food truck parked on the corner. Biggs is stationed nearby, disguised as a construction worker, as is Renfro. Newman and Cooper are stationed behind the building.While acting his part, Gerard sees the brothers and their girlfriends arrive in a stationwagon and walk inside with groceries. Once they're inside, he starts walking towards the building, removing his chicken feet and head and producing his pistol, and is joined by Biggs and Renfro. They advance up to the front door of the suspected hideout. On Gerard's signal, they break down. Michael immediately fights back as Biggs and Renfro try to subdue to him. Gerard gets attacked by the girlfriends when they try to intervene, but he manages to overpower both of them. Greg attempts to flee out the back door, only for Newman and Cooper to burst in and pin him to the wall. His infant son starts crying and he immediately makes a move for the baby's crib, ostensibly to comfort it, but actually so he can grab a shotgun. Newman shoots him in the shoulder before he can do this, and passes the gun to Gerard, who draws it on Michael and momentarily holds him at bay. Renfro starts to secure the handcuffs on Michael, who suddenly yells in pain and bites Biggs's left shoulder, forcing Gerard to crack him over the head with the butt of the shotgun.Gerard and his men later celebrate the arrest of the Conroy brothers at a bar, as they watch a newscast of the brothers being led to the courthouse in handcuffs. Both brothers have made excessive force complaints against Gerard, with Michael having required 27 stitches after Gerard struck him with the shotgun.Meanwhile, Mark is taken to Chicago Memorial Hospital, where his left arm is put in a cast and he is given a neck brace as support. His French girlfriend Marie Bineaux (Irène Jacob) is there waiting to pick him up when he's released, as she pays for Warren's bill in cash. As they're about to leave, though, one of the police officers from the scene of the accident shows up and arrests Mark on an illegal gun possession charge due to the gun found in the truck (thanks to Chicago's strict gun laws).Mark is taken into custody and questioned. The lead detective informs him that there's been a slight discrepancy: his name flags a white man with long hair. When asked if he's aware of the strict gun laws Chicago imposes, Mark dismisses it by asking, \"You ever try towin' a car on the Dan Ryan at three o'clock in the morning without a handgun?\" The detective then asks Mark if he's ever been to East 42nd Street and First Avenue in New York City, the scene of a brutal double homicide the previous December. Mark denies it, but the detective then reveals that Mark's fingerprints flagged him as Mark Roberts, the man wanted on a federal arrest warrant for the murders, and his prints were found at the crime scene. Warren/Roberts immediately demands to talk to a lawyer, and has to be restrained by the other two detectives, which as it turns out is a ploy as he uses the distraction to snap the glasses frames belonging to the lead detective.That evening, Gerard attends a party with his date, newscaster Stacia Vela. In actuality, he is attending because he's been summoned by his boss, Marshal Katherine Walsh (Kate Nelligan). Walsh reprimands Gerard for his actions during the arrest of the Conroy brothers, since the brothers are accusing Gerard of police brutality. As discipline, and damage control, she orders him to personally escort the Conroys back to Tennessee on a federal prison transport plane.Gerard reports that night to the airfield where the prison transport plane is awaiting departure. Several prisoners are loaded onto the aircraft, including the Conroy brothers, and Mark Roberts. Once on board, each prisoner is buckled in by a guard, with additional shackles being used to secure their legs to the floor.Around midnight, the aircraft takes off, headed first for Memphis, then for New York City. Everything goes fine until about 20 minutes prior to landing, when Vincent Ling, a Chinese mob assassin being returned to prison after losing an appeal, suddenly asks to use the lavatory. One of the guards releases the leg shackles on Ling's feet and walks him back to the toilet. Ling sits down and pretends to use the toilet. In actuality, the toilet trip is a ruse for him to grab a zipgun disguised as a ballpoint pen that's been planted inside a roll of toilet paper. While that's happening, Roberts begins to use the piece of glasses frame (which he's smuggled on inside his plaster cast) to pick at his handcuffs. As Ling is being escorted back to his seat, he produces the zipgun and tries to shoot Roberts. However, Roberts deflects the aim, and the bullet pierces a window, causing an explosive decompression that sucks Ling and a prison guard out of the plane.The plane immediately goes into a dive as the pilots struggle to regain control of the plane. They are forced to ditch the plane on a narrow country road somewhere in Kentucky. The plane touches down smoothly, but then the left wing clips a row of power line poles, and eventually breaks off. What's left of the plane then rolls off the road, and down a hill into the river, where it comes to a rest upside down. As survivors are evacuated, Roberts escapes into the night. Gerard issues a manhunt for the escapee. DSS Director Bertram Lamb assigns DSS Special Agent John Royce to join Gerard's team. Gerard inspects Royce's firearm and dismissively insists Royce replace it with a Glock. Roberts is tracked by the team to a swamp, where he takes Royce's gun and shoots Gerard with it, who is wearing a bulletproof vest, allowing him to escape.After traveling to New York City and securing money, weapons and fake identification, Roberts tails Chinese diplomat Xiang Chen, the other man from the parking garage. In Chicago, Gerard and the Marshals pursue several leads, including Marie. Roberts secretly contacts Marie to explain that he secretly worked for the government and was ambushed during a routine exchange, killing the men before realizing they were DSS agents. The Marshals track the airplane mechanic who was bribed to hide the zip gun, but by the time they catch him, Chen has already murdered him to prevent him from talking. Gerard acquires the surveillance footage of the murders and finds Roberts killed the agents in self-defense and was wearing gloves, thus could not have been identified by fingerprints at the scene as Lamb claimed. Lamb admits that Roberts is in fact Mark Sheridan, a former Force Recon Marine working as an unofficial operative for the government, who they believe is a mole within the U.S. State Department selling covert secrets to China. The agents were tailing Chen, a Chinese intelligence agent who was the mole's contact, but when they tried to intercept the exchange, Sheridan killed them and fled.Eventually, Gerard and his team catch up with Sheridan in Queens Hill Cemetery as he ambushes DSS Special Agent Frank Barrows, who conspired with the mole to frame Sheridan by duping him into making the exchange. As Sheridan holds Barrows hostage to clear his name, Chen inadvertently kills Barrows while trying to shoot Sheridan. Chen is arrested, while Sheridan flees to a retirement home followed by Gerard, Royce and Newman. During a struggle, Royce disarms Sheridan and holds him at gunpoint. Before Royce can kill Sheridan, Newman walks into the room and Royce fatally shoots him, giving Sheridan the opportunity to escape off the roof and onto a moving train. Royce claims Sheridan shot Newman, who dies before he can reveal the truth.A vengeful Gerard abandons his team, taking Royce along as they track Sheridan to a loading dock in Bayonne, New Jersey, where he is stowing away on a freighter bound for Canada. Gerard confronts, fights and nearly kills Sheridan but lets his guard down, enabling Sheridan to get the upper hand. Royce fires his new Glock at Sheridan, hitting him in the shoulder, who is taken into custody. At the hospital, Gerard recognizes the gun that killed Newman is Royce's old firearm. Royce goes into Sheridan's room and admits to Sheridan that he is the mole, giving Sheridan a knife to make his intended murder appear as self-defense. Gerard walks in and confronts Royce about killing Newman. Royce tries to shoot Gerard for catching him in the act like before, but Gerard had emptied Royce's Glock beforehand. When Royce attempts to draw his backup firearm, Gerard shoots and kills him first.Sheridan is publicly exonerated at a government hearing and makes peace with Gerard, who gives his team a backhanded apology before they depart to honor Newman's memory.",
	"links": [
		"https://www.amazon.com/U-S-Marshals-Tommy-Lee-Jones/dp/B001AS43VI"
	]
}