{
	"title": "The Truman Show",
	"release_year": "1998",
	"runtime": "103",
	"tags": [
		"Comedy",
		"Drama",
		"amazon"
	],
	"rating": 8.2,
	"actors": [
		"Jim Carrey",
		"Ed Harris",
		"Laura Linney",
		"Laura Linney",
		"Noah Emmerich",
		"Natascha McElhone",
		"Natascha McElhone",
		"Holland Taylor",
		"Brian Delate",
		"Blair Slater",
		"Peter Krause",
		"Heidi Schanz"
	],
	"staff": [
		"Peter Weir",
		"Andrew Niccol",
		"Edward S. Feldman",
		"Andrew Niccol",
		"Scott Rudin",
		"Adam Schroeder",
		"Burkhard von Dallwitz",
		"Peter Biziou",
		"William M. Anderson",
		"Lee Smith",
		"Howard Feuer",
		"Dennis Gassner"
	],
	"votes": 1223800,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzA3ZjZlNzYtMTdjMy00NjMzLTk5ZGYtMTkyYzNiOGM1YmM3XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Truman Burbank is the unsuspecting star of \"The Truman Show,\" a reality television program filmed and broadcast worldwide 24/7 through approximately five thousand hidden cameras. Selected at birth and legally adopted by a television studio following an unwanted pregnancy, Truman lives in Seahaven Island, set inside an enormous soundstage. This setup allows Christof, the show's creator and executive producer, to control most aspects of Truman's life, including the weather.Truman's world is populated by actors and crew members who pretend to be his community while carefully keeping him from discovering the truth. They also earn revenue for the show through cleverly disguised product placements. To prevent Truman from escaping, Christof orchestrates various scenarios to instill fear and anxiety. For example, he fakes the death of Truman's father in a boating accident to create a fear of water, and the cast reinforces Truman's anxieties with warnings about the dangers of traveling and the virtues of staying home.Though the producers intend for Truman to fall in love with and marry a woman named Meryl, he develops feelings for Sylvia, an extra in the show. Sympathetic to his plight, Sylvia tries to reveal the truth to him but is fired and forcibly removed from the set before she can convince him. Truman eventually marries Meryl, but their relationship is stilted and passionless, and he secretly dreams of a life with Sylvia and hopes to travel to Fiji, where he was told she had moved. Meanwhile, Sylvia joins a group called \"Free Truman,\" which advocates for his liberation.As the show approaches its thirtieth anniversary, Truman begins noticing unusual occurrences: a stage light falling from the sky, an isolated patch of rain that falls only over him, a radio transmission describing his movements through town, and the sudden reappearance of his father, who is hurriedly taken away by crew members. Realizing that the city seems to revolve around him, Truman starts questioning his life and seeks help from those he trusts to solve the mystery.Truman's suspicions culminate in a plan to escape the island, but increasingly implausible events block his path. He is eventually caught and returned home under flimsy pretenses. There, he confronts Meryl and challenges the authenticity of their marriage. A panicked Meryl tries to change the subject with product placements, causing Truman to snap and hold her at knife point. Meryl breaks character, calls for help, and is subsequently removed from the show.To regain control over Truman, Christof reintroduces his father to the program, claiming that he has developed amnesia after the boating accident. Although the show's ratings rise again, Truman begins displaying unusual behavior, like sleeping in the basement. Concerned by this change, Christof sends Truman's best friend Marlon to visit, only to discover that Truman has escaped through a makeshift tunnel. This marks the first time in the show's history that the broadcast is suspended, resulting in record viewing numbers.Christof orders a citywide search for Truman and is eventually forced to break the production's day-night cycle to optimize the search. Truman is found sailing away from Seahaven, having overcome his fear of water. In an effort to stop him, Christof resumes the broadcast and creates a violent storm to capsize Truman's boat. Truman nearly drowns but continues to sail until he strikes the wall of the dome. Horrified, he looks around and finds a staircase leading to an exit door.As he contemplates leaving, Christof speaks to him directly, revealing the truth about the show and urging him to stay by claiming that there is no more truth in the real world than in his artificial one. Truman responds with his catchphrase, \"In case I don't see you, good afternoon, good evening, and good night,\" bows to the audience, and exits. Viewers around the world celebrate Truman's escape, and Sylvia races to greet him. The executive producers end the program with a shot of the open exit door, leaving Christof devastated. Following the broadcast, Truman's viewers look for something else to watch..",
	"links": [
		"https://www.amazon.com/Truman-Show-Jim-Carrey/dp/B002SGYPS2"
	]
}