{
	"title": "Starship Troopers",
	"release_year": "1997",
	"runtime": "129",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"Casper Van Dien",
		"Denise Richards",
		"Dina Meyer",
		"Jake Busey",
		"Neil Patrick Harris",
		"Clancy Brown",
		"Seth Gilliam",
		"Patrick Muldoon",
		"Michael Ironside",
		"Rue McClanahan"
	],
	"staff": [
		"Paul Verhoeven",
		"Edward Neumeier",
		"Robert A. Heinlein",
		"Jon Davison",
		"Alan Marshall",
		"Basil Poledouris",
		"Jost Vacano",
		"Mark Goldblatt",
		"Caroline Ross",
		"Elaine J. Huzzar",
		"Johanna Ray",
		"Allan Cameron"
	],
	"votes": 326718,
	"cover": "https://m.media-amazon.com/images/M/MV5BZTNiOGM1ZWUtZTZjZC00OWJmLWE2YzUtZjQ4ODZjZmVlMDU3XkEyXkFqcGc@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "In the 23rd century, Earth is governed by the United Citizen Federation, a Stratocratic regime founded generations earlier by \"veterans\" after democracy and social scientists brought civilization to the brink of ruin. In the Federation, citizenship is a privilege earned by performing such activities as military service, which grants individuals opportunities like procreation and voting which are prohibited to basic civilians.\nFederal service (such as joining the mobile infantry) is seen as a collective duty and people are encouraged to do \"their part\".Earth has become a space-faring civilization. While colonizing new planets, humans have encountered an Insectoid species known as Arachnids or \"Bugs\", with their home being the distant world Klendathu. The bugs appear to be little more than savage, unrelenting killing machines, though there are suggestions that they were provoked by the intrusion of humans into their habitats.The bugs send meteors to destroy Earth, which is defended by huge spaceships who blow the meteors up with their cannons. Klendathu orbits a twin star system, where brutal gravitational forces create an unlimited supply of bug meteors in the form of an asteroid belt. Klendathu is on the other side of the Galaxy, and the humans believes that for their survival, the Klendathu bug planet must be eliminated. Earth is planning to launch an invasion force to Klendathu in one year's time.John \"Johnny\" Rico (Casper Van Dien), his girlfriend Carmen Ibanez (Denise Richards) and best friend Carl Jenkins (Neil Patrick Harris) attend high school in Buenos Aires. Fellow student Isabel \"Dizzy\" Flores (Dina Meyer) is in love with Rico, but he does not reciprocate as he has eyes only for Carmen. Jean Rasczak is their teacher, who has only one arm.They all apply to Fleet Academy. Carmen scores 97% on her math tests, which are the first scores checked by the academy. Rico scores a 35% on his math. Rico is not good with Psychic abilities either, while Jenkins excels at it. Jenkins has a pet raccoon named Cyrano.\nCarmen is also doing some light flirting with school jock Zander Barcalow, who is also going to the Fleet Academy. Zander and Rico play the same American football like sport on rival teams.Rico's parents (Mr Rico (Christopher Curry) and Mrs Rico (Lenore Kasdorf)) disapprove of military service and wanting him to enroll at Harvard University instead. They argue that people get killed in military service. Rico comes from a rich family but wants to make his own name and career rather than relying on his parents. His parents try to entice him into staying by offering a gap year with an all expense paid trip to the outer rings of the galaxy, including Zegema beach, which Rico always wanted to see.At the graduation party Jean Rasczak says that choosing their path in life is the only real freedom that an individual has, and that Rico should use it.\nThe friends all enlist in the Federal Service after graduation and Carmen makes them (herself, Rico and Carl) take a vow that they would always be friends. Rico's parents believe that he is throwing away his life to impress Carmen. Despite Rico declaring his love to Carmen, she does not reciprocate his feelings.Carmen becomes a spaceship pilot assigned to the battleship Rodger Young, while mentally gifted psychic Carl Jenkins joins Military Intelligence. Rico enlists in the Mobile Infantry expecting to be with Carmen, but is surprised to find Dizzy, who deliberately transferred from Fort Cronkite to his squad to be near him. Rico believes that Dizzy joined mobile infantry to pursue him romantically, but he makes it clear that he will maintain his distance from her.At Mobile Infantry training, Career Sgt. Zim (Clancy Brown) trains the recruits. Sgt. Zim is a tough taskmaster and tells the recruits to quit if they cannot keep up the pace at the training center.\nRico is later promoted to squad leader after showing initiative and quick-thinking during training exercises and befriends Ace Levy. Rico was only able to excel at training simulations due to suggestions from Dizzy and acknowledges it.Meanwhile Carmen aims to be a Star Ship pilot. Carmen's training takes place on a space station orbiting around the moon where her class it trained on flying various categories of spaceships, before being assigned to the Star Ship Rodger Young. A star drive is a device that allows Star Ships to attain warp speeds and enables inter planetary travel. Rodger Young is led by Captain Deladier (Brenda Strong).Rico later receives a Dear John letter from Carmen, as she desires a career with the fleet (which means that she will be with the fleet for a much longer duration and won't be able to meet Rico when his term concludes at 2 years of service). Carmen now serves under Rico's high-school-sports rival, Zander Barcalow (Patrick Muldoon), who is her flight instructor.\nCarmen ended her relationship with Rico due to their diverging career paths and her growing feelings for Zander.Following a live-fire training incident that kills one of Rico's squads (the squad member had a helmet malfunction and Rico asked him to remove it, which resulted in him being shot in the head) and causes another to quit out of guilt (she was the one who fired the shot that killed the other squad member), Rico is demoted and flogged. Rico is not fired as Sgt. Zim believes that Rico can still be salvaged. Ace Levy is promoted to Squadron Leader instead.\nRico resigns and calls his parents to ask them if he can return home, but the call is cut off when an asteroid, supposedly launched by the Arachnids, obliterates Buenos Aires, killing his family and millions of others. Rico rescinds his resignation and remains with the Infantry as an invasion force is deployed to Klendathu.The Rodger Young was deployed near Jupiter and had seen the asteroid coming, but the asteroid damaged the ship's communications array in a collision and the ship could not warn planetary defenses in time before the asteroid collided with Earth. Carmen was praised for her quick thinking that saved the rest of the ship.The invasion force gathers at an advanced space station called Triconderoga deep inside the Arachnid Quarantine Zone. Carmen and Rico come face to face, and Rico gets into a physical altercation with Zander, when Zander taunts him. Dizzy separates them and says that Mobile Infantry and Fleet do not mix.An invasion force is deployed to Klendathu, the Arachnids' home planet (which is defended by Bug Batteries, which resembles anti-aircraft fire but for spaceships), but military intelligence underestimates the Arachnids' defensive abilities. Soon, the bug batteries start taking out star ships in orbit. Carmen's own ship is hit by the battery and severely damaged.\nThe first strike on Klendathu is a total disaster, with hundreds of thousands of casualties. Rico is severely wounded in the leg and mistakenly classified KIA, causing Carmen to believe he is dead. Rico is rescued and put into rehab with the remainder of his unit.Rico, Ace and Dizzy are reassigned to the 'Roughnecks', an elite unit commanded by Lt. Jean Rasczak (Michael Ironside), Rico's former-high-school teacher. The Roughnecks are assigned to clearing an outer planet around Klendathu.\nRico is promoted to Corporal after destroying a Tanker Bug (By piercing a hole in it's armor and then dropping grenades inside it) and impressing Rasczak. He also finally reciprocates Dizzy's love for him.The Roughnecks respond to a distress call from Planet \"P\", where they discover an outpost that has been devastated by Bugs. The distress call ends up being a trap and the Arachnids swarm the outpost.Rico, now Acting Sergeant, Euthanizes a mortally wounded Rasczak after a buried Bug bites off his legs, and after a Bug stabs Dizzy in the torso she dies in Rico's arms as they are rescued by Carmen and Zander. The group returns to the fleet assembled in orbit above P, where Dizzy is eulogized. Rico and Carmen reconnect and encounter Carl, now a high-ranking intelligence officer, at Dizzy's funeral.Jenkins, now a high-ranking colonel, reveals the Roughnecks were deliberately ordered into the trap, justifying it as a necessary sacrifice to confirm the existence of a \"Brain Bug\", an intelligent Arachnid strategically directing the others. He field-promotes Rico to Lieutenant and gives him full command of the Roughnecks, ordering the infantry to return to \"P\" and capture the brain bug.As Rico's Roughnecks join the mission, the Fleet encounters unexpectedly heavy fire from the Bugs and Carmen's ship the Rodger Young is destroyed. The escape pod carrying Carmen and Zander crashes into the Bug tunnel system near Rico. Unknowingly guided by a psychic suggestion from Carl, Rico takes Ace and Sugar Watkins (Seth Gilliam) into the tunnels to rescue both. They find Carmen and Zander surrounded by several types of Arachnids including the Brain Bug, which had used its proboscis to pierce Zander's skull and eat his brain. Before it can take Carmen's brain she cuts off the proboscis with a knife Zander gave her. Rico threatens the Bugs with a small nuclear bomb, which the Brain Bug is able to recognize and allows them to leave.Arachnids pursue them and Watkins is mortally wounded, sacrificing himself by detonating the bomb to kill them while the others escape. After returning to the surface, they find that former Sgt. Zim, who had requested demotion to private so that he could serve at the front, has captured the Brain Bug. Carl congratulates Rico and tells him and Carmen that the humans will soon be victorious, now that Military Intelligence can study the brain bug, which Carl reveals through a psychic scan is afraid. A propaganda clip is shown starring Carmen (now a captain commanding a battleship), Ace and Rico as model servicemen, encouraging viewers to enlist.",
	"links": [
		"https://www.amazon.com/Starship-Troopers-Casper-Van-Dien/dp/B000MF4O82"
	]
}