{
	"title": "Alien³",
	"release_year": "1992",
	"runtime": "114",
	"tags": [
		"Action",
		"Horror",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.4,
	"actors": [
		"Sigourney Weaver",
		"Charles S. Dutton",
		"Charles Dance",
		"Paul McGann",
		"Brian Glover",
		"Ralph Brown",
		"Danny Webb",
		"Christopher John Fields",
		"Holt McCallany",
		"Lance Henriksen"
	],
	"staff": [
		"David Fincher",
		"Dan O'Bannon",
		"Ronald Shusett",
		"Vincent Ward",
		"David Giler",
		"Gordon Carroll",
		"David Giler",
		"Walter Hill",
		"Elliot Goldenthal",
		"Alex Thomson",
		"Terry Rawlings",
		"Norman Reynolds"
	],
	"votes": 329914,
	"cover": "https://m.media-amazon.com/images/M/MV5BOGZiNmVlZGEtM2VmMi00ZTFkLTliMzEtZDNhYzUzNTcxMGY3XkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "A fire starts aboard the Colonial Marine spaceship Sulaco. The computer launches an escape pod containing Ellen Ripley (Sigourney Weaver), the young girl Newt, the wounded Corporal Hicks, and the damaged android Bishop; all four are in Cryonic stasis. Scans of the crew's Cryotubes show an Alien face-Hugger, a parasite that implants its hosts with Alien embryos, attached to one of the members. The pod crash-lands on Fiorina \"Fury\" 161, a foundry facility and penal colony inhabited by male inmates with histories of physical and sexual violence. After inmates recover the pod and its passengers, a face-Hugger approaches the prison dog.Ripley is awakened by Clemens (Charles Dance), the prison doctor, and informed that she is the only survivor. Many of the ex-inmates, led by Dillon, have embraced an apocalyptic, Millenarian version of Christianity. Ripley is warned by the prison warden, Harold Andrews (Brian Glover), that her presence may have disruptive effects. Ripley requests that Clemens perform an autopsy on Newt (Danielle Edmond), secretly fearing that Newt may be carrying an Alien embryo. Despite protests from the warden and his assistant Aaron, the autopsy is conducted, and no embryo is found. Ripley's unusual behavior begins to frustrate the warden and agitate the prisoners.A funeral is held for Newt and Hicks and their bodies are cremated in the facility furnace. In another section of the facility, an unusually large Alien bursts from the prison dog. The Alien kills several members of the colony and returns outcast prisoner Golic (Paul McGann) to his deranged state. Ripley re-activates Bishop, who confirms that an Alien came with them to Fiorina in the escape pod. Ripley informs Andrews of her encounters with the Aliens and suggests everyone work together to hunt down and kill it. Andrews does not believe her story but explains that the facility has no weapons; their only hope is the rescue ship being sent for Ripley by the Weyland-Yutani Corporation.The Alien surprises Ripley and Clemens in the prison infirmary and kills Clemens. It examines Ripley but spares her and retreats. Andrews orders Aaron (Ralph Brown) to take her back to the infirmary, but he is ambushed and killed by the Alien. Ripley rallies the inmates and proposes they pour flammable toxic waste into the ventilation system and ignite it to flush out the Alien. However, the Alien's intervention causes an explosion, and several inmates are killed. With Aaron's help, Ripley scans herself using the escape pod's medical equipment and discovers the embryo of an Alien Queen growing inside her. She also discovers that Weyland-Yutani hopes to turn the Queen embryo and the adult Alien into biological weapons.Deducing that the Alien will not kill her because of the embryo she carries, Ripley begs Dillon to kill her; he agrees only if she helps the inmates kill the adult creature first. They form a plan to lure the creature into the foundry's molding facility, trap it via a series of closing doors, and drown it in molten lead. The bait-and-chase plan results in the death of every prisoner except Morse (Danny Webb) and Dillon. Dillon remains in the mold to distract the Alien, allowing it to tear him apart as Morse pours the molten lead onto them. The Alien is covered in molten metal but escapes the mold; Ripley activates the fire sprinklers, causing the Alien's exoskeleton to cool rapidly and shatter, killing it.The Weyland-Yutani commando team arrives, including a man who looks identical to Bishop who claims he is Bishop's creator (Lance Henriksen). He tries to persuade Ripley to undergo surgery to remove the Queen embryo, which he claims will be destroyed. Ripley refuses and steps back onto a mobile platform, which Morse positions over the furnace. The Weyland-Yutani team shoot Morse in the leg; Aaron strikes the man with a wrench and is shot dead. The commando team begs Ripley to let them have the \"magnificent specimen\". Ripley throws herself into the furnace. The facility is closed and the only surviving inmate, Morse, is led away.",
	"links": [
		"https://www.amazon.com/Alien-3-Sigourney-Weaver/dp/B000QDYQQ0"
	]
}