{
	"title": "Bad Boys II",
	"release_year": "2003",
	"runtime": "147",
	"tags": [
		"Action",
		"Comedy",
		"Crime",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Will Smith",
		"Martin Lawrence",
		"Gabrielle Union",
		"Jordi Mollà",
		"Peter Stormare",
		"Theresa Randle",
		"Joe Pantoliano",
		"Michael Shannon",
		"Jon Seda",
		"Yul Vazquez"
	],
	"staff": [
		"Michael Bay",
		"George Gallo",
		"Marianne Wibberley",
		"Cormac Wibberley",
		"Ron Shelton",
		"Jerry Bruckheimer",
		"Trevor Rabin",
		"Amir Mokri",
		"Roger Barton",
		"Mark Goldblatt",
		"Tom Muldoon",
		"Kerry Barden",
		"Suzanne Crowley",
		"Billy Hopkins",
		"Dominic Watkins"
	],
	"votes": 274967,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTVkM2YxODItOGNlMy00NWExLWI2NTgtODEzMmM5NThiM2E2XkEyXkFqcGc@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "Eight years after the events of the first film, Miami police detectives Marcus Barnett (Martin Lawrence) and Mike Lowrey (Will Smith) are investigating the flow of highly-potent ecstasy into the city. Their surveillance of boats coming in from Cuba leads them to a Ku Klux Klan meeting and drug drop in a swamp. The subsequent raid on the Klan members proves to be a disaster; malfunctioning radios delay back-up, causing a firefight where Mike accidentally shoots Marcus in the buttocks, while the Klan members are revealed to be mere small-time buyers and not the distributors of the ecstasy. The incident leaves Marcus to further question if he still wants to partner with Mike, while Mike frets that Marcus may discover his relationship with Marcus' sister, Syd (Gabrielle Union).Unbeknownst to Mike and Marcus, Syd is an undercover operative with the DEA, as a money laundering agent for Russian gangsters; the Russian gangsters are in fact the distributors of the ecstasy on behalf of neurotic Cuban drug lord Johnny Tapia (Jordi Mollà). During her first assignment in Miami, a violent Haitian gang attempts to hijack the money transport between the Russians and Tapia, putting Syd in danger. Mike and Marcus inadvertently stumble into the action, and an intense fire fight and car chase ensues between the gang members and the Miami Police/DEA, devastating the local area and enraging Police Captain Conrad Howard (Joe Pantoliano). Marcus and Mike learn of Syd's actual work, which makes Marcus unhappy, while Capt. Howard demands they find the supplier of ecstasy.Marcus and Mike go to confront the Haitian gang leader, which results in a firefight and the leader revealing that his information about the transport came from his friend's camcorder. After viewing the footage, Marcus and Mike find out that a local business, the Spanish Palms Mortuary, is possibly being used as a front by Tapia. Disguised as pest terminators, the detectives penetrate Tapia's mansion and discover that Tapia has eliminated his Russian distributors and begun to woo their former associate Syd, who is still undercover with the DEA and has refocused the investigation towards Tapia. The detectives also recover evidence linking Tapia to one of the boats involved in the Klan raid.After pressuring one of the arrested Klansman into making Tapia's boat, the detectives find themselves involved in another firefight, this time while pursuing a morgue van from the docks carrying emptied cadavers. Mike and Marcus decide to infiltrate Tapia's mortuary, where they learn that the drug lord is using dead bodies to smuggle his drugs and money. The mission is nearly sabotaged when the pair are almost discovered, resulting in Marcus accidentally ingesting some of the ecstasy and Mike ordering the disguised officers outside the building to crash an ambulance into it, creating an diversion. After Mike and an intoxicated Marcus obtain a search warrant from Capt. Howard, the mortuary and Tapia's mansion are raided, with the drugs and money being intercepted by the Coast Guard. However, the mansion raid is botched when a vengeful Russian gangster, Alexei (Peter Stormare), violently storms the mansion on his own. Alexei is killed by the police, while Syd is discovered by Tapia and kidnapped to Cuba. With Syd held prisoner in Tapia's compound and guarded by the Cuban military, the drug lord demands the return of his money in two days in exchange for Syd's life.Mike and Marcus, along with their voluntary SWAT team and Syd's DEA co-workers, prepare a military assault to rescue Syd from Tapia's fortress. During the battle, Mike and Marcus extract Syd and escape, pursued by the infuriated Tapia. After a lengthy pursuit, they end up in a minefield outside the U.S. Naval Base at Guantanamo Bay, where Tapia holds Mike at gunpoint. Marcus rescues Mike with a skillful head-shot to Tapia's skull in the middle of the minefield with his last bullet; in a nod to the previous film, Mike exclaims \"That's how you shoot!\". Later, at the Burnett house, Mike has bought Marcus a new pool (replacing a previous pool that had been destroyed in a prior gag), and Marcus finally makes peace with Mike dating Syd and no longer doubts their partnership. Despite the sentiment, Mike's new pool breaks, washing the two into a river, as they sing the \"Bad Boys\" theme song.",
	"links": [
		"https://www.amazon.com/Bad-Boys-II-Martin-Lawrence/dp/B000O15XBG"
	]
}