{
	"title": "Event Horizon",
	"release_year": "1997",
	"runtime": "96",
	"tags": [
		"Horror",
		"Sci-Fi",
		"Thriller"
	],
	"rating": 6.6,
	"actors": [
		"Laurence Fishburne",
		"Sam Neill",
		"Kathleen Quinlan",
		"Joely Richardson",
		"Richard T. Jones",
		"Jack Noseworthy",
		"Jason Isaacs",
		"Sean Pertwee",
		"Peter Marinker",
		"Holley Chant"
	],
	"staff": [
		"Paul W.S. Anderson",
		"Philip Eisner",
		"Jeremy Bolt",
		"Lawrence Gordon",
		"Lloyd Levin",
		"Michael Kamen",
		"Adrian Biddle",
		"Martin Hunter",
		"Joseph Bennett"
	],
	"votes": 200358,
	"cover": "https://m.media-amazon.com/images/M/MV5BM2M4ZTI2MjMtYjVlNy00Y2E3LTgzM2EtNDA0NTUzZmQxZjY3XkEyXkFqcGc@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "In the year 2047, a signal from the star-ship Event Horizon is picked up on Earth. The ship had disappeared without trace beyond Neptune in 2040; her loss was considered the worst space disaster on record. The ship has reappeared in a decaying orbit around the planet Neptune, and the rescue ship Lewis and Clark is dispatched to investigate. The ship's crew is commanded by Capt. Miller (Laurence Fishburne) and carries the Event Horizon's designer, Dr. William Weir (Sam Neill).When the Lewis and Clark arrives, the crew are informed by Dr. Weir that the Event Horizon had actually been built to test a secret, experimental gravity drive. The drive would create an artificial black hole to bridge two points in space to significantly reduce journey time. The ship had been on its initial test flight, intended to reach Proxima Centauri; it subsequently vanished without a trace. Weir plays to the crew the only signal received since the ship's reappearance, spoken by ship's captain, Cpt. Kilpack, which is a series of confusing screams and shouts, embedded in which is the Latin phrase liberate me (\"save me\").Upon approaching the drifting vessel, no definitive trace of human life is found; inconclusive sensor readings lead the Lewis and Clark's crew to enter the Event Horizon to search for survivors. Inside, the crew split up and Medical Tech Peters (Kathleen Quinlan) discovers a frozen human corpse floating on the bridge, with both eyes gouged out. Engineer Justin (Jack Noseworthy) enters the ship's core and sees a black, liquid-like mirror within its drive; it sucks him inside as he touches it and emits a large shock wave, damaging the Lewis and Clark. Rescue Tech Cooper (Richard T. Jones) manages to pull Justin out of the core by his tether, but he is catatonic.With the Lewis and Clark heavily damaged, the remaining crew transfer to the Event Horizon, which only contains 20 hours of usable oxygen. A short time later, Justin emerges from his catatonia and attempts to commit suicide by ejecting himself from an airlock, to escape the memory of what he saw inside the ship's core. Although Justin is rescued by Miller, he is seriously injured.Soon afterwards the rescuers begin to experience hallucinations of their personal fears and regrets. Miller sees the manifestation of a subordinate he was forced to abandon in a fire; Peters sees images of her son Denny (Barclay Wright), with his legs covered in bloody lesions; and widower Dr. Weir sees his wife Claire (Holley Chant), missing her eyes and urging him to join her.\nThe crew discovers that although the ship's drive successfully opened a gateway in space-time, it actually led outside the known universe and into another dimension, described as \"pure chaos, pure evil\". The Event Horizon's reconstructed video log shows the original crew activating the gravity drive and, moments later, engaging in a frenzy of torture, self-mutilation, cannibalism and sodomy. The ship's captain, who has torn out his own eyes, leaves the previously-heard Latin message which has since been found to actually say Liberate Tutame Ex Inferis (\"save yourself from Hell\").It appears that the Event Horizon has returned with a supernatural presence which is using its occupants' personal torments against them, with the aim of compelling them to return to the \"chaos\" dimension. The Lewis and Clark now repaired; Miller decides to destroy the Event Horizon despite the strong objections of Weir. While preparing to evacuate, Peters is led to her death by plummeting down a shaft as a result of being tricked by a manifestation of her son.Weir, having abandoned the crew and arriving at the core, discovers her body. He sees a vision of his wife's suicide and is compelled by her reanimated form to tear out his eyes.\nWeir then uses bombs fitted to the Event Horizon to destroy the Lewis and Clark, which kills its pilot Smith (Sean Pertwee) and causes Cooper, on the ship's hull, to be thrown into space. Weir goes on to kill D.J. (Jason Isaacs) by vivisection, leaving him suspended from the ceiling of the medical facility.Seemingly possessed by the presence on board, Weir threatens Miller and X.O. Starck (Joely Richardson) with a nail gun, saying the ship is \"alive\" and will not allow anyone to leave. He activates the ship's gravity drive, beginning a ten-minute countdown, after which the Event Horizon will return to the chaos dimension. Cooper, having used his space suit's oxygen to propel him back to the ship, causes Weir to shoot the bridge window and be blown into space towards his apparent death. Miller attempts to detonate the explosives installed on the Event Horizon to split the ship in two; after arming all of the explosives and recovering the detonator for them, he is trapped by a burning manifestation of his former comrade and forced to escape to the ship's core.Inside the core, Miller again sees the vision of his comrade, which then changes into a scarred Dr. Weir (eyes restored) who shows Miller scenes of the Lewis and Clark's remaining crew being tortured and mutilated. The two fights, but Miller is eventually able to reach the detonator, which he then triggers, sacrificing himself as the ship explodes. Weir screams denied the surviving crew.The ship explodes at the neck and splits in two. The gravity drive then activates, pulling the rear of the ship into a wormhole. Starck and Cooper, with a comatose Justin, survive in the remaining forward decks and place themselves into stasis. Starck has a nightmare of a mutilated Dr. Weir rescuing her and is awakened in a distraught state by the real rescue team. Cooper restrains Starck, as one of the rescuers calls for a sedative. As the film ends, the automated hatch leading to the stasis chamber seals shut behind the rescuers, implying the supernatural force is inherent to the ship and not dependent on the gravity drive.",
	"links": []
}