{
	"title": "Scent of a Woman",
	"release_year": "1992",
	"runtime": "156",
	"tags": [
		"Drama",
		"amazon"
	],
	"rating": 8.0,
	"actors": [
		"Al Pacino",
		"Chris O'Donnell",
		"James Rebhorn",
		"Gabrielle Anwar",
		"Philip Seymour Hoffman",
		"Richard Venture",
		"Bradley Whitford",
		"Rochelle Oliver",
		"Margaret Eginton",
		"Tom Riis Farrell"
	],
	"staff": [
		"Martin Brest",
		"Giovanni Arpino",
		"Bo Goldman",
		"Ruggero Maccari",
		"Dino Risi",
		"Martin Brest",
		"Thomas Newman",
		"Donald E. Thorin",
		"Harvey Rosenstock",
		"William Steinkamp",
		"Michael Tronick",
		"Ellen Lewis",
		"Angelo P. Graham"
	],
	"votes": 335930,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzc5ODg2NzMtYTQ4MS00MWFiLWI5NWMtNWNkODNmZjE0ZGVjXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "Charlie Simms is a student at an exclusive New England prep school, Baird. Unlike most of his peers, Charlie wasn't born to a wealthy family and attends Baird on scholarship. To pay for a flight home to Oregon for Christmas, Charlie accepts a temporary job over Thanksgiving weekend, looking after retired Army Ranger Lieutenant Colonel Frank Slade, who Charlie discovers to be a cantankerous blind alcoholic. Charlie's first conversation with Frank doesn't go well: Frank berates Charlie for talking too much about his personal life and loudly orders Charlie out of the guest house he lives in on his niece's property. When Charlie talks to Frank's niece, saying that he thinks he blew it with her uncle, she tells him he has to take the job since he's the only person who applied.Charlie and George Willis, Jr., another student at the preparatory school, witness several students setting up a prank for the school's headmaster Mr. Trask. Following the prank, Trask presses Charlie and George to divulge the names of the perpetrators. Trask offers a bribe, a letter of recommendation that would virtually guarantee Charlie's acceptance to Harvard. Charlie continues to remain silent but appears conflicted.Shortly after Charlie arrives at Frank's house, Frank, without the knowledge of his niece, unexpectedly whisks Charlie off on a trip to New York City. Frank has reserved a room at the Waldorf-Astoria and during dinner the upscale Oak Club, Frank glibly states the goals of the trip, which involve enjoying luxurious accommodations in New York before committing suicide. Charlie is taken aback and doesn't know if Frank is serious. The next morning, Charlie awakes to find Frank in his bedroom expertly assembling his Colt service pistol. Charlie is somewhat alarmed and asks Frank to give up the pistol; Frank refuses. Charlie asks him for the bullets and Frank complies.They pay an uninvited visit to Frank's brother's home for Thanksgiving dinner. Frank is an unpleasant surprise for the family, as he deliberately provokes everyone and the night ends in acrimony. During this time the reason behind Frank's blindness is also revealed: Frank's nephew, Randy, tells the story about how Frank used to juggle grenades while drunk. One grenade got away from him and exploded, causing his blindness. Frank seemingly takes Randy's ridicule in stride but when Randy calls Charlie \"Chuckie\", Frank suddenly explodes, grabbing him by the neck, threatening to kill him if he doesn't apologize to Charlie. Frank and Charlie leave, Frank saying goodbye to his brother and telling him he's never been a good person.As they return to New York, Charlie tells Frank about his complications at school. Frank advises Charlie to inform on his classmates and go to Harvard, warning him that George will probably be pressured into revealing the identities of his friends, however, with his influential father (also an alumnus of Baird) behind him, his punishment will likely be light. Later at a restaurant, Fran is aware of Donna; a young woman waiting for her date. Although blind, Frank leads Donna in a spectacular tango (\"Por una Cabeza\") on the dance floor.That night, he hires a female escort recommended to him by their driver, Manny. While Frank enjoys his evening with the escort, Charlie calls the ski resort that George and Harry (the student who planned and carried out the prank) are spending the break at and finds out from George that Trask has elevated his investigation and that George's father has become involved. The phone call makes Charlie more tense than ever.Deeply despondent the next morning, Frank responds to Charlie's suggestion that they test drive a Ferrari. Frank schmoozes the salesman at the dealership into letting them take a Mondial model, with Charlie driving, despite Charlie not having a license. Charlie eventually lets Frank drive the car and Frank begins speeding, terrifying Charlie and attracting the attention of a police officer (Ron Eldard). Frank manages to appease the officer without giving away his blindness and they are ordered to return the car. They leave the car at the Ferrari dealership, Frank more depressed than ever. While they walk back to the Waldorf, Frank deliberately marches out into traffic and collapses on the street. Charlie is able to pick him up and they continue.When they return to the hotel, Frank sends Charlie out on a list of errands. Charlie initially leaves the room but quickly becomes suspicious. Charlie returns to find Frank in his military uniform, preparing to commit suicide with his pistol. Charlie intervenes and attempts to grab Frank's gun. Frank, however, easily overpowers him, threatening to shoot Charlie before himself. They enter a tense argument, however, when Charlie stands up to Frank, the Colonel backs down. Frank has a newfound respect for Charlie's bravery and agrees to take him back to Baird.Manny drives the two back to Baird. Frank gives Charlie the money he owes him in cash and then touches Charlie's face, feeling for the first time how Charlie looks. He also offers Charlie any references he many need in the future and has Manny drive him home.At school, Charlie and George are subjected to a formal inquiry in front of the student body and the student/faculty disciplinary committee. As headmaster Trask finishes his interrogation of George and turns his attention to Charlie, Frank unexpectedly returns to the school, joining Charlie on the auditorium stage for support. George has already divulged the names of the perpetrators, qualifying that his vision wasn't clear. When pressed for more details, George passes the burden to Charlie. Although struggling with his decision, Charlie gives no information, so Trask recommends his expulsion.At this, Frank can't contain his silence any longer and launches into a passionate speech defending Charlie, and calling out the perpetrators for not coming forward, George for his cowardice and selling out his friends, and Trask for his hypocrisy by talking about the school's morals while punishing students for defending their classmates and rewarding snitches. Frank tells them about the bribe and whether or not Charlie's silence is right or wrong, he has shown integrity in his actions and that's what great leaders are made of, and he will make them proud in the future if allowed to remain at Baird. The disciplinary committee decides to place the students named by George on probation, deny George of recognition and commendation for his testimony and excuse Charlie from any punishment and allow him to have no further say in the inquiries, to loud applause from the student body except for George and the perpetrators.As Charlie escorts Frank to his limo, a female political science teacher, Christine Downes, who is part of the disciplinary committee approaches Frank, commending him for his speech. Seeing a spark between them, Charlie tells Ms. Downes that Frank served on President Lyndon Johnson's staff. A romantic prospect is hinted between Frank and Ms. Downes as they part ways.Charlie takes Frank home, where they go their separate ways. The colonel walks towards his house and greets his niece's young children happily as Charlie watches by the limo.",
	"links": [
		"https://www.amazon.com/Pacino-Triple-Film-Collection-Manglehorn/dp/B0D2M9DBK6"
	]
}