{
	"title": "Batman Returns",
	"release_year": "1992",
	"runtime": "126",
	"tags": [
		"Action",
		"Crime",
		"Fantasy",
		"max",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Michael Keaton",
		"Michael Keaton",
		"Danny DeVito",
		"Michelle Pfeiffer",
		"Michelle Pfeiffer",
		"Christopher Walken",
		"Michael Gough",
		"Michael Murphy",
		"Cristi Conaway",
		"Andrew Bryniarski",
		"Pat Hingle",
		"Vincent Schiavelli"
	],
	"staff": [
		"Tim Burton",
		"Bob Kane",
		"Daniel Waters",
		"Sam Hamm",
		"Tim Burton",
		"Denise Di Novi",
		"Danny Elfman",
		"Stefan Czapsky",
		"Bob Badami",
		"Chris Lebenzon",
		"Marion Dougherty",
		"Bo Welch"
	],
	"links": [
		"https://www.max.com/movies/batman-returns/7ebb10fa-4552-405c-a5d2-3cc5b21193c7",
		"https://www.amazon.com/Batman-Returns-Michael-Keaton/dp/B001X0ZKM4"
	],
	"votes": 331716,
	"cover": "https://m.media-amazon.com/images/M/MV5BZTliMDVkYTktZDdlMS00NTAwLWJhNzYtMWIwMDZjN2ViMGFiXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Tucker and Esther Cobblepot, an aristocratic couple, throw their deformed infant child into the sewers, feeling that Gotham's high society would not approve after witnessing their son kill their pet cat. However, a flock of penguins living in the sewers rescue him and raise him. 33 years later, the child becomes the criminal Penguin (Danny Devito). He kidnaps businessman Max Shreck, blackmailing him into helping him become a citizen of Gotham City using evidence of his corporate crimes. Meanwhile, Max finds out his secretary, Selina Kyle, has found out that Max is planning to build a power plant which will drain Gotham City of its electricity. Max pushes her out of a window, ensuring that she will not tell anyone. However, a flock of alley cats lick her corpse, reviving her. She returns home, suffers a mental breakdown and makes a homemade black vinyl catsuit and becomes a costumed vigilante under the name of \"Catwoman\" (Michelle Pfeiffer).Penguin sends one of his costumed henchman to kidnap the mayor's baby while he \"saves\" him, becoming a hero in the eyes of the people. However, billionaire Bruce Wayne (Michael Keaton) is suspicious of the Penguin and finds out that he is the leader of the Red Triangle Circus Gang who commits crimes throughout Gotham. As Batman, Bruce decides to protect Gotham from the gang. After Penguin finds out his parents are dead and his name is Oswald Cobblepot, Max decides to make Penguin the mayor of Gotham City because the current mayor will not approve of Max's power plant. To do this, Penguin has the Red Triangle Circus Gang create a riot, causing the citizens to lose all faith in the mayor, but Batman stops it. During the riot, Catwoman vandalizes Shreck's Department Store to gain revenge on Max. When Batman and Penguin confront each other, she intervenes before the store blows up. Penguin escapes as Catwoman fights Batman. Batman pushes her off a rooftop, but a litter-box on a truck saves her.The next day, Penguin and Catwoman collaborate on a plan to kill Batman. Meanwhile, Bruce and Selina develop a romantic relationship. Penguin and Catwoman kidnap the Ice Princess, an actress chosen to turn on the Gotham City Christmas Tree Lights, framing Batman for it. Batman finds her but Catwoman takes her to a rooftop where Penguin releases a swarm of flying bats which make the Princess retreat backwards, falling off, making her death seem like Batman's fault. Catwoman rejects Penguin's advances, prompting him to make an attempt on her life. Batman enters the Batmobile and finds out that Penguin has control over it, due to a device Penguin's gang installed. Penguin takes it on a devastating rampage but Batman regains control over it, escaping death.Batman, having recorded Penguin's plans during the rampage, plays it during Penguin's election speech, turning the people against him. Enraged, Penguin kidnaps all the first-born sons of Gotham City, including Max Shreck. Batman saves all the babies, forcing Penguin to execute an alternate plan to destroy the entire city with his army of penguins. Batman foils this plan by luring the penguins back to Penguins sewer base, Batman briefly fights with Penguin then pushes him into sewer water. Catwoman tries to kill Max, but Batman stops her and reveals himself as Bruce. Max shoots Batman, knocking him out and Catwoman claims that she has six of her nine lives left although Max shoots her four times, leaving her with two lives. Catwoman kisses Max with an electrical taser between their lips and breaks an electric wire, creating an explosion which kills Max but Batman cannot find Selina's corpse.\nPenguin emerges from the water but chokes on his own blood from internal injuries from the fall and his emperor penguins drag his corpse into the sewer water.Afterwards, Alfred, Bruce's butler, drives Bruce home. Suddenly, Bruce spots Selina's shadow in an alley. He investigates the area, only finding her black cat, Miss Kitty, taking her with him before exchanging Christmas wishes with Alfred. Finally, the Batsignal lights up in the night sky and Catwoman rises up into the foreground and stares at it, confirming that she is alive."
}