{
	"title": "Boogie Nights",
	"release_year": "1997",
	"runtime": "155",
	"tags": [
		"Drama",
		"amazon"
	],
	"rating": 7.9,
	"actors": [
		"Mark Wahlberg",
		"Mark Wahlberg",
		"Julianne Moore",
		"Burt Reynolds",
		"Luis Guzmán",
		"Rico Bueno",
		"John C. Reilly",
		"Nicole Ari Parker",
		"Don Cheadle",
		"Heather Graham",
		"William H. Macy"
	],
	"staff": [
		"Paul Thomas Anderson",
		"Paul Thomas Anderson",
		"Paul Thomas Anderson",
		"Lloyd Levin",
		"John S. Lyons",
		"JoAnne Sellar",
		"Michael Penn",
		"Robert Elswit",
		"Dylan Tichenor",
		"Christine Sheaks",
		"Bob Ziembicki"
	],
	"votes": 285601,
	"cover": "https://m.media-amazon.com/images/M/MV5BOTFmZmE4OTMtNDYxNi00MmZmLThlYjktMmExMzMwY2YzOTFiXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1977, high-school dropout Eddie Adams (Mark Wahlberg) is living with his father and emotionally abusive mother in Torrance, California. He works at a Reseda nightclub owned by Maurice Rodriguez (Luis Guzmán), where he meets porn filmmaker Jack Horner (Burt Reynolds).\nInterested in bringing Eddie into porn, Jack auditions him by watching him have sex with Rollergirl (Heather Graham), a porn starlet who always wears skates. After coming home late & arguing with his mother about his girlfriend (whom she says is a whore & calls Eddie a loser) and sex life, Adams moves in with Horner at his San Fernando Valley home.Adams gives himself the screen name \"Dirk Diggler\" and becomes a star because of his good looks, youthful charisma, and unusually large penis. His success allows him to buy a new house, an extensive wardrobe, and a \"competition orange\" 1977 Chevrolet Corvette. With friend and fellow porn star Reed Rothchild (John C. Reilly), Dirk pitches a series of successful action-themed porn films to Jack and Col James (who finances all of Jack's films). These films are a great hit.\nDirk works and socializes with others from the porn industry, and they live carefree lifestyles in the late 1970s disco era. At a New Year's Eve party at Horner's house marking the year 1980, assistant director Little Bill Thompson (William H. Macy) discovers his wife having sex with another man (In the driveway, surrounded by onlookers). Bill, tired of being repeatedly cuckolded by his wife, shoots them both dead, and kills himself.Dirk and Reed begin using cocaine on a regular basis. The action movies are doing great, and Dirk wins many awards from the Adult films association. Due to his drug use, Dirk finds it increasingly difficult to achieve an erection, falls into violent mood swings, and becomes upset with Johnny Doe, a new leading man Jack has recruited. In 1983, after arguing with Jack (Dirk wanted to shoot a scene, but Jack refused as Dirk was high and hadn't slept for 2 days), Dirk is fired and takes off with Reed to start a music career along with Scotty (Philip Seymour Hoffman), a boom operator who is in love with Dirk (He had tried to kiss Dirk at the new yrs party, but Dirk rebuffed him).\nDirk and Reed record some albums but can't get a record deal as the studio head refuses to give them the tapes until they give him the money for the recordings.Jack rejects business overtures from Floyd Gondolli (Philip Baker Hall), a theater magnate in San Diego and San Francisco, who insists on cutting costs by shooting on videotape because Jack believes that video will diminish the quality of his films (currently they are being shown in theaters as full-length feature films). After his friend and financier, Colonel James (Robert Ridgely), is imprisoned for possession of child pornography, Jack works with Gondolli, becoming disillusioned with the projects he expects him to churn out.\nOne of these projects involves Jack and Rollergirl riding in a limousine, searching for random men for her to have sex with while being taped by a crew. After they pick up a man, he recognizes Rollergirl as a former high-school classmate. After a failed attempt at intercourse, he insults her and Jack. Jack throws him out of the limousine. Jack and Rollergirl both attack the man, leaving him bloodied on the sidewalk. They return to the car and drive away from the scene.in Sep 1983, Leading lady Amber Waves (Julianne Moore) finds herself in a custody battle with her ex-husband. The court determines that she is an unfit mother due to her involvement in the porn industry, prior criminal record, and cocaine addiction.\nBuck Swope (Don Cheadle) marries fellow porn star Jessie St. Vincent (Melora Walters), who becomes pregnant. Buck and Jessie met at the new yr party, when both were feeling ignores as Dirk got all the attention. Because of his past, Buck is disqualified from a bank loan and cannot open his own stereo-equipment store. That night, he finds himself in the middle of a holdup at a donuts shop in which the clerk, the robber, and an armed customer are killed. Buck is the sole survivor and escapes with the money.Having wasted their money on drugs, Dirk and Reed cannot pay a recording studio for demo tapes they believe will enable them to become music stars. Desperate for money, Dirk resorts to prostitution but is assaulted and robbed by three men. Dirk, Reed, and their friend Todd Parker (Thomas Jane) attempt to scam local drug dealer Rahad Jackson (Alfred Molina) by selling him a half-kilo of baking soda disguised as cocaine. Dirk and Reed decide to leave before Rahad's bodyguard inspects it, but Todd attempts to steal additional drugs and money from Rahad. In the ensuing gunfight, Todd shoots Rahad's bodyguard and is killed by Rahad. Dirk and Reed barely escape, and Dirk reconciles with Jack.In 1984, Buck and Jessie give birth to their son, Amber shoots the television commercial for Buck's store opening, Reed performs a magic act at a strip club, Colonel James remains in prison, Maurice opens a night club and Rollergirl takes a GED class. Dirk and Amber prepare to start filming again.",
	"links": [
		"https://www.amazon.com/Boogie-Nights-Mark-Wahlberg/dp/B0030UHT3I"
	]
}