{
	"title": "Scream 2",
	"release_year": "1997",
	"runtime": "120",
	"tags": [
		"Horror",
		"Mystery",
		"max",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Neve Campbell",
		"Courteney Cox",
		"David Arquette",
		"Jada Pinkett Smith",
		"Omar Epps",
		"Paulette Patterson",
		"Rasila Schroeder",
		"Heather Graham",
		"Roger Jackson",
		"Peter Deming"
	],
	"staff": [
		"Wes Craven",
		"Kevin Williamson",
		"Cathy Konrad",
		"Marianne Maddalena",
		"Marco Beltrami",
		"Peter Deming",
		"Patrick Lussier",
		"Lisa Beach",
		"Bob Ziembicki"
	],
	"links": [
		"https://www.max.com/movies/scream-2/a2b94dfc-5fcc-4ea8-85c1-7ebb2db29ee5",
		"https://www.amazon.com/Scream-2-David-Arquette/dp/B0094N2LQU"
	],
	"votes": 213051,
	"cover": "https://m.media-amazon.com/images/M/MV5BODE5YWJkMDMtN2ZiNC00MjI5LTkxYTgtOTkyZjUwMjU0YThiXkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Two Windsor College seniors, Maureen Evans and Phil Stevens, attend a sneak preview of Stab, a film based on the events of the Woodsboro massacre. Briefly exiting the theater to use the bathroom, Phil is killed by the masked killer now known as Ghostface. Ghostface sits beside Maureen in Phil's place and stabs her repeatedly, unnoticed by the raucous crowd, leading her to climb up on stage in a cry for help, which the audience mistakes for a publicity stunt until she falls dead.The news media, including local journalist Debbie Salt, descend on Windsor College where Sidney Prescott is a student alongside her roommate Hallie McDaniel, her new boyfriend Derek Feldman, fellow Woodsboro survivor Randy Meeks and Derek's best friend Mickey Altieri. Two other Woodsboro survivors arrive: police officer Dewey Riley to offer Sidney protection, and reporter Gale Weathers to cover the case. Gale and her new cameraman, Joel Jones, unsuccessfully try to stage a confrontation between Sidney and Cotton Weary, who is attempting to gain fame from his exoneration for the rape and murder of Sidney's mother, Maureen Prescott.That evening, Sidney and Hallie attend a party at the sorority house Delta Lambda Zeta. At Omega Beta Zeta, another nearby sorority house, Ghostface murders student Cici Cooper. After the partygoers leave to witness Cici's crime scene, Ghostface enters Delta Lambda Zeta and attacks Sidney. Ghostface injures Derek but flees when the police arrive. Later, after realizing that Cici is a diminutive for Casey, Gale theorizes that the new Ghostface is targeting students with the same names as the Woodsboro murder victims. Randy theorizes that the killer is likely someone Sidney knows and is patterning the killings after a movie sequel. Soon after, Ghostface calls Gale, Dewey, and Randy while they are together in daylight on the college campus. Despite their attempts to find him, Ghostface ultimately ambushes Randy, pulling him into Joel's media van, where he is murdered. Shortly after, Joel, fearing he will be targeted next, skips town.As night falls over the campus, Dewey and Gale go to a building to review tapes of footage shot by Joel, hoping to spot the killer in the vicinity of the previous crime scenes, but Ghostface attacks them, stabbing Dewey. Two officers drive Sidney and Hallie to a safe house, but Ghostface intercepts the car and murders them. In the ensuing struggle, Ghostface is knocked unconscious, but recovers and kills Hallie. Drawn to music playing in the campus theatre while seeking safety, Sidney finds Derek in the auditorium tied to a cross from an earlier fraternity hazing ritual. Ghostface arrives, revealing himself as Mickey, and shoots Derek, killing him.Mickey reveals he intends to kill Sidney and allow himself to be arrested, so he can blame movie violence for the murders. Debbie arrives, holding Gale at gunpoint, and is revealed to be Mickey's accomplice, whom Sidney recognizes as Nancy Loomis, the mother of Woodsboro killer Billy. Nancy betrays Mickey and shoots him, affirming that she only used Mickey to frame him for their killing spree. Mickey fires his gun before collapsing, wounding Gale, who falls offstage. Nancy reveals she is seeking revenge against Sidney for killing Billy and that she killed Randy in Joel's news van for criticizing Billy. However, Sidney points out the hypocrisy of her motives, considering that Nancy's abandonment fueled her son's psychotic tendencies. The pair fight until Cotton appears and holds them at gunpoint. Nancy attempts to manipulate Cotton into murdering Sidney, reminding him that her testimony got him arrested, but to her shock, he instead chooses to shoot Nancy in exchange for an interview with Sidney and Diane Sawyer. As Sidney, Cotton, and a recovered Gale look at Nancy's body, Mickey suddenly resurfaces but is killed by Gale and Sidney. Sidney then shoots Nancy in the head to ensure she is dead.When the police arrive, Dewey is revealed to still be alive and Gale climbs into the ambulance with him rather than taking the opportunity to report to the returning Joel. Sidney then instructs the press to direct questions to Cotton to remove attention from herself and reward Cotton for helping her."
}