{
	"title": "The Fugitive",
	"release_year": "1993",
	"runtime": "130",
	"tags": [
		"Action",
		"Crime",
		"Drama",
		"amazon"
	],
	"rating": 7.8,
	"actors": [
		"Harrison Ford",
		"Tommy Lee Jones",
		"Sela Ward",
		"Julianne Moore",
		"Joe Pantoliano",
		"Andreas Katsulas",
		"Jeroen Krabbé",
		"Daniel Roebuck",
		"L. Scott Caldwell",
		"Tom Wood"
	],
	"staff": [
		"Andrew Davis",
		"Jeb Stuart",
		"David Twohy",
		"Roy Huggins",
		"Arnold Kopelson",
		"James Newton Howard",
		"Michael Chapman",
		"Don Brochu",
		"David Finfer",
		"Dean Goodhill",
		"Dov Hoenig",
		"Cathy Sandrich Gelfond",
		"Amanda Mackey",
		"J. Dennis Washington"
	],
	"votes": 323976,
	"cover": "https://m.media-amazon.com/images/M/MV5BM2RjMjEwODUtYTE4OC00MzhkLThjMjItZjYyZjk3YzA4YWUxXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "The movie opens with flashes of the Chicago skyline and fight between an unidentified man and Helen Kimble (Sela Ward). In the struggle, Helen is killed when her assailant shoots her with the pistol she and her husband, Dr. Richard Kimble (Harrison Ford), a prominent Chicago vascular surgeon, keep in their bedroom and then crushes part of her head with a heavy piece of decorative stone. The police turn up and find Helen dead on the floor. Forensics is hard at work in the room, documenting the murder scene. A man walks through a room and Richard stands up with scratches on his neck and is escorted out the door. A reporter stands outside, telling the camera what's happened. Kimble climbs into the back of a police car.Richard is shown in an interview room with Detective Kelly (Ron Dean), and flashbacks show what he was doing just hours earlier. Kimble and his wife mingled with donors at a Children's Research Aid Foundation fundraiser. Helen is surrounded by a group of men and Richard \"rescues\" her. They also exchange pleasantries with Richard's best friend and colleague Dr. Charles Nichols (Jeroen Krabbé), who thanks Richard for letting him temporarily borrow his car. While driving home afterwards, Richard gets a call asking him to come into work for an emergency operation, to Helen's disappointment. Nonetheless, she says she'll wait up for him. Her voice echoes in the background as he sits in the interview room, while another policeman walks into the room.The detectives interview Richard and ask him if anything unusual happened, and about the fight with the guy with one arm, as well as who has keys to his house. They ask if he'd seen any suspicious people following him or if he'd gotten any unusual phone calls in recent weeks or months. The detectives discuss the evidence in the observation room. Back in the interrogation room, the policemen ask Richard about his wife's wealth and who the sole beneficiary of his wife's life insurance is, to which Richard says he is. Detective Kelly suspects Richard killed Helen as she was very wealthy and he'll come out well. Richard insists he's innocent and the police keep interrogating him about the appearance of the one-armed thief. Their superior looks over the report and seeing that Richard was the only witness and that his fingerprints were on the pistol used to shoot Helen, they decide to charge him with the murder. Richard becomes more distraught and tells the detectives that he'd fought with Helen's killer and that the man had a mechanical arm. He yells for them to find him.Nonetheless, Richard is arrested and put on trial. He is next shown in court, listening to the opposition's opening statement, while flashing back to the scene of the crime. Detective Kelly is in on the stand, and Richard flashes back to when he entered the house after work. More questioning of another witness. Helen gasps for air as she manages to call 911. The opposing lawyer asks to play Helen's 911 emergency call, previously identified by the police dispatcher. Helen says that there's someone still in her house, trying to kill her. While this is going on, Richard comes up the stairs and the killer hangs up the call. He remembers struggling with the man & tearing away one of his sleeves, revealing a prosthetic arm. Despite his best efforts, Richard is found guilty and remanded to Illinois State Penitentiary, where he'll wait to be put to death via lethal injection.Richard is one of several convicts who are then chained up and put on a bus that will transport them to prison. When they're almost at the prison, one of the other convicts decides to stage a jailbreak by faking a seizure, foaming at the mouth. One of the officers approaches the man and is shanked by the convict with a shiv made by a sharpened toothbrush. The older guard shoots two prisoners with a shotgun. When another prisoner tries to overpower him, an errant blast kills the driver, and the bus goes off the road at a bridge and rolls down the hill, landing on a railroad track. The guard demands that Richard help the injured guard. Richard demands to be released from his shackles in return. The guard throws Richard the keys and he frees his wrists. Another convict, Copeland (Eddie Bo Smith Jr.), grabs the keys and unlocks his own shackles and runs out on Richard when the doctor asks him for help getting the injured man out. It's then that Richard sees the lights and hears a freight train approaching the wreck at speed. He manages to get the remaining survivors off the bus before the train plows into it at speed and derails. Copeland frees Richard and tells him not to follow him. Richard is wounded and needs medical attention, following the riverbank.The county police and the Illinois State Police converge on the scene to begin investigating. They are later joined by a team of US Marshals, comprised of Deputy US Marshal Samuel Gerard (Tommy Lee Jones) and his associates Cosmo Renfro (Joe Pantoliano), Bobby Biggs (Daniel Roebuck), Noah Newman (Tom Wood), Henry (Johnny Lee Davenport) and Erin Poole (L. Scott Caldwell). The local police, headed by Sheriff Rawlins (Nick Searcy), seem to have things under control, and don't see any reason to cede jurisdiction to Gerard until Biggs discovers a set of leg irons that had been used by Richard and don't have anyone attached to them. With Richard unaccounted for, Gerard takes over the scene and orders a massive manhunt and dragnet within a 15 mile radius of the crash scene, encompassing every residence, business, and hospital in the area.By the next morning, Richard comes to a clearing under a bridge and steals a workman's coveralls, and finds his way to a hospital. Meanwhile, at the crash scene, Gerard's marshals have found a blood trail that might belong to Richard, and Gerard orders that Richard's mugshot be faxed to every local hospital in case he seeks treatment. There's a moment of chaos as the moment is interrupted when rescue workers extricate the guard who was shanked at the start of the jailbreak, and who has been trapped under the wreckage all night.Richard gets to the hospital and steals some medical supplies to stitch his own wound. A state trooper is sent to the hospital and alerts the medical staff of Richard's identity while Richard stitches his wound up and steals an elderly patient's clothes. He has to hide behind the bathroom door as a nurse comes by on her rounds to tend to the patient. Once the nurse leaves, Richard shaves his beard, combs his hair, and steals some of the patient's breakfast. He passes the same state trooper in the hallway, who quizzes Richard about the escaped prisoner's whereabouts. Richard is able to shrug off any \"resemblance\" he has to the escaped man the trooper describes by saying \"Every time I look in the mirror, pal, except for the beard of course.\"As Richard is leaving the hospital, an ambulance arrives with the wounded guard from the train wreck. The guard, while half-conscious, recognizes Richard as he helps the paramedics unload the guard from the ambulance. Once the paramedics are gone, Richard steals the ambulance. It isn't long before this information makes it back to Gerard, and the Marshals set off in pursuit of Richard.Richard abandons the ambulance at a dam, and escapes into a nearby drainage grating. In the tunnels, Gerard separates himself from his team and slips while climbing down another tunnel. He loses his pistol which Richard finds. While pointing the pistol at Gerard, Richard tells him he didn't kill his wife. Gerard's curt response is \"I don't care!\" Richard runs off while Gerard pulls a spare pistol and continues after him. At a high drainage port, Richard is trapped by Gerard who orders him to drop the pistol and surrender. Richard jumps, falling hundreds of feet into the river below. Gerard is found by his team, who immediately believe Richard didn't survive the fall. Gerard refuses to believe it, and tells them they have to find the body.Renfro asks if they can go home, but Gerard is so hell-bent on catching Richard that he refuses to believe Richard is dead in the absence of a body. He orders dive teams dispatched to search the river for him, ignoring the protests of another trooper who says the odds of him surviving the fall are unlikely. The police search the woods with hounds, but come up with nothing.Richard runs through the woods, but stops out of breath and collapses. He hides under some leaves and dreams about Helen making love to him, his trying to save her life, as well as his lawyer Walter Gutherie, and the killer. He wakes up some hours later, and after wandering aimlessly for some time, runs into a good Samaritan who sees him walking along the side of a road and picks him up.Back in Chicago, Gerard and his team get a tip that they've got \"him\" shacked up with a woman in Whiting, Indiana who \"left work tonight and took him home.\" The next morning, they head out to Whiting. Gerard and Newman pretend to be drunk passers-by while Biggs and Henry pose as garbage truck drivers, Poole poses as a homeless woman, and Renfro poses as a plumber. As they prepare to break down the door, they put on patches identifying them as US Marshals and raid the house, which as it turns out isn't where Richard is hiding, but rather Copeland, the other survivor from the train wreck. As the Marshals sweep the house, Newman is taken hostage by Copeland. Gerard gets the drop on Copeland and shoots him, but in such close quarters, it ends up temporarily deafening Newman.Richard makes it back to Chicago, where he tries to get in touch with his lawyer. Gutherie asks Richard of his whereabouts, telling him that he can't harbor a criminal and he should turn himself in. Richard lies and tells Gutherie that he's in St. Louis, knowing his call is being traced by the Marshals, who have a tap on Richard's associates' phones, and despite Richard's attempts at misdirection, they're still able to figure out he's back in Chicago when they recognize the sound of an 'L' train in the background, the sound of a bell on the Wells Street Bridge and an 'L' announcement of \"Next Stop: Merchandise Mart.\"In desperation, Richard decides to reach out to Dr. Nichols as he exits the North Bank Club and gets back into his car. Nichols gives some money to Richard, but is forced to drive off when a cop orders him to keep moving as the traffic light he stopped at is now green.Gerard and his colleagues discuss why Richard may have killed his wife, and pay a visit to the Chicago Police Department detectives who conducted the original investigation. Gerard is skeptical of the detectives' claims that Richard killed his wife for the money, pointing out that he already was making a ton of money as one of the top surgeons in the city, but detective Kelly insists that Helen \"was more rich.\"Gerard decides to have Richard's friends and coworkers questioned as a precaution. First up is Nichols, who openly admits to Richard's visit that morning, but when asked as to where Richard may be hiding, claims \"If you want help, gentlemen, you've come to the wrong man; Richard is innocent. You'll never find him; he's too smart.\" Next up is Dr. Kathy Wahlund (Jane Lynch), who starts off by proclaiming her belief that Richard'is innocent and says that she'd help Richard if he came to her, but that's not his style.While this happens, Richard rents a basement apartment from an old Polish woman (Monika Chabrowski). That night, he goes to the Cook County Hospital, and stealing the ID tags of a maintenance worker named Desmondo Jose Ruiz, finds his way to the prosthetics department. Richard reads a medical report on a man who has half of his arm missing and starts doing research. He takes home a book called \"Atlas of Limb Prosthetics: Surgical, Prosthetic, and Rehabilitation Principles\" by the American Academy of Orthopedics.That night, Richard has more nightmares of Helen's death and dreams of the scene of the crime. Unlike other nightmares, he tries to focus more on what he remembers of the prosthetic limb, hoping to find clues to narrow down the man in question. Unfortunately for Richard, it turns out that the Land Lady's son (Lonnie Sima) is a drug dealer, and this only becomes clear to him when he's rousted from his nightmare by the sounds of the police arriving to arrest the dealer and his accomplice. Even worse, when they question him at the station, the dealer snitches on Richard in hopes of gaining leniency, and this information is passed on to Gerard.Richard returns to the hospital and uses his janitor disguise to break into the prosthetics department and access the database. Recalling what he remembers about the prosthetic, he's able to narrow down his suspects list to five names. Things get hectic as the hospital suddenly receives a major influx of patients from a bus crash, including several children. In the chaos, Richard has to be asked to help move patients to different operating rooms. He is assigned to a boy who is having breathing difficulties and examines his chart, which doesn't go unnoticed by Dr. Anne Eastman (Julianne Moore), the resident ER doctor. Richard had noticed the boy being misdiagnosed, and while on the staff elevator, he corrects the boy's diagnosis on the forms and takes him to a different ward than assigned so that he can undergo a life-saving operation.Richard is quickly found out by Dr. Eastman and is forced to flee when she confronts him and takes his badge. Gerard and his Marshals show up shortly thereafter, just as Richard is leaving out a back door. Learning from Dr. Eastman that Richard's last-minute decision saved the Boy's life, Renfro expresses disbelief that Richard would hang around a hospital where lots of cops are stationed. The conversation is interrupted when a man with half an arm squeezes past them and makes his way to the prosthetics clinic. This gives Gerard an idea: Richard is probably looking for the one-armed man using hospital records.Richard and Gerard both begin working through the lists of patients with prosthetic arms and criminal records. Kimble's search is a bit narrower since he's only got a few names, vs. Gerard's team who have 47 hits. Richard's first two names, Tom Ryba and Matthew Zelick, turn out to be dead ends, with Zelick having recently died. The third one, Clive Driscoll (Maurice Person), seems more promising, as he has been arrested for armed robbery. Richard goes to the jail to find Driscoll, at the same time Gerard goes there. Upon seeing Driscoll, Richard realizes he's not the individual responsible for Helen's death as Driscoll is black, while Helen's killer is white. Richard apologizes to Driscoll and leaves.As Richard leaves, he's recognized by a guard, and moments later, he's spotted by Gerard while escaping down another staircase. Gerard tries to give chase, but Richard temporarily stalls him by tricking some police officers into restraining him. The Marshals attempt to give chase as Richard flees into the St. Patrick's Day parade, but Richard manages to escape.Gerard and the Chicago police detectives are forced to hold a press conference. Gerard has no affirmative answers for the reporters, while Detective Kelly's response to questions that allege Richard is innocent is that he's guilty because he was convicted by the court of law.Richard obtains some new clothes and continues his suspect search. His search leads him to the fourth man named Frederick Sykes (Andreas Katsulas). Narrowly avoiding a police officer parked outside Sykes' building, Richard breaks into Sykes' apartment. Searching through his possessions, Kimble finds photographs of Sykes, and the prosthetic arm he wears, and instantly recognizes Sykes as the real killer, and remembers damaging the arm when he threw Sykes down the stairs during the fight at his house. What's more alarming to Richard is that in some of the pictures, Sykes is posing with Alec Lentz (David Darlow), the doctor that Nichols had introduced him to at the benefit.Richard goes through Sykes' medical file and finds multiple forms from Devlin MacGregor Pharmaceuticals, who were sponsoring the benefit, as well as documents pertaining to a cruise in the Caribbean and information on Provaisc, the company's new medication. He also remembers a discussion about the new drug that he had during the surgery.Knowing he's got his man, Richard makes a call to Gerard at the Marshals' office and leaves the line off the hook so that the Marshals will trace the call and apartment. They raid the apartment and find Richard's fingerprints, but no sign of Richard. Sykes denies knowing Richard when Gerard questions him about it, and provides an alibi for the night of the murder. Gerard and Renfro quickly surmise that Sykes is lying about not knowing Kimble, and Gerard tasks Newman with identifying the man who's with Sykes in the photograph.Richard gets in touch with Nichols about what he found, and his conclusion that his wife's death wasn't the result of a burglary gone bad, but a conspiracy by Devlin MacGregor and Dr. Lentz to kill him for raising questions about provasic. To Richard's surprise, he learns from Nichols that Lentz is dead, having died in a car accident over the summer. Nonetheless, Richard refuses to give up and gets in contact with some other colleagues of his.Gerard and his team question Nichols again, this time about Richard and Sykes. Nichols accuses Gerard of getting pretty desperate. Curiously, he denies knowing Lentz when shown the picture of Lentz posing with Sykes. When they blow up the picture at their offices, they find a label on Lentz's shirt labeled \"Chicago Memorial Hospital\", to which Devlin MacGregor Pharmacuticals is a successful benefactor.Richard approaches an old hospital contact of his named Bones Roosevelt (John M. Watson Sr.), who gets him a liver sample that originated from a patient on the RDU-90 drug study. He also gets another sample (the last one) from January 21st, and Richard promises to get everything back to Roosevelt while putting it into an envelope. He takes the sample to Dr. Wahlund for analysis. She embraces him and agrees to analyze the samples with him through a microscope. They're not the same tissue, yet they came from the same, very healthy liver. Analyzing the reports, they also realize that Dr. Lentz died on August 21st, and half of the samples that he approved were signed for the day of his death. Richard realizes that someone else with access must have been manipulating them. Getting a pretty good idea who might have been responsible, he leaves to \"visit a friend\".Meanwhile, Sykes gets a call from his employer, telling him to deal with Richard. Since the police are sitting on his residence, he can't get away unnoticed, so his boss calls the fire department. The confusion caused by the fire department arriving distracts the cops and allows Sykes to slip out, unnoticed, carrying his gun.Newman and Biggs identify Lentz, and learn about his death. They visit Roosevelt at Chicago Memorial Hospital to question him, at the same time that Sykes goes there. Roosevelt denies having been in contact with Richard, and while the questioning is going on, Sykes hides from them in the shadows of the lab.Gerard is getting a headache as Newman calls to note that Roosevelt had no information on where Richard was going, beyond supplying him tissue samples for a drug study. Newman adds, over the phone, that the release was approved by Dr. Nichols, who was Lentz's boss. Renfro speculates that Dr. Nichols was covering for Richard, and Gerard orders the CPD to go there instantly to sweep the place, while also sending men to apprehend Dr. Nichols.Sykes contacts Nichols from a payphone to report his failure to find Richard at the hospital but drops the call when he spots Richard walking nearby.Gerard pins the picture of Sykes and Lentz to a board while Renfro reads off an article about Lentz and his accident. It's then that Gerard gets a lead when Marshal Stevens (Mike Bacarella) cross-checks Sykes' telephone records. He's made no calls to Richard, but upon cross-checking Richard's phone records, it turns out that someone called Sykes on the night of Helen's murder from Richard's car phone at 7:30 PM, when Richard was still at the party with Helen. Gerard double-checks Richard's arrest records and cross-checks the call. He's then notified by Poole that Sykes has managed to evade police and is likely looking for Richard.Richard boards an 'L' to head to a presentation that Nichols is presiding over at a nearby hotel. As he nears his destination, Sykes enters from an adjoining car and draws his gun on him. His attempt to eliminate Richard is interrupted when a transit cop appears and tries to draw on Richard. Sykes kills the cop, at which point Richard pulls the emergency brake and fights Sykes, overpowering him and knocking him out. He handcuffs Sykes to one of the hand-railings in the car and takes his and the officer's guns, evading police as they arrive in response to an \"officer down\" call.Richard empties the bullets out of the guns and discards them in a mailbox. He then goes to the Hilton Tower Hotel, where Nichols is giving a presentation. Richard interrupts Nichols' speech, accusing him of falsifying medical research, orchestrating Helen's murder and most likely killed Lentz. They fight on the hotel roof before falling through a skylight into a laundry room. Having arrived on the scene, Gerard calls out to Richard that he knows about Nichols' conspiracy. Nichols knocks out Renfro with an I-beam, takes his gun, and attempts to shoot Gerard. Richard attacks Nichols from behind with a pipe, knocking him unconscious and saving Gerard's life. Richard surrenders to Gerard, who escorts him out of the hotel. Sykes and Nichols are arrested, while Renfro is taken to a hospital for medical treatment. Richard is driven from the crime scene with Gerard, who now knows he is innocent and assures him he will be exonerated.",
	"links": [
		"https://www.amazon.com/Fugitive-Harrison-Ford/dp/B001EBYM8A"
	]
}