{
	"title": "Chicken Run",
	"release_year": "2000",
	"runtime": "84",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Mel Gibson",
		"Julia Sawalha",
		"Phil Daniels",
		"Lynn Ferguson",
		"Tony Haygarth",
		"Jane Horrocks",
		"Miranda Richardson",
		"Timothy Spall",
		"Imelda Staunton",
		"Benjamin Whitrow"
	],
	"staff": [
		"Peter Lord",
		"Nick Park",
		"Peter Lord",
		"Nick Park",
		"Karey Kirkpatrick",
		"Mark Burton",
		"Peter Lord",
		"Nick Park",
		"David Sproxton",
		"Harry Gregson-Williams",
		"John Powell",
		"Simon Jacobs",
		"Andy MacCormack",
		"Tristan Oliver",
		"Frank Passingham",
		"Robert Francis",
		"Tamsin Parry",
		"Mark Solomon",
		"Patsy Pollock",
		"Phil Lewis"
	],
	"votes": 214431,
	"cover": "https://m.media-amazon.com/images/M/MV5BNTc3YTRlMWMtMWIxMC00Njk2LTg0MjktNWVjNTUzOTViZmNhXkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "The Tweedys, a middle-aged couple, run their chicken farm in Yorkshire, England. Mrs. Tweedy serves as the brains and temper, while Mr. Tweedy is rather slow but handles the manual work. The coop is run in the style of a World War II POW camp, with the chickens accountable for the number of eggs they lay daily. One chicken, Ginger, has attempted numerous plans to flee the coop, aided by contraband smuggled into the coop by two rats, Nick and Fetcher, but is always caught by Mr. Tweedy and his dogs, and is thrown into the solitary confinement numerous times.Meanwhile, Mrs. Tweedy realizes that her farm is failing, and reads a catalog on an ambiguous method of increasing profits at her farm. Ginger, realizing something is wrong, attempts to convince the other hens to speed up their efforts to escape. However, she soon comes to the conclusion that the only escape route is to go over the fence, something chickens cannot do. Later the same night, as a depressed Ginger sits outside, a Rhode Island Red rooster seemingly flies over the fence and accidentally crashes into the coop.The hens fawn over the new arrival, who introduces himself as Rocky, and keep him hidden from the Tweedys, except for Ginger, who is initially suspicious, til she finds the first half of a poster with Rocky on it. Showing it to the other hens and explaining how he came in, she claims that he can fly, and attempts to convince Rocky to help her and the other hens escape by teaching them how to fly. However, Rocky's wing was injured, and he cannot show them immediately. Instead, Rocky puts them through a set of exercises that seem to have no purpose while assuring them that all the chickens are making progress.Meanwhile, a large machine arrives; Mr. Tweedy begins assembling it. At the same time, Mrs. Tweedy orders food rations doubled. Ginger unwisely proclaims that her intent is to fatten them up for something, causing a panic. However, the machine is now complete, and Mr. Tweedy kidnaps Ginger for its first test. Rocky follows Ginger into the machine and rescues her, sabotaging the machine and giving them more time to work on their escape. Fowler, an older rooster, gives Rocky his respect for rescuing Ginger and his old Royal Air Force (RAF) badge in tribute. Rocky decides to flee the farm the next day, leaving behind Fowler's medal and the second half of the poster, showing that he was a stunt rooster, only \"flying\" by being shot out of a cannon.This revelation outrages the other chickens, and a fight soon breaks out as morale falls. When Fowler arrives to restore order, he begins talking of his days in the RAF, leading Ginger to realize that she and the other chickens can build a plane made from Fowler's pictures and personal recollections. The chickens race against time to assemble their plane as Mr. Tweedy works to repair the pie machine.The chickens finally finish their plane just as Mr. Tweedy completes the repairs of the pie machine and enters the coop to grab all the chickens. The chickens launch an open revolt, tying up and gagging Mr. Tweedy and readying the \"crate\". As the chickens start to take off, Mr. Tweedy gets free and knocks down the ramp. Ginger jumps down while Fowler turns the plane around, knocking Mr. Tweedy unconscious. As Ginger struggles to lift the ramp, Mrs. Tweedy arrives with an ax and attacks Ginger.However, Rocky, having had a change of heart, flies over the fence and hits Mrs. Tweedy in her face aboard a tricycle. Rocky and Ginger grab onto a string of lights caught on the plane's landing gear; Mrs. Tweedy awakens, and grabs onto the lights, weighing down the crate. Ginger heads down the string to cut it, but loses the scissors. Realizing the only way to cut the lights, Ginger tricks Mrs. Tweedy by using the hatchet to sever the string. Mrs. Tweedy falls, crashing into the pie machine and plugging her into the safety valve. This causes the machine to explode, destroying the barn and covering most of the farm with gravy.The film ends as the chickens find an idyllic setting in a bird sanctuary, where they can live in comfort and raise their new chicks. Rocky and Ginger, having fallen in love with each other, become a couple. Meanwhile, Nick and Fetcher discuss their plans of starting their own chicken farm, so they can have all the eggs they could eat. Ultimately, though, they end up arguing with each other over whether the chicken or the egg came first.",
	"links": [
		"https://www.amazon.com/Chicken-Run-Peter-Lord/dp/B079J4S2VC"
	]
}