{
	"title": "The Rock",
	"release_year": "1996",
	"runtime": "136",
	"tags": [
		"Action",
		"Adventure",
		"Thriller",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Sean Connery",
		"Nicolas Cage",
		"Ed Harris",
		"John Spencer",
		"David Morse",
		"William Forsythe",
		"Michael Biehn",
		"Vanessa Marcil",
		"John C. McGinley",
		"Gregory Sporleder"
	],
	"staff": [
		"Michael Bay",
		"David Weisberg",
		"Douglas Cook",
		"Mark Rosner",
		"Jerry Bruckheimer",
		"Don Simpson",
		"Nick Glennie-Smith",
		"Hans Zimmer",
		"John Schwartzman",
		"Richard Francis-Bruce",
		"Billy Hopkins",
		"Heidi Levitt",
		"Michael White"
	],
	"votes": 362484,
	"cover": "https://m.media-amazon.com/images/M/MV5BMDhkYjRiZWEtZTE0Ny00ZjA1LThmNjgtM2UyYTQzODA4MjdhXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Rogue Force Recon Marines led by heroic Brigadier General Francis Hummel (Ed Harris) seizes a stockpile of rockets armed with VX gas, a highly toxic chemical weapon, from a Naval Weapons Depot.\nHummel and his men including second-in-command Major Tom Baxter (David Morse) then seize Alcatraz Island and take 81 tourists hostage, placing them in the prison cells, then threatening the FBI and Pentagon with launching the VX rockets against the population of San Francisco, unless the government pays ransom of $100 million from a military slush fund, which he will distribute to his men and the families of Recon Marines who died on covert missions under his command, but whose deaths were not compensated.The Pentagon and FBI develop a plan to retake the island with an elite Navy SEAL team led by Commander Anderson (Michael Biehn), enlisting chemical weapons expert Stanley Goodspeed (Nicolas Cage) to help remove the VX and disarm the rockets. Goodspeed is not a field agent, but has no choice in the matter as he is the only expert available.\nIn need of reliable first-hand knowledge of the physical layout of Alcatraz, FBI Director Womack (John Spencer) releases federal prisoner John Mason (Sean Connery), the only former inmate of Alcatraz to ever successfully escape. Mason is bribed with a pardon to cooperate with the FBI, but in reality, Womack has no intention of keeping the promise.\nMason escapes to make contact with his estranged daughter Jade Angelou (Claire Forlani), Goodspeed and the FBI catch up with him.With Mason the team infiltrates Alcatraz. But the entire prison has sensors installed by Hummel's team and are quickly discovered. They confronted by Hummel's men & only Mason & Goodspeed escape. Goodspeed wants to finish the mission and attempts to strong-arm Mason into helping. Mason, seeing his chance to escape custody, disarms Goodspeed. Mason changes his mind about assisting Goodspeed for the safety of his daughter.Mason and Goodspeed eliminate several teams of Marines and disable twelve of the fifteen rockets by removing their guidance chips.FBI prepares strike fighters with Plasma to destroy the entire island along with the gas. Mason tells Goodspeed that as a British agent he stole a microfilm containing serious secrets about U.S. and other world leaders and events.\nThe information came from the personal files of former FBI Director J. Edgar Hoover. Mason was imprisoned for 33 years when he refused to divulge the location of the microfilm.Hummel threatens to execute a hostage if they do not surrender and return the chips; Mason destroys them before submitting to Hummel to try reasoning with him and stall for time. Goodspeed disables another rocket but then gets captured.\nGoodspeed is rescued by Mason. As the deadline passes, Hummel launches but then destroys the warhead at last minute. When confronted by Captains Darrow (Tony Todd) and Frye (Gregory Sporleder), Hummel explains the rocket threat was an elaborate bluff, as he had never intended to harm innocent civilians. He declares the mission over and orders the Marines to leave Alcatraz with some hostages and the remaining rocket to cover their retreat while he assumes the blame.\nHis men mutiny saying they expect to be paid for their trouble.A firefight ensues; Baxter is killed defending Hummel, who is mortally wounded. The general manages to tell Goodspeed where the last rocket is before dying.\nAs Goodspeed retrieves the VX globule, he is attacked by one of Hummels men. Goodspeed breaks the globule in the attacker's mouth, killing him instantly. He then injects his own heart with a vaccine to protect himself from death. Though Goodspeed signals that the threat is over, one jet accidentally drops a bomb, and the blast throws Goodspeed into the bay, and Mason rescues him.\nGoodspeed says that Mason was killed in the attack.The film ends with Goodspeed running from a church in Ft. Walton, Kansas, as Carla, his pregnant bride, urges him to hurry and get in the car so they can get away. Goodspeed has in his hand a canister containing microfilm. Mason had told him where to find it. He looks at the microfilm and asks Carla if she'd like to know who really shot JFK.",
	"links": [
		"https://www.amazon.com/Rock-Sean-Connery/dp/B004Q8LDL2"
	]
}