{
	"title": "Gone in Sixty Seconds",
	"release_year": "2000",
	"runtime": "118",
	"tags": [
		"Action",
		"Crime",
		"Thriller",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Nicolas Cage",
		"Angelina Jolie",
		"Giovanni Ribisi",
		"T.J. Cross",
		"William Lee Scott",
		"Scott Caan",
		"James Duval",
		"Will Patton",
		"Delroy Lindo",
		"Timothy Olyphant"
	],
	"staff": [
		"Dominic Sena",
		"H.B. Halicki",
		"Scott Rosenberg",
		"Jerry Bruckheimer",
		"Mike Stenson",
		"Trevor Rabin",
		"Paul Cameron",
		"Roger Barton",
		"Chris Lebenzon",
		"Tom Muldoon",
		"Victoria Thomas",
		"Jeff Mann"
	],
	"votes": 298012,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTIwMzExNDEwN15BMl5BanBnXkFtZTYwODMxMzg2._V1_QL75_UY281_CR1,0,190,281_.jpg",
	"description": "Giovanni Ribisi, along with 2 other men, are about to steal a car under orders from Calitri (Christopher Eccleston). The goal is to steal 50 top-of-the-line cars to fill an order from an international auto theft ring. The intended car is a Porsche, still in a showroom. Ribisi tells the 2 men that he's going to get his tools to steal the car. He opens his trunk, takes out a brick and throws it through the glass door of the car dealership. They steal the car, driving it through the glass wall of the dealership. The police track the car back to the gang's warehouse. Everyone escapes but the police impound all the cars already stolen including 3 Mercedes.Kip Raines (Nicolas Cage) is a former car thief who is now running a rundown go-kart track. One of his old gangs shows up and tells him that Calitri has his brother Ribisi and he's in serious trouble. They go to Long Beach and to Calitri's headquarters in a wrecking yard. The brother is handcuffed to the steering wheel of a car in a crusher. Calitri tells Cage that he has 3 days to steal 50 cars, or his brother dies. Cage agrees.Day 1, they pick their team which includes Robert Duvall, Angelina Jolie, and Cage's brother Ribisi who was released from the half-crushed car. Memphis (Robert Duvall) was Cage's old car-stealing mentor.\nDay 2, they pick out the cars to steal.\nDay 3, they steal the cars.The police detective (Delroy Lindo) knows how the original 3 Mercedes were stolen. The thieves had gotten special keys from the dealer, so the police watch the dealership. When one of Cage's group goes to get more keys, the police start following him.The theft of the cars is going smoothly until Cage is about to steal one of the Mercedes and notices the police watching. He notifies the rest of his team to walk away from the Mercedes.\nHe still needs these cars to fill his order. He then realizes that he still has the original keys from the first attempt. He decides to steal the 3 Mercedes from the police impound lot.They've now got 49 cars and need just one more. The last car is a 1967 Mustang Shelby GT. This has always been a problem car for Cage since he's never had a successful theft of this type of car. He starts the car but when he starts to pull out of the lot, the police show up. A huge chase begins lasting about 15 minutes ending with Cage stopped in a giant traffic jam on a bridge. As the police are about to capture him, Cage notices a truck used for carrying autos with its ramp down. Cage floors it and using the ramp, jumps over all the cars stuck in traffic, escaping from the police.He gets the car to Calitri 12 minutes late. Calitri toys with Cage saying he'll let his brother live but has really made up his mind to kill Cage. As his henchman are about to kill Cage, his brother shows up and knocks off the henchman. Delroy shows up and he, Cage, and Calitri have a gunfight inside the warehouse.Calitri has Delroy at gunpoint and is about to shoot him when Cage runs and throws himself against Calitri, knocking Calitri off the catwalk to his death.\nDelroy was there to arrest Cage for auto theft but let's Cage go for saving his life. Cage tells him where the other 49 stolen cars are.The last scene is Cage and his gang having a barbecue at Duvall's shop, and they give Cage a present. It is a 1967 Mustang Shelby that can be restored. It ends with Cage and Jolie driving off in it.",
	"links": [
		"https://www.amazon.com/Gone-Sixty-Seconds-Nicolas-Cage/dp/B003QSJVTY"
	]
}