{
	"title": "Demolition Man",
	"release_year": "1993",
	"runtime": "115",
	"tags": [
		"Action",
		"Sci-Fi",
		"Thriller",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Sylvester Stallone",
		"Wesley Snipes",
		"Sandra Bullock",
		"Nigel Hawthorne",
		"Benjamin Bratt",
		"Bob Gunton",
		"Glenn Shadix",
		"Denis Leary",
		"Grand L. Bush",
		"Pat Skipper"
	],
	"staff": [
		"Marco Brambilla",
		"Peter M. Lenkov",
		"Robert Reneau",
		"Daniel Waters",
		"Howard G. Kazanjian",
		"Michael Levy",
		"Joel Silver",
		"Elliot Goldenthal",
		"Alex Thomson",
		"Stuart Baird",
		"Ferne Cassel",
		"Joy Todd",
		"David L. Snyder"
	],
	"votes": 196868,
	"cover": "https://m.media-amazon.com/images/M/MV5BNWY3ZThmN2QtMzVkNS00MjczLTllNDQtOGEwN2M0ZTFkMWMzXkEyXkFqcGc@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "In 1996, LAPD Sgt. John Spartan (Sylvester Stallone) leads a raid to rescue a busload of hostages taken by the psychopathic criminal Simon Phoenix (Wesley Snipes). Spartan is nicknamed \"The Demolition Man\" for the large amounts of collateral damage he often causes in apprehending suspects.\nAfter a scan of the area shows no sign of the hostages' presence, Spartan enters Phoenix's stronghold and captures him, but Phoenix sets off explosive gasoline to destroy the building. The hostages' bodies are found in the rubble, leading the LAPD to arrest Spartan as well. Both men are sentenced to lengthy terms in \"CryoPrison,\" where they are kept in cryogenic storage and exposed to subconscious rehabilitation techniques.In 2032, Phoenix is thawed for a parole hearing, but he escapes from the Cryo-Prison by saying a secret password, without knowing how he had learned it. He subsequently murders his guards and the warden, making his way into the city where he easily overpowers and kills several police officers who have never had to deal with violent crime.\nBy this time, the Los Angeles, San Diego, and Santa Barbara regions have merged into the pacifist utopia of San Angeles, under the guidance of Dr. Raymond Cocteau (Nigel Hawthorne).\nAll of humanity's vices have been outlawed, and the police have become incapable of dealing with criminals such as Phoenix. However, Lt. Lenina Huxley (Sandra Bullock) learns about Spartan's career from a fellow officer. Huxley persuades her superiors to parole Spartan and reinstate him to active duty. Spartan finds life in San Angeles to be sterile and oppressive, since all types of behavior deemed immoral or unhealthy, such as sports, alcohol, swearing, eating meat, and having sex have been declared illegal.Spartan has trouble adapting to life in this peaceful setting, while most of Huxley's fellow officers especially Head Chief George Earle (Bob Gunton), find him brutish and uncivilized. Phoenix breaks into a museum's weapon exhibit to arm himself. To Spartan's surprise, Phoenix is even deadlier than before. Phoenix escapes and holds Cocteau at gunpoint, but is unable to kill him, as Cocteau had implanted a command in his rehabilitation program to prevent him from doing so.Cocteau instead orders Phoenix to kill Edgar Friendly (Denis Leary), the leader of a resistance group called the Scraps who refuse to conform to Cocteau's moral ideals and who live in the underground ruins of old Los Angeles.\nSpartan first encounters the Scraps when they raid a dinner party given by Cocteau.Spartan and Huxley witness this exchange on security cameras and review the Cryo-Prison records. They discover that Phoenix's rehabilitation program was tailored by Cocteau to make him even more dangerous than he was in 1996, including martial arts, computer hacking, knowledge of torture techniques, and murderous impulses; by contrast, Spartan's program taught him to knit and sew.\nSpartan deduces that Cocteau was training Phoenix with the goal of eliminating Friendly and go to the ruins to meet with Friendly and warn him. Meanwhile Phoenix meets with Cocteau, realizing what he has done, and has him release other prisoners to assist him.During a car chase through San Angeles, Phoenix admits to Spartan that the hostages he took in 1996 were already dead before the building exploded, so Spartan spent 36 years in prison for a crime he never committed. Phoenix escapes and Spartan arms himself with help from the Scraps as they emerge in force to get food. Realizing that he cannot kill Cocteau himself because of his rehabilitation, Phoenix instead has one of his men do it and begins thawing the CryoPrison's most dangerous convicts. Spartan enters the facility and fights Phoenix, eventually freezing him solid. He escapes just before the machinery overloads and explodes, destroying the prison.With Cocteau dead and the prison destroyed, the police and Scraps find themselves at odds over how to run their society. The police fear that the loss of Cocteau and the Cryo-Prison will end society as they know it, but Spartan suggests that they and the Scraps cooperate to combine the best aspects of order and personal freedom. He kisses Huxley and they leave together.",
	"links": [
		"https://www.amazon.com/Demolition-Man-Sylvester-Stallone/dp/B001AIY58O"
	]
}