{
	"title": "Scream",
	"release_year": "1996",
	"runtime": "111",
	"tags": [
		"Horror",
		"Mystery",
		"max",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Neve Campbell",
		"Courteney Cox",
		"David Arquette",
		"Skeet Ulrich",
		"Drew Barrymore",
		"Roger Jackson",
		"Kevin Patrick Walls",
		"David Booth",
		"Carla Hatley",
		"Lawrence Hecht"
	],
	"staff": [
		"Wes Craven",
		"Kevin Williamson",
		"Cathy Konrad",
		"Cary Woods",
		"Marco Beltrami",
		"Mark Irwin",
		"Patrick Lussier",
		"Lisa Beach",
		"Bruce Alan Miller"
	],
	"links": [
		"https://www.max.com/movies/scream/8c8ce860-6336-4818-aae1-6e89f49197e0",
		"https://www.amazon.com/Scream-David-Arquette/dp/B004U8VUQG"
	],
	"votes": 395883,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjA2NjU5MTg5OF5BMl5BanBnXkFtZTgwOTkyMzQxMDE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In the small town of Woodsboro, California, high school student Casey Becker is home alone when she receives a phone call from an unknown person. They discuss horror films until the caller turns sadistic, threatening her life and revealing that her boyfriend, Steve, is tied up on her patio. The caller demands she answer questions about horror films to save his life, but she gives an incorrect answer about Friday the 13th and Steve is killed. Casey attempts to escape the house but is stabbed to death by someone wearing a \"Ghostface\" costume and her disemboweled corpse is hanged from a tree.The news media descend on the town as a police investigation begins. Teenager Sidney Prescott struggles with the impending first anniversary of the rape and murder of her mother Maureen by Cotton Weary. The trauma has made her unable to consummate her relationship with her boyfriend, Billy Loomis. As her father Neil is traveling for work, Sidney waits home alone for her best friend, Tatum Riley. She receives a call taunting her about Maureen's death and is attacked by Ghostface, who disappears just before Billy comes through her window. However, she becomes suspicious when he drops a cell phone, and he is arrested by Deputy Sheriff Dewey Riley, Tatum's brother. At the police station, Sidney is confronted by investigative journalist Gale Weathers, who claims that Maureen had several affairs, including one with Cotton, and that he was wrongly accused of her murder. Sidney stays at Tatum's home but receives another taunting call from the killer. The calls are traced to Neil's phone, but the police are unable to locate him.After his release, Billy encounters Sidney at school and further upsets her by comparing his absent mother to Maureen's death. After suspending school in the wake of the murders, Principal Himbry is stabbed to death in his office. To celebrate the closure, Stu Macher, Tatum's boyfriend, hosts a party at his secluded home. Dewey and Gale keep watch on the party in case the killer strikes again. As fellow high schooler Randy Meeks details the rules of surviving a horror film, Tatum is isolated in the garage by Ghostface, who crushes her with the garage door. After discovering Himbry's murder, most of the partygoers leave to see his hanging body, nearly running over Dewey and Gale and inadvertently leading them to Neil's hidden car. Billy arrives at the house to reconcile with Sidney, and they finally have sex. Afterward, they are suddenly attacked by Ghostface, and Billy is stabbed. Sidney evades Ghostface, who kills Gale's cameraman Kenny and stabs Dewey when he returns. Gale, attempting to flee in her van, crashes and is knocked unconscious. Sidney seeks refuge inside the house, locking Stu and Randy outside as they accuse each other of being the killer.A seemingly wounded Billy returns and allows Randy inside before shooting him in the shoulder, revealing himself as the killer and Stu as his accomplice. Billy confesses that they killed Maureen because the discovery of her affair with his father was responsible for his mother leaving. The pair abducted Neil to frame him for their crimes and proceed to stab each other to portray themselves as the only survivors. They are interrupted by Gale's return, which gives Sidney the chance to incapacitate Billy and kill Stu by dropping a television set on his head. Billy attempts to stab Sidney but is shot by Gale. After Randy remarks that horror film killers revive for a final scare, Billy sits back up and Sidney shoots him in the head, killing him. As dawn breaks, Neil is rescued, Dewey is taken away by ambulance, and Gale provides an impromptu news report about the night's events."
}