{
	"title": "Almost Famous",
	"release_year": "2000",
	"runtime": "122",
	"tags": [
		"Adventure",
		"Comedy",
		"Drama",
		"amazon"
	],
	"rating": 7.9,
	"actors": [
		"Billy Crudup",
		"Patrick Fugit",
		"Kate Hudson",
		"Frances McDormand",
		"Jason Lee",
		"Zooey Deschanel",
		"Michael Angarano",
		"Anna Paquin",
		"Fairuza Balk",
		"Noah Taylor"
	],
	"staff": [
		"Cameron Crowe",
		"Cameron Crowe",
		"Ian Bryce",
		"Cameron Crowe",
		"Nancy Wilson",
		"John Toll",
		"Joe Hutshing",
		"Saar Klein",
		"Gail Levin"
	],
	"votes": 297143,
	"cover": "https://m.media-amazon.com/images/M/MV5BZGFmNDQzOTItOGZkNS00NjFkLWE4MjQtNmRjMjNlMjg3YzdiXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1969, child prodigy William Miller (Patrick Fugit) struggles to fit in. His life is further complicated after learning that his widowed college-professor mother Elaine (Frances McDormand) has falsely led him to believe he is twelve years old. William is actually eleven, having started the first grade at five years old, and skipping fifth grade. Strong-willed Elaine's strict ban on rock music and her fear of pop culture have a negative effect on her children, finally driving William's 18-year-old sister Anita (Zooey Deschanel) to move to San Francisco and become a flight attendant.In 1973, William, now fifteen, influenced by Anita's secret cache of rock albums, aspires to be a rock journalist, writing freelance articles for underground papers in San Diego. Rock journalist Lester Bangs (Philip Seymour Hoffman) (editor of Creem magazine), impressed with William's writing (William had been mailing him his articles all through school, and got a chance to meet him when he was visiting San Diego), gives him a $35 assignment to review a Black Sabbath concert. William is barred from backstage until the opening band Stillwater arrives and William flatters his way in.Lead guitarist Russell Hammond (Billy Crudup) takes a liking to him and his new acquaintance, veteran groupie Penny Lane (Kate Hudson), who has taken William under her wing. Despite behaving as stereotypical groupies, Penny Lane insists she and her friends (Polexia Aphrodisia (Anna Paquin), Sapphire (Fairuza Balk)) are \"band aids\", a term she invented to describe female fans that are there more for the music than for the rock stars themselves.\nRussell has a crush on Penny and wants William to get them together. Penny takes William to Russell's hotel, where there is a full-on post-concert after-party going on. Penny ends up having sex with Russell in the ice vending room.Rolling Stone editor Ben Fong-Torres (Terry Chen) hires William to write an article about Stillwater, based on his skills, and sends him on the road with the band (3000 words for $1000). Penny is part of the road trip as well. William interviews the other band members, but Russell repeatedly puts him off (as he is officially part of a magazine that has trashed many great bands and broke them apart, before they reached their potential). Tensions between Russell and lead singer Jeff Bebe (Jason Lee) soon become evident and not helped at all by the band's first tee shirt, a full band shot that pictures Russell in full view while the rest of the band is unclear (Jeff was supposed to be the \"face\" and Russell the guitarist with mystique. but Russell is changing the dynamics without consulting anyone). William is jokingly called \"the enemy\" by the band as he is a journalist, but all the same begins to lose his objectivity as he becomes integrated into their inner circle.\nMeanwhile the Rolling Stone is breathing down William's neck for the 1000 words. Also, his mother is angry that William is missing school.The record label hires Dennis (Jimmy Fallon), a professional manager, to handle problems with venues and promoters (Russell was electrocuted at one of the previous concerts and the situation gave Stillwater a bad name as the band abandoned the gig mid-way) (This role was informally played by Dick Roswell (Noah Taylor) prior to Dennis). Dennis also tells the band that current they owe the record company, and they would have to do more shows to make more money and advises them to use a plane to travel quicker.\nPenny has to leave before the band reaches New York, where Russell's girlfriend Leslie (Liz Stauber) will join them. Penny and her three protege band aids are gambled away to another band in a poker game; Penny acts nonchalant but is devastated. Meanwhile, Dennis charters a small plane so the band can play more gigs.Penny shows up uninvited at the New York restaurant where they are celebrating the news that they are to be featured on the cover of Rolling Stone. Penny is asked to leave after Leslie notices her attempts to get Russell's attention. William chases her to her hotel, where he saves her from overdosing on Quaalude's. William is also ordered to report back to the Rolling Stones office in SFO and submit the 1000 words. They need to check the facts as it is going to be a cover story.\nWilliam misses his graduation. Flying to a gig the following day, the plane encounters severe weather. Fearing the plane will crash, everyone confesses their secrets, while Jeff and Russell's long-simmering conflicts erupt (Leslie had slept with Jeff, Jeff reveals that Russell had slept with Penny). William confesses his love for Penny after Jeff insults her. The plane lands safely in Tupelo, leaving everyone to ponder the changed atmosphere. William departs after landing.William arrives at the Rolling Stone office in San Francisco but has difficulty finishing the article. Seeking help, he calls Lester Bangs who says William got caught up in being part of the band. He says his perceived friendships with them are not real and advises him to \"be honest...and unmerciful.\" Rolling Stone's editors rave over William's completed article, but when the magazine's fact checker calls the band, Russell lies to protect Stillwater's image and claims most of it is false. Rolling Stone kills the article, crushing William. Anita encounters a dejected William in the airport and offers to take him anywhere; he chooses for them to go to their home in San Diego.\"Band aid\" Sapphire chastises Russell for betraying William. He then calls Penny, wanting to meet with her, but she gives him William's address. He arrives and finds himself face-to-face with William's mother who, during the tour, scolded him over the phone for his behavior. Russell apologizes to William and finally gives him an interview. Russell has verified William's article to Rolling Stone, which runs it as a cover feature. Penny fulfills her long-standing fantasy to go to Morocco while Stillwater tours again by bus.",
	"links": [
		"https://www.amazon.com/Almost-Famous-Billy-Crudup/dp/B0036OODFU"
	]
}