{
	"title": "My Best Friend's Wedding",
	"release_year": "1997",
	"runtime": "105",
	"tags": [
		"Comedy",
		"Drama",
		"Romance",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Julia Roberts",
		"Dermot Mulroney",
		"Cameron Diaz",
		"Rupert Everett",
		"Philip Bosco",
		"M. Emmet Walsh",
		"Rachel Griffiths",
		"Carrie Preston",
		"Susan Sullivan",
		"Christopher Masterson"
	],
	"staff": [
		"P.J. Hogan",
		"Ron Bass",
		"Ron Bass",
		"Jerry Zucker",
		"James Newton Howard",
		"László Kovács",
		"Garth Craven",
		"Lisa Fruchtman",
		"David Rubin",
		"Richard Sylbert"
	],
	"votes": 157671,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzhlZjE4NTYtZDBlOC00NTAwLWFmMTQtMWVjNDQwZGI1MjViXkEyXkFqcGc@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "Three weeks before her 28th birthday, New York City food critic Julianne \"Jules\" Potter (Julia Roberts) receives a call from her lifelong friend Michael O'Neal (Dermot Mulroney), a Chicago sportswriter. Years earlier, the two agreed that if they were both unmarried by age 28, they would marry each other. Michael tells her that in four days, he will marry Kimmy Wallace (Cameron Diaz), a college student eight years his junior whose father owns the Chicago White Sox.Isabelle Wallace (Susan Sullivan), wife of Walter, mother of Kimmy, and future mother-in-law of Michael. Joe O'Neal (M. Emmet Walsh), father of Michael and Scotty O'Neal and future father-in-law of Kimmy. Samantha Newhouse (Rachel Griffiths) & Mandy Newhouse (Carrie Preston), twin sisters & Kimmy's bridesmaids. Scotty O'Neal (Christopher Masterson), youngest son of Joe and younger brother of Michael and future brother-in-law of KimmyRealizing that Michael is the love of her life, Jules resolves to sabotage his wedding. Arriving in Chicago, she reunites with Michael and meets Kimmy, who asks her to be the maid of honor. Kim trusts Jules completely and considers her an elder sister. Jules schemes to break up the couple. she turns on her seductive side, trying to lure Michael. Jules's attempt to humiliate Kimmy at a karaoke bar backfires (Kimmy had told her she can't carry a tune and she forces Kimmy on the stage hoping to embarrass her in front of Michael. Instead, Kimmy rocks a song and wins over everybody with her bubbly nature). She manipulates Kimmy into asking her father to offer Michael a job, which Jules knows will anger Michael, but this fails as well. (Michael gets upset when Kimmy asks him, and he gets up to leave. But then Kimmy starts crying and apologizes to Michael and he melts and forgives her)Frustrated, Jules begs her friend George Downes (Rupert Everett) for help, and he flies to Chicago. On George's advice, Jules prepares to tell Michael how much she loves him, but instead tells him that she is engaged to George, hoping to make Michael jealous. George, who is gay, plays along but embarrasses Jules at lunch (by telling a fake, but incredibly romantic story about how they first met) with the wedding party, singing \"I Say a Little Prayer\" as the whole restaurant joins in. George flies' home, and Jules tells Michael that her \"relationship\" with George is over. Michael admits to feeling jealous and gives her the chance to confess her own feelings, but she lets the moment pass. They share a dance as Michael sings their song, \"The Way You Look Tonight\".The day before the wedding, at Kimmy's father's Walter (Philip Bosco) office, Jules uses his email account to forge a message from him to Michael's boss, asking that Michael be fired to allow Kimmy's father to hire him at Kimmy's insistence. She saves the message rather than send it, but later realizes that Kimmy's father has unknowingly sent the email. Jules lies to enlist Michael's help, but they find the office locked. Returning to Jules' hotel, Michael receives a message from his boss notifying him of the email. Furious, he calls Kimmy, calling off the wedding.The next morning, Jules discovers that neither Michael nor Kimmy have told anyone else that the wedding is off. She tries to manipulate the couple into breaking up for good, but Michael and Kimmy decide to get married after all. Jules finally confesses her love to Michael and passionately kisses him. Kimmy witnesses this and drives away, pursued by Michael, who is followed by Jules in a caterer's truck. Jules calls George, who assures her that Michael loves Kimmy. Finding Michael at Chicago Union Station, Jules confesses to everything. He forgives her and tells her that here at the station is where he proposed to Kimmy and she accepted, and they split up to look for Kimmy.Jules finds Kimmy in the bathroom of Comiskey Park. Amid a crowd of onlookers, Kimmy confronts Jules for interfering with Michael. Jules apologizes, assuring Kimmy that Michael truly loves her, and they reconcile. The wedding proceeds, and at the reception, Jules gives a heartfelt speech as Kimmy's maid of honor.\nJules allows the newlyweds to temporarily have \"The Way You Look Tonight\" as their song until they find their own song. Jules and Michael share their goodbyes, both finally moving on. On the phone with George, Jules is surprised to see him at the reception, and they dance together.",
	"links": [
		"https://www.amazon.com/Best-Friends-Wedding-Julia-Roberts/dp/B006WANG6W"
	]
}