{
	"title": "Die Another Day",
	"release_year": "2002",
	"runtime": "133",
	"tags": [
		"Action",
		"Adventure",
		"Thriller",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Pierce Brosnan",
		"Halle Berry",
		"Rosamund Pike",
		"Toby Stephens",
		"Rick Yune",
		"Judi Dench",
		"John Cleese",
		"Michael Madsen",
		"Will Yun Lee",
		"Kenneth Tsang"
	],
	"staff": [
		"Lee Tamahori",
		"Ian Fleming",
		"Neal Purvis",
		"Robert Wade",
		"Barbara Broccoli",
		"Michael G. Wilson",
		"David Arnold",
		"David Tattersall",
		"Andrew MacRitchie",
		"Christian Wagner",
		"Natalya Krimenskaya",
		"Peter Lamont"
	],
	"votes": 230856,
	"cover": "https://m.media-amazon.com/images/M/MV5BNDZiYWFmOTQtMTQ5Yy00MzA3LWFlNzktZTVmMGQ1MDA4MjEyXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "MI6 agent James Bond (Pierce Brosnan) infiltrates a North Korean military base (he hijacks a helicopter that was supposed to be delivering diamonds to the base, in exchange for weaponry. Bond had put explosives inside the diamond case before the helicopter landed) where Colonel Tan-Sun Moon (Will Yun Lee) is illegally trading weapons for African conflict diamonds (The UN has banned trade in these diamonds as they are being used to fund wars). After Moon's right-hand man Zao (Rick Yune) sends Bond's photo to an unknown source who reveals Bond's true identity. Moon attempts to kill Bond (He blows up Bond's helicopter, but Bond escapes by triggering the diamond case explosive at the right moment) and a hovercraft chase ensues, ending with Moon's apparent death (The hovercraft goes over a waterfall with Moon on it). Bond survives but is captured by North Korean soldiers and imprisoned by the Colonel's father, General Moon (Kenneth Tsang).After fourteen months of captivity and torture at the hands of the Korean People's Army, Bond is traded for Zao in a prisoner exchange. even at the last moment, General Moon asks Bond about Col Moon's ally in the west, but Bond says it was the same person who betrayed him. Bond is sedated and taken to meet M (Judi Dench), who informs him that his status as a 00 Agent has been suspended under suspicion of having leaked information under duress to the North Koreans (A top US agent in the North Korean high command had turned up dead during Bond's captivity and a prison communication named Bond as the source, since MI6 suspected he had cracked). Bond is convinced that he has been set up by a double agent in the British government. After escaping MI6 custody (he lowers his pulse and simulates a heart attack), he discovers that Zao is in Hong Kong, where he learns from Chang (Ho Yi), a Chinese agent (chang wants revenge the death of his agents at the hands of Zao) and old colleague, that Zao is in Cuba.\nQ (John Cleese), MI6's quartermaster and armorer. Miss Moneypenny (Samantha Bond), M's secretary.In Havana, Bond meets Raoul (Emilio Echevarría), the manager of a Havana cigar factory, and a British sleeper. Raoul traces Zao to a clinic of Dr Alvarez (who specializes in gene therapy), on a small island next to the Cuban mainland.\nBond also finds NSA agent Giacinta \"Jinx\" Johnson (Halle Berry) and they have sex after some casual flirting. Bond follows her to a gene therapy clinic, where patients can have their appearances altered through DNA restructuring. Bond locates Zao inside the clinic and attempts to kill him, but Zao escapes (actually Jinx kills Dr Alvarez and sets up a time bomb inside the clinic, which throws Bond off and allows Zao to escape) (Bond also learns that Jinx was CIA), leaving behind a pendant which leads Bond to a cache of diamonds, identified as conflict diamonds, but bearing the crest of the company owned by British billionaire businessman Gustav Graves (Toby Stephens). Bond learns that Graves only appeared a year prior, apparently discovering a vein of diamonds in Iceland leading to his current wealth, celebrity, and philanthropy from its assets.At Blades Club in London, Bond meets Graves along with his assistant Miranda Frost (Rosamund Pike), who is also an undercover MI6 agent (who won a gold medal at the Sydney Olympics for fencing). After a fencing battle (Verity (Madonna), a fencing instructor for Graves introduced them and Bond made a wager for a conflict diamond), Bond is invited by Graves to Iceland for a scientific demonstration. Shortly afterwards, M tells Bond of MI6's doubts about Graves, restores Bond's Double-0 status (when Bond tells her that Graves Iceland operations are a front for laundering African conflict diamonds) and offers assistance in the investigation.\nM calls Frost and tells her that she is sending in Bond despite Frost's objections as in 3 months Frost has come up with nothing on Graves.At his ice palace adjacent to the diamond mine site in Iceland (Jinx also turns up for the demonstration), Graves unveils a new orbital mirror satellite, \"Icarus\", which is able to focus solar energy on a small area and provide year-round sunshine for crop development. Zoa arrives in secret and Graves is revealed to be Col Moon, post gene replacement therapy.\nFrost seduces Bond (actually she is distracting Bond while Jinx is captured) and Jinx infiltrates Graves' command center, but is captured by Graves and Zao. Bond rescues her and discovers that Graves is in fact Colonel Moon, who has used the gene therapy technology to change his appearance and amassed his fortune from sale of the conflict diamonds as a cover for his true plans. Bond sends Jinx to warn frost..Bond confronts Graves, but Frost arrives to reveal herself as the traitor who betrayed Bond in North Korea (Frost and Moon studied together at Harvard and became good friends while fencing), forcing Bond to escape from Graves' facility. Bond returns in his Aston Martin V12 Vanquish to rescue Jinx, who has been recaptured by Frost in the palace. As Graves uses Icarus to melt the ice palace, Zao pursues Bond into the palace using his Jaguar XKR. Bond kills Zao by causing a giant ice chandelier to fall onto him, and revives Jinx after she has almost drowned (by putting her in a hot spring that he had seen earlier inside Graves's palace).\nBond and Jinx pursue Graves and Frost to the Korean peninsula (They are briefed that General Moon has been deposed in a coup by the hardliners. 80K troops are amassing north of the border with a Million in reserve. Icarus will clear the minefield and enable the invasion of South Korea) and stow away on Graves' cargo plane (Before it takes off from the Pyonyang airbase towards the DMZ). Graves reveals his identity to his father, and the true purpose of the Icarus satellite: to cut a path through the Korean Demilitarized Zone with concentrated sunlight, allowing North Korean troops to invade South Korea, defeat the United Nations Command forces of both U.S. and South Korean troops, and unite the peninsula under the flag of the DPRK. Horrified that it would potentially trigger World War III with the United States, General Moon tries to stop the plan, but Graves murders him.Bond attempts to shoot Graves, but he is prevented by a soldier. In their struggle, a gunshot pierces the fuselage, causing the plane to descend rapidly. Bond and Graves engage in a fist fight, and Jinx attempts to regain control of the plane. Frost attacks Jinx, forcing her to defend herself in a sword duel. After the plane passes through the Icarus beam and is further damaged, Jinx kills Frost. Graves attempts to escape by parachute, but Bond opens the parachute, pulling Graves out of the plane and into one of its engines, killing him and disabling the Icarus beam. Bond and Jinx escape from the disintegrating plane in a helicopter from the cargo hold, carrying away Graves' stash of diamonds.",
	"links": [
		"https://www.amazon.com/Die-Another-Day-Lee-Tamahori/dp/B0CJRFGJM5"
	]
}