{
	"title": "Rush Hour 3",
	"release_year": "2007",
	"runtime": "91",
	"tags": [
		"Action",
		"Comedy",
		"Crime",
		"amazon"
	],
	"rating": 6.2,
	"actors": [
		"Jackie Chan",
		"Chris Tucker",
		"Max von Sydow",
		"Hiroyuki Sanada",
		"Yvan Attal",
		"Yûki Kudô",
		"Noémie Lenoir",
		"Jingchu Zhang",
		"Tzi Ma",
		"Dana Ivey"
	],
	"staff": [
		"Brett Ratner",
		"Jeff Nathanson",
		"Ross LaManna",
		"Roger Birnbaum",
		"Andrew Z. Davis",
		"Jonathan Glickman",
		"Arthur Sarkissian",
		"Lalo Schifrin",
		"J. Michael Muro",
		"Mark Helfrich",
		"Dean Zimmerman",
		"Don Zimmerman",
		"Ronna Kress",
		"Ed Verreaux"
	],
	"votes": 186252,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTA0Nzg5NjQ0MDBeQTJeQWpwZ15BbWU3MDE4Mzg5NDE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Three years after the events of Rush Hour 2, Chinese Ambassador Solon Han (Tzi Ma), with Hong Kong Police Force Chief Inspector Lee (Jackie Chan) as his bodyguard, addresses the importance of fighting the Triads at the World Criminal Court in Los Angeles. There, he starts to announce the whereabouts of Shy Shen, a semi-mythical individual of great importance to the Chinese mob, but an assassin snipes him, causing a panic. Lee follows and corners the shooter, only to learn it is his childhood Japanese foster brother, Kenji (Hiroyuki Sanada). Lee hesitates, inadvertently allowing Kenji to escape just as LAPD Detective James Carter (Chris Tucker) arrives after learning what happened over the police radio.Despite Han surviving the assassination attempt, Lee and Carter promise his daughter Soo Yung (Zhang Jingchu) to find the person responsible. Upon her insistence, the pair head to the local Kung Fu studio to retrieve an envelope Han left her (which he had asked Soo Yung to hand over to Lee if anything ever happened to him) but learn from the studio master that the Triads took Soo Yung's belongings.Lee and Carter return to the hospital and intercept a gang of French-speaking Chinese assassins before they can kill Han. After defeating them, they interrogate one of them with the help of Sister Agnes (Dana Ivey), a French-speaking nun. They are given an address and the name of Genevieve. For her protection, they take Soo Yung to the French Embassy and leave her with French ambassador and chairman of the World Criminal Court, Varden Reynard (Max Von Sydow). When Reynard and Soo Yung are nearly killed by a car bomb, Lee and Carter head to Paris (they figure the address they got is in Paris) to investigate further. The address belongs to an underground titty bar.After a painful encounter with Parisian Commissaire Revi (Roman Polanski) (Revi beats Lee and Carter with books to find why they are in Paris, but they continue to say that they are on vacation), Lee and Carter meet anti-American taxi driver (as they always start wars and are always killing people), George (Yvan Attal), and force him to drive them to the Triad hideout.While there, Carter meets stage performer Geneviève (Noémie Lenoir) at a blackjack table, while Lee is tricked by mob assassin Jasmine (Youki Kudoh), who claims to have information about Shy Shen, though Carter saves him from being killed. They both try to run away in George's cab but are pursued through the streets of Paris. Only George's manic driving keeps them both alive. The pair try to escape but are ultimately captured by Kenji's men. Kenji offers to let them live if they leave Paris, but Lee refuses and following a short struggle, he and Carter successfully escape.The duo recuperates at a hotel, where Lee reveals his relationship with Kenji and decides to continue alone. Lee says he and Kenji grew up together at an orphanage in China, but Lee got adopted and got a life, Kenji got left behind on the streets and became a crook. Carter says Kenji is not Lee's brother and is not telling him the truth. Lee says he and Carter are also not brothers. A disillusioned Carter leaves but recomposes himself when he spots and follows Geneviève. Meanwhile, Reynard meets Lee and reveals that Shy Shen is not a person, but a list of 3 Triad leaders (the dragon heads) and that Geneviève is Han's informant with access to the list.After locating Geneviève and saving her from an assassination attempt, Carter & Lee two flee to their hotel (driven by George). They are attacked by Jasmine, but George rescues them out of a newfound admiration for Americans & takes them to his home. Geneviève reveals to Lee and Carter that the Triad leaders' names were tattooed on the back of her head and that she will be beheaded if the Triads capture her (that is the ancient tradition that after the Shy Shen is circulated in 35 provinces, the woman carrying it is beheaded. She reached out to Han as she thought the world court could protect her). When Lee and Carter bring Geneviève to Reynard, they discover he was working with the Triads the entire time (when he orders his men to kill her). Kenji calls to inform Lee that he has captured Soo Yung and demands he turn over Geneviève.Lee arrives at the Eiffel Tower to make the exchange, with Carter disguised as Geneviève with a wig. Kenji challenges Lee to a sword fight, during which the two fall into a safety net. After Kenji's sword cuts the net, Lee tries to save him, but Kenji lets go, falling to his death. Meanwhile, Carter saves Soo Yung (who is hanging off the ledge at the top of the Eiffel tower) and defeats Jasmine, who is killed after getting stuck in an elevator wheel.After escaping the remaining Triad members, Carter and Lee are confronted by Reynard, who threatens to kill Geneviève and frame them. However, George shoots Reynard from behind, killing him. As the police arrive, Revi tries to take credit for Lee and Carter's work, but they knock him out and leave with a victory dance.",
	"links": [
		"https://www.amazon.com/Rush-Hour-3-Chris-Tucker/dp/B00113N6K6"
	]
}