{
	"title": "Ali",
	"release_year": "2001",
	"runtime": "157",
	"tags": [
		"Biography",
		"Drama",
		"Sport",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Will Smith",
		"Will Smith",
		"Jamie Foxx",
		"Jon Voight",
		"Mario Van Peebles",
		"Ron Silver",
		"Jeffrey Wright",
		"Mykelti Williamson",
		"Jada Pinkett Smith",
		"Nona Gaye",
		"Michael Michele"
	],
	"staff": [
		"Michael Mann",
		"Gregory Allen Howard",
		"Stephen J. Rivele",
		"Christopher Wilkinson",
		"Eric Roth",
		"Paul Ardaji",
		"A. Kitman Ho",
		"James Lassiter",
		"Michael Mann",
		"Pieter Bourke",
		"Lisa Gerrard",
		"Emmanuel Lubezki",
		"William Goldenberg",
		"Lynzee Klingman",
		"Stephen E. Rivkin",
		"Victoria Thomas",
		"John Myhre"
	],
	"links": [
		"https://www.amazon.com/Ali-Directors-Cut-Will-Smith/dp/B06WWD61Y5"
	],
	"votes": 106616,
	"cover": "https://m.media-amazon.com/images/M/MV5BODVhNWUwMGItZTg1My00Njg1LTllMjctNzQzMjIzODUyZDhmXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "In 1964, a brash new pro boxer, Cassius Clay, explodes on to the scene. Bold and outspoken, he cuts an entirely new image for African Americans in sports with his proud, public self confidence and his unapologetic belief that he is the greatest boxer of all time. To his credit, he sets out to prove that with his highly agile and forceful style soon making him a formidable boxer who claims the heavyweight championship. His personal life is no less noteworthy with his allegiance to the Nation of Islam, his friendship with the controversial Malcolm X, and his abandonment of his slave name in favor of Muhammad Ali stirring up controversy. Yet, at the top of his game, both Ali's personal and professional lives face the ultimate test when the military draft rules are changed, making him eligible for military induction during the Vietnam War. Ali refuses to submit on principle to cooperate in a war for a racist nation that treated his people so poorly. The cost of that stand is high as he finds himself unable to legally box in his own country while his case is contested in court. What follows is a battle for a man who would sacrifice so much for what he believes in and a comeback that cemented his legend as one of the great sports figures of all time."
}