{
	"title": "Ice Age",
	"release_year": "2002",
	"runtime": "81",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"max",
		"amazon"
	],
	"rating": 7.5,
	"actors": [
		"Denis Leary",
		"John Leguizamo",
		"Ray Romano",
		"Goran Visnjic",
		"Jack Black",
		"Cedric The Entertainer",
		"Stephen Root",
		"Stephen Root",
		"Diedrich Bader",
		"Alan Tudyk",
		"Alan Tudyk",
		"Alan Tudyk",
		"Lorri Bagley"
	],
	"staff": [
		"Chris Wedge",
		"Michael J. Wilson",
		"Michael Berg",
		"Peter Ackerman",
		"James Bresnahan",
		"Lori Forte",
		"David Newman",
		"John Carnochan",
		"Alan Filderman",
		"Brian McEntee"
	],
	"links": [
		"https://www.max.com/movies/ice-age-collision-course/67f183a6-fcc7-4a4a-870d-a66f736dd19b",
		"https://www.amazon.com/Ice-Age-Chris-Wedge/dp/B000I9U8KK"
	],
	"votes": 527447,
	"cover": "https://m.media-amazon.com/images/M/MV5BODhmZTRjZWYtNGI5MC00YjgyLWFhODEtN2E4NTc2Zjg2ZmNmXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "A herd of prehistoric animals is migrating south to escape an impending ice age. Sid, a clumsy ground sloth, is accidentally left behind by his family and sets out alone in pursuit of the herd. Along the way, he inadvertently ruins a meal for a pair of angry Brontosaurus, who attack him. Just as things seem hopeless, Manny, a surly woolly mammoth who has decided not to migrate with the others, reluctantly saves Sid. Although Manny wants to be left alone, Sid insists on following him, and Manny, constantly irritated by Sid's outgoing nature, begrudgingly accepts.Meanwhile, a human tribe has recently killed part of a Smilodon pack for their pelts. Soto, the leader of the remaining saber-toothed tigers, seeks revenge by targeting the humans. He orders his lieutenant, Diego, to capture and bring back Roshan, the infant son of the human chief. After Roshan's mother flees with the baby, leaping over a waterfall to escape the attack, Diego fails to prevent her escape and is punished by Soto. He is given one final chance: bring Roshan back alive, or face death himself.Sid and Manny find Roshan and his injured mother at the bottom of the waterfall, with the mother fading. She leaves the baby in their care before being swept away by the current. Sid tries to return the baby to the humans but finds their camp deserted. Diego then appears, offering to take the baby from them, but Manny refuses, mistrusting Diego and instead orders him to track the humans. Diego complies but secretly informs Soto of his plans to bring both the baby and a mammoth to the pack.After facing numerous challenges and moments of bonding, the trio-Sid, Manny, and Diego-come across a cave filled with human paintings, triggering a painful flashback for Manny about his own family's slaughter by humans. Despite his past, Manny has grown fond of Roshan. Meanwhile, Diego begins to question his loyalty to Soto. When Manny saves him from a deadly lava flow, Diego finally decides to switch sides. He warns Sid and Manny of an ambush at Half Peak, urging them to trust him if they want to survive.The group comes up with a plan to trick Soto's pack, but things go awry when Soto and two other tigers corner Manny at a cliff. In a desperate attempt to save Manny, Diego steps in to fight Soto, suffering severe injuries. In the chaos, Soto is struck by falling icicles, killing him, and the remaining pack members flee.As Sid and Manny mourn Diego's apparent death, he convinces them to leave him behind and return Roshan to his human family before the mountain passes become too dangerous. Manny and Sid reach the human settlement just in time for Roshan to be reunited with his father. The chief gifts Manny a necklace as a token of gratitude. Just as the pair prepares to leave, Diego, having survived his injuries, catches up to bid farewell to Roshan. The reunited trio sets off to continue their journey south, now with their own bond of friendship stronger than ever."
}