{
	"title": "Children of Men",
	"release_year": "2006",
	"runtime": "109",
	"tags": [
		"Action",
		"Drama",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.9,
	"actors": [
		"Julianne Moore",
		"Clive Owen",
		"Chiwetel Ejiofor",
		"Michael Caine",
		"Juan Gabriel Yacuzzi",
		"Mishal Husain",
		"Rob Curling",
		"Jon Chevalier",
		"Rita Davies",
		"Kim Fenton"
	],
	"staff": [
		"Alfonso Cuarón",
		"Alfonso Cuarón",
		"Timothy J. Sexton",
		"David Arata",
		"Mark Fergus",
		"Marc Abraham",
		"Eric Newman",
		"Hilary Shor",
		"Iain Smith",
		"John Tavener",
		"Emmanuel Lubezki",
		"Alfonso Cuarón",
		"Alex Rodríguez",
		"Lucinda Syson",
		"Jim Clay",
		"Geoffrey Kirkland"
	],
	"votes": 535960,
	"cover": "https://m.media-amazon.com/images/M/MV5BMDNkNmNiYzYtYWY0YS00NWEwLTgwMWUtYjM0M2E4Nzk3MzhmXkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "In 2027, eighteen years of total human infertility have led to war and global depression, pushing civilization to the brink of collapse as humanity faces extinction. The last person on the planet was born in 2009. The United Kingdom, the last known stable nation, is deluged by asylum seekers. In response it has become a militarized police state as British forces round up and detain immigrants. Refugees are arrested and either imprisoned, deported, or executed in concentration camps.Theo is former activist turned cynical bureaucrat. He visits his best friend Jasper who is a cartoonist. His wife Janice was a journalist, who was reportedly tortured by the secret services for her journalism. Jasper tells Theo about organizations like the Human Project working on a cure for infertility. Theo believes it is too late already and that mankind is beyond the point of salvation.Kidnapped by an immigrants rights group known as \"The Fishes\", Theo Faron (Clive Owen) is brought to its leader, his estranged wife Julian Taylor (Julianne Moore). They parted ways after their son died from a flu pandemic in 2008.Julian offers Theo money (5000 pounds) to acquire transit papers for a young black female refugee named Kee (Clare-Hope Ashitey). At first Theo refuses as the transaction would be too risky and he would have to put himself in danger to get the papers. Julian releases Theo but pays him the 5000 pounds in case he changes his mind. Julian believes that every immigrant should have equal rights and has dedicated her organization to helping them.Theo obtains the papers from his cousin Nigel (Danny Huston), a government minister. Theo says that the papers are for his girlfriend, whom he loves.\nHowever, according to the papers provided by Nigel, the bearer must be accompanied by their significant other, so Theo agrees to escort Kee in exchange for a larger sum. Theo cannot understand why Julian asked him for the papers as she could have got them through other means as well. Julian only says that she trusts him.Luke (Chiwetel Ejiofor), a Fishes member, drives them and former midwife Miriam (Pam Ferris) towards the coast to a boat. On their route, they pass through a heavily forested area.\nThey are ambushed by an armed gang and Julian is fatally shot. Theo fights off their attackers, but the car is damaged in the fight. The police notice the damaged car and follow them and intercept the car further down the road. Luke kills two police officers that try to question them, and the group hides Julian's body in the surrounding forest, before heading to a safe house.\nTheo wanted to leave, but Luke says that it is too dangerous and says that Theo will be taken care of the next day.Kee reveals to Theo that she is pregnant, making her the only known pregnant woman in the world and that Julian told her to only trust him. Theo realizes that Kee could unlock the future of mankind by providing a cure for infertility.\nJulian had intended to hand Kee to the \"Human Project\", a supposed scientific group in the Azores dedicated to curing infertility. However, Luke persuades Kee to stay. Luke becomes the new leader of the Fishes.That night, Theo eavesdrops on a meeting of Luke and other members and discovers that Julian's death was orchestrated so the group could use the baby as a political tool to support the coming revolution. Theo wakes Kee and Miriam and they steal a car, escaping to the secluded hideaway of Theo's aging hippie friend Jasper Palmer (Michael Caine), a former editorial cartoonist. Jasper's wife Janice was tortured into catatonia by the British government for her journalism.A plan is formulated to board the Human Project ship, the Tomorrow, which will arrive offshore from the Bexhill refugee camp and Jasper proposes getting camp guard Syd (Peter Mullan) to smuggle them in, as he's had dealings with him in the past. From where they can take a rowboat and rendezvous with the Tomorrow. The next day, the Fishes discover Jasper's house, forcing the group to flee.The Fishes trail the group, and Jasper stays behind to stall them, giving the government-issued suicide drug Quietus to his catatonic wife. A horrified Theo witnesses the Fishes kill him before escaping with Miriam and Kee. Later they meet Syd (Peter Mullan), who transports them to Bexhill as prisoners. When Kee begins having contractions on a bus, a guard enters the bus to select people for execution. When he notices Kee hurting, Miriam obstructs the guard and is taken away; Theo fools him into thinking Kee just soiled herself, after which the guard leaves her alone.At the camp Theo and Kee meet Marichka (Oana Pellea), who provides a room where Kee gives birth to a girl. The next day Syd informs Theo and Kee that a war between the army and the refugees, including the Fishes, has begun. He then reveals that Theo and Kee have a bounty on their heads and attempts to capture them. Theo subdues Syd with Marichka's help and the group briefly take shelter with Marichka's friends.Heading for the rowboat, they are ambushed by the Fishes, who capture Kee and the baby. As British troops attack, Theo tracks the Fishes to an apartment building under heavy fire. Theo confronts Luke, who is killed in an explosion, and Theo escorts Kee and the baby out. Awed by the baby, the British soldiers and Fishes temporarily stop fighting and allow the trio to leave. Marichka leads them to the boat but stays behind as they depart.As British fighter jets conduct airstrikes on Bexhill, Theo and Kee row to the rendezvous point in heavy fog. Theo reveals that he was shot and wounded by Luke earlier; he teaches Kee how to burp her baby, and she tells him she will name the baby girl Dylan, after Theo's and Julian's lost son. Theo smiles weakly, then loses consciousness as the Tomorrow approaches. As the screen cuts to black, children's laughter is heard.",
	"links": [
		"https://www.amazon.com/Children-Men-Clive-Owen/dp/B000OW8DW6"
	]
}