{
	"title": "The Chronicles of Riddick",
	"release_year": "2004",
	"runtime": "119",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Vin Diesel",
		"Judi Dench",
		"Colm Feore",
		"Thandiwe Newton",
		"Karl Urban",
		"Alexa Davalos",
		"Linus Roache",
		"Yorick van Wageningen",
		"Nick Chinlund",
		"Keith David"
	],
	"staff": [
		"David Twohy",
		"Jim Wheat",
		"Ken Wheat",
		"David Twohy",
		"Camille Brown",
		"Vin Diesel",
		"Scott Kroopf",
		"Graeme Revell",
		"Hugh Johnson",
		"Tracy Adams",
		"Martin Hunter",
		"Dennis Virkler",
		"Coreen Mayrs",
		"Anne McCarthy",
		"Holger Gross"
	],
	"votes": 244310,
	"cover": "https://m.media-amazon.com/images/M/MV5BNjJkZGI1MTktNmNiMS00NTE5LTkyY2EtZjkyMDZjMzdhZTJjXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Riddick (Vin Diesel), having remained in hiding for five years after the events of Pitch Black, evades the bounty hunter Toombs, killing his crew and stealing his ship, before heading for the planet called Helion Prime, after Toombs reveals that the incredibly high bounty originated there. Once there, Riddick is reunited with Imam, the man he rescued in Pitch Black, and is asked about his home world, a now devastated planet called Furya, and if there are any of his people still alive, aside from him. Imam and the others are aware that Helion Prime is likely the next planet to be conquered by the Necromongers, an army of religious fanatics who seek to convert every human life and kill those who refuse. One night, the Necromongers invades Helion Prime, overwhelming their entire defense forces, and takes control of the capital. In the ensuing battle, Imam is killed defending his family and Riddick heads to the capital building.The next day, the Necromongers, led by the high priest (called a purifier), coerce the populace into converting, except for Riddick, who in a display of defiance kills the man who killed Imam the night before. Intrigued, and alarmed by a sense of Deja Vu, the Lord Marshal orders Riddick be examined in the main Necromonger hall, where it is discovered that he is the last Furyan alive, to which the Lord Marshal immediately orders Riddick's death. Riddick escapes the Necromonger ship and allows himself to be captured by Toombs and his new crew. Riddick quietly gets Toombs to take him to Crematoria, a harsh prison, where the kid from Pitch Black, Jack, was reported to have been sent.Following Riddick's escape, the Lord Marshal sends a commander named Vaako to track down and kill Riddick, a process made easier by Toombs' ship leaving behind an easily traceable path. During the voyage, Vaako's wife, after talking to an Elemental who acted as a seer for the Lord Marshal 30 years prior, reveals that Furya was devastated by the Lord Marshal, after he was informed that a male child from that world would bring about his downfall, thus revealing his desire to see Riddick killed. On Crematoria, a disagreement between Toombs and the prison warden over the amount Toombs is owed for Riddick results in Toombs and his crew staying there for a day; word about the Necromongers has reached even the isolated prison guards, who suspect that Toombs stole Riddick from them, and that it will bring them only trouble. In the prison, Riddick meets up with Jack, now renamed Kyra, and after a few fights, they eventually reconcile.The next day, the guards kill all the mercenaries, except Toombs who drops into the prison area, who take all their money and prepare to leave when they realize the Necromongers are coming for Riddick. Riddick leads several prisoners to steal the ship. The guards eventually reach the hanger, whereas the prisoners arrive on the outside of the hanger right as the Necromongers arrive. After a fight, the guards are all killed, and Riddick is incapacitated due to timely action by Vaako. However, following an outburst of energy by Riddick, a trait among Furyans, and the approach of the vicious sunrise (0 to 700 degrees F), Vaako leaves Riddick for dead; Kyra, also thinking Riddick is dead, flees with the Necromongers.However, Riddick is saved by the Purifier, who informs him that if he stays away from the Necromongers, the Lord Marshal will not hunt him. The Purifier then reveals that he too is Furyan, and that Vaako will likely report Riddick as dead, giving him the element of surprise. The Purifier then commits suicide by walking out of the hanger onto the scorching surface of Crematoria after encouraging Riddick to save Kyra and kill the Lord Marshal. Meanwhile, Vaako has reported Riddick as dead, and for which, has been named as the heir apparent by the Lord Marshal. Riddick flies back to Helion Prime.Riddick, disguised as a Necromonger in full armor, infiltrates the main Necromonger hall; Dame Vaako finds out and encourages her husband to let Riddick strike first, so as to wound the Lord Marshal, paving the way for Vaako to kill him. When Riddick strikes, the Lord Marshal brings out Kyra, who appears to have converted; Riddick attacks him, and when it appears that Riddick has been defeated, Kyra stabs the Lord Marshal in the back with a spear. She is then mortally wounded after being tossed onto, and impaled, on spikes. Vaako makes his move to strike, but Riddick, who in the fight has figured out the Lord Marshal's weakness, ends up killing the Lord Marshal. Kyra dies, and as Riddick mourns, the Necromongers kneel before him, the new Lord Marshal.",
	"links": [
		"https://www.amazon.com/Chronicles-Riddick-Vin-Diesel/dp/B001M5GVKU"
	],
	"netflix": []
}