{
	"title": "The Bank Job",
	"release_year": "2008",
	"runtime": "111",
	"tags": [
		"Crime",
		"Drama",
		"Thriller",
		"amazon"
	],
	"rating": 7.2,
	"actors": [
		"Jason Statham",
		"Saffron Burrows",
		"Stephen Campbell Moore",
		"Daniel Mays",
		"James Faulkner",
		"Alki David",
		"Michael Jibson",
		"Georgia Taylor",
		"Richard Lintern",
		"Peter Bowles"
	],
	"staff": [
		"Roger Donaldson",
		"Dick Clement",
		"Ian La Frenais",
		"Steven Chasman",
		"Charles Roven",
		"J. Peter Robinson",
		"Michael Coulter",
		"John Gilbert",
		"Lucinda Syson",
		"Gavin Bocquet"
	],
	"votes": 190599,
	"cover": "https://m.media-amazon.com/images/M/MV5BZmQ5OTkxZDMtYTAxYS00OWE1LThhMWItYjdlYjJmNWZlNWU5XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The British Security Services (MI5) in 1971, have taken interest in a safety deposit box that is located in a Lloyd's Bank branch on the corner of Baker Street and Marylebone Road. It belongs to a black militant gangster, Michael X (Peter De Jersey), and contains compromising photos of Princess Margaret, which he is keeping as insurance to keep the British authorities off his back. Michael X was driven out of England to Trinidad due to his illegal business activities including drugs and pimping. The MI5 cannot intervene directly as that would prompt Michael X to release the photos. But they do want the photos to disappear.\nMartine Love (Saffron Burrows), an ex-model who is romantically involved with MI5 agent Tim Everett (Richard Lintern), is caught at Heathrow Airport smuggling drugs into the country, and to avoid going to jail, she makes a deal with the authorities whereby she agrees to retrieve the photos.Martine approaches her friend Terry Leather (Jason Statham), a struggling East London car salesman with criminal contacts, and tells him that if he can assemble the gang to help her rob the bank, he will be richly rewarded, though she does not tell him about the photos in the deposit box. Martine convinces Terry by saying that the alarms at the bank are being replaced as the trains were setting them off. For a week, they won't have any alarms.Terry recruits a small team, including one of his own workers, Eddie (Michael Jibson), Dave (Daniel Mays), Kevin (Stephen Campbell Moore), Bambas (Alki David) (The tunnel digging expert), and Guy Singer (James Faulkner) (He is a fake \"Major\" and is used as a front for the lease of the shop next door to the bank).\nWhile scouting the bank, Dave runs into local gangster Lew Vogel (David Suchet), for whom he has made several pornographic films. Lew Vogel is an old business associate of Michael X. Lew handles Sonia Bern's (Sharon Maughan) brothels and pays off London coppers to look the other way. He keeps a ledger for all payments made to the cops which is kept in a locker at the bank. Meanwhile Sonia takes pics and videos of the high-profile customers at her establishment.The gang rents a leather goods shop near the bank and tunnels into the vault. They loot the safety deposit boxes, but Terry becomes suspicious when Martine seems to display intense interest in one box and eventually discovers the photos. The police are alerted to the robbery by a ham radio operator who overhears the gang's Walkie-Talkie communications, but by the time they locate the bank, the gang has already got away.The robbery rattles many important underworld figures who had used the bank, including Lew Vogel, who kept a ledger of police payoffs inside. He notifies a furious Michael X in Trinidad, who correctly suspects Gale Benson (Hattie Morahan)-the lover of his associate Hakim Jamal (Colin Salmon)-of spying for MI5, and subsequently murders her.Terry confronts Martine who tells him the truth. Martine sets up a handover with Tim at a tube station, but only Terry goes to it the handover meeting. Terry uses the photos from Michael X's locker and Sonia's locker to secure passports and new identities for the gang.\nVogel decides that Dave's presence outside that particular bank was not a coincidence and has him kidnapped and tortured for information by sand blasting the ankle and up on one of his legs. Dave gives in, and Lew has Gerald Pyke (Don Gallagher) and Nick Burton (Craig Fairbrass)-two corrupt policemen working on his payroll-kidnap Eddie at Terry's garage. Vogel has Terry call him and demands the ledger and the Royal Portfolio back.Vogel's men track down and murder Bambas and Guy Singer. Eddie refuses to cooperate with Vogel, who has Gerald execute Dave (When Terry tries to negotiate, Vogel shoots Dave point blank) and threatens to kill Eddie unless Terry delivers the ledger to him; Terry agrees to meet up with Vogel at Paddington Station to exchange the ledger for Eddie. He arranges for the meeting to happen at the same time as he will be picking up the new passports and the immunity of prosecution of the robbery from the MI5 in exchange for the pictures of Princess Margaret.Meanwhile, Terry sends Kevin to honest cop Roy Given (Gerard Horan) with a page torn from the ledger. Vogel becomes spooked when he sees MI5 agents tracking Terry at the Paddington station and tries to flee, but Terry attacks and beats him-only to be arrested by the police. However, Given has Terry released and uses the information he supplied to arrest Lew, Gerald and Nick. In Trinidad, Michael X is arrested as well and his house is burned down when Tim finds out that Michael X killed Gale Benson.Eddie inherits Terry's car dealership, while Kevin and Martine prepare to begin new lives with their share of the money. Terry and his family leave England and enjoy a carefree life on a boat in a sunny location.\nIt is later revealed Vogel's ledger eventually causes Scotland Yard to undergo a major corruption purge in the police force. The activities of Sonia Bern's brothels make several senior officials resign. Michael X is hanged in Trinidad in 1975 for the murder of Gale Benson and his file in the British National Archive remains classified until 2054. Lew Vogel is sentenced to 8 years in prison. Hakim Jamal is murdered in 1973. The murders of both Bambas and Guy Singer are never solved. The loot taken from the robbery exceeds that of the Great Train Robbery at 4 million pounds. Over 100 safe deposit holders refuse to identify their losses as most of them are criminals.",
	"links": [
		"https://www.amazon.com/Bank-Job-Jason-Statham/dp/B001CNMDUO"
	]
}