{
	"title": "Bend It Like Beckham",
	"release_year": "2002",
	"runtime": "112",
	"tags": [
		"Comedy",
		"Drama",
		"Romance",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Parminder Nagra",
		"Keira Knightley",
		"Jonathan Rhys Meyers",
		"Anupam Kher",
		"Archie Panjabi",
		"Shaznay Lewis",
		"Frank Harper",
		"Juliet Stevenson",
		"Shaheen Khan",
		"Ameet Chana"
	],
	"staff": [
		"Gurinder Chadha",
		"Gurinder Chadha",
		"Guljit Bindra",
		"Paul Mayeda Berges",
		"Gurinder Chadha",
		"Deepak Nayar",
		"Craig Pruess",
		"Jong Lin",
		"Justin Krish",
		"Carrie Hilton",
		"Liora Reich",
		"Nick Ellis"
	],
	"votes": 117581,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTIyOTI2MTM5N15BMl5BanBnXkFtZTYwNDc2NTQ3._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "Jesminder \"Jess\" Bhamra (Parminder Nagra) is the 18-year-old daughter of Punjabi Sikhs living in London. Juliette \"Jules\" Paxton (Keira Knightley) is the same age and the daughter of an English family. Jess is infatuated with football but because she's a woman, her family won't let her play. However, she sometimes plays in the park with other boys and her best friend, Tony (Ameet Chana) who is a closet homosexual. Jules discovers Jess' skills whilst on a jog through the park. She befriends Jess and invites her to try out for the local women's football team, the Hounslow Harriers coached by Joe (Jonathan Rhys Meyers). Jess is extremely happy and excited about the try-outs even though Joe is skeptical about a new player joining the team. After seeing Jess' skills, Joe accepts her on the team. Jess lies to Joe about her parents being cool with the idea.Jess develops an attraction towards Joe and when the team take a trip to Hamburg and go out clubbing, they're caught about to kiss by Jules; who also had a crush on Joe. This sours Jess and Jules' friendship as Jules was adamant, she'd told Jess about her crush. When Jess arrives at Jules' house to patch up their friendship, Mrs. Paxton (Juliet Stevenson) is misled and thinks they're hiding a lesbian relationship.Jess' parents, (Anupam Kher) and (Shaheen Khan), find out that Jess has been playing football behind their backs, they become stricter and prevent Jess from playing any more matches. The elder Bhamras are distracted by the elaborate wedding plans for Jess' older sister, Pinky (Archie Panjabi).Thanks to Jess and Jules' skills, the Harriers reach the finals of the league tournament. Unfortunately, the final and the wedding are on the same day. Joe pleads with Mr. Bhamra to allow Jess to play but he refuses. Mr. Bharma reveals that he doesn't want Jess to suffer the same way he did when he was kicked out of the cricket club because of his race.\nJoe pleads with Mr Bhamra to let Jess play, but he is firm & Joe is forced to start the finals without her. A talent scout is also at the game who will choose players for the US professional women's soccer league. It's a once in a lifetime opportunity.Halfway through Pinky's wedding, Tony convinces Mr. Bhamra to let Jess go. He agrees and Tony drives Jess to the game where the Harriers are losing 1-0 with half an hour left.\nJess and Jules tie the score, and when Jess is awarded a free kick, she must bend the ball around the wall of players to score. Jess succeeds and the Harriers win the tournament. Jess and Jules are offered scholarships at Santa Clara University in California. Jules tells her parents immediately whereas Jess has trouble telling hers.\nJules and Mrs. Paxton arrive at the wedding for Jules to celebrate with Jess. Mrs. Paxton accuses Jess of being a hypocrite and a lesbian. Jules grabs her mother and runs off in shame.Jess still hasn't told her parents about the scholarship. Tony decides to lie to the family and tells them he's engaged to Jess as long as she gets to go to any college she wants. Jess reveals the lie and Mrs. Bhamra accuses her husband of allowing her to play and refuses. Mr. Bhamra convinces Mrs. Bhamra after telling her he doesn't want Jess suffering like he did.Jess flees to the football field to tell Joe of her parent's decision. The two almost kiss, but Jess pulls away, saying her parents would object, and that although they had come far enough to let her go to America to play, she doesn't think they would be able to handle another cultural backlash from her.On the day of Jess' and Jules' flight, Mrs. Paxton gives her daughter a football jersey, and wishes her good luck. The two are about to board the plane when Joe arrives and confesses his love for Jess. The two kiss and Jess agrees to sort out a relationship (and her parents) when she returns for Christmas.Jess and Jules send their parents a team photograph, and it is revealed that Pinky is pregnant. Mr. Bhamra practices cricket with Joe's help.",
	"links": [
		"https://www.amazon.com/Bend-Like-Beckham-Parminder-Nagra/dp/B001K940R4"
	]
}