{
	"title": "Rat Race",
	"release_year": "2001",
	"runtime": "112",
	"tags": [
		"Action",
		"Adventure",
		"Comedy",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Breckin Meyer",
		"Amy Smart",
		"Whoopi Goldberg",
		"Vince Vieluf",
		"Jenica Bergere",
		"Cuba Gooding Jr.",
		"Carrie Diamond",
		"Douglas Haase",
		"Chris Myers",
		"Kevin Frazier"
	],
	"staff": [
		"Jerry Zucker",
		"Andy Breckman",
		"Sean Daniel",
		"Janet Zucker",
		"Jerry Zucker",
		"John Powell",
		"Thomas E. Ackerman",
		"Tom Lewis",
		"Bette Chadwick",
		"Candice Elzinga",
		"Gary Frutkoff"
	],
	"votes": 124436,
	"cover": "https://m.media-amazon.com/images/M/MV5BZGY0NDk4ZjEtZmZiYS00ZTE5LTlmMDktNGI3NTYzYjdlYTE5XkEyXkFqcGc@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "Donald Sinclair, the eccentric owner of The Venetian Resort Hotel Casino in Las Vegas, devises a new game to entertain the high rollers who visit his hotel. Six special tokens are placed in the casino's slot machines, and the winners of them are gathered together and told that $2 million in cash is hidden in a bag in a train station locker in Silver City, New Mexico. They are told they must compete in a no-holds-barred race to get there first and claim the money. Each winner is given a key that will open the locker and they are sent on their way. What they do not know is that Sinclair's wealthy patrons are placing bets on who will win the race. Among the racers are scheming twins Duane and Blaine Cody, businesswoman Merrill Jennings and her estranged mother Vera, disgraced football referee Owen Templeton (Cuba Gooding Jr), the Pear family led by opportunistic father Randy, eccentric Italian tourist Enrico Pollini (Rowan Atkinson), and no-nonsense attorney Nick Schaffer.Duane and Blaine destroy an airport radar with their pickup truck, before deciding to split up to double their chances of winning by creating a replica key. However, a locksmith overhears their plan and makes off with the key. The brothers chase the locksmith who tries to escape in a hot air balloon, only for the brothers to steal back the key and leave the locksmith dangling from the balloon with a cow for company. The brothers later steal a monster truck after being distracted by a woman with numerous piercings.Merrill and Vera lose their car thanks to a crazed squirrel owner, forcing them to steal a rocket car which races across the desert until it runs out of fuel, the women dizzily stumbling onto a bus full of mental patients which drives through Silver City\nOwen is left stranded in the desert by a vengeful cab driver, but he comes across a coach filled with women going to an I Love Lucy convention and disguises himself as the driver. Numerous shenanigans happen on the coach until it crashes thanks to the hot air balloon. Owen breaks down, reveals he is not a coach driver and is forced to flee from the women. The Pear Family visit a museum dedicated to Nazi Klaus Barbie, but after the Codys cut their car engine, they steal Adolf Hitler's Mercedez-Bens car. Randy accidentally insults a biker gang, who attack the car, causing the Pears to crash into a meeting for World War II veterans with Randy's injuries causing him to sound like Hitler. Randy later drugs his family and loads them onto a truck to reach Silver City.Nick at first refuses to participate until he meets helicopter pilot Tracy Faucet who offers him a lift to Silver City. On the way, they pass over Tracy's boyfriend's house but find he is with his ex-girlfriend, enraging Stacey to the point that she chases him in the helicopter until it runs out of fuel, causing her and Nick to steal her boyfriend's truck. Enrico, who is narcoleptic, falls asleep at the start of the race but awakens hours later and receives a lift from ambulance driver Zack Mallozzi, who is delivering a heart to El Paso. The heart gets lose in the van, and Enrico accidentally throws it out the window. Zack considers removing Enrico's heart to replace the first, but Enrico flees onto a passing train, only for Zack to restart the first heart by touching an electric fence.All the racers reunite in Silver City, but Enrico arrives at the train station first only to fall asleep as he reaches the locker. Sinclar's assistant Mr. Grisham and call-girl Vicky steal the money bag, but lose it when the locksmith ties it to the balloon, only for the three to crash their car. The racers follow the balloon until it lands at a charity concert hosted by Smash Mouth. All the racers are persuaded to give the money to charity, Nick forcing Sinclair and his fellow gamblers to pay double the prize money.",
	"links": [
		"https://www.amazon.com/Rat-Race-Jerry-Zucker/dp/B0DMHCWPZ7"
	]
}