{
	"title": "Adaptation.",
	"release_year": "2002",
	"runtime": "115",
	"tags": [
		"Comedy",
		"Drama",
		"amazon"
	],
	"rating": 7.7,
	"actors": [
		"Nicolas Cage",
		"Nicolas Cage",
		"Meryl Streep",
		"Chris Cooper",
		"Tilda Swinton",
		"Jay Tavare",
		"Litefoot",
		"Roger Willie",
		"Jim Beaver",
		"Cara Seymour",
		"Doug Jones"
	],
	"staff": [
		"Spike Jonze",
		"Susan Orlean",
		"Charlie Kaufman",
		"Jonathan Demme",
		"Vincent Landay",
		"Edward Saxon",
		"Carter Burwell",
		"Lance Acord",
		"Eric Zumbrunnen",
		"Justine Arteta",
		"Kim Davis-Wagner",
		"K.K. Barrett"
	],
	"votes": 205104,
	"cover": "https://m.media-amazon.com/images/M/MV5BMmQ1MWMxZjEtNmNmYi00ZGFhLWExZDItODcwNzlmZjg0YzNlXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "John Laroche and his wife run a successful Florida nursery, but tragedy strikes and Laroche's wife, mother and uncle are involved in a car accident. Laroche's mother and uncle are killed immediately, but his wife goes into a coma, divorcing Laroche and suing him once she regains consciousness. One month later, Laroche's home and everything he owns is destroyed by Hurricane Andrew. Meanwhile, local Seminoles hire Laroche due to his vast knowledge of flowers and orchid poaching. However, the Seminoles only use the extract of the Ghost Orchid for illicit drug use, and not for tribal ceremonials as Laroche thought.Laroche is caught at the Fakahatchee Strand Preserve State Park and the ensuing trial captures the attention of New Yorker journalist Susan Orlean (Meryl Streep). Laroche and Susan become great friends, with Susan writing The Orchid Thief. Laroche and Susan then become romantically involved, while Susan is still married, albeit unhappily, in New York. The Orchid Thief is then optioned by Columbia Pictures.The self-loathing and agoraphobic Charlie Kaufman (Nicholas Cage) is hired to write the screenplay for The Orchid Thief. Charlie is going through melancholic depression and is not happy that his twin brother Donald has moved into his house and is mooching off him. Donald decides to become a screenwriter like Charlie and attends Robert McKee's famous seminars. Charlie, who rejects simplistic formulaic script writing, wants to ensure that his script is a faithful adaptation of The Orchid Thief. However, he comes to realize that there is no narrative to the book and that it is impossible to turn into a film, leaving Charlie with a serious case of writer's block.Meanwhile, Donald's spec script for a cliched psychological thriller, called The 3, sells for six or seven figures, while Charlie accidentally starts writing his script with self-reference. Already well over his deadline with Columbia Pictures, Charlie visits Susan (Meryl Streep) in New York for advice on the screenplay. Unable to face her, Charlie visits McKee's seminar in New York and asks him for advice and then brings Donald to New York to assist with the story structure.Donald pretends to be Charlie and interviews Susan but is suspicious of her account of events because it is too perfect. He and Charlie follow Susan to Florida where she meets Laroche. It is revealed that the Seminole only wanted the Ghost Orchid to manufacture a drug that causes fascination; Laroche introduces this drug to Susan. Laroche and Susan catch Charlie observing them taking the drug and having sex, so Susan decides that Charlie must die.She forces him at gunpoint to drive to the swamp where she will kill him. Charlie and Donald escape and hide in the swamp where they resolve their differences and Charlie's problems with women. Then, Laroche accidentally shoots Donald. Fleeing, Charlie and Donald drive off but crash into a ranger's truck which kills Donald. Charlie runs off into the swamp to hide but is spotted; Laroche is killed by an alligator before he can kill Charlie.Susan is arrested. Charlie then makes up with his mother, tells his former love interest, Amelia, that he is still in love with her, and finishes the script. It ends with Charlie in a voice-over announcing the script is finished and that he wants Gérard Depardieu to portray him in the film.",
	"links": [
		"https://www.amazon.com/Adaptation-Blu-ray-Nicolas-Cage/dp/B07GNTJN4N"
	]
}