{
	"title": "Hitch",
	"release_year": "2005",
	"runtime": "118",
	"tags": [
		"Comedy",
		"Romance",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Will Smith",
		"Eva Mendes",
		"Kevin James",
		"Amber Valletta",
		"Julie Ann Emery",
		"Adam Arkin",
		"Robinne Lee",
		"Nathan Lee Graham",
		"Michael Rapaport",
		"Jeffrey Donovan"
	],
	"staff": [
		"Andy Tennant",
		"Kevin Bisch",
		"James Lassiter",
		"Will Smith",
		"Teddy Zee",
		"George Fenton",
		"Andrew Dunn",
		"Troy Takaki",
		"Tracey Wadmore-Smith",
		"Kathleen Chopin",
		"Jane Musky"
	],
	"links": [
		"https://www.amazon.com/Hitch-4K-UHD-Will-Smith/dp/B094PCHYB2"
	],
	"votes": 337975,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzYyNzM2NzM2NF5BMl5BanBnXkFtZTcwNjg5NTQzMw@@._V1_QL75_UX190_CR0,3,190,281_.jpg",
	"description": "Alex Hitchins (Will Smith's) says that men just need that little push to get the woman of their dreams and how he helps them do that. All he needs is 3 dates and usually after that 3rd date its love.In Flashback to when Alex was in college, we see that he is not the coolest person on campus. A girl whom he loves is caught making out with another guy. Hitch vows never to fall for another girl again. That basically explains why he wanted to start the secret date Dr. business. We also see in the beginning a woman named Sara (Eva Mendes) going back to work from a short vacation with big news about a man who cheated on an heiress named Allegra Cole (Amber Valletta). Sara is doing well professionally but has no man in her life & is OK with that.Hitch's next referral is Albert who is overweight but has fallen for a girl & wants Hitch to make the girl reciprocate. The girl is non another than Allegra. Albert is her financial advisor. Hitch agrees because he can see Albert is sincere. Hitch asks Albert to impress Allegra, so she takes notice of him. At the next financial meeting between Allegra & his company, Albert stands up to his boss & advice Allegra to do what she thinks is right with her own money. The boss is shocked & Albert basically threatens to quit his job when the boss pressures him to fall in line.Albert goes to Hitch who is in his office & has a panic attack. Allegra comes along & says she is grateful to Albert & would like him to work with her. Hitch is always in the background & never in front.\nThat night Sara is at the same bar as Hitch & he saves her from a over interested man eager to get her into bed. Sara gets extremely interested in Hitch when he leaves after showing interest in her, but not really saying anything. Hitch calls her the next day and sets up a Jey ski date, which goes horribly. But Hitch and Sara do end up being a little closer together.We also see Hitch help Albert plan a day with Allegra. This time they are going to a fashion event to meet her friend Maggie. Hitch helps him learn how to dance properly, but he doesn't get it. The date isn't perfect by no means. Albert meets Maggie, who ends up being a man, so he is a bit tongue tied as to what to say. He also dances awful, and reporters capture it with their cameras, but Allegra seems to be having a good time with him.The twist now comes into play. Hitch meets a prospective client named Vance. (Jeffery Donovan) Vance says he just wants to get in bed with someone he met a lingerie store (Sara's friend Casey) and thinks Hitch will be able to help him to that fast. Hitch doesn't like this guy at all and tries to leave, but Vance thinks money can change his mind. Hitch explains that this job isn't to help men like him and leaves.We then see Sara and her boss discussing gossip that got out about Allegra being at an event with an unknown man (Albert). He is upset that Sara didn't get the scoop and wants to know what is going on. Sara finds out that Hitch is the one who got the tickets to this event for Allegra and Albert. She asks him how he knows them. He says he doesn't know them and tries to deny it.Later, Sara asks him to dinner and her boss ends up being there and they both try to get more info on Allegra and Albert. While they are eating Hitch begins to have trouble swallowing and begins to have an allergic reaction to the food. He swells up like a balloon and gets drugged up on Benedryl. Sara again tries to get more info out of him, but he doesn't really budge, but does tell him that the two are going to the Knicks game tomorrow night. Sara ends up going to the game to get photos of them for her column.The next day we see Casey upset about her date last night. She slept with the guy at the lingerie store, but he had left her in a hurry. She said she would like to kick the date Dr. who helped the man she went out with. Sara finds the jerk that Casey went out with to see who this date Dr. is. All he can tell her is where she could find him he doesn't know his name. So, she sets this date Dr. up to meet a guy friend of hers on a fake meeting. She finds out that the date Dr. is Hitch and is upset but runs off instead of asking him what is going on.She is so upset that she ends up writing a gossip article on him exploiting the situation without getting the right facts. She also includes Albert and Allegra in this so Allegra thinks that everything was an act. Albert is crushed and Hitch is ruined.\nHitch is upset that Sara didn't get the facts before writing the article. She ends up learning the truth and apologizes to Hitch, but he is too upset to accept this and blows her off. Later, we see Hitch preparing to move out of his apartment and Albert comes in to ask Hitch if he can fix this situation. Hitch is bitter about everything and thinks love is overrated. Albert tells him that Hitch was a liar for what he did to all the men he helped. He shouldn't help men out with love if he doesn't believe in it.Albert leaves upset and Hitch begins to think about everything. He decides to help Albert and runs to meet Allegra to tell her that Albert wasn't acting about how he feels for her. that all the dorky things he did on their dates was really him. Allegra believes him and she takes Albert back.Hitch then goes to Sara to tell her his feelings, but he has a difficult time. Now, he is the one needing a date Dr. to get his words right. Sara isn't buying it and tries to tell him to leave, but he doesn't. He ends up telling her how he feels about her, but Sara opens the door and there is another man there. Sara says it's too late and starts to leave with the man. Hitch goes after them, and he jumps on their car, and she finally stops. The man ends up being her brother-in-law and she takes Hitch back. They have a sweet reunion and in the end we see Albert and Allegra at their wedding. Everyone's happy."
}