{
	"title": "Kung fu",
	"release_year": "2004",
	"runtime": "99",
	"tags": [
		"Action",
		"Comedy",
		"Fantasy",
		"amazon"
	],
	"rating": 7.7,
	"actors": [
		"Stephen Chow",
		"Wah Yuen",
		"Qiu Yuen",
		"Siu-Lung Leung",
		"Xiaogang Feng",
		"Zhihua Dong",
		"Danny Kwok-Kwan Chan",
		"Tze-Chung Lam",
		"Kai-Man Tin",
		"Kang Xi Jia"
	],
	"staff": [
		"Stephen Chow",
		"Stephen Chow",
		"Kan-Cheung Tsang",
		"Xin Huo",
		"Man-Keung Chan",
		"Stephen Chow",
		"Bo-Chu Chui",
		"Jeffrey Lau",
		"Stephen Chow",
		"Ying-Wah Wong",
		"Hang-Sang Poon",
		"Angie Lam",
		"Oliver Wong"
	],
	"votes": 153067,
	"cover": "https://m.media-amazon.com/images/M/MV5BNGU2OWVlM2ItZGZlOC00Yzk2LWE1NzEtMDYwMzE4YTE5MzQ2XkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "In Shanghai during the 1930s, Brother Sum (Danny Chan Kwok-Kwan), the leader of the Deadly Axe Gang, exercises control over the city, openly killing anyone who gets in his way. Sum has no respect for the law and kills the leader of the crocodile gang (Feng Xiaogang) right in front of the police station to have complete control over the city. He leaves the mess for the cops to clean up.Pig Sty Alley is one of the poorest districts of town and hold no interest for the gangs. This is the only place where citizens can live in peace. The majority of Pig Sty Alley is owned by the Landlord and the Landlady who charge exorbitant rent from the tenants and do not pay them for any of their goods or services. The Landlord is also a pervert, forcing the young girls of the Alley to kiss him, even when they don't want to. The Landlady would arbitrarily shut off the water supply if anyone in the Alley complains.One day, two troublemakers, Sing (Stephen Chow) and Bone (Lam Chi-Chung), come to Pig Sty Alley impersonating members of the Axe Gang to gain respect. Their plan fails when the whole Alley unites against the impostors (Most residents of the Alley are trained in Martial Arts themselves), and Sing's antics attract the real gang to the scene. In the massive brawl that ensues, more than fifty gangsters are defeated by three tenants who are incognito martial arts masters.\nThe 3 masters are Coolie (Xing Yu) a Kung Fu specialist of the Tan Tui Twelve Kicks technique from the Tam School and has incredibly fast legs, Tailor (Chiu Chi-Ling) specializes in the Hung Ga Iron Wire Fist technique and fights with iron rings on his arms, and Donut (Dong Zhihua) specializes in the Eight Trigram Staff. He is a master of using staves and spears in battle.\nThe Alley respects the masters and shares their meager food supply with them to show their respect. The Landlady is not so generous and says that the masters are 3 months behind on their rent, which amounts to $90.After the fight, Sing and Bone are apprehended by Brother Sum for publicly humiliating the Axe Gang. They are hung by their arms. Sing uses his lock picking skills to escape and asks to join the gang. Sum is impressed by Sing's lock picking, so he tells them that if they kill a person they will be accepted into the gang. Asked to explain his escape skills, Sing describes his childhood: he bought a Buddhist Palm manual from a beggar (He is a fraud who tricks kids to make money for himself. He sold the 20-cent manual to Sing for $10) and trained himself to be a martial artist. Sing gave up his dream of becoming a doctor or a lawyer to learn Kung Fu.\nWhen Sing tried to defend a mute girl from bullies, he was beaten up and humiliated (the bullies urinate on him).\nThe next day, the duo returns to Pig Sty Alley and attempt to murder the Landlady (Yuen Qiu), but their efforts fail as she is a master of the Lama Pai Lion's Roar technique. She has a sonic scream that can pierce through anything. The cantankerous Landlady chases Sing, who becomes badly injured in the process after being bitten on the lips by 2 snakes and hides in a traffic control pulpit, where his multiple injuries including comically swollen lips spontaneously heal, a surprise even to him.Meanwhile, Sum hires two mystical assassins to kill the three martial artists at Pig Sty Alley. That night, the Landlady, fearing retaliation from the Axe Gang, evicts the three martial artists. In the process of leaving, one of them is murdered by the assassins, who use a magical Guqin (the weapon is in the form of a musical instrument which fires blades along with its musical notes) as their weapon, and the other two attain serious injuries during a fight. The assassins are then defeated by the Landlady and Landlord (Yuen Wah) (He is a master of Kung Fu specializing in Tai Chi. He is flexible and able to hover in midair), who are in fact martial arts masters in self-imposed retirement. Sensing an impending showdown with the Axe Gang, the Landlady and Landlord evacuate Pig Sty Alley.Sing mugs an ice cream vendor, only to realize she is the mute girl Fong (Huang Shengyi) from his childhood. For rescuing her in her childhood, the mute girl offers him the same lollipop from back when they were children. He refuses the lollipop and knocks it away, shattering it to pieces. Sing berates Bone for being unhelpful in their quest to become Axe members and forces him away.Sing is then picked up by the Axe Gang and in exchange for joining the gang, Sum orders him to break into a mental asylum to free a legendary fighter known as The Beast (Leung Siu-Lung), who is widely acknowledged as the world's top killer. The Beast is an old but incredibly strong Kung Fu master. He is rumored to be the most dangerous person alive, though his skill is disguised by his unkempt appearance. He is a master of the Toad Style from the Kwan Lun School. Sing succeeds and brings The Beast to Sum at his office.The Beast is initially flippant, and his sloppy appearance bewilders Sum, who orders his men to torture the fighter. In response, The Beast stops a bullet with his bare hands, and the Axe Gang bows in respect. The Beast then confronts the Landlady and Landlord at the casino, and they fight, with The Beast having the advantage. They manage to overpower him with a bell, through which the Landlady amplifies her lion's roar technique.Sing, having reformed, rushes in to help them by hitting The Beast with a table leg. The blow only incenses The Beast, who pummels Sing into the floor. Before he can deliver a final blow, the Landlord and Landlady grab him and flee. Sum angrily blames The Beast for letting them escape, and The Beast casually kills Sum and takes over his men.At Pig Sty Alley, Sing undergoes a metamorphosis; The Beast's thrashing has awoken his true potential as a Kung Fu genius. He quickly recovers from his wounds and suggests that the Landlord and Landlady rest. He easily defeats the Axe Gang before confronting The Beast. The two engage in a fierce brawl before The Beast uses his Toad technique to send Sing rocketing into the sky. As he falls back to earth, Sing comes to terms with the Buddha and the techniques he learned from the manual as a child and delivers the Buddhist Palm to defeat the Beast. After a final failed attack on Sing, The Beast then accepts his defeat.Sometime later, Sing and Bone open a candy store with the vendor's lollipop as the store sign. When the mute ice cream vendor walks by, Sing goes out to meet her. The beggar (suspected to be a magical traveler) (Yuen Cheung-Yan) who gave Sing the Buddhist Palm is then seen attempting to sell the Buddhist Palm manual to a young boy. The boy turns to leave until the beggar offers a variety of manuals.",
	"links": [
		"https://www.amazon.com/Kung-Fu-Hustle-English-Subtitled/dp/B0027Z837S"
	]
}