{
	"title": "Memoirs of a Geisha",
	"release_year": "2005",
	"runtime": "145",
	"tags": [
		"Drama",
		"Romance",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"Ziyi Zhang",
		"Ken Watanabe",
		"Michelle Yeoh",
		"Suzuka Ohgo",
		"Togo Igawa",
		"Mako",
		"Samantha Futerman",
		"Elizabeth Sung",
		"Thomas Ikeda",
		"Gong Li"
	],
	"staff": [
		"Rob Marshall",
		"Robin Swicord",
		"Arthur Golden",
		"Lucy Fisher",
		"Steven Spielberg",
		"Douglas Wick",
		"John Williams",
		"Dion Beebe",
		"Pietro Scalia",
		"Francine Maisler",
		"John Myhre"
	],
	"votes": 163034,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTYxMzM4NTEzOV5BMl5BanBnXkFtZTcwNDMwNjQzMw@@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "The film, set in Japan during the Showa Era, tells the story of Chiyo Sakamoto (Suzuka Ohgo as a child and by Zhang Ziyi as an adult), a poor, young Japanese girl who has been sold along with her older sister Satsu into a life of servitude by her parents when she is nine years old. Chiyo is taken in by the proprietress of a geisha house, Mother (Kaori Momoi), but Satsu is rejected and is sold to another house in the \"pleasure district\" of the Hanamachi. At the Okiya (geisha house) she meets another young girl named \"Pumpkin\" (Youki Kudoh). Both girls are sent off to geisha school. Hatsumomo (Gong Li), a beautiful and famous but cruel geisha who also lives at the Okiya blackmails Chiyo into ruining a kimono belonging to the well-known geisha Mameha (Michelle Yeoh).Chiyo runs away again, seeking sister Satsu. They arrange to meet by the bridge the following day as soon as it is dark and escape together. When she sneaks back into the Okiya, she sees Hatsumomo and a young man named Koichi (Karl Yune) having sex in the shed. Hatsumomo had known Chiyo had run off but hadn't expected her to come back. Mother hears noise in the shed and Hatsumomo shoos Koichi away and quickly asks why Chiyo has come back. Then she makes it appear that the noise was Chiyo stealing money. Facing a beating, Chiyo tells Mother that Hatsumomo was having sex with a man. Mother verifies this by reaching under Hatsumomo's kimono and slaps Hatsumomo, telling her, \"What do you think? That a geisha is free to love? Never.\" Hatsumomo never sees Koichi again.When Chiyo escapes again to run away with her sister, she is forced to use a different route. Since the Okiya gate is locked after Hatsumomo's disgrace, Chiyo climbs over rooftops until she can see the bridge in the distance. Chiyo falls from a rooftop and ends up back in the Okiya being seen to by a doctor. Mother discusses the debts Chiyo has amassed and explains that Satsu ran away that night, without waiting for Chiyo. Chiyo never sees Satsu again and Mother tells her to forget that she ever had a sister, explaining, 'We are your only family now.' Mother then places a package on her stomach, which contains a letter (read to her by Auntie; since Chiyo cannot read) reporting the death of her mother, and then, a few weeks after, her father. Chiyo feels she cannot sink lower. Her escapades have caused her to be taken out of geisha training and worked as a slave to pay off her debts.One day while crying in the street, the young Chiyo is noticed by the Chairman (Ken Watanabe) and his geisha companions. Chiyo is afraid to make eye contact with the Chairman, who says \"Don't be afraid to look at me.\" He then buys her an iced sorbet (Kakigori) and gives her his handkerchief with some money in it. Inspired by his act of kindness, Chiyo resolves to become a geisha so that she may one day become a part of the Chairman's life. She spends the money, not on food, but on prayer, wishing to see him again.Chiyo, now a young woman, is taken under the wing of Mameha, who has forgiven her for her actions as a child. Under Mameha's tutelage, Chiyo becomes a Maiko (geisha in training) and then takes the name of Sayuri, the most famous geisha in all of Gion, Kyoto. Hatsumomo becomes Sayuri's rival and seeks to destroy her. Through her work as a geisha, Sayuri reunites with the Chairman and longs to catch his attention, but instead has to lead on the Chairman's friend and business partner Nobu, who falls fast for her. Sayuri grows in popularity and Hatsumomo spreads lies and rumors to ruin Sayuri's reputation. Meanwhile Mameha starts a bidding war for Sayuri's Mizuage which will make her a full geisha. Sayuri gets named the lead dancer for the Spring Dances, where she dances wonderfully and catches the attention of bidders, including the Baron (Mameha's Danna), who invites Sayuri to his house for a party, gives her a kimono then, as he finds her so beautiful and believes he deserves a look, forcefully strips her.After the party Mameha hears what happened and believes that the Baron took Sayuri's virginity, and claims that Sayuri's bids may not come through if she is found to be \"worthless.\" Sayuri cries and tells Mameha that nothing happened and she is not worthless. That night the bid is finally placed by an elderly doctor known as Doctor Crab, for 15,000 yen-the highest Mizuage bid in history. Mother then chooses to \"adopt\" Sayuri as the heiress of the Okiya, a title that Pumpkin and Hatsumomo had been longing for.Mameha tells Sayuri later that the bid was down to two people, Dr. Crab and the Baron, but Mameha let it go to Dr. Crab because of her feelings for the Baron, despite his bid being even higher. When returning home, Sayuri finds Hatsumomo in her room, who found the Chairman's handkerchief and attempts to burn it, but unsuccessfully. Sayuri and Hatsumomo fight and accidentally start a fire, and finally to her breaking point, Hatsumomo purposely begins to burn the rest of the house and then leaves, knowing she has reached the bottom.Sayuri's prosperous life is then cut short by the outbreak of World War II and while the safety of Sayuri and Mameha is ensured by the Chairman, they must endure a life of hard labor. Sayuri and Mameha are separated, with Sayuri going to the hills to work for a kimono maker. After the war, Sayuri is reunited with Mameha, and they become geisha once more to impress an American Colonel that are going into business with Nobu and the Chairman. Sayuri meets back up with Pumpkin who is now a risque, flirty escort/prostitute (trying to act like geisha) and goes on a trip with Nobu, the Chairman, Pumpkin and the Americans to the Amami Islands. While they are conversing in an Onsen, Sayuri participates in the game 'Truth and Lies', starting to explain the \"story\" of how, when she was a little girl, a 'handsome man was kind enough to buy me a cup of sweet ice'. Before she can continue, the Chairman interrupts and changes the subject, clearly uncomfortable with her statement.Afterwards, the Colonel attempts to \"hire\" Sayuri for \"services\", but is rejected. Nobu saw the incident and confronts Sayuri (with the impression that they had made an arrangement) finally confessing his feelings and that he wants to be her Danna. Sayuri is distraught and devises a plan to humiliate herself with the Colonel in front of Nobu. She arranges for Pumpkin to bring Nobu by an abandoned theater at a predetermined time, and \"stumble\" upon Sayuri and the Colonel making love. But, because of her secret resentment of Sayuri for being adopted by Mother, Pumpkin brings the Chairman instead, claiming to Sayuri, \"Now you know how it feels\", Sayuri believes that the Chairman is lost to her forever.A few days later Sayuri discards the Chairman's handkerchief by throwing it off a cliff above the sea, and later receives a call to go to the tea-house. While waiting, Sayuri expects Nobu to arrive, but instead the Chairman comes where he finally reveals to her that he knows she is Chiyo by saying, \"Don't be afraid to look at me, Chiyo.\" He tells her that he was responsible for sending Mameha to her so that she could fulfill her dreams of becoming a geisha. Sayuri finally reveals her love to the Chairman, which she has been harboring for over fifteen years. The film ends with their loving embrace and kiss and a stroll through a beautiful Japanese garden with waterfalls and rocks.",
	"links": [
		"https://www.amazon.com/Memoirs-Geisha-Ziyi-Zhang/dp/B000I9YUYU"
	]
}