{
	"title": "Der Untergang",
	"release_year": "2004",
	"runtime": "156",
	"tags": [
		"Biography",
		"Drama",
		"History",
		"amazon"
	],
	"rating": 8.2,
	"actors": [
		"Bruno Ganz",
		"Alexandra Maria Lara",
		"Ulrich Matthes",
		"Juliane Köhler",
		"Corinna Harfouch",
		"Heino Ferch",
		"Christian Berkel",
		"Matthias Habich",
		"Thomas Kretschmann",
		"Michael Mendl"
	],
	"staff": [
		"Oliver Hirschbiegel",
		"Bernd Eichinger",
		"Joachim Fest",
		"Traudl Junge",
		"Melissa Müller",
		"Bernd Eichinger",
		"Stephan Zacharias",
		"Rainer Klausmann",
		"Hans Funck",
		"An Dorthe Braker",
		"Bernd Lepel"
	],
	"votes": 379205,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTU0NTU5NTAyMl5BMl5BanBnXkFtZTYwNzYwMDg2._V1_QL75_UY281_CR1,0,190,281_.jpg",
	"description": "In November 1942, at the Wolf's Lair in East Prussia, Fuhrer of Nazi Germany Adolf Hitler (Bruno Ganz) invites a number of young women to interview for the position of his personal secretary. Traudl Junge (Alexandra Maria Lara) is overjoyed when he chooses her. Three years later, the Red Army has pushed Germany's forces back and surrounded Berlin. On Hitler's 56th birthday, the Red Army begins shelling Berlin's city center. General Der Flieger Karl Koller (Hans H. Steinberg) of the Airforce, who was is charge of the defense of the city, is nowhere to be seen. He claims Russians are 12 Kms from the center of Berlin.Reichsfuhrer-SS Heinrich Himmler (Ulrich Noethen) tries to persuade Hitler to leave Berlin, but Hitler refuses. Himmler leaves to negotiate terms with the Western Allies in secret. SS-Brigadefuhrer Walther Hewel (Alexander Held) is a diplomat and close to Hitler and even he fails to convince him to leave Berlin. Later, Gruppenfuhrer Hermann Fegelein (Thomas Kretschmann), Himmler's adjutant, also attempts to persuade Hitler to flee, but Hitler insists that he will win or die in Berlin.SS doctor Obersturmbannfuhrer Ernst-Günther Schenck (Christian Berkel) is ordered to leave Berlin per Operation Clausewitz, though he persuades an SS general to let him stay in Berlin to treat the injured. In the streets, Hitler Youth child soldier Peter Kranz's (Donevan Gunia) father approaches his son's unit and tries to persuade him to leave. Peter, who destroyed two enemy tanks and will soon be awarded a medal by Hitler, calls his father a coward and runs away.At a meeting in the Fuhrerbunker, Hitler forbids the overwhelmed 9th Army from retreating, instead ordering Obergruppenfuhrer Felix Steiner's units to mount a counter-attack. The generals find the orders impossible and irrational, as the enemy outnumbers them 10:1. SS-Brigadefuhrer Wilhelm Mohnke (André Hennicke) is in charge of defending the govt district and Hitler orders him to stop evacuating the civilians and focus on attacking the enemy.Above ground, Hitler awards Peter his medal, hailing Peter as braver than his generals. In his office, Hitler talks to Minister of Armaments Oberbefehlsleiter Albert Speer (Heino Ferch) about his scorched earth policy. Speer is concerned about the destruction of Germany's infrastructure, but Hitler believes the German people left behind are weak and thus deserve death. Meanwhile, Hitler's companion Eva Braun (Juliane Köhler) holds a party in the Reich Chancellery. However, her brother-in-law Fegelein tries to persuade Eva to leave Berlin with Hitler, but she dismisses him. Artillery fire eventually breaks up the party.On the battlefield, General Der Artillerie Helmuth Weidling (Michael Mendl) is informed he will be executed for allegedly ordering a retreat. Weidling comes to the Fuhrerbunker to clear himself of his charges. His action impresses Hitler, who promotes him to oversee all of Berlin's defenses. At another meeting, Hitler learns Steiner did not attack because his unit lacked sufficient force. Hitler becomes enraged at what he sees as an act of betrayal and launches into a furious tirade, shouting that everyone has failed him and denouncing his generals as cowards and traitors. He finally acknowledges that the war is lost, but that he would rather commit suicide than leave Berlin.Schenck witnesses old men being executed by German military police for supposedly refusing to take part in the fighting. Hitler allows the women to leave the bunker but Eva and Junge decide to stay. Goebbels moves his wife and kids to the bunker as well, committed to fight till the end. Hitler gives cyanide pills to Junge and others who ask for it.\nHitler receives a message from Reichsmarschall Hermann Göring (Mathias Gnadinger), Luftwaffe commander-in-chief, requesting state leadership. Hitler declares Göring a traitor, ordering his dismissal from all posts and his arrest.Speer makes a final visit to the Fuhrerbunker and admits to Hitler that he has defied his orders to destroy Germany's infrastructure. Hitler, however, does not punish Speer, who decides to leave Berlin. Peter returns to find his unit dead and runs back to his parents. Hitler continues to imagine fantastic ways for Germany to turn the tide. At dinner, Hitler learns of Himmler's secret negotiations. Hearing that one of his most loyal followers has abandoned him sends him into another rage, and he quickly orders Himmler's execution. He also finds out that Fegelein has deserted his post, having him executed despite Eva's pleas. SS physician Obergruppenfuhrer Ernst-Robert Grawitz (Christian Hoening) asks Hitler's permission to evacuate for fear of Allied reprisal (he conducted medical experiments on captured PoWs and all of them unethical and illegal). Hitler refuses, leading Grawitz to kill himself and his family.The Soviets continue their advance, Berlin's supplies run low, and German morale plummets. Hitler hopes that the 12th Army, led by Lieutenant General Walther Wenck, will save Berlin. After midnight, Hitler dictates his last will and testament to Junge, before officially marrying Eva. The following morning, Hitler learns that the 12th Army is unable to relieve Berlin. Refusing surrender, Hitler plans his death (he is advised to take poison and then shoot himself). He administers poison to his dog Blondi, bids farewell to the bunker staff, and commits suicide with Eva. The two are crudely cremated with petrol in a ditch in the Chancellery Garden.Propaganda Minister Reichsleiter Joseph Goebbels (Ulrich Matthes) assumes the Chancellorship. General Der Infanterie Hans Krebs (Rolf Kanies), Chief of the Army General Staff fails to negotiate a conditional surrender with Soviet Marshal Vasily Chuikov. Goebbels declares that Germany will not surrender as long as he is alive. Goebbels' wife Magda (Corinna Harfouch) poisons her six children with cyanide, before committing suicide with Goebbels; Weidling announces unconditional surrender of German forces in Berlin afterwards. Many government and military officials including Krebs commit suicide after learning of Germany's defeat. Peter discovers his parents were executed. Junge leaves the bunker and tries to flee the city; Peter joins her as she sneaks through a group of Soviet soldiers before the two find a bicycle and leave Berlin.War ended on 8th May. 50 Million lives were lost. 6 million Hebrews were murdered in German concentration camps.",
	"links": [
		"https://www.amazon.com/Downfall-English-Subtitled-Bruno-Ganz/dp/B078HNWWV7"
	]
}