{
	"title": "Tangled",
	"release_year": "2010",
	"runtime": "100",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"amazon"
	],
	"rating": 7.7,
	"actors": [
		"Mandy Moore",
		"Zachary Levi",
		"Donna Murphy",
		"Ron Perlman",
		"M.C. Gainey",
		"Jeffrey Tambor",
		"Brad Garrett",
		"Paul F. Tompkins",
		"Richard Kiel",
		"Delaney Rose Stein",
		"Delaney Rose Stein"
	],
	"staff": [
		"Nathan Greno",
		"Byron Howard",
		"Dan Fogelman",
		"Jacob Grimm",
		"Wilhelm Grimm",
		"Roy Conli",
		"Alan Menken",
		"Tim Mertens",
		"Jamie Sparer Roberts",
		"David Goetz",
		"Douglas Rogers"
	],
	"votes": 503821,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTAxNDYxMjg0MjNeQTJeQWpwZ15BbWU3MDcyNTk2OTM@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "A magical flower with therapeutic qualities is created when a drop of sunlight falls from the sky. It helps an elderly woman named Gothel stay young. Centuries later, soldiers from the kingdom of Corona steal the flower and use it to save their pregnant and sick queen. Rapunzel, who has the flower's magic in her blond hair, is born. Her hair turns brown and loses its enchantment when Gothel stealthily enters the castle and chops off a lock. Rather, she abducts Rapunzel and rears her in a secret tower in the forest. The king and queen release sky lanterns on Rapunzel's birthday every year in the hopes that they will lead Rapunzel home.On the eve of Rapunzel's eighteenth birthday, she asks to leave the tower and explore the annual lights because she finds them fascinating, but Gothel says the outside world is too dangerous. Flynn Rider, who is being hunted by Maximus, the royal guard horse, betrays the Stabbington brothers, his criminal partners, and steals Rapunzel's intended crown from the palace. When Flynn finds the tower and seeks safety there, Rapunzel knocks him unconscious and conceals him. Having a plan, Rapunzel sends Gothel on a three-day journey to get new paint as a gift.In order to get Flynn to accompany Rapunzel to see the lanterns, Rapunzel agrees to return the crown. Threatening thugs attempt to apprehend the wanted Flynn when they stop at the Snuggly Duckling pub, but Rapunzel seduces them into showing their mercy. The thugs assist Rapunzel and Flynn in escaping when royal guards show up. Gothel discovers the crown and a wanted poster of Flynn when he returns to the deserted tower. The Stabbington brothers agree to help her locate Rapunzel. Rapunzel and Flynn find themselves stranded in a rapidly filling cave; fearing that they will drown, Flynn discloses his real name, Eugene Fitzherbert. They make their getaway after Rapunzel uses the enchanted glow of her hair to uncover a secret passageway beneath the water. In order to test Rapunzel's loyalty, Gothel gives her the crown and confronts her alone that evening. He instructs Rapunzel to give it to Eugene.The following morning, Rapunzel persuades them to make a truce after Maximus finds Eugene and tries to arrest him. After entering the kingdom, Rapunzel and Eugene go to a celebration held in honor of the \"lost princess\". Following a day of festivities, they set sail for the lake to observe the lantern release. After Rapunzel bestows the crown on Eugene, the two declare their love for one another. Eugene offers the Stabbingtons the crown and apologizes when he spots them on the shore. In order to make Rapunzel believe he left her, the brothers tie him up. Gothel rescues them by knocking them unconscious and bringing Rapunzel back to the tower when they attempt to capture her.Maximus and the thugs from the pub assist Eugene in getting out of jail after he is arrested. Rapunzel, meanwhile, discovers that she has unconsciously used the golden sun, the kingdom's standard, in her artwork all of her life. When she realizes she is the \"lost princess,\" she confronts Gothel and rebels. When Eugene reaches the tower, Gothel deceives him and stabs him. When Gothel tries to remove the shackled Rapunzel, she fights back and says she will remain with him if he lets her heal the dying Eugene. Gothel grudgingly consents, but before Rapunzel can heal him, Eugene chops off her long hair because he knows she will be held captive for the rest of her life. Gothel, horrified, ages quickly before falling from the tower and turning to dust, while Rapunzel's hair changes from blonde to brown.Rapunzel laments Eugene, but he is brought back to life by one of her tears, which still contains some of the flower's power. Rapunzel and Eugene eventually get married after they return to Corona, where the kingdom rejoices and Rapunzel is reunited with her birth parents.",
	"links": [
		"https://www.amazon.com/Tangled-Mandy-Moore/dp/B004QKNXIQ"
	]
}