{
	"title": "Madagascar",
	"release_year": "2005",
	"runtime": "86",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"amazon"
	],
	"rating": 6.9,
	"actors": [
		"Chris Rock",
		"Ben Stiller",
		"David Schwimmer",
		"Jada Pinkett Smith",
		"Sacha Baron Cohen",
		"Cedric The Entertainer",
		"Andy Richter",
		"Tom McGrath",
		"Tom McGrath",
		"Tom McGrath",
		"Christopher Knights",
		"Chris Miller"
	],
	"staff": [
		"Eric Darnell",
		"Tom McGrath",
		"Mark Burton",
		"Billy Frolick",
		"Eric Darnell",
		"Tom McGrath",
		"Mireille Soria",
		"Hans Zimmer",
		"Mark A. Hester",
		"Clare Knight",
		"H. Lee Peterson",
		"Leslee Feldman",
		"Kendal Cronkhite"
	],
	"votes": 444391,
	"cover": "https://m.media-amazon.com/images/M/MV5BYjk4OGFmZmYtYWE4NC00MzM4LTkwZTItODdhMjk3NTZjMmI5XkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "Zebra Marty (Chris Rock), Lion Alex (Ben Stiller), Hippo Gloria (Jada Pinkett Smith) and Giraffe named Melman (David Schwimmer) are inmates of the NY central zoo. Alex is the star and that makes Marty jealous. The Penguins have been digging a tunnel to escape the zoo and go to their homeland in Antarctica. One of the penguins talks to Marty and tells him of their plan to escape.\nThat night at his birthday party, Marty expresses his wish to escape to the wild by boarding a train from the Grand Central train station. Everyone laughs. That same night Melman finds Marty missing and they assume he has left. Alex, Gloria and Melman take a quick subway ride. All of the humans run in fear. Eventually the three meet up with Marty at the train station. An old woman notices Alex and starts to beat him up with her pocketbook (Hilarious scene). The penguins are at the station as well & are caught.The police surround the animals and shoot them with tranquilizer darts. They wake up in a crate on an ocean freighter in the middle of the ocean. The penguins escape their crate and take control of the ship. They decide they want to go to Antarctica. Suddenly, the penguins whip the ship completely around, causing the four boxes containing Alex, Gloria, Melman and Marty to fall off board and into the sea.Alex, Gloria, Melman and Marty wash up on the beaches of Madagascar, Africa. Melman says that they must be in San Diego so there must be humans close by. They come across a group of lemurs singing the song \"Move it\". The group is about to walk into the gathering and find out what's going on when the lemurs are attacked by \"the Foosa\" which look like hyenas. The Foosa are about to eat a little lemur named Mort (Andy Richter) when Alex steps in and scares off the Foosa.The King lemur named Julian, (Sacha Baron Cohen) and his partner Maurice (Cedric the Entertainer) introduce themselves. This is when the group finds that they have reached the wild. Alex and Marty fight. Alex blames Marty for all of this. Marty decides to separate from the group and go along on his own. Marty constructs his own drink bar.Alex gets upset and tries to sleep but can't because he hears Marty at the drink bar. Alex gets up and goes over to Marty to apologize. Marty accepts and invites Alex in the bar. The next morning, the four animals meet up with the lemurs & start having fun in the wild.\nAlex becomes hungry for his favorite food; steak. Alex then looks at Marty and the rest of the lemurs and pictures them as steak. Alex's mouth waters and he bites Marty in the butt. Alex's claws grow and the lemurs run away. Alex chases Marty but Marty gets away. Alex realizes that he has become a beast and hides.We cut to the penguins in Antarctica. We see them standing next to the ship with snow blowing in their faces. They yell out \"Well this sucks!\".\nWe go back to Alex, who has made his way to the predator side of the island. Marty makes a fence to keep others away from him since he feels he is dangerous.Back on the beach the others are upset by what happened with Alex when they see the ship and flag it down. It runs right up on the beach and the penguins get off. The animals realize they can go home now. Marty sneaks off to get Alex even though the others told him not to go near him.\nWhile Marty is trying to persuade Alex to come with him, the Foosa surround Alex and chase him, he runs into Gloria and Melman on the way and the Foosa surround them. The penguins show up and start kicking butt, although they are totally outnumbered by the Foosa and know they'll lose. Then Alex comes into the picture looking totally insane and hungry saying that its \"his kill\" he pounces on Marty and tells him to play along. Alex chases all the Foosa away and tells them this is \"HIS TURF\" and not to come back.Cut to the beach, the lemurs are having a going away party for the animals, and the penguins make Alex some sushi, which Alex likes, and they realize will keep him from wanting to eat the others.On the deck of the boat the others decide to make some stops along the way back and have some fun. Cut to the penguins sunbathing on the beach. One asks the lead penguin \"should we tell them the boat is out of gas?\" The lead penguin replies \"Just smile and wave boys, smile and wave.\"",
	"links": [
		"https://www.amazon.com/Madagascar-Eric-Darnell/dp/B079HPX5FB"
	]
}