{
	"title": "Iron Man",
	"release_year": "2008",
	"runtime": "126",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.9,
	"actors": [
		"Robert Downey Jr.",
		"Gwyneth Paltrow",
		"Terrence Howard",
		"Jeff Bridges",
		"Leslie Bibb",
		"Shaun Toub",
		"Faran Tahir",
		"Clark Gregg",
		"Bill Smitrovich",
		"Sayed Badreya"
	],
	"staff": [
		"Jon Favreau",
		"Mark Fergus",
		"Hawk Ostby",
		"Art Marcum",
		"Matt Holloway",
		"Avi Arad",
		"Kevin Feige",
		"Ramin Djawadi",
		"Matthew Libatique",
		"Dan Lebental",
		"Sarah Finn",
		"Randi Hiller",
		"J. Michael Riva"
	],
	"votes": 1141947,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTczNTI2ODUwOF5BMl5BanBnXkFtZTcwMTU0NTIzMw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Playboy and genius Tony Stark (Robert Downing Jr) has inherited the defense contractor Stark Industries from his father the legendary Howard Stark. Tony was brilliant from the beginning and built his first circuit board when he was 4 years old, his first engine at the age of 6, graduated from MIT at 17. Howard died in a car accident soon thereafter. Obadiah Stane took over the company till Tony returned to take over at the age of 21. Tony has subsequently unleashed an array of smart weapons that have changed the face of conflict forever.Journalist Christine Everhart confronts Tony in Vegas and presents evidence that his company is selling weapons to terrorists and are being used to subjugate native defenseless populations across the globe. Tony has sex with Christine.\nPepper Potts is Tony's personal assistant. Harold \"Happy\" Hogan (Jon Favreau) is Stark's bodyguard and chauffeur. J.A.R.V.I.S. (Paul Bettany) is Stark's personal AI system.Tony is in war-torn Afghanistan with his friend and military liaison, Lieutenant Colonel James Rhodes (Terrence Howard) to demonstrate the new \"Jericho\" missile. Rhodes and Tony are very good friends. The Jericho missile incorporates the new \"Repulsor\" technology and can deliver explosive payloads to multiple targets with a single missile, over a relatively large combat area.Stark is critically wounded in an ambush (where he notices that terrorists have access to weapons manufactured by his own company) and imprisoned in a cave by the terrorist group the Ten Rings. An electromagnet (powered by a heavy car battery) built by fellow captive Yinsen (Shaun Toub) keeps the shrapnel that wounded Stark from reaching his heart and killing him. Ten Rings leader Raza (Faran Tahir) offers Stark freedom in exchange for building a Jericho missile for the group, but Tony and Yinsen agree Raza will not keep his word.\nYinsen tells Tony that his weapons in the hands of terrorists is his legacy to the world.Tony and Yinsen use the components from other missiles (also manufactured by Stark Industries) and extract Palladium (a precious metal) from it. They use the limited forge facilities available to them and work meticulously.\nStark and Yinsen secretly build a powerful electric generator called an arc reactor (Tony had a large Arc reactor back home powering his factory and he has built a miniaturized version of it), to power Stark's electromagnet (instead of the bulky battery), and then begin to build a suit of armor to escape. The suit is a very basic design, heavy and bulky. It has rudimentary weapons, a flame thrower, and rocket Thrusters at the base to launch the occupant into flight. With the arc reactor, it can be powered for about 15 minutes.The Ten Rings attack the workshop when they discover what Stark is doing. Yinsen sacrifices himself to divert them while Stark's suit powers up. The armored Stark battles his way out of the cave to find the dying Yinsen, then an enraged Stark burns the terrorist's munitions and flies away, only to crash in the desert, destroying the suit.After being rescued by Rhodes, Stark returns home and announces that his company will no longer manufacture weapons. Obadiah Stane (Jeff Bridges), his father's old partner and the company's manager, advises Stark that this may ruin Stark Industries and his father's legacy. Tony reveals to Stane that he has built a new miniaturized Arc reactor. The reactor has the power to provide clean energy to the entire planet.In his home workshop, Stark builds an improved version of his suit, as well as a more powerful arc reactor for his chest. Personal assistant Pepper Potts (Gwyneth Paltrow) places the original reactor inside a small glass showcase.\nThough Stane requests details on his work, a suspicious Stark decides to keep his work to himself.At Stark's first public appearance after his return, reporter Christine Everhart (Leslie Bibb) informs him that Stark Industries weapons, including the Jericho, were recently delivered to the Ten Rings and are being used to attack Yinsen's home village. Stark also learns that Stane is trying to replace him as head of the company. Enraged, Stark dons his new armor and flies to Afghanistan, where he saves Yinsen's village and delivers a devastating blow to the Ten Rings. While flying home, Stark is shot at by two F-22 Raptor fighter jets. He phones Rhodes and reveals his secret identity in an attempt to end the attack.Meanwhile, the Ten Rings gather the pieces of Stark's prototype suit and meet with Stane, who subdues Raza and has the rest of the group eliminated. Stane has a new suit reverse engineered from the wreckage.\nSeeking to find any other weapons delivered to the Ten Rings, Stark sends assistant Virginia \"Pepper\" Potts to hack into the company computer system from Stane's office. She discovers Stane has been supplying the terrorists and hired the Ten Rings to kill Stark, but the group reneged.\nPotts later meets with agent Phil Coulson (Clark Gregg) of the \"Strategic Homeland Intervention, Enforcement and Logistics Division\", a counter-terrorism agency, to inform him of Stane's activities.Stane's scientists cannot duplicate Stark's arc reactor, so Stane ambushes Stark at home, using a sonic device to paralyze him and take his arc reactor. Left to die, Stark manages to crawl to his lab and plug in his original reactor. Potts and several S.H.I.E.L.D. (Strategic Homeland Intervention, Enforcement and Logistics Division) agents attempt to arrest Stane, but he dons his suit and attacks them.\nStark fights Stane but is over-matched without his new reactor to run his suit at full capacity. Stark lures Stane atop the Stark Industries building and instructs Potts to overload the large arc reactor there. This unleashes a massive electrical surge that knocks Stane unconscious, causing him and his armor to fall into the exploding reactor, killing him.The next day, the press has dubbed the armored hero \"Iron Man\". Agent Coulson gives Stark a cover story to explain the events of the night and Stane's death. At a press conference, Stark begins giving the cover story, but then announces that he is Iron Man, prompting the reporters to ask more questions.In a post-credits scene, S.H.I.E.L.D. Director Nick Fury (Samuel L Jackson) visits Stark at home, and, noting that Iron Man is not \"the only superhero in the world\", says he wants to discuss the \"Avengers Initiative\".",
	"links": [
		"https://www.amazon.com/Iron-Man-Plus-Bonus-Content/dp/B078YDXKRD"
	]
}