{
	"title": "The Hitchhiker's Guide to the Galaxy",
	"release_year": "2005",
	"runtime": "109",
	"tags": [
		"Adventure",
		"Comedy",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Martin Freeman",
		"Yasiin Bey",
		"Sam Rockwell",
		"Zooey Deschanel",
		"Bill Bailey",
		"Anna Chancellor",
		"Warwick Davis",
		"Su Elliot",
		"Stephen Fry",
		"Stephen Fry",
		"Richard Griffiths"
	],
	"staff": [
		"Garth Jennings",
		"Douglas Adams",
		"Karey Kirkpatrick",
		"Gary Barber",
		"Roger Birnbaum",
		"Jonathan Glickman",
		"Nick Goldsmith",
		"Joby Talbot",
		"Igor Jadue-Lillo",
		"Niven Howie",
		"Marcia Ross",
		"Joel Collins"
	],
	"votes": 209890,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTg4OWYwZjgtZDU0ZS00NjU4LTkxNjItYmYyYmUwNDU5YmM3XkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Man is the 3rd most intelligent species on planet Earth. 2nd are the dolphins who long knew about the impending destruction of the planet. They made many attempts to alert mankind, but their communications were misinterpreted as amusing attempts to punch footballs or whistle for Tid-bits. Eventually, the Dolphins give up and decide to leave mankind to its own fate. All the dolphins escape the planet at night.Arthur Dent (Martin Freeman) wakes up to find his house about to be demolished in order to make way for a bypass. He tries delaying the bulldozers by lying down in front of them while the construction crews wait.\nFord Prefect (Mos Def), a friend of Arthur's, convinces him to go to the pub with him. Ford distracts the construction crew by giving them a shopping cart full of peanuts and beer.\nAt the pub, over a pint of beer (as \"muscle relaxant\"), Ford explains that he is an alien from a planet in the vicinity of Betelgeuse. Ford tells Arthur that when he arrived on the planet, he thought cars were the dominant life form and was trying to introduce himself, when Arthur saw him and saved him from being run over. Ford says that Arthur saved his life, and now he is returning the favor.He continues that he is a journalist working on the Hitchhiker's Guide to the Galaxy, a universal guidebook, and that the Earth is to be demolished later that day (in fact within the next 12 minutes precisely) by a race called Vogons, in order to make way for a hyperspace bypass. Vogons are one of the most unpleasant races in the Galaxy, they are bad tempered, bureaucratic, officious and callous. They use bureaucracy as a cover for their laziness. One should not allow a Vogon to read poetry to you as it is widely accepted as the third worst in the Universe.\nFord inserts a Babel fish in Arthur's ear, which acts as a Universal translator.Suddenly, a Vogon Constructor Fleet appears in the sky and destroys the planet. The Vogons says that the plans for the Hyperspace expressway have been on display at the local planning office at Alpha Centauri for over 50 years. So, it is Earth's fault that they never protested.\nFord saves himself and Arthur by hitching a ride on a Vogon ship.\nFord claims that the book Hitchhiker's Guide to the Galaxy, published by corporations of Ursa Minor, is more famous than the Celestial Homecare Omnibus, better selling than 53 more things to do in zero gravity, and more controversial than Where God Went Wrong, Some More of God's Greatest Mistakes, and Who is this God Person Anyways. The Guide has already supplanted the Encyclopedia Galactica.\nFord is very particular that Arthur should have his towel on him at all times. The two are discovered and thrown out of an airlock but are picked up by the star-ship Heart of Gold, the most coveted ship in the Universe.They find Ford's \"semi-half-brother\" Zaphod Beeblebrox (Sam Rockwell), the President of the Galaxy. He has stolen the ship along with Tricia \"Trillian\" McMillan (Zooey Deschanel), an Earth woman whom Arthur had met previously at a fancy dress party (Trillian wanted to go to Madagascar with Arthur after their first meeting, but he refused citing his job and his other commitments) (at the same party Trillian met Zaphod, who tried to impress her with his \"spaceship\"), and Marvin (Warwick Davis) the Paranoid Android.\nTrillian tells Zaphod that the ship picked up Ford and Arthur by itself, when they engaged the Improbability drive. Marvin is depressed and feels that even though he has a large brain, he is only given menial tasks to perform by Zaphod.\nMeanwhile the Vogons are hunting for the Heart of Gold ship as they believe that Zaphod has been kidnapped. They send a fleet of 100 destroyers to rescue the President, whom they know has been kidnapped by himself (Zaphod has 2 faces and thus 2 personalities). Zaphod escapes the Vogons by jumping to Hyperdrive.\nZaphod warns Arthur not to reveal the destruction of Earth to Trillian. Trillian says that she always to get away, and now she is on a spaceship, surrounded by technology.Zaphod explains that he is seeking the planet Magrathea, where he believes he can discover the Question of Life, the Universe, and Everything to match with the answer \"42\" given by the supercomputer Deep Thought (Helen Mirren). Deep Thought was created by intelligent beings who wanted to know the Ultimate Answer (Deep Thought took 7.5 million years to compute the same) but were dissatisfied with the outcome. Now they wanted to know the Ultimate Question. Deep Thought had created a computer with a 10-million-year cycle to figure out the ultimate question, but nobody knew the location of this new computer. Zaphod believes that Deep Thought exists on Magrathea.\nZaphod stole the Heart of Gold to use its improbability drive to get to Magrathea through trial and error.During one of these attempts, they end up on the planet Viltvodle VI. The people of Viltvodle believe that the entire Universe was sneezed out of the nose of a being called the Great Green Arkleseizure.\nZaphod decides to visit Humma Kavula (John Malkovich), his opponent from the election. Upon learning of Zaphod's plan, Kavula announces that he has the coordinates to Magrathea.Humma demands that Zaphod brings him the Point-of-view gun created by Deep Thought, which allows the target to understand the shooter's point of view. To ensure that Zaphod returns with the gun he takes one of Zaphod's two heads hostage. As they are leaving the planet, Trillian is captured by Vogons, while she was trying to get away with Zaphod to their ship.\nThe gang travels to rescue her from the Vogon home world Vogsphere. The gang has to travel in an escape pod, as the guidance system of the Heart of Gold has been chewed up by mice.On Vogsphere, the gang battles bureaucracy, facing long lines and frustrating form processing. Trillian is outraged to learn that Zaphod signed the authorization for the destruction of Earth thinking it was a request for an autograph. As Trillian is deemed a kidnapper, she is to be fed to the Ravenous Bugblatter Beast of Traal.\nThe gang is able to complete all the forms and secure her release, just before she is fed to the beast. The gang travels back to the Heart of Gold in their escape pod.The Heart of Gold is chased by the Vogons, led by Galactic Vice-President Questular Rontok (Anna Chancellor), who is attempting to rescue Zaphod from himself. As the Heart of Gold arrives in orbit above Magrathea, Arthur triggers the improbability drive to avoid the automated missile defense systems. The missiles transform into a bowl of petunias and a sperm whale.On the planet, Zaphod, Ford and Trillian find portals that open doorways to other dimensions. They take a portal to Deep Thought. When they ask the computer whether it has calculated the ultimate question, it reveals that it designed another supercomputer to do so - Earth.\nWhen the trio finds the Point-of-View gun (If someone shoots the gun, the other person can instantly see things from the shooter's point of view), Trillian shoots Zaphod, making him understand how she feels about the destruction of Earth. She also finds out how much she loves Arthur.Arthur and Marvin miss the portal (as it closed before they could jump through it) and encounter a Magrathean called Slartibartfast (Bill Nighy), who takes Arthur on a tour of the construction floor where Earth Mark II is being built. Slartibartfast says that several custom planets are being built on the factory floor.\nSlartibartfast takes Arthur home, where the rest of the gang are enjoying a feast provided by pan-dimensional beings who resemble a pair of mice. Slartibartfast says that the entire planet Earth was commissioned by mice, the most intelligent beings on the planet. Arthur realizes he has fallen into a trap.The mice, who constructed Deep Thought, used the supercomputer to build an even larger supercomputer, the planet Earth, to determine the Ultimate Question. Believing Arthur, the last remaining supercomputer component, may hold the Ultimate Answer, the mice attempt to remove his brain. Arthur kills the mice.As the crew regroup outside the house, they are surrounded by Vogons and take shelter in a caravan as the Vogons open fire. Marvin is left outside and shot in the back of the head and uses the Point-of-View gun on the Vogons, causing them to become depressed and unable to fight. As the Vogons are taken away and Questular rejoins with Zaphod, Arthur chooses to explore the galaxy with Trillian and lets Slartibartfast finalize the new Earth without him.\nThe Heart of Gold crew decide to visit the Restaurant at the End of the Universe while Marvin points out they are going the wrong way.",
	"links": [
		"https://www.amazon.com/Hitchhikers-Guide-Galaxy-Sam-Rockwell/dp/B003QSJVGW"
	]
}