{
	"title": "Monster House",
	"release_year": "2006",
	"runtime": "91",
	"tags": [
		"Animation",
		"Comedy",
		"Family"
	],
	"rating": 6.7,
	"actors": [
		"Mitchel Musso",
		"Sam Lerner",
		"Spencer Locke",
		"Ryan Whitney",
		"Steve Buscemi",
		"Catherine O'Hara",
		"Fred Willard",
		"Woody Schultz",
		"Ian McConnel",
		"Maggie Gyllenhaal"
	],
	"staff": [
		"Gil Kenan",
		"Dan Harmon",
		"Rob Schrab",
		"Pamela Pettler",
		"Jack Rapke",
		"Steve Starkey",
		"Douglas Pipes",
		"Xavier Grobet",
		"Fabienne Rawley",
		"Adam P. Scott",
		"Scot Boland",
		"Victoria Burrows",
		"Ed Verreaux"
	],
	"votes": 141527,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTIzNjE1NDg1N15BMl5BanBnXkFtZTcwOTg2NTMzMQ@@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "12-year-old DJ Walters (Mitchel Musso) spies on his elderly neighbor, Mr. Nebbercracker (Steve Buscemi), who confiscates any item landing in his yard. Nebbercracker is harsh on kids who land on his lawn even accidentally. He yells at them, confiscates their toys or bikes and chases them off his lawn and away from his old and scary looking house.\nDJ keeps detailed logs of all incidents at Nebbercracker's house. DJ believes that there is something wrong with Nebbercracker's house, but even his own parents do not believe him.DJ's parents leave town for the weekend for a dentists' convention, leaving him in the care of Elizabeth \"Zee\" (aggie Gyllenhaal), their babysitter.\nCharles \"Chowder\" (Sam Lerner), DJ's best friend comes by to spend time with him. Chowder loses his basketball on Nebbercracker's lawn. Chowder begs DJ to retrieve the ball, as it cost $28, which Chowder had to earn by doing household chores for multiple weeks. DJ is caught by Nebbercracker while recovering it, who rages at him before apparently suffering a heart attack and being taken away by an ambulance. As soon as Nebbercracker goes down, the heater of the house comes alive and starts spewing smoke through the chimney. DJ finds a key lying on the lawn and keeps it.Zee invites her boyfriend to spend time with at DJ's house and is not at all interested in taking care of DJ.\nThat night, DJ receives phone calls from Nebbercracker's house with no one on the other end. He calls back the number and can hear ringing noises coming from Nebbercracker's house. DJ can see movement in the Nebbercracker house, even though nobody is supposed to be home.\nDJ eavesdrops on Zee's boyfriend Bones (Jason Lee), who tells Zee about losing his kite on Nebbercracker's lawn when he was younger, and that Nebbercracker supposedly ate his wife.\nZee kicks Bones out of the house for being a nuisance and he goes to the Nebbercracker's front lawn. As he uproots the grass, Bones sees his kite in the doorway of Mr. Nebbercracker's house. But he and the kite are consumed by the house as he is retrieving it.\nDJ runs over to inform Chowder that Nebbercracker is back and Bones's blood is on his hands. Chowder is at a construction site where a large crane has been left unattended, with ignition keys plugged in. Chowder is dismissive of DJ's claims and to calm him down, he offers to approach the Nebbercracker house himself. Chowder is attacked by the house when he rings the bell and manages to escape as the reach of the house does not extend beyond the front lawn. Chowder now believes DJ.The next morning, Jenny Bennett (Spencer Locke) is selling Halloween chocolates to all houses in the neighborhood. DJ and Chowder see her going to Nebbercracker's house, and they rush out to warn her, catching her before she is eaten by the house. Jenny then calls Chowder and DJ, and calls the police, but officers Landers (Kevin James) and Lester (Nick Cannon) do not believe their story.\nThe trio seek advice from Reginald \"Skull\" Skulinski (Jon Heder), who is claimed to be an expert on the supernatural. They learn that the house is a \"Domus Mactabilis\" (Latin for \"deadly home\"); a being created when a human soul merges with a structure. They assume the house is inhabited by Nebbercracker's soul. The only way to kill the house is to destroy its heart, its source of life.They conclude that the heart must be the fireplace, as DJ realizes that the chimney has been smoking since Nebbercracker died. Chowder provides a cold medicine-filled dummy that should cause the house to sleep long enough for them to douse the furnace.\nOfficers Landers and Lester thwart their plan (when they pass through the neighborhood on a drive by), and they are arrested when Landers finds the cold medicine, stolen from Chowder's father's pharmacy, inside the dummy. The cops place the trio in their car while they examine the house. The house eats Landers, Lester and the car. DJ, Chowder and Jenny escape the car but are trapped in the house.The house falls asleep (as the dummy was also with the cops when they were eaten by the house), and they begin exploring. They fall into the basement and find a collection of toys accumulated from Nebbercracker's lawn, as well as a cage containing the body of Constance the Giantess (Kathleen Turner), Nebbercracker's wife, encased in cement. The house realizes they are inside and attacks them. DJ, Chowder and Jenny force the house to vomit them outside by grabbing its uvula.Nebbercracker arrives home alive, revealing that the house is possessed by Constance. As a young man Nebbercracker met Constance, who was an unwilling member of a circus sideshow, and fell in love with her despite her obesity. After helping her escape, she and Nebbercracker began building the house. One Halloween, as children tormented her, Constance tried hurting them with an ax, but lost her footing and died in the foundations of the house; the cement buried her body. Nebbercracker finished the house after Constance's death, knowing it was what she would have wanted. Aware that Constance's spirit made the house come alive, Nebbercracker tried keeping people away by pretending to hate children.DJ tells Nebbercracker it is time to let Constance go, but she overhears. The house breaks free from its foundation and chases the group to a construction site. Nebbercracker attempts to convince Constance that she should die while holding a stick of dynamite, but Constance refuses. As she tries to eat him, Chowder fights the house off with a back hoe, causing it to fall into a pit. DJ is given the dynamite, and he and Jenny climb to the top of a crane while Chowder distracts Constance. DJ throws the dynamite into the chimney, destroying the house.The trio see Nebbercracker with Constance's spirit for the last time before she fades away. DJ apologizes to Nebbercracker for the loss of his house and wife, but Nebbercracker thanks DJ and the kids for freeing him and Constance.That night, children in their Halloween costumes are lined up at the site of Nebbercracker's house, where DJ, Chowder and Jenny help him return the toys to their owners. Jenny's parents pick her up and DJ and Chowder go trick-or-treating, which they previously thought they were too old for. Those who were eaten by the house emerge from the basement.",
	"links": []
}