{
	"title": "Live Free or Die Hard",
	"release_year": "2007",
	"runtime": "128",
	"tags": [
		"Action",
		"Thriller",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Bruce Willis",
		"Justin Long",
		"Timothy Olyphant",
		"Maggie Q",
		"Cliff Curtis",
		"Jonathan Sadowski",
		"Andrew Friedman",
		"Kevin Smith",
		"Yorgo Constantine",
		"Cyril Raffaelli"
	],
	"staff": [
		"Len Wiseman",
		"John Carlin",
		"Roderick Thorp",
		"Mark Bomback",
		"David Marconi",
		"Michael Fottrell",
		"Marco Beltrami",
		"Simon Duggan",
		"Nicolas De Toth",
		"Deborah Aquila",
		"Tricia Wood",
		"Patrick Tatopoulos"
	],
	"votes": 423493,
	"cover": "https://m.media-amazon.com/images/M/MV5BNDQxMDE1OTg4NV5BMl5BanBnXkFtZTcwMTMzOTQzMw@@._V1_QL75_UY281_CR1,0,190,281_.jpg",
	"description": "In response to the brief blackout at the FBI Cyber Division headquarters, FBI Deputy Director Miguel Bowman requests local law enforcement to bring in high-level computer hackers nationwide. NYPD detective John McClane was assigned to New Jersey to pick up Matthew Farrell. As McClane arrives, assassins sent by Thomas Gabriel, a hacker and leader of cyberterrorists, attack them, but McClane and Farrell manage to escape.On the way to Washington D.C., Farrell tells McClane he had written an algorithm for Mai Linh to crack a specific security system for white hat purposes. Meanwhile, Gabriel orders his crew of hackers to take over transportation grids and the stock market while nationally broadcasting a threatening message to the U.S. government. Farrell realizes this is a \"fire sale\", a cyber attack designed to disable the nation's infrastructure. As McClane and Farrell are driven to DHS headquarters, Linh, posing as a dispatcher, reroutes them into a helicopter ambush. McClane fends off the attackers and destroys the helicopter.McClane asks Farrell what would be Gabriel's next move, and he deduces Gabriel's next target is the power grid. They drive to a utility superstition in West Virginia. They find the superstition under the control of a team led by Linh. McClane and Farrell kill the team, and McClane kills Linh by locking her into a car that falls from an elevator shaft and explodes.While Farrell is working on the hub computer to slow the damage, he traces Gabriel and uploads his picture to Bowman. McClane learns that Bowman and Gabriel once worked together for the DOD, and Gabriel was the chief programmer for infrastructural security. He warned the department of weaknesses that made America's network infrastructure vulnerable to cyberwarfare, but he was ignored and his unorthodox methods got him fired, and he is out for revenge. Enraged over Linh's death, Gabriel redirects the natural gas pipelines to the superstition to kill McClane and Farrell, and they barely escape before a massive blackout occurs throughout the Eastern Seaboard.McClane and Farrell then travel by helicopter to the home of super hacker Frederick \"Warlock\" Kaludis in Baltimore. Warlock identifies the piece of code Farrell wrote for Linh as a means to access data at a Social Security Administration building at Woodlawn, Maryland. Doing a trace route, Warlock locates Gabriel.The Woodlawn building is actually an NSA facility intended to back up the nation's personal and financial records in the event of a cyber attack and was designed by Gabriel himself. The blackout on the FBI triggered a download of financial data to Woodlawn, which Gabriel plans to steal. Meanwhile, Gabriel taps into the connection they made, which reveals the location of McClane's estranged daughter Lucy, whom he kidnaps. McClane and Gabriel then meet - virtually - McClane telling him he will lose.McClane and Farrell race to the Woodlawn facility. Farrell finds the facility's main server and encrypts the data Gabriel's men downloaded before getting captured. Gabriel then takes Farrell and Lucy with him as he flees. McClane pursues them, hijacking their semi mobile base. Accessing the communication system of an F-35B Lightning II, Gabriel orders the pilot to attack the truck McClane is driving, but the jet is destroyed by falling debris. McClane barely survives and sees Gabriel's vehicle pull into a nearby hangar.There, Gabriel demands that Farrell decrepit the financial data. When he refuses, Gabriel shoots him and threatens to kill Lucy. McClane arrives, killing two of Gabriel's men, but he is shot and wounded by Gabriel's last man, Emerson. Gabriel positions himself behind McClane, putting the barrel of the gun in his shoulder wound. McClane then pulls the trigger. The bullet travels through McClane's shoulder and hits Gabriel in the heart, killing him instantly. Farrell then grabs a pistol and kills Emerson as the FBI arrives. Afterward, McClane thanks Farrell for saving Lucy's life, who takes a romantic interest in him.",
	"links": [
		"https://www.amazon.com/Live-Free-Hard-Bruce-Willis/dp/B000XJSL9U"
	]
}