{
	"title": "Mission: Impossible III",
	"release_year": "2006",
	"runtime": "126",
	"tags": [
		"Action",
		"Adventure",
		"Thriller",
		"amazon"
	],
	"rating": 6.9,
	"actors": [
		"Tom Cruise",
		"Michelle Monaghan",
		"Ving Rhames",
		"Philip Seymour Hoffman",
		"Billy Crudup",
		"Jonathan Rhys Meyers",
		"Keri Russell",
		"Maggie Q",
		"Simon Pegg",
		"Eddie Marsan"
	],
	"staff": [
		"J.J. Abrams",
		"Alex Kurtzman",
		"Roberto Orci",
		"J.J. Abrams",
		"Bruce Geller",
		"Tom Cruise",
		"Paula Wagner",
		"Michael Giacchino",
		"Dan Mindel",
		"Maryann Brandon",
		"Nick Gibbs",
		"Mary Jo Markey",
		"April Webster",
		"Scott Chambliss"
	],
	"votes": 395091,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzY1MzdjMjYtNDJiZS00N2U4LWI0MWQtZTRiZWYxMzU3ZmI4XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Ethan Hunt (Tom Cruise) has retired from active field work for the Impossible Missions Force (IMF) and instead trains new recruits while settling down with his fiance Julia Meade (Michelle Monaghan), a nurse at a local hospital who is unaware of Ethan's past.\nJulia's family believes that Ethan is a very boring person as none of them including Julia know about his real life as an IMF agent.Ethan is approached by fellow IMF agent John Musgrave (Billy Crudup) about a mission for him: rescue one of Ethan's proteges, Lindsey Farris (Keri Russell), who was captured while investigating arms dealer Owen Davian (Philip Seymour Hoffman). Davian is a black-market trafficker, extremely dangerous and a priority for the IMF. Normally IMF would disavow captured agents, but Farris may be their only clue to get to Davian.\nMusgrave has already prepared a team for Ethan, consisting of Declan Gormley (Jonathan Rhys Meyers), Zhen Lei (Maggie Q), and his old partner Luther Stickell (Ving Rhames), in Berlin, Germany.The team raids the warehouse where Lindsey is kept and collects two damaged computer laptops during their escape. Ethan identifies Davian's associate Brownway (Eddie Marsan) at the warehouse, who manages to escape.\nAs they flee on a helicopter, they are followed by armed helicopter gunships who try to bring the IMF chopper down. Declan manages to defeat the gunships by flying through a windmill farm. The pursuing gunships are stuck down by the rotating arms of the windmills.\nEthan discovers a micro-explosive implanted in Lindsey's head when she complains of a debilitating pain inside her skull. Before Ethan can use a defibrillator to disable the device (it takes 30 seconds to charge to defibrillator), it kills her. The micro-explosive was planted in Farris' skull through her nasal cavity.Ethan and Musgrave are reprimanded by IMF director Theodore Brassel (Laurence Fishburne). Brassel says that the explosive could have taken the entire team and finds it inexcusable that she was on-boarded the chopper without a scan. He also says that Davian is the one who brought gas centrifuge technology to Korea from Pakistan. He also sold the Toxic Five weapons system to Armahad Republic Jihad. Davian has been out of reach to the IMF and this botched operation was one more failure in that direction.Ethan learns that Lindsey mailed him a postcard before her capture and discovers a magnetic microdot under the stamp.IMF technician Benji Dunn (Simon Pegg) recovers enough from the damaged laptops to determine that Davian will be in Vatican City to obtain a mysterious object called the \"Rabbit's Foot\". Benji says that Davian also plans to sell the object to an unspecified buyer for $850 M.Ethan plans the mission to capture Davian without seeking Brassel's or Musgrave's approval. Before leaving, he and Julia have an impromptu wedding at the hospital's chapel. The team successfully infiltrates Vatican City and captures Davian. Meanwhile Ethan impersonates Davian at the charity event that he is attending, where Davian had picked up a briefcase, presumably with the Rabbit's Foot. Ethan as Davian leaves the Vatican normally, but after he escapes through the hatch of his car, he explodes it, letting everyone believe that Davian is dead.On the flight back to the United States, Davian threatens to kill Ethan and his loved ones. The briefcase had the location of Rabbit's Foot. Davian riles Ethan by revealing that he was the one responsible for Farris' death. Ethan then threatens to drop Davian out of the plane (during which Davian overhears Luther calling Ethan by his first name). After landing, Ethan learns that the microdot contains a video of Lindsey warning that she believes Brassel is working with Davian.Then the convoy taking Davian across the Chesapeake Bay Bridge-Tunnel is suddenly attacked by organized armed forces (seemingly of US military), and Davian escapes. Ethan worries for Julia's safety and races to the hospital, arriving to find that she already has been taken. Davian calls Ethan to give him 48 hours to recover the Rabbit's Foot for Julia's life, but then Ethan is captured by IMF for his rogue actions.Musgrave takes part in Ethan's interrogation, but discreetly mouths instructions for Ethan to lip-read about Shanghai, China where the Rabbit's Foot is located, and provides him with the means to escape IMF. Ethan travels to Shanghai and meets his team, which Musgrave sent there under the guise of another operation.\nEthan and his team raid the building where the Rabbit's Foot is secured and inform Davian that they have the Rabbit's Foot. Ethan goes to deliver the Rabbit's Foot alone and is forced to take a tranquilizer. While sedated, a micro-explosive is implanted in his head. Ethan awakens to find Davian holding Julia at gunpoint. Despite Ethan asserting that he brought the real Rabbit's Foot, Davian kills Julia and leaves.Musgrave then arrives and explains to Ethan that \"Julia\" was Davian's head of security (Bahar Soomekh) in a mask - the execution carried out for failing to protect Davian in Vatican City, and the mask was used in order to force Ethan to confirm the authenticity of the Rabbit's Foot - and that Julia is alive.\nMusgrave reveals himself as the mole, having arranged for Davian to acquire the Rabbit's Foot to sell to terrorist groups, after which IMF would have reason to launch a preemptive strike against the Middle East in order to \"stop the terrorists overseas and spread democracy.\" Musgrave then asks Ethan about the microdot Lindsey sent.Musgrave dials his phone for Ethan to hear Julia's voice. Ethan then bites on Musgrave's hand and knocks him unconscious, ultimately freeing himself and stealing Musgrave's phone, using it to track down the location of Musgrave's last call. Ethan finds Davian there and pushes him into the path of a truck, but not before Davian triggers the micro-explosive.\nFreeing Julia, he instructs her to electrocute him in order to deactivate the explosive, and then revive him. He also instructs her in using a gun for her protection. He jury-rigs an impromptu defibrillator to deactivate the explosive, asking Julia to bring him back. Julia kills a henchman, then Musgrave, who is carrying the Rabbit's Foot, before resuscitating Ethan. Julia successfully revives Ethan, and he explains his true IMF career to her as they leave.Brassel congratulates Ethan as he leaves for his honeymoon with Julia. Ethan is unsure if he will return to the IMF. Brassel promises that he will tell Ethan what the Rabbit's Foot is if Ethan will promise to return. Ethan smiles and walks off with Julia.",
	"links": [
		"https://www.amazon.com/Mission-Impossible-III-Tom-Cruise/dp/B000I0EOLI"
	]
}