{
	"title": "Capote",
	"release_year": "2005",
	"runtime": "114",
	"tags": [
		"Biography",
		"Crime",
		"Drama",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"Philip Seymour Hoffman",
		"Clifton Collins Jr.",
		"Catherine Keener",
		"Allie Mickelson",
		"Kelci Stephenson",
		"Craig Archibald",
		"Bronwen Coleman",
		"Kate Shindle",
		"David Wilson Barnes",
		"Michael J. Burg"
	],
	"staff": [
		"Bennett Miller",
		"Dan Futterman",
		"Gerald Clarke",
		"Caroline Baron",
		"Michael Ohoven",
		"William Vince",
		"Mychael Danna",
		"Adam Kimmel",
		"Christopher Tellefsen",
		"Avy Kaufman",
		"Jess Gonchor"
	],
	"votes": 142211,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTczMzU0MjM1MV5BMl5BanBnXkFtZTcwMjczNzgyNA@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1959, the four dead bodies of the Clutter family are discovered on their Kansas farm. While reading The New York Times, Truman Capote (Philip Seymour Hoffman) is riveted by the story and calls The New Yorker magazine editor William Shawn (Bob Balaban) to tell him that he plans to document the tragedy.\nCapote travels to Kansas, inviting childhood friend Nelle Harper Lee (Catherine Keener) to come along. He intends to interview those involved with the Clutter family, with Lee as his go-between and facilitator. Alvin Dewey (Chris Cooper), the Kansas Bureau of Investigation's lead detective on the case, brushes him off, but Dewey's wife Marie (Amy Ryan) is a fan of Capote's writing and persuades her husband to invite Capote and Lee to their house for dinner.Capote's stories of movie sets and film stars captivate Marie. Over time, her husband warms to Capote and allows him to view the photographs of the victims. The Deweys, Lee, and Capote are having dinner in Jan 1960 when the murder suspects, Perry Smith (Clifton Collins Jr.) and Richard \"Dick\" Hickock (Mark Pellegrino), are caught. Flattery, bribery, and a keen insight into the human condition facilitate Capote's visits to the prison where the accused are held.\nCapote learns that the defense lawyers persuaded Smith and Hickock to waive their rights for a prelim hearing, as that would \"curry favor with the judge\".Capote begins to form an attachment to Smith. He informs Shawn of his intent to expand the story into a full-length book. Following the trial and conviction (where both are sentenced to death), Capote gains continued access to the murderers by bribing Warden Marshall Krutch (Marshall Bell). Smith had stopped eating for a month and Capote uses his special visiting rights to feed infant food to Smith and nurse him back to health.\nCapote spends the following years regularly visiting Smith and learning about his life, excepting a year-long stint when he goes to Morocco and Spain to write the \"first three parts\" of the book, accompanied by his romantic partner Jack Dunphy (Bruce Greenwood).The story of Smith's life, his remorseful manner, and his emotional sincerity impress Capote, who becomes emotionally attached to him despite the gruesome murders. Capote aids Smith and Hickock by obtaining expert legal counsel for them and initiating an appeal in the Kansas supreme court. Still, he is frustrated, as Smith declines to relate exactly what happened on the night of the murders. Dewey is angry with Capote and threatens to hunt him down if the appeals lead to the perpetrators being let off in any way.\nSmith is also not happy with Capote as Capote will always dodge the question whether he will show his book to Smith. Capote has written a few chapters, but always lies that he has not written anything.Though initially an effort to provide proper representation and extend Capote's opportunity to speak with the killers, the appeals process drags on for several years. Without the court case being resolved, Capote feels he is stuck with a story without an ending, and he is unable to complete his book. Eventually he gets Smith to describe the killings and his thoughts at the time in great detail (Smith admits that he and Hickock entered the house on a tip that the house had $10,000 in it. In the end Smith ended up shooting everyone as there was only 50$ in the house). He has what he wants from Smith, but in the process, he sees a callousness and selfishness in his own actions. He withdraws the legal aid he has provided Smith and Hickock and leaves them to fend for themselves in the Supreme Court, their last appeal.Now with everything in hand, Capote still must wait for the appeals process to conclude before he feels he can publish his work. In the course of time, Lee's best-selling novel To Kill a Mockingbird is turned into a movie, but Capote is unable to share in the joy of his friend's success, too caught up in drinking through his own misery.With the last appeal rejected, Smith pleads for Capote to return before he is executed on Apr 14th, 1965, but Capote cannot bring himself to do so. A telegram from Smith to Harper Lee ultimately compels Capote to return to Kansas. There he is an eyewitness as Smith and Hickock are executed.Capote talks to Lee about the horrifying experience and laments that he could not do anything to stop it. She replies, \"Maybe not. The fact is you didn't want to.\" The final scenes show Capote looking through photos from the case and at the writings and drawings given to him by Smith. An epilogue points out that In Cold Blood turned Capote into the most famous writer in America, also noting that he never finished another book. He died in 1984 due to alcoholism.",
	"links": [
		"https://www.amazon.com/Capote-Philip-Seymour-Hoffman/dp/B0B1758CVX"
	]
}