{
	"title": "Charlie and the Chocolate Factory",
	"release_year": "2005",
	"runtime": "115",
	"tags": [
		"Adventure",
		"Comedy",
		"Family",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Johnny Depp",
		"Freddie Highmore",
		"David Kelly",
		"Helena Bonham Carter",
		"Noah Taylor",
		"Missi Pyle",
		"James Fox",
		"Deep Roy",
		"Christopher Lee",
		"Adam Godley"
	],
	"staff": [
		"Tim Burton",
		"Roald Dahl",
		"John August",
		"Brad Grey",
		"Lorne Orleans",
		"Richard D. Zanuck",
		"Danny Elfman",
		"Philippe Rousselot",
		"Chris Lebenzon",
		"Susie Figgis",
		"Alex McDowell"
	],
	"votes": 536886,
	"cover": "https://m.media-amazon.com/images/M/MV5BNjcxMjg1Njg2NF5BMl5BanBnXkFtZTcwMjQ4NzMzMw@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Charlie Bucket is a kind, loving boy who lives in poverty with his mother, father, and four bedridden grandparents. Directly across the street from their house is a world-famous chocolate factory, the owner of which, Willy Wonka (Jhonny Depp), has long since closed access to the factory due to problems concerning industrial espionage that ultimately led him to fire all his employees, among them Charlie's Grandpa Joe. One day, Wonka announces a contest in which five Golden Tickets have been placed in five random Wonka Bars worldwide, and the winners will be given a full tour of the factory, as well as a lifetime supply of chocolate. One ticket-holder will be given a special prize at the end of the tour.The first four tickets are found by Augustus Gloop, a greedy, gluttonous eater from Düsseldorf; Veruca Salt, a spoiled, rotten brat from Buckinghamshire; Violet Beauregarde, a boastful, competitive gum chewer from Atlanta; and Mike Teavee, an arrogant, aggressive video-game addict from Denver. Two of Charlie's attempts to find a ticket end in failure. With one ticket remaining, and his father laid off from his job at a toothpaste factory, replaced by a robot, Charlie's hopes are then broken when rumors spread that the last ticket has been found by a rich boy in Russia resulting in the end of the Golden Ticket search. Charlie then finds a dollar bill on the street and buys another Wonka Bar with it, hoping it will cheer him up. At the same time news spread that the rich boy's ticket was a fake, Charlie opens up the bar and finds, with much shock and joy, the last Golden Ticket.Chaperoned by Grandpa Joe and one of their respective parents, Charlie and the other ticket holders are greeted by Wonka, who leads the group through the facility. During the tour, each of the bad children disobeys Mr. Wonka's orders after being tempted by something related to their individual character flaws. They suffer various consequences as a result: Augustus falls into a chocolate river from which he was drinking and is sucked up a chocolate-extraction pipe; Violet chews an experimental gum and swells up into an oversized blueberry; Veruca is pushed into a garbage chute by worker squirrels after trying to take one of them as a pet, and Mike is shrunk by a Teleporter that he uses on himself. Each misfortune is accompanied by a song of morality sung by Mr. Wonka's employees, the Oompa-Loompas. The children later leave the factory, each with an exaggerated characteristic relating to their demise: Augustus covered in chocolate, Violet being juiced and becoming blue and flexible, Veruca and her father covered in garbage, and Mike being stretched by a taffy puller into a thin shape.With Charlie the last remaining child on the tour, Mr. Wonka offers him the tour's secret prize: a chance to live in the factory and work with him, revealing that the purpose of the contest was to make the least rotten child heir to the factory so he can have someone carry on his legacy when he dies. The only condition, however, is that Charlie must leave his family behind. As detailed by a series of flashbacks throughout the film, Mr. Wonka ran away from his own father, a dentist, who fitted him with oppressive orthodontic headgear and forbade him from eating candy. As a result, Mr. Wonka believes that Charlie's parents will similarly restrain Charlie's creativity as a candy-maker. Charlie refuses Mr. Wonka's offer, considering his family to be the most important thing in his life.From that moment on, Charlie and his family begin living contently, with his father being rehired at the toothpaste factory to do maintenance on the robot that replaced him, though Mr. Wonka becomes depressed. After he returns to Charlie to seek advice, Charlie helps Wonka reunite with his estranged father and repair their relationship. Afterwards, Charlie accepts inheritance of the factory and moves his whole family into the facility, becoming good friends and business partners with Mr. Wonka.",
	"links": [
		"https://www.amazon.com/Charlie-Chocolate-Factory-Johnny-Depp/dp/B0094LU9C0"
	]
}