{
	"title": "Ocean's Twelve",
	"release_year": "2004",
	"runtime": "125",
	"tags": [
		"Crime",
		"Thriller",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"George Clooney",
		"Brad Pitt",
		"Julia Roberts",
		"Catherine Zeta-Jones",
		"Ed Kross",
		"Don Tiffany",
		"Anne Jacques",
		"David Sontag",
		"Larry Sontag",
		"Andy Garcia"
	],
	"staff": [
		"Steven Soderbergh",
		"George Nolfi",
		"George Clayton Johnson",
		"Jack Golden Russell",
		"Jerry Weintraub",
		"David Holmes",
		"Steven Soderbergh",
		"Stephen Mirrione",
		"Corinne Renard-Bendjadi",
		"Debra Zane",
		"Philip Messina"
	],
	"votes": 418564,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTQ3NTIyMzczMF5BMl5BanBnXkFtZTYwMjgzNTg2._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Ocean's Eleven are living their lives separately off the fortunes of their Vegas casino heist. Terry Benedict (Andy Garcia), the owner of the three casinos, confronts each member of the team in turn, demanding the team return his money, with interest. Benedict gives the team 2 weeks to come up with original $160 MM plus $38 MM interest. They don't have enough and are short $97 MM which they must get in 14 days, or they are \"dead men\".Danny and the team decide to stage another heist to pay off the debt. Being too \"hot\" to work in the United States, they pick a European target: the world's oldest stock certificate, which was issued by the Dutch East India Company in 1602, worth around 2.5 million euros, and is kept in Amsterdam. The certificate is enough to extend their deadline. The group manages to breach the security around the certificate, in part by physically lifting the building to achieve line-of-sight. But a rival thief, the \"Night Fox\" (Vincent Cassel), beats them to the document and leaves a message for them.The Night Fox was trained by the legendary retired thief Gaspar LeMarque and believes himself to be the world's greatest thief. He is the one who revealed the identities of the 11 to Benedict. The Fox is incensed that his mentor, LeMarque, failed to correct a businessman who claimed that Danny was the best thief in the world. The Fox breaks \"rule # 1\" (revealing another thief's identity) in order to lure the team to Europe, where he can propose a challenge, since going after the same object is the only way to tell who the best thief is. Both Danny's group and the Night Fox will attempt to steal the famous Coronation Egg within a week; the first to succeed will be declared the better thief. If Danny's team wins, the Fox will pay off the team's debt to Benedict. With no other options, Danny accepts the challenge.A Europol detective, Agent Isabel Lahiri (Catherine Zeta-Jones), with a romantic link to Rusty, hears of the increased theft activity in Amsterdam. She forges her superior's signature on a request form in order to procure enough resources to track down the group. the group are captured, including Tess (Julia Roberts) masquerading as Julia Roberts, partially due to unintended interference from Bruce Willis (as himself). A U.S. official, actually Linus's mother in disguise, manages their extradition.Danny and Tess meet The Night Fox at Lake Como in Italy. At his home, the Night Fox delights in explaining how he was able to steal the egg by climbing to the roof of the Museum at dark without being detected by Danny's Recon squad. He passed through the laser grid, dances his way and avoids triggering the alarm. Danny then reveals the truth: the contest was over before it began, and the egg that the Fox stole was the fake. Danny and associate Rusty Ryan (Brad Pitt) had previously visited LeMarque and learned the location of the real egg which was transported in a military Khakhi bag instead of the armored car. LeMarque also warned Danny and Rusty to assume that the Night Fox would always have them under surveillance. Daniel wins & gets the money.It is not until the end that the viewers realize that LeMarque was actually the mastermind behind the entire operation. By deliberately making the Night Fox feel inferior to Ocean's group, he manipulates the Night Fox into entering the competition. This is \"the solution to all our problems\" that he alludes to in the meeting with Daniel and Rusty. The Night Fox is the mark, and Danny's team is essentially a pawn of LeMarque. Their task is to simply acquire the egg, and then get caught. This convinces the Night Fox that he has won, although the contest is just misdirection. Another goal of LeMarque is to be reunited with his daughter, Agent Lahiri, who had thought her father had died over a decade previously.Reuben then meets with Benedict to pay him honestly and in full. During their conversation the camera zooms in on the Night Fox in the background disguised as one of Terry Benedict's gardeners, implying that the Night Fox plans to rob Terry Benedict in order to prove himself once again and to get his money back.Isabel Lahiri joins Ocean's group in a get together afterward. She and Rusty are together again.",
	"links": [
		"https://www.amazon.com/Oceans-Twelve-George-Clooney/dp/B001EBWIR2"
	]
}