{
	"title": "Hotel Rwanda",
	"release_year": "2004",
	"runtime": "121",
	"tags": [
		"Biography",
		"Drama",
		"History",
		"amazon"
	],
	"rating": 8.1,
	"actors": [
		"Don Cheadle",
		"Sophie Okonedo",
		"Joaquin Phoenix",
		"Xolani Mali",
		"Desmond Dube",
		"Hakeem Kae-Kazim",
		"Tony Kgoroge",
		"Rosie Motene",
		"Neil McCarthy",
		"Mabutho 'Kid' Sithole"
	],
	"staff": [
		"Terry George",
		"Keir Pearson",
		"Terry George",
		"Terry George",
		"A. Kitman Ho",
		"Afro Celt Sound System",
		"Rupert Gregson-Williams",
		"Andrea Guerra",
		"Robert Fraisse",
		"Naomi Geraghty",
		"Moonyeenn Lee",
		"Richard Pagano",
		"Johnny Breedt",
		"Tony Burrough"
	],
	"votes": 375320,
	"cover": "https://m.media-amazon.com/images/M/MV5BY2FmMWRmZmQtN2IzMS00OGVmLWFmNjktMTM0YWQzODcwYTEwXkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "In 1994, nearly one million Tutsi persons, were murdered by Hutu soldiers over a conflict of land ownership. Approximately 1,000 Tutsi refugees took shelter at a luxury hotel in central Kigali owned by Sabena Airlines. Paul Rusesabagina was essentially in charge of making sure these refugees were not killed during the multiple invasions by the Hutu soldiers.\"The Tutsi were collaborators for the Belgian colonists, they stole our Hutu land, they whipped us. Now they have come back, these Tutsi rebels. They are cockroaches. They are murderers. Rwanda is our Hutu land. We are the majority. They are a minority of traitors and invaders. We will squash the infestation.\"Paul Rusesabagina, (Don Cheadle), manager of the hotel Mille Collines. Paul is a Hutu, married to a Tutsi, Tatiana (Sophie Okonedo) and has two daughters and one son. That evening he arrives home to find his wife's brother visiting with his wife and two (very) young daughters. After dinner, Paul's son runs into the living room and announces that there are soldiers in the street. Paul witnesses his innocent neighbor being dragged off by Hutu soldiers.The next evening, Hutus soldiers are burning down Tutsi houses, killing many of them in the street and what few women they do not kill, dragging off to keep as their sex slaves. He arrives at his house to find Tatiana hoarding their Tutsi neighbors in the back. The next morning the Hutus enter the house and force Paul to take them to the hotel to get money and booze. He talks them into taking the refugees (who he claims are family) with them. Hutu soldiers aware of the fact that the \"family\" are all Tutsi refugees and ready to execute all, including Tatiana and the children. Paul buys all of their lives with the $1000 and some jewelry.David (David O'Hara) is a Scottish reporter in Rwanda, accompanied by his American cameraman, Jack (Joaquin Phoenix). Jack records a taste of the brutality, getting a short bit of footage of some Hutus beating Tutsis to death with machete. Colonel Oliver (Nick Nolte), a Canadian UN official, brings some refugees to the hotel and places guards at the hotel gates. Pat Archer (Cara Seymour), an Australian Red Cross worker brings several children from the local Tutsi orphanage to the hotel, and as she is leaving to bring the rest of the children, Paul begs her to check for his brother-in-law and his family, who live near the orphanage.Pat returns that night, saying she could not find the adults, but the children were living across the street with an old woman. She then quietly tells Paul and Tatiana that when she arrived at the orphanage, the Hutus had arrived and are killing Tutsi children in order to wipe out the next generation. The next day, all those who can legally leave Rwanda are ordered to go, which essentially means every white person in Rwanda is gone. Pat stays, David and Jack leave. More troops come to Rwanda, but they will only stay as long as it takes to get the whites out of Rwanda. America and the rest of the Global Powers are - literally and intentionally - ignoring Rwanda.The hotel is now solely Tutsi and has become nothing but an upscale refugee camp. Soon they begin to run out of food and other provisions. Paul and another Hutu hotel employee, Gregoire (Tony Kgoroge) drive to one of the Hutu bases and buy supplies from them. The head of the base tells Paul that it won't be long before they kill all the Tutsis in Rwanda, and that they are already half-way there. Paul sees they are keeping naked Tutsi women in cages, calling them \"prostitutes.\"The leader tells Paul to take a certain back road because it is clear. While driving back in a very thick mist, Paul and Gregoire begin to drive over huge bumps, as if they have driven off the road and into the jungle. Paul scolds Gregoire and gets out to see how far off the course they are, only to see that they are still on the road but driving over hundreds of corpses. The Hutus have been using this road as a piling ground for all the murderedOne morning a Hutu Lieutenant arrived at the hotel at around 6 a.m. and ordered Rusesabagina to turn out everyone who had sought shelter there. Told that he had half an hour to comply with the order, he then hears on his radio that Belgian soldiers are on their way to the hotel. This is because during those 30 minutes, Paul called the president of Sabina Airlines appealing urgently for help. The Hutu Lieutenant and his men leave quickly, killing no one. Paul then has all the refugees who have powerful friends call them up, which eventually results in a few of them being able to leave. The Rusesabagina is one of these families. The day before they are to leave, Pat returns to the hotel with some supplies from the Red Cross. Paul tells her they are leaving and asks her to get his nieces from the old woman. Pat tells him that the section of the city has been razed, they are all probably dead.He asks her to go anyway. She complies. Paul tells Tatiana that if Pat is not back by 7:00 am of the morning they are to leave Rwanda, they must go without their nieces. Pat does not return in time, and so Paul makes the last-minute decision to send Tatiana and their children without him. As the caravan is driving away (with Tatiana screaming for Paul to get on the truck) we see Gregorie far down the road, informing the Hutu soldiers that the trucks are not UN supplies, as they have been told, but Tutsi refugees. The Hutus surround the truck, Oliver and his men hold them off until the Rwanda troops arrive. As it turns out, the Rwanda troops are supporting the massacres on the Tutsis, but only help the refugees at that moment because it looks good in the eyes of the UN. They then turn around and drive back to the hotel.As Oliver cannot keep his guard at the gates of the hotel, Paul seeks help from General Augustin Bizimungo (Fana Mokoena), Chief of Staff of the Rwanda Army and a Hutu who encouraged the murders of the Tutsis. Bizimungo agrees to help Paul only because he pays him in extreme amounts of jewelry and scotch. And Bizimungo figures he'll kill them eventually, anyway, so why not make some money off of keeping them alive all the while longer? While driving to get the items, Paul sees Pat's Red Cross van upside down and riddled with bullets - an implication that she is dead. While Paul is out getting help from Bizimungo, Hutu troops have invaded the hotel and are about to kill everyone when the Rwanda troops come back and get them out of there. During the madness, Paul fears his wife has committed suicide with the children (Paul instructed her to do this if it looked like they were going to be killed - he felt the children could not watch their parents die first). He finds them hiding in a shower, ready to \"shoot\" him with the shower head.They begin to run out of more sources but cannot get more. Their water sources are cut off, so they begin to drink out of the pool. When we see them next the water in the pool is significantly lower, a sign that about two or three weeks have passed. Oliver comes and tells them that he has made it possible so that all the refugees can leave. They all pack into trucks, lock up the hotel and leave. As they are leaving, the Hutus start attacking their trucks. Tutsi rebels attack the Hutus and keep them off the trucks until they can get to safety. At the refugee camp, Tatiana and Paul run around showing a photo of her brother's family, asking if anyone has ever seen them or the children. No one knows them.Paul, Tatiana and the children get are allowed on a bus that is leaving Rwanda when Pat (who is NOT dead) come running up and stops the bus. She pulls off Paul and Tatiana, taking them to the orphaned children's section, where his nieces are singing with other children. Paul, Pat and Tatiana are walking towards the bus when Pat says, \"There's no room.\" Paul responds, \"There's always room.\" The camera pulls out and they have, along with their own children and nieces, about 10 other children with them to leave Rwanda. The End.The closing credits include the information that Paul, Tatiana, their children and adopted nieces currently live in Belgium. Bizimungo was arrested for war crimes in 2002. In 1995, the Hutus were pushed into the Congo by Tutsi rebels, leaving in their trails nearly one million bodies. Also, Paul kept over one thousand refugees in the hotel, none of which were killed.",
	"links": [
		"https://www.amazon.com/Hotel-Rwanda-Don-Cheadle/dp/B09YDP1QZB"
	]
}