{
	"title": "The Good Shepherd",
	"release_year": "2006",
	"runtime": "167",
	"tags": [
		"Drama",
		"History",
		"Thriller",
		"amazon",
		"netflix"
	],
	"rating": 6.7,
	"actors": [
		"Matt Damon",
		"Angelina Jolie",
		"Robert De Niro",
		"Alec Baldwin",
		"Tammy Blanchard",
		"Billy Crudup",
		"Keir Dullea",
		"Michael Gambon",
		"Martina Gedeck",
		"William Hurt"
	],
	"staff": [
		"Robert De Niro",
		"Eric Roth",
		"Robert De Niro",
		"James G. Robinson",
		"Jane Rosenthal",
		"Bruce Fowler",
		"Marcelo Zarvos",
		"Robert Richardson",
		"Tariq Anwar",
		"Sig De Miguel",
		"Cathy Sandrich Gelfond",
		"Amanda Mackey",
		"Jeannine Oppewall"
	],
	"votes": 109185,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTU5MjExMzA1Nl5BMl5BanBnXkFtZTgwMzIxNzQxMTE@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "In 1961, senior CIA officer Edward Wilson (Matt Damon) receives a photograph and tape recording after the failed Bay of Pigs Invasion, and obtains a coded signal from \"Cardinal.\"In 1939, attending Yale University, Edward is invited to join Skull and Bones. In his initiation, he reveals that he discovered but never read the suicide note left by his father (Timothy Hutton), an admiral who was to be named Secretary of the Navy until his loyalties were questioned. FBI agent Sam Murach (Alec Baldwin) recruits Edward to expose professor Dr. Fredericks (Michael Gambon) as a Nazi spy, leading to Fredericks' resignation. Edward dates a deaf student named Laura (Tammy Blanchard), but is seduced by Margaret \"Clover\" Russell (Angelina Jolie) in 1940. General Bill Sullivan (Robert De Niro) offers Edward a post in London with the OSS.Clover's brother John (Gabriel Macht) tells Edward that Clover is pregnant with Edward's child; Laura, reading their lips, leaves. Edward marries Clover and accepts Sullivan's offer, leaving his new wife for London where he finds Dr. Fredericks (Michael Gambon), actually a British intelligence operative who recommended Edward for counter-espionage training. Special Operations Executive officer Arch Cummings (Billy Crudup) tells Edward that Fredericks' indiscreet liaisons pose a security risk; Fredericks refuses to retire quietly and is killed.In post-war Berlin, Edward collaborates with Soviet counterpart \"Ulysses\" (Oleg Stefan). Learning Clover is having an affair, Edward sleeps with his interpreter Hanna Schiller (Martina Gedeck); he realizes she is a Soviet operative and she is killed. After six years, Edward returns home to a distant Clover, preferring to be called Margaret, and helps Sullivan form the CIA with colleague Richard Hayes (Lee Pace) under Phillip Allen (William Hurt).Monitoring Soviet activity in Central America, Edward recognizes Ulysses, who sends him an agent's severed finger. Valentin Mironov (John Sessions) convinces Edward he is a high-ranking KGB defector. Edward encounters Laura and rekindles their romance, until Margaret confronts him with compromising photographs, and he ends the affair. Another Soviet defector claims he is the real Mironov and the impostor is a double-agent. Tortured and administered liquid LSD, he ridicules his interrogators before hurling himself out a window. The first defector, watching with Edward, offers to take LSD to prove his innocence, but Edward declines.At Yale, his son Edward Jr. also joins Skull and Bones and is approached by the CIA. Despite Margaret's pleas, Edward Jr. joins the agency. When he overhears Edward and Hayes discuss the upcoming Bay of Pigs invasion, Edward warns him to remain silent. Margaret moves out.In 1961, the tape recording leads CIA specialists to deduce the photograph may have been taken in Léopoldville. There, Edward realizes the photograph and tape are of his son. He meets Ulysses, who plays the unedited tape of Edward Jr. repeating the conversation he overheard to his lover Miriam (Liya Kebede), a Soviet spy, unknowingly leaking the upcoming invasion. Encouraged to spy for the Soviets in exchange for his son's protection, Edward confronts his son, who refuses to believe Miriam is a spy.\nEdward exposes Mironov as a double-agent and Cummings as a co-conspirator, who flees to Moscow. Ulysses' aide is revealed to be \"Cardinal,\" Edward's mole. Edward and Margaret arrive separately in the Congo for Edward Jr.'s wedding to Miriam; flying to the ceremony, Miriam is thrown out of a plane. Edward informs his son of her death and denies responsibility, but is shaken to learn she was pregnant.Edward meets Hayes at the new CIA headquarters, noting the lobby's Biblical inscription: \"And ye shall know the truth, and the truth shall make you free (John 8:32).\" Allen is resigning in disgrace, and the President has named Hayes the new Director of the CIA, and appoints Edward the first head of counter-intelligence.\nEdward finally reads his father's suicide note, learning that he had betrayed his country but urged his son to live a life of decency and truth. Edward sadly burns the note, and leaves his old office for his new wing in the CIA.",
	"links": [
		"https://www.amazon.com/Good-Shepherd-Matt-Damon/dp/B000P42A22",
		"https://www.netflix.com/title/70044695"
	]
}