{
	"title": "The Longest Yard",
	"release_year": "2005",
	"runtime": "113",
	"tags": [
		"Comedy",
		"Crime",
		"Sport",
		"amazon"
	],
	"rating": 6.4,
	"actors": [
		"Adam Sandler",
		"Burt Reynolds",
		"Chris Rock",
		"Nelly",
		"Michael Irvin",
		"Walter Williamson",
		"Bill Goldberg",
		"Terry Crews",
		"Bob Sapp",
		"Nicholas Turturro"
	],
	"staff": [
		"Peter Segal",
		"Albert S. Ruddy",
		"Tracy Keenan Wynn",
		"Sheldon Turner",
		"Jack Giarraputo",
		"Teddy Castellucci",
		"Dean Semler",
		"Jeff Gourson",
		"John Papsidera",
		"Perry Andelin Blake"
	],
	"votes": 198049,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTc1NTQyNDk2NV5BMl5BanBnXkFtZTcwOTE2OTQzMw@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Paul \"Wrecking\" Crewe (Adam Sandler) is a former NFL player disgraced for shaving points in a big game. He gets in an argument with his rich girlfriend, Lena (Courteney Cox), regarding his failure. He locks her in a closet, gets drunk, and goes joyriding in her Bentley Continental GT through San Diego. After completely wrecking the car and disabling several police cruisers in the process, he gets arrested and convicted for grand theft auto and driving while intoxicated and is sentenced to three years in Allenville Penitentiary in Texas.In prison, Warden Hazen (James Cromwell) asks Crewe to help the prison guards' football team. Crewe, under threat of an extra five years in prison for a falsified accusation of attacking Captain Knauer (William Fichtner), decides to help him. He informs Hazen that what his team needs is a tune-up game, in which they play a team like Appalachian State in order to boost morale. Hazen decides that Crewe, with the help of a fellow inmate, Caretaker (Chris Rock), will make a team out of the inmates for them to play as their tune-up game. He starts off with a poorly organized team, before being noticed by another prisoner, former college football star Nate Scarborough (Burt Reynolds), who decides to help him by coaching the team.Crewe, Nate and Caretaker find a rating system on the criminals (up to five stars, depending on how prone to violence they are). They all set out to find and recruit some five-star inmates: linebacker \"Battle\" (Bill Goldberg); fullback Turley (Dalip Singh Rana); and at safety, Torres (Lobo Sebastian), a chain-smoking outsider. But after realizing their team is built on power and nastiness (primarily on defense) and there are no offensive threats on the team, Crewe realizes he needs more players. Caretaker suggests that it is due to their lack of \"brothers\", as they only have one currently on their team: defensive lineman Switowski (Bob Sapp), a childlike and friendly, but large strongman.Crew approaches the black inmates, but one of them, Deacon Moss (Michael Irvin), says that none of them want to play on his team because of Crewe's point-shaving history. So, Crewe challenges Deacon to a 1-on-1 basketball game where if Crewe wins, the men will join the team. They play basketball and call their own fouls, with Crewe getting physically punished during the game. Despite Crewe losing, one of the black inmates, Earl Megget (Cornell \"Nelly\" Haynes, Jr.), is impressed by Crewe's resilience and joins the team, which Deacon allows with no consequence. Megget becomes the team's running back by impressing Crewe with his running ability.After a tip from Unger (David Patrick Kelly) that Crewe and Meggett are the only real offensive threats on the team, Captain Knauer, the guards' quarterback, decides that the guards should try to stop Megget by trying to get him to assault one of them and sticking him in solitary confinement. Three guards, Denham (Stone Cold Steve Austin), Garner (Brian Bosworth), and Engleheart (Kevin Nash) try to provoke Megget by using racial slurs and making him pick up books they dropped on the floor repeatedly. The guards give up on this after he withstands their harassment without being provoked. Witnessing this, Moss, \"Cheeseburger\" Eddy (Terry Crews), and the rest of black inmates agree to join the football team. Hazen and guards go to extreme lengths to stop Crewe's squad, even flooding their field, but the team overcomes these obstacles.Caretaker suggests that since the guards have been playing dirty, that the inmates should start acting more like criminals, such as swapping Engleheart's Anabolic steroids for estrogen pills, examining x-rays of guards with broken bones, and acquiring tapes of the guards' past games from Hazen's elderly secretary Lynette (Cloris Leachman), in exchange for Crewe playing sexual games with her and Brucie (Nicholas Turturro) caught in love with a sissy called Miss Tucker (Tracy Morgan) by camera CCTV. After watching 2 comedy videos, Scarborough plays the guard's past games videos in order to examine the guard's formation to his teammates. Without feeling conscious, Unger secretly see the activities of the inmates who were watching a movie, and he immediately told Guard Garner. To sabotage the inmates' morale, the guards Garner, Engleheart, Holland, and Lambert have Unger plant a bomb in Crewe's cell during the inmate's last practice.Crewe, deciding to stay with the team for their post-practice hype, doesn't notice Caretaker going to Crewe's cell to leave him a present. Unger, waiting for Crewe to enter his cell, doesn't notice Caretaker going into Crewe's cell. Caretaker places an old college picture of Crewe as a present on top of his radio. Caretaker listens to the \"music\" that Crewe was listening to (set up by Unger to provoke Caretaker to change the station) and does change the channel, causing the bomb to explode. Unger, still not knowing it was Caretaker, closes the cell door to keep any help from arriving. Crewe and Scarborough arrive too late and watch Caretaker burn to his death. At the funeral the next day, Crewe and the football team leave presents for Caretaker including a bible from Moss, \"Cheeseburger\" Eddy's Cheesburger with fries, Caretaker's stopwatch and whistle from Scarborough, and a picture of his mother from Crewe that he showed him a few nights before.During game day, the inmates, now calling themselves \"Mean Machine\", with gear provided by the late Caretaker, overcome a rough start, and Crewe has to help the team realize that winning the game is more important than personal grudges. One of the referees is also corrupt, and Crewe has to coerce him to make fair calls by giving up two downs to throw the ball in his groin. The first half ends with the score tied. The angered Hazen informs Crewe that if he does not lose he would be framed for the murder of Caretaker. Crewe acquiesces to Hazen's threat. After the guards score touchdowns while inflicting punishment on the inmates, while Crewe fakes an injury to leave the field. Crewe returns to the field, but the other inmates, believing he has returned to his old point-shaving ways, ignore him, and allow him to get tackled twice.After losing his helmet and still getting the first down, Crewe admits his sabotage to the other inmates, and asks for their forgiveness. United again as a team, the Mean Machine scores two touchdowns to cut the guards' lead to 35-28, but Megget injures his knee. Scarborough comes in for one play as replacement and scores a touchdown off a trick play involving a fumble called a Fumblerooski. They decide to go for the two-point conversion, and the win. As they get up to the line they seem to be confused, and Crewe and Coach start arguing in order to trick the guards. Moss gets the snap and passes it to Crewe, who scores the winning conversion. Knauer, with a newfound respect for Crewe, lets him know that he will testify that Crewe had nothing to do with Caretaker's death.Hazen admonishes Knauer for losing a fixed game and notices that Crewe is heading towards the exit along with the fans. Retrieving a sniper-rifle, he demands that Crewe be shot for attempting to escape. Knauer hesitates because of the numerous people near Crewe. Knauer sights up Crewe, but hesitates again, calling out Crewe's name to get him to stop. As Crewe picks up the game football and returns back, Knauer angrily hands the rifle back to Hazen and leaves, while Crewe gives the game ball to Hazen, telling them to place it in his trophy case.\nMoss and Battle pour a cooler of Gatorade on Hazen in a mockery of a typical football game celebration. Hazen angrily shouts that they will receive a week in the hotbox. Battle yells back, \"Who gives a s**t!\"",
	"links": [
		"https://www.amazon.com/Longest-Yard-Peter-Segal/dp/B0B8QHVX48"
	]
}