{
	"title": "Pirates of the Caribbean: Dead Man's Chest",
	"release_year": "2006",
	"runtime": "151",
	"tags": [
		"Action",
		"Adventure",
		"Fantasy",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Johnny Depp",
		"Orlando Bloom",
		"Keira Knightley",
		"Jack Davenport",
		"Bill Nighy",
		"Jonathan Pryce",
		"Lee Arenberg",
		"Mackenzie Crook",
		"Kevin McNally",
		"David Bailie"
	],
	"staff": [
		"Gore Verbinski",
		"Ted Elliott",
		"Terry Rossio",
		"Stuart Beattie",
		"Jay Wolpert",
		"Jerry Bruckheimer",
		"Hans Zimmer",
		"Dariusz Wolski",
		"Stephen E. Rivkin",
		"Craig Wood",
		"Denise Chamian",
		"Rick Heinrichs"
	],
	"votes": 778027,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTcwODc1MTMxM15BMl5BanBnXkFtZTYwMDg1NzY3._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The wedding for Will Turner (Orlando Bloom) (A blacksmith-turned-pirate) and Elizabeth Swann (Keira Knightley) (Governor Swann's daughter) is disrupted with the arrival of Lord Cutler Beckett (Tom Hollander) of the East India Trading Co. who has warrants to arrest the two and the ex-Commodore James Norrington (Jack Davenport) for helping Captain Jack Sparrow (Johnny Depp) to evade his hanging. Jack Sparrow is pirate captain of the Black Pearl. He is hunted by the Kraken because of his unpaid debt to Davy Jones. He is also searching for the Dead Man's Chest to free himself from Jones' servitude\nElizabeth is imprisoned while Beckett negotiates with Will to locate Jack and retrieve his compass which has the ability to point in the direction of what a person most desires. Beckett offers Jack a full pardon, and a Letter of Marque, which would make Jack a privateer in the employ of England.At the same time, Jack Sparrow reveals to his crew on The Black Pearl that they are going to find a mysterious key. The crew is getting anxious since the Royal Navy is chasing them and Jack hasn't stolen anything valuable in ages. Jack convinces the crew that whatever the key unlocks is very valuable.\nJack is approached by a reincarnated Bootstrap Bill Turner (Stellan Skarsgard), Will's long-deceased father, who reveals he is now part of the crew of The Flying Dutchman captained by Davy Jones (Bill Nighy), and Jack must pay his debt to him. Jack had asked Jones to raise his ship (Black Pearl) from the depths and make him captain for thirteen years, which Jones did and now it is time for Jack to pay his debt (which is to serve on board Davy Jones's ship for 100 years). Bootstrap further tells Jack that the Kraken will be sent after him if he is unable to pay back.\nDavy Jones was once a human being. Unable to bear the pain of losing his true love, he carved out his heart and put it into the Dead Man's Chest, then buried it in a secret location. He has become a bizarre creature - part octopus, part crab, part man - and collects the souls of dead or dying sailors to serve aboard his ship for one hundred years.Will searches for Jack, eventually finding the Black Pearl on Pelegosto. Jack, Will and surviving crew members are on the island, where they were in the custody of cannibals. The Pelegosto believe that Jack is their God and they want to do him the honor of releasing him from his fleshy prison. The crew were kept in a cage made of bones, hanging over a deep crevice. Both Jack and the crew manage to escape and get to the Black Pearl.\nWill wants Jack to sail to Port Royal to secure Elizabeth's freedom, but Jack only agrees to help Will if he helps him secure the key. Jack steers the Black Pearl near the coastlines and away from the open ocean due to the fear of the Kraken.Elizabeth secures her release at gunpoint and is sent off by Beckett to offer Letter of Marque to Jack in return for the compass. Beckett says that Elizabeth can choose to save either Will or Jack, as there is only one pardon, but he wants the compass.\nJack visit voodoo priestess Tia Dalma (Naomie Harris), who tells them that the key unlocks the Dead Man's Chest where Davy Jones' cut-out heart is hidden; the key is in possession of Jones. Tia also gives Jack a jar of dirt to protect him from Jones, since Jones is cursed to touch land only once every 10 years.\nUpon finding the Flying Dutchman, Jack sends Will aboard to \"settle\" his debt with Jones. Jack hoped that Jones would accept Will's soul as payment in exchange for his own. Jones refuses the offer and confronts Jack on the Black Pearl. Jack barters with Jones to free his debt if Jack can give 100 souls to Jones in 3 days. Jack even agrees to leave Will behind a goodwill gesture and security that Jack will deliver on his promise.\nWill finds Bootstrap on the ship. Nobody knows the location of the key, so Will challenges Jones to a game of dice, waging his lifetime of servitude against the key. Jones is forced to show the key which is kept on his person at all times. Bootstrap enters the game and loses the game of dice, but now Will knows the location of the key and is free to leave the ship.\nWill manages to steal the key from Jones while he is sleeping and escapes the ship with the promise to rescue Bootstrap.\nJack and his crew stop in Tortuga, where Elizabeth and a drunken Norrington join them. Norrington wants to kill Jack but is too drunk to even shoot straight. Elizabeth wants to find Will, but Jack convinces her that finding the chest of Davy Jones is the quickest way to saving Will. Since Jack's heart is muddled, he reckons that the compass in hands of Elizabeth will give them a clear reading. Jack says that whoever controls the chest will control Davy Jones and hence saving Will, who is in Jones's custody.Jack and his first mate Joshamee Gibbs (Kevin McNally) realize (when Elizabeth tells them that Will is working for Beckett) that Beckett wants the compass to seek the chest and use Jones' heart to control him and destroy all piracy on the seas. Norrington asks Elizabeth to think about how Will ended up on Jones's ship.Will finds refuge on a trading ship, but it is destroyed by the Kraken. Will hides on the Flying Dutchman where Jones decides to go after the chest and secure it.\nThe Black Pearl sails to Isla Cruces where the chest is buried, and Jack, Elizabeth and Norrington recover it. Will arrives with the key, planning to stab the heart to free his father, unaware that whoever stabs the heart becomes the next captain of the Flying Dutchman. Norrington wants the heart to regain his position in the Navy, while Jack is primarily interested in becoming immortal, able to sail the ocean waters for all time.Quickly, the argument about the heart's fate flares tempers, and a three-way sword fight breaks out between Jack, Will and Norrington. While Pintel (Lee Arenberg) and Ragetti (Mackenzie Crook) try to steal the chest, Jones' crew arrives on the island, forcing Elizabeth, Pintel and Ragetti to fight them together, causing the chest to be dropped.\nJack unlocks the chest, finds the heart inside, and hides it in the jar of dirt Tia Dalma gave him. Norrington spirits away the heart and the Letters of Marque, Jack believing the heart is still in the jar. The chest itself is retrieved by Davy's men and taken to the Flying Dutchman.Later, the Flying Dutchman attacks the Black Pearl which escapes the Dutchman until then attacked by the Kraken. Jack tries to flee when he realizes that the heart is not in the jar, but returns to help defeat the Kraken, wounding it with an explosion, but the ship is heavily damaged and most of the crew are dead, leaving only Jack, Will, Elizabeth, Gibbs, Pintel, Ragetti, Cotton (David Bailie) and Marty (Martin Klebba).Jack orders everyone to abandon ship, but Elizabeth, having realized that the Kraken is only after Jack and not the ship or crew, chains him to the mast to ensure everyone else's escape.Jack frees himself, but the Kraken rises up behind him. In a final act of defiance, Jack launches himself into the Kraken's maw, and the monster takes the Pearl down to the depths, which Jones watches from his telescope. Jones then opens the chest to find the heart missing, which is delivered to Beckett by Norrington.\nThe surviving members of the Black Pearl return to Tia Dalma, who suggests they retrieve Jack from the afterlife, but recommends a captain who knows those waters.\nThen, to everyone's surprise, a resurrected Captain Barbossa (Geoffrey Rush) arrives, asking about the fate of \"his\" ship.",
	"links": [
		"https://www.amazon.com/Pirates-Caribbean-Dead-Mans-Chest/dp/B004IF4PNQ"
	]
}