{
	"title": "Coraline",
	"release_year": "2009",
	"runtime": "100",
	"tags": [
		"Animation",
		"Drama",
		"Family",
		"amazon"
	],
	"rating": 7.8,
	"actors": [
		"Dakota Fanning",
		"Teri Hatcher",
		"Teri Hatcher",
		"Teri Hatcher",
		"John Hodgman",
		"John Hodgman",
		"Jennifer Saunders",
		"Jennifer Saunders",
		"Dawn French",
		"Dawn French",
		"Keith David",
		"Robert Bailey Jr.",
		"Ian McShane",
		"Ian McShane",
		"Aankha Neal",
		"George Selick"
	],
	"staff": [
		"Henry Selick",
		"Henry Selick",
		"Neil Gaiman",
		"Claire Jennings",
		"Bill Mechanic",
		"Mary Sandell",
		"Henry Selick",
		"Bruno Coulais",
		"Pete Kozachik",
		"Christopher Murrie-Green",
		"Ronald Sanders",
		"Cathy Kalmenson",
		"Linda Lamontagne",
		"Henry Selick"
	],
	"votes": 271596,
	"cover": "https://m.media-amazon.com/images/M/MV5BMzQxNjM5NzkxNV5BMl5BanBnXkFtZTcwMzg5NDMwMg@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Eleven-year-old Coraline Jones and her parents, Charlie and Mel, move from Pontiac, Michigan, to the Pink Palace Apartments, an old Victorian house in Ashland, Oregon. While searching for an old well, she encounters a mysterious black cat and Wyborn \"Wybie\" Lovat, the grandson of Coraline's landlady, who gifts her a rag doll that eerily resembles her. With her parents preoccupied with work, Coraline explores the house and discovers a small door with a brick wall behind it in the living room. That night, she finds that the brick wall has been replaced by a tunnel, which leads her to an \"Other World,\" where her parents' button-eyed doppelgangers shower her with delicious food and attention.Upon waking in the morning, Coraline finds herself back in the real world. She meets her other neighbors: Mr. Bobinsky, an eccentric Russian liquidator-turned-gymnast who owns a mouse circus, and retired burlesque performers April Spink and Miriam Forcible. Wybie tells Coraline about his grandmother's twin sister, who disappeared when they were children.Coraline returns to the Other World that night and meets a mute Other Wybie. When she returns again, the cat, who can travel between the worlds, arrives and warns her about the Other World. The Other Mother later offers Coraline a chance to stay in the Other World forever, on the condition that buttons are sewn onto her eyes. Horrified, Coraline tries to sleep, but she remains in the Other World. When she attempts to escape, the Other Mother transforms into a taller, skeletal form and imprisons her in a dark room through a mirror.In the dark room, three ghost children, one of whom Coraline recognizes as the landlady's missing sister, reveal that the Other Mother is an evil entity called the \"Beldam.\" She used rag dolls to spy on their unhappy lives and lure them into the Other World with treats and games. They allowed her to sew buttons over their eyes, and she subsequently locked their souls inside the mirror. After Coraline promises to help the ghost children by retrieving their eyes, the Other Wybie sends her home.Back in the real world, Wybie asks Coraline for the doll, as it belongs to his grandmother's missing sister. Coraline attempts to explain the situation to him, but he disbelieves her and runs out in fear. Coraline borrows an adder stone from Spink and Forcible, and after the cat informs her that the Beldam has kidnapped her parents, the two set out to rescue them. Knowing that the Beldam loves games, Coraline proposes a deal: if she finds her parents and the eyes of the ghost children, the Beldam will set them all free; if not, she will stay and allow the Beldam to sew buttons on her eyes.The Beldam reveals that each of the missing eyes is hidden within the three \"wonders\" she designed for Coraline. Using the adder stone, Coraline finds and collects each eye, freeing the spirits of the ghost children. The Other World begins to fade until only the house remains. The Beldam, now a spider-like monster, challenges Coraline to find her parents. Realizing they are trapped in a nearby snow globe and that the Beldam will not let her go, Coraline throws the cat to distract her and narrowly escapes through the door with the ghost children's help, severing the Beldam's hand in the process. Coraline's parents return with no recollection of being kidnapped, and she warmly embraces them.That night, the ghosts warn Coraline that the Beldam is still after the cursed key. As Coraline heads toward the backyard well to dispose of it, the Beldam's severed hand sneaks into the real world and attempts to drag her back in. Wybie, having realized Coraline was right, comes to the rescue and destroys the hand. Together, they throw the key and the hand's remains into the well. The next day, the Jones family hosts a garden party for the Pink Palace residents. Wybie accompanies his grandmother to the party, as Coraline begins to tell her about her missing sister's fate.",
	"links": [
		"https://www.amazon.com/Coraline-Dakota-Fanning/dp/B002BWCJOA"
	]
}