{
	"title": "Happy Feet",
	"release_year": "2006",
	"runtime": "108",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"amazon"
	],
	"rating": 6.4,
	"actors": [
		"Elijah Wood",
		"Brittany Murphy",
		"Hugh Jackman",
		"Robin Williams",
		"Robin Williams",
		"Carlos Alazraqui",
		"Lombardo Boyar",
		"Jeffrey Garcia",
		"Johnny A. Sanchez",
		"Nicole Kidman",
		"Hugo Weaving"
	],
	"staff": [
		"George Miller",
		"George Miller",
		"John Collee",
		"Judy Morris",
		"Warren Coleman",
		"Bill Miller",
		"George Miller",
		"Doug Mitchell",
		"John Powell",
		"David Peers",
		"Christian Gazal",
		"Margaret Sixel",
		"Kristy Carlson",
		"Mark Sexton"
	],
	"votes": 202460,
	"cover": "https://m.media-amazon.com/images/M/MV5BNjViZDZhNjctM2MwOS00MDdhLWIwMTYtNjNmNGY2OGMzZWZhXkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Every emperor penguin attracts a mate by singing a unique \"heartsong\". If the male penguin's heartsong matches the female's song, the two penguins mate. Norma Jean, a female penguin, falls for Memphis, a male penguin and they become mates. They lay an egg, which Memphis cares for while Norma Jean leaves with the other females to fish. While the males struggle through the harsh winter, Memphis briefly drops the egg. The resulting chick, Mumble, is unable to sing but can tap dance. Nevertheless, he is enamored with Gloria, a female penguin who is regarded as the most talented of her age. One day, Mumble encounters a group of hostile skua, with a leader who is tagged with a yellow band, which he says is from an alien abduction. Mumble narrowly escapes the hungry birds by falling into a crevice.Now a young adult, Mumble is frequently ridiculed by the elders and their leader Noah. After escaping from a leopard seal attack, Mumble befriends five Adelie penguins named Ramón, Nestor, Lombardo, Rinaldo and Raul, known collectively as \"the Amigos\", who embrace Mumble's dance moves and assimilate him into their group. After seeing a hidden human excavator in an avalanche, they opt to ask Lovelace, a rockhopper penguin, about its origin. Lovelace has the plastic rings of a six pack entangled around his neck, saying that they have been bestowed upon him by mystic beings.For the emperor penguins, it is mating season and Gloria is the center of attention. The Amigos unsuccessfully attempt to help Mumble win her affection by having Ramón sing a Spanish version of \"My Way\" behind Mumble, with the latter lip syncing. After Mumble desperately begins tap dancing in synch with her song, she falls for him and the youthful penguins join in for singing and dancing to \"Boogie Wonderland\". The elders are appalled by Mumble's conduct, which they see as the reason for their lean fishing season. Memphis begs Mumble to stop dancing, for his own sake, but when Mumble refuses, he is exiled.Mumble and the Amigos return to Lovelace, only to find him being choked by the plastic rings. Lovelace confesses they were snagged on him while swimming off the forbidden shores, beyond the land of the elephant seals. Not long into their journey, Gloria encounters them, wishing to become Mumble's mate. Fearing for her safety, he ridicules Gloria, driving her away.At the forbidden shore, Mumble, Lovelace and the Amigos are attacked by the two orcas, during which Lovelace gets free from the plastic rings. After escaping, they find a fishing boat. Mumble exhaustingly pursues it alone, eventually washing up on the shore of Florida, where he is rescued and kept at Sea World with Magellanic penguins. After a long and secluded confinement in addition to fruitlessly trying to communicate with the humans, he nearly succumbs to madness. When a girl attempts to interact with Mumble by tapping the glass, he starts dancing, which attracts a large crowd. He is released back into the wild, with a tracking device attached to his back. He returns to his colony and challenges the will of the elders. Memphis reconciles with him, just as a research team arrives, verifying Mumble's statements of \"aliens\" existing. The entire colony engages in dance in front of the research team, whose expedition footage prompts a worldwide debate, which eventually leads to the banning of all Antarctic overfishing, satisfying both the emperor penguins and the Amigos.",
	"links": [
		"https://www.amazon.com/Happy-Feet-Elijah-Wood/dp/B001XUNOSQ"
	]
}