{
	"title": "Layer Cake",
	"release_year": "2004",
	"runtime": "105",
	"tags": [
		"Action",
		"Crime",
		"Drama",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"Daniel Craig",
		"Sienna Miller",
		"Michael Gambon",
		"Tom Hardy",
		"Jamie Foreman",
		"Sally Hawkins",
		"Burn Gorman",
		"Brinley Green",
		"George Harris",
		"Tamer Hassan"
	],
	"staff": [
		"Matthew Vaughn",
		"J.J. Connolly",
		"Adam Bohling",
		"David Reid",
		"Matthew Vaughn",
		"Ilan Eshkeri",
		"Lisa Gerrard",
		"Ben Davis",
		"Jon Harris",
		"Leo Davis",
		"Jina Jay",
		"Kave Quinn"
	],
	"votes": 198466,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTI5MTE1OTAzOV5BMl5BanBnXkFtZTcwNDc2OTgyMQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The protagonist XXXX (otherwise unnamed) (Daniel Craig) is a London cocaine distributor who abhors violence and operates with the care and professionalism of a legitimate businessman. His chief associates are his enforcer and partner Morty (George Harris) (& Terry (Tamer Hassan)), and Gene (Colm Meaney), an Irish gangster who serves as XXXX's liaison to mob boss Jimmy Price (Kenneth Cranham). Clarkie (Tom Hardy) is his chemist and cuts the drugs for him.\nJust as XXXX is ready to retire from criminal life, Jimmy summons him to a lunch meeting and gives him two tasks to perform.The first is to track down Charlie (Nathalie Lunghi), the drug-addicted runaway daughter of one of Price's friend Eddie. XXXX enlists two con men, Cody (Dexter Fletcher) and Tiptoes (Steve John Shepherd), to find Charlie; they learn that Charlie has apparently been kidnapped (and her boyfriend is found dead, OD on drugs), but are unable to figure out who abducted her.The second task is for XXXX to oversee the purchase of one million ecstasy tablets from the \"Duke\" (Jamie Foreman), a low-level criminal who recently returned to London from Amsterdam with his girlfriend Slasher (Sally Hawkins) and crew of thugs led by his right-hand man Gazza (Burn Gorman). Duke wants $5 per pill, but XXXX walks away as Duke is asking too much. He wants Duke to come to his senses on the asking price.\nUnbeknownst to XXXX, the Duke and his crew have stolen the pills from a gang of Serbian war criminals. XXXX meets the Duke's feckless nephew, Sidney (Ben Whishaw), and finds himself attracted to Sidney's girlfriend Tammy (Sienna Miller). XXXX tries to broker the sale of the pills to Liverpool gangsters Trevor (Louis Emerick) and Shanks (Stephen Walters) but they refuse, informing him of the pills' origin and that the vengeful Serbians have sent an assassin, Dragan (Dragan Micanovic), to recover the pills and kill the thieves. As the Duke had mentioned his name to the Serbians, XXXX is also a target.\nTrevor and Shanks offer XXXX $2.5 per pill, as they are stolen good, with Dragan after it.As XXXX tries to track Duke down, he disappears. Jimmy is furious as the deal seems to be going south. Morty loses his cool and takes it out on one of his informants Freddie Hurst (Ivan Kaye). He disappears after that. Duke is killed by a mysterious person, presumably Dragan.\nGene tells XXXX about the history between Morty and Eddie. They were disposing off a body together for Crazy Larry (Jason Flemyng), many years ago. Eddie was close to Larry but fell asleep at a red light. Morty was in the back with the body, and both were arrested. Morty did 10 yrs and Eddie did 3. Gene tells XXXX that he was the one who killed Larry all those years ago since Jimmy never liked him. He shows him the gun he used to killed Larry.\nMeanwhile Dragan calls XXXX and wants the drugs back. Duke had said in Amsterdam that he worked for XXXX. Meanwhile Duke has gone missing, and Gazza tells Gene to find a buyer in 48 hrs or the drugs are gone.XXXX arranges a tryst with Tammy but is kidnapped and brought to Eddie Temple (Michael Gambon), a wealthy crime lord. Eddie explains that Charlie is his daughter, whom he has recovered; Jimmy, having recently lost a fortune due to bad investments he blames on Eddie (Eddie hosted a golf tournament where Jimmy met Eddie's friend from some African country, who promised a fortune in commodities in exchange for hard currency investments. Jimmy invested 13 MM pounds. But then the communists took over and Jimmy lost all his money), wanted her as a hostage until Eddie recouped his losses by going to Switzerland to negotiate the return of the money with the minister.\nEddie gives XXXX a recording, revealing that Jimmy has been working as an informant for Scotland Yard, planning to betray XXXX to the police once the pills were sold in exchange for immunity for his own crimes and XXXX's money (which was parked with Jimmy's accountant for laundering). Eddie demands that XXXX sell him the pills instead, for $3 per pill. If XXXX agrees, he will break the deal with Trevor and Shanks, who won't like it either.XXXX assassinates Jimmy at his home (using the same gun that Gene used to kill Larry), but later finds that his accountant, an associate of Jimmy's, has vanished along with XXXX's money (about 1 MM pounds that the accountant was supposed to launder for XXXX and return to him as legit). Via Tammy, XXXX had a clue of where Sidney was, and he asked Terry to follow him. Terry reports that Sidney is parked near a garage and is not venturing out very far from that location.\nConfronted by Gene (who found the ballistics report and figured out that XXXX stole his gun) and Morty, he shares the evidence of Jimmy's betrayal, and the pair acknowledge him as the new acting boss. Gene shows them the corpse of the Duke, who was killed by one of his men when Slasher threatened to go to the cops if Jimmy did not help them out of their situation.\nXXXX hires a hit-man to ambush and kill Dragan (XXXX had fixed up a meeting with Dragan to clear out any misunderstanding), but Dragan kills the hit-man first and makes XXXX promise to recover the pills.Sidney brings XXXX to Duke's old hideout, and as he tries to bargain with Gazza for the pills, the police arrive. XXXX and the Duke's gang barely escape the raid, while Dragan watches from afar as the pills are confiscated. However, it turns out that XXXX arranged for the raid, with Cody and Tiptoes posing as officers to secure the pills. XXXX delivers the Duke's severed head to Dragan as a peace offering; satisfied, Dragan reports to the Serbians that the police have seized the drugs. The Serbians accept the loss, which is revealed to be a small amount in comparison to their overall manufacturing capacity.When XXXX and his crew arrive at Eddie's warehouse to sell the pills as arranged, Eddie's henchmen relieve them of the drugs at gunpoint, and Eddie welcomes him to the \"layer cake\" of criminal hierarchy. Having anticipated this double-cross, XXXX arranges Trevor and Shanks to gun down Eddie's men in an armed robbery, take the drugs, and sell them so he can settle his accounts. The gang assembles for lunch at the Stoke Park Country Club, honoring their new boss; however, XXXX declines their offer of leadership and follows through on his initial plan to retire. With Tammy on his arm, he exits the club, but is shot by the jilted yet apologetic Sidney. XXXX collapses, bleeding out on the steps.",
	"links": [
		"https://www.amazon.com/Layer-Cake-Daniel-Craig/dp/B000LPIDS0"
	]
}