{
	"title": "The Da Vinci Code",
	"release_year": "2006",
	"runtime": "149",
	"tags": [
		"Mystery",
		"Thriller",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Tom Hanks",
		"Audrey Tautou",
		"Jean Reno",
		"Ian McKellen",
		"Paul Bettany",
		"Alfred Molina",
		"Jürgen Prochnow",
		"Jean-Yves Berteloot",
		"Etienne Chicot",
		"Jean-Pierre Marielle"
	],
	"staff": [
		"Ron Howard",
		"Akiva Goldsman",
		"Dan Brown",
		"John Calley",
		"Brian Grazer",
		"Ron Howard",
		"Hans Zimmer",
		"Salvatore Totino",
		"Daniel P. Hanley",
		"Mike Hill",
		"Janet Hirshenson",
		"Jane Jenkins",
		"Allan Cameron"
	],
	"votes": 463636,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjIxMjQyMTc3Nl5BMl5BanBnXkFtZTcwMTA1MDUzMw@@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "Louvre curator and Priory of Sion grand master Jacques Saunière is fatally shot one night at the museum by an albino Catholic monk named Silas, who is working on behalf of someone he knows only as the Teacher, who wishes to discover the location of the \"keystone\", an item crucial in the search for the Holy Grail. After Saunière's body is discovered in the pose of the Vitruvian Man by Leonardo DA Vinci, the police summon Harvard professor Robert Langdon, who is in town on business. Police captain Bezu Fache tells him that he was summoned to help the police decode the cryptic message Saunière left during the final minutes of his life. The message includes a Fibonacci sequence out of order and an anagram: \"O, draconian devil! Oh, lame saint!\" Langdon explains to Fache that the pentacle Saunière drew on his chest in his own blood represents an allusion to the goddess and not devil worship, as Fache believes.Sophie Neveu, a police cryptographer, secretly explains to Langdon that she is Saunière's estranged granddaughter and that Fache thinks Langdon is the murderer because the last line in her grandfather's message, which was meant for Neveu, said \"P.S. Find Robert Langdon\", which Fache had erased prior to Langdon's arrival. However, \"P.S.\" does not refer to \"postscript\", but rather to Sophie - the nickname given to her by her grandfather was \"Princess Sophie\". She understands that her grandfather intended Langdon to decipher the code, which leads to Leonardo DA Vinci's Mona Lisa, which in turn leads to his painting Madonna of the Rocks. They find a pendant that holds the address of the Paris branch of the Depository Bank of Zurich.Neveu and Langdon escape from the police and visit the bank. In the safe deposit box, which is unlocked with the Fibonacci sequence, they find a box containing the keystone: a cryptic, a cylindrical, hand-held vault with five concentric, rotating dials labeled with letters. When they are lined up correctly, they unlock the device, but if the cryptic is forced open, an enclosed vial of vinegar breaks and dissolves the message inside the cryptic, which was written on papyrus. The box containing the cryptic contains clues to its password.Langdon and Neveu take the keystone to the home of Langdon's friend, Sir Leigh Teabing, an expert on the Holy Grail, the legend of which is heavily connected to the Priory. There, Teabing explains that the Grail is not a cup but connected to Mary Magdalene, and that she was Jesus Christ's wife and is the person to his right in The Last Supper. The trio then flee the country on Teabing's private plane, on which they conclude that the proper combination of letters spells out Neveu's given name, Sofia. Opening the cryptic, they discover a smaller cryptic inside it, along with another riddle that ultimately leads the group to the tomb of Isaac Newton in Westminster Abbey.During the flight to Britain, Neveu reveals the source of her estrangement from her grandfather ten years earlier: arriving home unexpectedly from university, Neveu secretly witnessed a spring fertility rite conducted in the secret basement of her grandfather's country estate. From her hiding place, she was shocked to see her grandfather with a woman at the center of a ritual attended by men and women who were wearing masks and chanting praise to the goddess. She fled the house and broke off all contact with Saunière. Langdon explains that what she witnessed was an ancient ceremony known as hero's Amos or \"sacred marriage\".By the time they arrive at Westminster Abbey, Teabing is revealed to be the Teacher for whom Silas is working. Teabing wishes to use the Holy Grail, which he believes is a series of documents establishing that Jesus Christ married Mary Magdalene and fathered children, in order to ruin the Vatican. He compels Langdon at gunpoint to solve the second cryptic's password, which Langdon realizes is \"apple\". Langdon secretly opens the cryptic and removes its contents before tossing the empty cryptic in the air. Teabing is arrested by Fache, who by now realizes that Langdon is innocent. Bishop Aringarosa, head of religious sect Opus Dei and Silas' mentor, realizing that Silas has been used to murder innocent people, rushes to help the police find him. When the police find Silas hiding in an Opus Dei Center, Silas assumes that they are there to kill him and he rushes out, accidentally shooting Bishop Aringarosa. Bishop Aringarosa survives but is informed that Silas was found dead later from a gunshot wound.The final message inside the second keystone leads Neveu and Langdon to Rosslyn Chapel, whose docent turns out to be Neveu's long-lost brother, whom Neveu had been told died as a child in the car accident that killed her parents. The guardian of Rosslyn Chapel, Marie Chauvel Saint Clair, is Neveu's long-lost grandmother and Saunière's wife who was the woman who participated with him in the \"sacred marriage\". It is revealed that Neveu and her brother are descendants of Jesus Christ and Mary Magdalene. The Priory of Sion hid her identity to protect her from possible threats to her life. The real meaning of the last message is that the Grail is buried beneath the small pyramid directly below La Pyramide Inversée, the inverted glass pyramid of the Louvre. It also lies beneath the \"Rose Line\", an allusion to \"Rosslyn\". Langdon figures out this final piece to the puzzle; he follows the Rose Line (prime meridian) to La Pyramide Inversée, where he kneels to pray before the hidden sarcophagus of Mary Magdalene, as the Templar knights did before.",
	"links": [
		"https://www.amazon.com/Vinci-Code-Tom-Hanks/dp/B000KKQNRO"
	]
}