{
	"title": "Hauru no ugoku shiro",
	"release_year": "2004",
	"runtime": "119",
	"tags": [
		"Adventure",
		"Animation",
		"Family",
		"amazon"
	],
	"rating": 8.2,
	"actors": [
		"Chieko Baishô",
		"Takuya Kimura",
		"Tatsuya Gashûin",
		"Akihiro Miwa",
		"Ryunosuke Kamiki",
		"Mitsunori Isaki",
		"Yô Ôizumi",
		"Akio Ôtsuka",
		"Daijirô Harada",
		"Haruko Katô"
	],
	"staff": [
		"Hayao Miyazaki",
		"Hayao Miyazaki",
		"Diana Wynne Jones",
		"Rick Dempsey",
		"Ned Lott",
		"Toshio Suzuki",
		"Joe Hisaishi",
		"Atsushi Okui",
		"Takeshi Seyama",
		"Ned Lott"
	],
	"votes": 460904,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzlhNzlmZjktMTkyNC00ODBkLTlkZjctODAyMGRiYzQyMThmXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "Sophie, an eighteen-year-old hatter, is a responsible young woman who encounters a mysterious and tremendously powerful wizard named Howl while on her way to visit her younger sister Lettie. The Witch of the Waste, who romantically pursues Howl, comes to the hat shop and curses Sophie who refuses to serve her by transforming Sophie into a ninety-year-old woman.Seeking a cure for the transformation spell, Sophie travels into the Wastes but instead finds a cursed living scarecrow whom she calls \"Turnip Head\", who takes her to Howl's castle. Here, Sophie meets Howl's young apprentice, Markl; and the fire-demon Calcifer, who is the source of all of the castle's energy and magical power. Calcifer offers to break the curse in exchange for Sophie's help in breaking the spell he's under, which keeps Calcifer bound to the house. When Howl appears, Sophie announces that she is the castle's new cleaning lady hired by Calcifer.At the same time, Sophie's country is caught up in the beginning of a war with its neighboring country, following the mysterious disappearance of the other country's Crown Prince. Howl receives summons from the King, who orders his various assumed identities to fight in the war. However, Howl comes up with an idea to send Sophie, under the guise of being his mother, to the King to profess the cowardice of one of Howl's two aliases. Before leaving the castle, Howl gives to Sophie a magic charm (ring), which connects her to Calcifer and will guarantee her safe return.He also assures her that he will follow her to the palace in disguise. At the palace, Sophie runs into an asthmatic dog, Heen, who she thinks is Howl undercover. She also meets the Witch of the Waste, who Suliman, the king's magic advisor, punishes by draining all of her power, causing her to regress into a harmless old woman. Suliman tells Sophie that Howl will meet the same fate if he does not contribute to the war. As Sophie vehemently protests these measures, the Witch's spell temporarily weakens revealing Sophie's true form due to the passion in her words. Suliman realizes Sophie's true relation to Howl and her purely intense romantic feelings towards him.Howl then arrives to rescue Sophie under the guise of the King. Suliman tries to trap Howl but with the help of Sophie, they manage to escape, taking Heen and the former Witch of the Waste with them.Sophie learns that Howl transforms into a bird-like creature in order to interfere in the war, but each transformation makes it more difficult for him to return to human form. Sophie fears that Howl is preparing to leave them, as his remaining time as a human is limited, he returns to interfering in the war. Sophie's mother-under Suliman's control-arrives and leaves behind a bag containing a \"peeping bug\" under her orders. The former Witch of the Waste discovers it and promptly destroys the bug by tossing it into Calcifer. Unfortunately, Calcifer gets sick after eating the bug, rendering him unable to protect the castle from being discovered due to his weakened state. Sophie's mother says Sophie can live with her again, but Sophie says she will stay with her new family.A few hours later, Sophie returns to her young form just as the city is carpet bombed by enemy aircraft. Suliman's henchmen invade the flower shop Howl made for Sophie. After protecting the flower shop from the bombing, Howl draws the guards away just after healing Calcifer. He tells Sophie he is not going to run away anymore because he has something he wants to protect - Sophie. Afterwards, he takes his leave. Deducing that Howl is trying to protect the castle and everyone inside it, Sophie moves everyone out and removes Calcifer from the fireplace and destroys the castle. She offers Calcifer her braid, allowing him to power a portion of the remaining castle.They head toward Howl, in order to let him know that they are not attached to the castle anymore when the former Witch of the Waste realizes that Howl has given his heart to Calcifer, just like Sophie did with her hair. The Witch takes Calcifer and refuses to let go of him although it is burning her. A panicked Sophie pours water onto the Witch of the Waste, which douses Calcifer, making him lose his magical strength and power. The castle is split in two; Sophie and Heen fall down a chasm, while Markl, the Witch of the Waste and Calcifer continue traveling on the disintegrating castle.Making her way toward Howl's heart with the ring that Howl gave her as a protective charm, Sophie enters through the broken door of the castle into the black region and discovers a recollection of how Howl and Calcifer met: as a boy, Howl took pity on a falling (dying) star-Calcifer-and gave it his heart. The act bound Calcifer to Howl indefinitely; however, by losing his heart, Howl was emotionally trapped in adolescence.Sophie finds Howl, having now lost his human consciousness in bird form. They head back to Calcifer, accompanied by the Witch of the Waste and Markl who are on a plain wooden platform, the only remaining part of the former castle, moving on the edge of a cliff. Sophie asks the Witch for Howl's heart. She gives it to her, and Sophie places the heart back inside Howl, returning him to life, and freeing Calcifer. With Calcifer gone, the remaining platform collapses and starts falling down the mountain. Turnip-head saves the platform by putting his pole against the falling platform. Sophie warmly kisses Turnip-head on the cheek as thanks, which breaks his curse revealing that he is actually the missing prince from the neighboring country and was trapped in the form of a scarecrow until he received a true love's kiss.Although Calcifer is now free, he returns to his former company. Heen shows the scene of the happy end and the discovery of the missing prince to Suliman, and Suliman decides to put an end to the war. Howl, Sophie, and the others are seen high above the bomber planes upon a new flying castle, while the bombers return from the war.",
	"links": [
		"https://www.amazon.com/Howls-Moving-Castle-Japanese-Language/dp/B081S3VBRV"
	]
}