{
	"title": "The Golden Compass",
	"release_year": "2007",
	"runtime": "113",
	"tags": [
		"Adventure",
		"Family",
		"Fantasy",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Nicole Kidman",
		"Daniel Craig",
		"Dakota Blue Richards",
		"Ben Walker",
		"Freddie Highmore",
		"Ian McKellen",
		"Eva Green",
		"Jim Carter",
		"Tom Courtenay",
		"Ian McShane"
	],
	"staff": [
		"Chris Weitz",
		"Chris Weitz",
		"Philip Pullman",
		"Bill Carraro",
		"Deborah Forte",
		"Alexandre Desplat",
		"Henry Braham",
		"Anne V. Coates",
		"Peter Honess",
		"Kevin Tent",
		"Lucy Bevan",
		"Fiona Weir",
		"Dennis Gassner"
	],
	"votes": 198051,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTM2NDkxMjQxMV5BMl5BanBnXkFtZTYwNTMxMDM4._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In an alternate Universe, the Earth of that reality is dominated by a powerful church called the Magisterium that strictly controls the populace's beliefs and teachings. In this world, every person's inner spirit partially exists outside their body, manifesting itself as an animal companion called a daemon. The daemon communicates with the person and must remain in close physical proximity. Witches, however, have bird-shape daemons able to travel long distances from their bodies.\nThe various worlds and Universes are connected by Dust. Alethiometers are Golden Compasses that can read the signals from the Dust and show the path forward. Magisterium has seized or destroyed all other Alethiometers and have forbidden the mention of Dust. Only one Alethiometer remains and only one who can read it. The witches rule the air, Gyptians rule the water and the Ice Bears rule the Ice. Ice bears don't have daemons.Lyra Belacqua (Dakota Blue Richards), whose daemon is named Pantalaimon or \"Pan\" (who can change shapes and hasn't settled into its final form yet), is an orphan being raised at Jordan College in Oxford. Her uncle, Lord Asriel (Daniel Craig), a noted explorer and scholar, has been absent seeking the elusive Dust, a cosmic particle that the Magisterium forbids to be mentioned.\nWhen Asriel returns to Oxford, Lyra saves his life after seeing a visiting Magisterium agent Fra Pavel poison his wine. Pavel wanted the college to silence Asriel and stop him from making his presentation, but the master of the Jordan college (Jack Shepherd) refuses to do so point blank. Asriel later gives a presentation to other scholars regarding his discovery that Dust existing in the North Pole links infinite worlds. Asriel receives a grant for another expedition. If his theory is proven, it could severely undermine the Magisterium's hold on the world.Lyra meets Mrs Coulter (Nicole Kidman), a wealthy, powerful woman presented as \"a friend of the college\". Mrs Coulter tells Lyra that she has met the Ice Bear King Ragnar himself, who is desperate to acquire a daemon of his own.\nIt is revealed that Coulter is working on behalf of the Magesterium, and simultaneously the Magesterium is working on a serum that counteracts the effects of Dust in children, before their daemons can settle. Removing the influence Dust would raise a generation of young who would never question authority again.\nMrs Coulter takes an interest in Lyra and invites her to stay in her home. Before they leave for London, the Master of the college entrusts Lyra with her uncle's Alethiometer, a compass-like artifact that reveals the truth. Few individuals can decipher its symbols. Lyra is warned to keep hers a secret, especially from Mrs Coulter.Lyra notices the Alethiometer continuously points to a symbol of a lady, a lightning bolt, and an infant, though she is unable to comprehend its meaning. Soon, Mrs Coulter's congenial manner changes and shows that she is aligned to the Magisterium and its mandate. When Lyra casually mentions Dust, Mrs Coulter sternly warns her never to bring it up again.Kidnappers called Gobblers have been snatching poor, orphaned, and Gyptian children, including Lyra's friends Roger (Ben Walker), an Oxford servant boy, and Billy Costa (Charlie Rowe), a young Gyptian. Lyra later discovers that Mrs Coulter is head of the General Oblation Board (who is in charge of an experimental surgical procedure called Intercision) and realizes they are the \"Gobblers\" (as the first 3 letters spell GOB).When Mrs Coulter's daemon attempts to steal the Alethiometer, Lyra and Pan escape with it into the streets. Gobblers pursue her, but she is saved by Ma Costa (Clare Higgins), Billy's mother. Ma Costa says that the Gyptians were keeping an eye on Lyra ever since she left the College grounds. Lyra is taken to the Gyptian king (Jim Carter), John Faa, whose ship is heading north to rescue the captured children. Lyra shows the Alethiometer to a wise Gyptian elder named Farder Coram (Tom Courtenay) and discovers she is able to decipher the device.\nAfter consulting with Magisterium agent Fra Pavel (Simon McBurney), Mrs Coulter sends two mechanical spy-flies after Lyra. Fra Pavel believes that Lyra is the child that the witches prophecy speaks of.\nOne is batted away but the other is caught and sealed in a can by Farder Coram, who says the spy-fly has a stinger filled with a sleeping poison.\nMeanwhile, Lord Asriel has reached Svalbard, the kingdom of the Ice Bears, but he is captured by Samoyed tribesmen hired by Mrs Coulter.The witch queen, Serafina Pekkala (Eva Green), visits Lyra and tells her the missing children are in an experimental station called Bolvangar. At a northern port, Lyra is befriended by a Texan Aeronaut named Lee Scoresby (Sam Elliott). He advises her to hire him and his friend Iorek Byrnison, an armored bear that Lee has come to rescue. Once a prince of the armored bears, Iorek is now exiled in shame, the local townspeople having tricked him out of his armor. Iorek says that a bear's armor is his soul. Lyra uses the Alethiometer to locate Iorek's armor at the local Magisterium office. After recovering it, Iorek joins the Gyptian trek northward, along with Scoresby.\nThe Magisterium suspect that Coulter allowed Lyra to escape, but they task her to separate Lyra from her daemon using Intercision.Lyra, astride Iorek, goes to an abandoned building the Alethiometer pointed her toward. There, Lyra finds Billy Costa, who has been surgically separated from his daemon. The Gobblers are experimenting on the kidnapped children using a procedure called \"Intercision\". Lyra reunites Billy with Ma Costa, but the group is attacked by Samoyeds, who capture Lyra.\nIorek and Lee follow her in Lee's airship. Lyra is taken to the bear king Ragnar Sturlusson. Knowing Iorek will be outnumbered, Lyra tricks Ragnar into fighting Iorek one-on-one. Lyra tells Ragnar, that she is Iorek's daemon, knowing that Ragnar wishes to have a daemon of his own. She says that Ragnar kills Iorek in 1:1 combat, then he would gain Iorek's daemon.\nRagnar, who usurped Iorek's throne, initially appears to be winning; Iorek feigns weakness and kills Ragnar, avenging his father and regaining his kingdom.Iorek carries Lyra to Bolvangar, but only Lyra crosses a narrow ice bridge before it collapses. Upon reaching the station, Lyra is welcomed in and reunited with Roger. While snooping around, Lyra overhears Mrs Coulter telling the station scientists that Asriel escaped capture and has set up a laboratory but that Magisterium soldiers are going there to arrest and execute him for heresy. Lyra also overhears the scientists discussing experiments to sever a child from their daemon. Caught spying, Lyra and Pan are thrown into the Intercision chamber but Mrs Coulter rescues her.When Lyra awakens, Mrs Coulter explains that she and the Magisterium believe Intercision protects children from Dust's corrupting influence. She reveals she is Lyra's mother but was forced to give her up; Lyra realizes that Asriel is her father. When Mrs Coulter wants the Alethiometer, Lyra instead gives her the can containing the spy-fly. The fly stings Mrs Coulter, rendering her unconscious. Lyra destroys the machine, setting off a series of explosions.Outside, the fleeing children are attacked by Tartar mercenaries and their wolf daemons. Iorek, Scoresby, the Gyptians, and flying witches led by Serafina join the battle. The Tartars are defeated, and the children rescued. Lyra, Roger, Iorek, Lee, and Serafina fly further north to search for Asriel. Confirming Serafina's prophecy of an upcoming war with Lyra at the center, Lyra is determined to fight the Magisterium, who plot to control all the other worlds in the universe.",
	"links": [
		"https://www.amazon.com/Golden-Compass-Nicole-Kidman/dp/B0013TO3HS"
	]
}