{
	"title": "X-Men: The Last Stand",
	"release_year": "2006",
	"runtime": "104",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Patrick Stewart",
		"Patrick Stewart",
		"Hugh Jackman",
		"Hugh Jackman",
		"Halle Berry",
		"Halle Berry",
		"Famke Janssen",
		"Famke Janssen",
		"Ian McKellen",
		"Ian McKellen",
		"Anna Paquin",
		"Anna Paquin",
		"Kelsey Grammer",
		"Kelsey Grammer",
		"James Marsden",
		"James Marsden",
		"Rebecca Romijn",
		"Rebecca Romijn",
		"Shawn Ashmore",
		"Shawn Ashmore"
	],
	"staff": [
		"Brett Ratner",
		"Simon Kinberg",
		"Zak Penn",
		"Avi Arad",
		"Lauren Shuler Donner",
		"Ralph Winter",
		"John Powell",
		"Dante Spinotti",
		"Mark Goldblatt",
		"Mark Helfrich",
		"Julia Wong",
		"Heike Brandstatter",
		"Coreen Mayrs",
		"Richard Pagano",
		"Ed Verreaux"
	],
	"votes": 550052,
	"cover": "https://m.media-amazon.com/images/M/MV5BMThmOWE3OWEtODJmNC00ZDEzLTk4MWUtNzEzM2RiNmJiZmU3XkEyXkFqcGc@._V1_QL75_UY281_CR2,0,190,281_.jpg",
	"description": "In the 1980s, Professor Charles Xavier (Patrick Stewart) and Magneto (Ian McKellen) meet a young Jean Grey (Famke Janssen) at her parents' house to invite her to join their school, the X-Mansion. Jean's parents believe she is sick, and they are only too happy to be rid of her. Jean has the makings of a powerful category 5 mutant, when she demonstrates how she could levitate the cars of the entire neighborhood with her mind.\nTen years later, a young Warren Worthington III (Ben Foster) tries to cut off his wings. His father Warran Worthington II (Michael Murphy) is horrified to find that his son is a mutant.The next scene opens with the X-Men in a simulated battle against a giant robot. Kitty Pryde (Elliot Page) (A mutant with the ability to phase through matter and walk through solid objects) and Colossus (Daniel Cudmore) (A mutant with the ability to transform his body into an organic steel) have joined the team, although Cyclops (James Marsden) (Cyclops emits powerful energy blasts from his eyes, and must wear specially made glasses to prevent the destruction of anything he looks at) is absent. Storm (Halle Berry) insists on working as a team, but Wolverine (Hugh Jackman) has Colossus throw him towards the robot as he cuts the giant robot's head off with his Adamantium reinforced claws. Storm is upset with Logan for not working as a team.Beast runs the Department of Mutant Affairs. Mystique is under custody of the US Government and kept in a mobile prison. She was caught stealing a top-secret file with details of a vaccination for mutants, developed from the DNA of a fellow mutant Leech (Cameron Bright), a mutant who has the ability to neutralize the powers of nearby mutants. At the moment the DNA can only be replicated, but not generated.Sometime afterward, the pharmaceutical company Worthington Labs, led by Warren Worthington II, announces it has developed an inoculation to suppress the X-gene that gives mutants their powers and makes them different from other humans, offering the \"cure\" to any mutant who wants it. The facility is situated on Alcatraz Island.\nWhile some mutants are interested in the cure, including the X-Men's Rogue (Anna Paquin) (A young mutant woman whose power causes her to temporarily take on the powers of anyone she touches, leaving her victims (mutant or human) unconscious), many others are horrified by the announcement.\nIceman and Kitty are bonding, and Rogue is jealous of Kitty for this reason. Rogue cannot touch her boyfriend Iceman, as he falls unconscious whenever she gets intimate with him.In response to the news, the X-Men's adversary, Magneto, raises an army, warning his followers that the \"cure\" will be forcefully used to exterminate the mutant race.\nMagneto re-establishes his Brotherhood of Mutants with those who oppose the cure, warning it will be converted into a weapon to exterminate the mutant race. With help from Pyro, Callisto (Callisto is a mutant with enhanced super-humanly acute senses, who senses mutants and their powers) and several other mutants, Magneto attacks a mobile prison and frees Mystique (Rebecca Romijn), Multiple Man (Eric Dane) (has the ability to create a very large number of copies of himself) and Juggernaut (Vinnie Jones). Mystique shields Magneto from a cure dart and loses her mutant abilities. Magneto abandons her.Cyclops, still depressed about the loss of Jean, returns to Alkali Lake. Jean appears to Cyclops, but as the two kiss, Jean takes on a fearsome appearance. Psychically sensing trouble, Professor X sends Wolverine and Storm to investigate.\nWhen they arrive, the two X-Men encounter Telekinetically floating rocks, Cyclops' glasses, and an unconscious Jean. Cyclops himself is nowhere to be found. Xavier explains that when Jean sacrificed herself, she unleashed the powerful alternate personality she calls \"Phoenix\".Xavier speculates that Jean's formidable powers wrapped her in a cocoon of Telekinetic energy.\nWolverine is disgusted to learn that Xavier has kept Jean in check telepathically (which resulted in the split personas of Jean and Phoenix. Phoenix was the dominant persona), but when Jean awakens, he realizes she is not the Jean Grey he knew. Jean pleads with Wolverine to kill her, but when he refuses, the Phoenix surfaces and knocks out Wolverine, before escaping to her childhood home.Magneto, alerted by Callisto (Dania Ramirez) to the presence of a powerful mutant, realizes that it must be Jean Grey. Magneto and his allies are already at Jean's childhood home when Xavier and his X-Men arrive. The two men vie for Jean's loyalty until the Phoenix resurfaces. She destroys her family's house, disintegrates Xavier, and leaves with Magneto.The X-Men know that Magneto is going to attack Alcatraz to kill Leech, thereby destroying the source of the \"cure\". They regroup to confront Magneto's army, despite being significantly outnumbered.\nMagneto has diverted the Golden Gate Bridge to provide access to Alcatraz Island, the location of Worthington Labs facility. The military troops defending the facility are armed with plastic \"cure weapons\" able to neutralize the attacking mutants, and non-metallic to counter Magneto's powers. Magneto lets the lesser-powered mutants charge ahead, with heavy initial losses, but then they rapidly begin to overwhelm the troops. The X-Men Wolverine, Storm, Beast (Kelsey Grammer), Iceman (Shawn Ashmore), Colossus and Shadowcat) arrive to battle Magneto and his troops.During the fight, Beast injects Magneto with the cure, nullifying his powers. Meanwhile, Shadowcat has entered the facility to find the mutant who is the source of the cure and saves him from the murderous Juggernaut. They escape as Phoenix begins to destroy everything around her.\nWolverine realizes that due to his self-healing power, he is the only one who can approach her. He tells Storm to evacuate everyone and faces Phoenix alone, his power barely neutralizing her disintegration attack. Jean, momentarily gaining control, begs Wolverine to save her. Telling Jean he loves her, Wolverine kills her and holds her dead body as he weeps.The school continues without Xavier, with Storm now as headmistress and Logan as a teacher. The US president appoints Beast as ambassador to the United Nations, Rogue returns, telling Iceman she has taken the cure and the two hold hands skin-to-skin for the first time. Magneto, without his powers, sits at a chessboard in a park and reaches toward a metal chess piece that moves slightly.\nIn a post-credits scene, Dr. Moira MacTaggert checks on a comatose patient who greets her with Xavier's voice. Startled, she replies, \"Charles?\"",
	"links": [
		"https://www.amazon.com/X-Men-Last-Stand-4K-UHD/dp/B08GX8SQ8P"
	]
}