{
	"title": "Shi mian mai fu",
	"release_year": "2004",
	"runtime": "119",
	"tags": [
		"Action",
		"Adventure",
		"Drama"
	],
	"rating": 7.5,
	"actors": [
		"Ziyi Zhang",
		"Takeshi Kaneshiro",
		"Andy Lau",
		"Dandan Song",
		"Hongfei Zhao",
		"Jun Guo",
		"Shu Zhang",
		"Jiusheng Wang",
		"Zhengyong Zhang",
		"Yongxin Wang"
	],
	"staff": [
		"Yimou Zhang",
		"Feng Li",
		"Bin Wang",
		"Yimou Zhang",
		"William Kong",
		"Sook Yhun",
		"Yimou Zhang",
		"Shigeru Umebayashi",
		"Xiaoding Zhao",
		"Long Cheng",
		"Tingxiao Huo"
	],
	"votes": 116846,
	"cover": "https://m.media-amazon.com/images/M/MV5BYWZlZjQwMjUtNGI5Ny00ODg4LTg0Y2UtODkxYmYxM2IxNjgzXkEyXkFqcGc@._V1_QL75_UY281_CR1,0,190,281_.jpg",
	"description": "The film is set in 859 AD. The once great Tang Dynasty is now in decline. Numerous rebel groups have formed, the largest of which is the House of Flying Daggers, based in Feng Tian County. The Flying Daggers steal from the rich and give to the poor, gaining the support of the locals.\nThe local deputies have managed to kill the leader of the Flying Daggers, but the rebel group only becomes stronger, due to a mysterious new leader. Jin (Takeshi Kaneshiro) and Liu (Andy Lau), two police captains, are ordered to kill the new leader within ten days.In order to accomplish this, they arrest Mei (Zhang Ziyi), a blind dancer who is suspected of being the daughter of the old leader of the Flying Daggers. While Mei is incarcerated, Jin and Liu decide to let her go to track the mastermind; Jin will pretend to be a lone warrior called Wind and break her out of prison. This will gain her trust, and hopefully, Jin will be led to the headquarters of Flying Daggers. The plan works, but Mei and Jin fall in love on the way. They are followed at a distance by Liu; Jin and Liu meet secretly to discuss their plans. Jin jokes about his seduction of the girl; Liu warns him sternly against getting involved.To add authenticity to the deception, Liu and his men ambush the pair: the fight is, however, a fake. Further on, they are attacked again, but this time their assailants are apparently for real: Jin and Mei battle for their lives, being saved only by the intervention of an unseen knife-thrower. Furious, Jin confronts Liu: Liu explains that he has reported the matter up the chain of command and his general has taken over the pursuit. Jin realizes that he is now expendable.Once again, Jin and Mei are attacked by the General's men. They are hopelessly outnumbered; at the last minute they are saved when the House of Flying Daggers reveal themselves. Jin and Liu are captured and taken to their headquarters. At this point, a number of surprising revelations are made. Mei is not blind, nor is she the old leader's daughter - she was merely pretending to be. Liu is in fact an undercover agent for the House of Flying Daggers, which has engineered the whole chain of events in order to draw the General into a decisive battle. Furthermore, Liu is in love with Mei: he has waited for three years for her whilst working undercover.Mei, however, cannot bring herself to love Liu: over the last few days she has fallen for Jin. But as Jin is now a liability, she is ordered by Nia, the leader of the House of Flying Daggers, to kill him. Instead, Mei takes him away then frees him from his bonds before they make love in the field. Jin then begs Mei to flee with him, but she is torn between her love and her duty to the House, as well as guilt over Liu; Jin leaves alone.Mei finally decides to ride after Jin but is ambushed by Liu who is embittered by her rejection and consumed by jealousy for Jin. Mei, not realizing that Liu has thrown two daggers stuck together, only manages to ward off one before the other strikes her in the chest. As Mei lies dying, Jin returns to find Liu, and they begin an epic battle of honor and revenge, fighting from autumn to winter.Mei, regaining consciousness, grabs the dagger in her chest and threatens to pull it out and to throw it in order to kill Liu if Liu kills Jin with his throwing dagger; in doing so Mei would sacrifice her own life, as it would enable the blood to flow and cause her to bleed to death. Jin begs her not to do it, willing to die rather than let her be killed. Infuriated, Liu throws his arm out as if to throw a knife at Jin, leading Mei to rip the dagger out of her own heart and throw it, not at Liu but instead in an attempt to deflect Leo's attack and save Jin. However, all her dagger does is deflect a droplet of blood, as Liu never let go of his dagger.\nLiu stumbles off into the blizzard as a grief-stricken Jin holds Mei's lifeless body, singing the song originally sung by Mei at the beginning of the film in the Peony Pavilion.",
	"links": []
}