{
	"title": "A History of Violence",
	"release_year": "2005",
	"runtime": "96",
	"tags": [
		"Action",
		"Crime",
		"Drama",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Viggo Mortensen",
		"Maria Bello",
		"Ed Harris",
		"William Hurt",
		"Ashton Holmes",
		"Peter MacNeill",
		"Stephen McHattie",
		"Greg Bryk",
		"Kyle Schmid",
		"Sumela Kay"
	],
	"staff": [
		"David Cronenberg",
		"John Wagner",
		"Vince Locke",
		"Josh Olson",
		"Chris Bender",
		"J.C. Spink",
		"Howard Shore",
		"Peter Suschitzky",
		"Ronald Sanders",
		"Deirdre Bowen",
		"Carol Spier"
	],
	"votes": 257047,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTczMzIzMTQ1OV5BMl5BanBnXkFtZTYwMDQwNjk2._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Billy Orser (Greg Bryk) is a ruthless killer and thief mob who works with Leland Jones (Stephen McHattie). They are shown to kill the staff of a motel, and Billy even shoots a little girl who is a witness to their crime.Tom Stall (Viggo Mortensen) is a local restaurant owner in the small town of Millbrook, Indiana. He is leading a content life with wife Edie (Maria Bello), son Jack (Ashton Holmes) & girl Sarah (Heidi Hayes). By all indications, they are a normal and happy family. Tom is a respected member of the local community. Mick (Gerry Quigley) is Tom's chef at the restaurant.\nJack is being bullied at school by punks Bobby (Kyle Schmid) and Buddy (Morgan Kelly), but he avoids confrontation by admitting defeat even before the fight starts. Jack believes that violence is pointless and cruel.\nTom and Edie love each other dearly and use every moment they can find to enjoy their sex life.One night Billy and Leland attempt to rob the restaurant. When one of the criminals is about to kill the waitress Charlotte (Deborah Drakeford), Tom deftly kills both robbers. Tom is stabbed in the foot by Leland, but he gets off 2 precise shots that kill Billy and Leland.\nTom's actions make him an overnight celebrity and the news reporters are all over the story. Tom's picture is all over the national news. After a brief stay at the hospital, Tom is discharged and returns home to a hero's welcome. Tom is reluctantly forced to be in front of live TV cameras as they intercept him right outside his house.Tom is soon visited by scarred gangster Carl Fogarty (Ed Harris) who alleges that Tom is actually a gangster named Joey Cusack, who had dealings with him in the Irish Mob in Philadelphia many years ago. Tom vehemently denies these accusations and claims he has never been to Philadelphia, as well as never meeting him before, but Fogarty remains persistent in his claims and continues to stalk the Stall family.\nSam, the local sheriff, tells Tom and Edie that Carl and his men Frank Mulligan (Bill McDonald) and Charlie Roarke (Aidan Devine) represent the organized crime syndicates from the east coast, and are suspected to be involved in several counts of murder charges. Tom insists that he is not part of any witness protection program. Sam says that while he found no official documents on Joey Cusack, he did find that Ritchie Cusack is the head of the crime syndicate that Carl and his men come from.Under pressure from Fogarty and his newfound fame, Tom's relationships with his wife Edie, teenage son Jack, and young daughter Sarah become strained. Carl continually harasses Tom and his family, making Tom believe that he is going to attack and thus forcing Tom to take precautionary measures.\nJack can also see that the family is in danger. Carl follows Edie and Sarah to a mall, where Edie panics when Sarah wanders off by herself. Edie finds Sarah, but she was being closely watched over by Carl. Carl tells Edie to ask Tom how come he is so good at killing people.Jack has an argument with Tom over the use of violence after Jack brutally assaults the bully Bobby at school. Tom hits Jack in an attempt to dissuade Jack from using violence again. Jack runs off and is caught by Fogarty.\nWith Jack as his hostage, Fogarty and his men go to the Stall house and demand that \"Joey\" return with them to Philadelphia. Tom kills Fogarty's men with the same precision he used against the robbers, while Jack kills Fogarty with a shotgun in defense of his father.At the hospital, Edie confronts Tom, claiming that while he was attacking Fogarty's men, she saw the real \"Joey\" that Fogerty was talking about. Tom shocks Edie by admitting that he is actually Joey Cusack, and that he had killed for both money and pleasure. He tells Edie that he ran away from Philadelphia to escape his criminal past. Tom stated he spent 3 years changing his life around in order to rid himself of the violent gangster in him, and to start a normal life as \"Tom Stall\".After Tom gets out of the hospital, Sam (Peter MacNeill), the local sheriff pays him a visit. Sam expresses his confusion about everything that happened. He tells them that these mobsters wouldn't go to all this trouble if they weren't sure they had the right man. Just when Tom is about to confess, Edie defends him and lies to Sam, claiming that Tom is who he says he is, and their family has suffered enough. At a loss for words after Edie breaks down into tears, Sam leaves. This furthers the tensions in their marriage. Edie and Tom then start slapping and hitting each other, their fight eventually culminating in violent sex on the stairs. Afterward, Edie and Jack continue to further distance themselves from Tom, leaving him isolated.Tom receives a call from his brother Richie Cusack (William Hurt), who also demands his return to Philadelphia, or else he will come see him. After traveling to Philadelphia and confronting his brother, Tom learns that the other mobsters whom he had offended in Philadelphia took out their frustrations on Richie, preventing him from moving up in the criminal organization. Tom offers to make peace, but Richie orders his men to kill him. Tom offers to make peace, but Richie orders his men to kill his brother. Tom manages to kill most of the guards and escape. As Richie and his last henchman are hunting for him, Tom kills the henchman, takes his gun, and confronts Richie outside; stunned, Richie says \"Jesus, Joey\" before Tom kills him with a single gunshot to the head, responding \"Jesus, Richie\".Tom returns home, but the atmosphere is tense and silent as the Stalls sit around the dinner table. The fate of his marriage and the future of his life as Tom Stall is uncertain, but Jack and Sarah indicate their acceptance of their father by setting a plate for him and passing him some food.",
	"links": [
		"https://www.amazon.com/History-Violence-Viggo-Mortensen/dp/B001R2K5UA"
	]
}