{
	"title": "Sahara",
	"release_year": "2005",
	"runtime": "124",
	"tags": [
		"Action",
		"Adventure",
		"Comedy",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Matthew McConaughey",
		"Penélope Cruz",
		"Steve Zahn",
		"Mark Aspinall",
		"Rakie Ayola",
		"Christopher Bello",
		"Lambert Wilson",
		"Nicholas Beveney",
		"Rainn Wilson",
		"Lennie James"
	],
	"staff": [
		"Breck Eisner",
		"Clive Cussler",
		"Thomas Dean Donnelly",
		"Joshua Oppenheimer",
		"John C. Richards",
		"Stephanie Austin",
		"Howard Baldwin",
		"Karen Elise Baldwin",
		"Mace Neufeld",
		"Clint Mansell",
		"Seamus McGarvey",
		"Andrew MacRitchie",
		"Nina Gold",
		"Anne McCarthy",
		"Allan Cameron"
	],
	"votes": 104847,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjExOTM4NDUzNV5BMl5BanBnXkFtZTcwOTgzNzczMw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1865, at the conclusion of the American Civil War, Richmond, Virginia is in ruins. The CSS Texas, captained by Mason Tombs (Robert Cavanah), is loaded with the last of the Confederacy's gold to keep it from Union forces. It then disappears into the Atlantic as it escapes the approaching Union army. The Union army unleashes its cannons on the CSS Texas, but the cannon shells simply bounce off the thick armor of the ship, which covers the entire ship from top to bottom.In the present day, in 1990s, World Health Organization doctors Eva Rojas (Penelope Cruz) and Frank Hopper (Glynn Turman) are investigating a disease that is spreading across Mali, Africa.\nEva and Hopper are stationed in Laos, Nigeria, and find evidence that people who show symptoms of the plague have traveled to Mali recently. Eva tries convincing Hopper that they need to go to Mali to find the source of this outbreak. In Mali, there is a civil war between dictator General Kazim and the Tuareg people. Hopper says that WHO won't be willing to lose any more staff to the civil war in Mali.\nEva investigates more cases in Lagos and goes to a lighthouse, where she finds the dead father of one of the victims she examined before. The father had also been to Mali.Assassins attempt to murder Eva, but she is rescued by Dirk Pitt (Matthew McConaughey), from National Underwater and Marine Agency (NUMA), who was working nearby. The assassins run away with Eva's medical kit with all the samples she had gathered so far.\nDirk is a famous person who is known to hunt down missing battleships, and the CSS Texas is one of the ships on his list.Dirk gets a call from a dealer in Nigeria. He sells Dirk a gold Confederate States of America coin, one of supposedly only five in existence, which was found in the Niger River. Dirk believes that this is a clue to the long-lost Texas. He convinces his boss, retired admiral James Sandecker (William H. Macy), to let him, Al Giordino (Steve Zahn), and Rudi Gunn (Rainn Wilson), from NUMA, go to Mali to search for the CSS Texas.\nSandecker leads a private organization and partners with Governments to explore undersea wrecks and restore national treasures to museums.Dirk borrows his boss Sandecker's yacht to search for it. They give Eva and Hopper a ride, so that they can continue their investigation, for the WHO. While taking water samples they discover red algae, which puzzles them as it is not usually found in fresh water.Businessman Yves Massarde (Lambert Wilson) and dictator General Kazim (Lennie James), who controls half of civil war-torn Mali, try to stop the doctors from discovering the source of \"plague\". Kazim sends men to kill them and the NUMA team, not realizing their CIA and Navy background.Kazim sends men to attack the yacht. Dirk, Al, and Rudi survive, but the yacht is destroyed. Rudi tries to get out of the country to get help while Dirk and Al go to rescue the doctors. Kazim's men track down the doctors and kill Hopper. Dirk and Al rescue Eva. As they are leaving Mali, they are captured by the Tuareg insurgents. Tuareg who are fighting the civil war. The Tuaregs leader, Modibo (Paulin Fudouop), shows Eva his people, who are dying. After taking samples, she finds out water contains toxins, and there is no treatment available.By accident, Al stumbles into a cave with a painting showing the ironclad Texas. Dirk believes that the Texas became stranded when the river water dried up after a storm and that the same river that carried the Texas now runs underground, spreading the contamination. They start to follow the dry riverbed and work their way to the border. Dirk still hopes to find the ironclad along the way. Their plans are interrupted when they stumble upon the solar detoxification plant owned by Massarde and realize that it is the source of the contamination.Rudi and Sandecker have already deduced that chemicals are creating the red algae and seeping slowly towards the ocean, where they will expand rapidly upon entering salt water and kill ocean life worldwide. But they can't get any government help to intervene during a civil war in a sovereign country.However, Massarde and Zakara capture them, keep Eva, and send Dirk and Al in a truck to Kazim. They escape in the middle of the desert. Rebuilding a plane wreck into a land yacht, they leave the desert. They contact Sandecker, who warns them that Kazim and his troops are after them. Dirk and Al enlist Modibo's aid to return to the plant and rescue Eva. He helps them infiltrate the plant and rescue his people who are working there as slaves.Rather than risk discovery, Massarde plans to destroy the plant, making it almost impossible to stop the contamination. Al goes to defuse the bombs while Dirk tries to head off Massarde and save Eva. Massarde escapes. Dirk, Eva, and Al get away from the plant in a stolen Avions Voisin C-28 that was originally owned by Kazim but are strafed by Kazim in a helicopter gunship.A series of explosions along the dry riverbed reveals the Texas, right where the cave painting showed it to be. They take cover inside, but Kazim's helicopter's armor piercing ammunition is too much for the old ironclad's armor. They manage to fight back with the old cannon and destroy Kazim's gunship, just as Modibo arrives with Tuareg reinforcements.In the end the contamination is dealt with, and Sandecker is offered a deal to do some covert work, while the government in a serendipitous manner funds NUMA, which he accepts, tentatively. Massarde, busy eating with a businessman, does not notice that the waiter who serves him water (which he drinks) served only him and disappeared with the rest of the bottle.The Texas gold, which belongs to the CSA - Confederate States of America, is left with Modibo's people. It is implied that Massarde is poisoned by Carl, an undercover US agent, while Dirk and Eva start a relationship.",
	"links": [
		"https://www.amazon.com/Sahara-Matthew-McConaughey/dp/B07QVN5YLF"
	]
}