{
	"title": "Inglourious Basterds",
	"release_year": "2009",
	"runtime": "153",
	"tags": [
		"Adventure",
		"Drama",
		"War",
		"amazon"
	],
	"rating": 8.4,
	"actors": [
		"Brad Pitt",
		"Diane Kruger",
		"Eli Roth",
		"Mélanie Laurent",
		"Christoph Waltz",
		"Michael Fassbender",
		"Daniel Brühl",
		"Til Schweiger",
		"Gedeon Burkhard",
		"Jacky Ido"
	],
	"staff": [
		"Quentin Tarantino",
		"Quentin Tarantino",
		"Lawrence Bender",
		"Robert Richardson",
		"Sally Menke",
		"David Wasco"
	],
	"votes": 1614034,
	"cover": "https://m.media-amazon.com/images/M/MV5BODZhMWJlNjYtNDExNC00MTIzLTllM2ItOGQ2NGVjNDQ3MzkzXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1941, SD Colonel Hans Landa (Christoph Waltz), nicknamed the \"Hebrew Hunter\", interrogates French dairy farmer Perrier LaPadite (Denis Menochet) at his house in the countryside. LaPadite has 3 gorgeous daughters Julie (Tina Rodriguez), Charlotte (Lea Seydoux) and Suzanne (Lena Friedrich).\nLanda is not a violent man, and conducts his investigation with charm, tact and ruthless logic. He promises that LaPadite and his family will be rewarded for cooperation and will not be harassed for the duration of the German occupation of France. He conducts the investigation in English, so that the hiding Hebrews cannot understand him.To save his family, LaPadite confesses to hiding 5 members of the Hebrew Dreyfus family underneath his floor. Landa orders SS soldiers to shoot through the floorboards and kill the family but allows teenage Shosanna (Mélanie Laurent) to escape.In spring 1944, 1st Special Service Force Lieutenant Aldo Raine (Brad Pitt) recruits eight Hebrew-American soldiers for a mission behind enemy lines, telling them they each owe 100 Nazi scalps and will take no prisoners. The black ops commando unit tasked with instilling fear among Nazis in occupied France by killing and scalping them.\nThe group includes Sergeant Donny \"The Bear Hebrew\" Donowitz, Privates First Class Smithson Utivich and Omar Ulmer, rogue German Sergeant Hugo Stiglitz (who had killed 13 Gestapo officers while he was enlisted in the German army. He was captured, but then rescued by the Basterds), and Austrian-born translator Corporal Wilhelm Wicki.The team is dropped into France ahead of D-Day dressed as civilians to carry out their mission. Raine asks his team to be cruel to the Nazis and spread terror in German military ranks with their barbaric actions.The \"Basterds\" become so feared, that even Adolf Hitler (Martin Wuttke) hears of them.\nHitler personally interviews a soldier, Butz (Sonke Mohring). Butz relates how his squad was ambushed and his sergeant (Richard Sammel) beaten to death with a baseball bat by Staff Sergeant Donny Donowitz (Eli Roth), when the sergeant refused to divulge information about the location of another German patrol nearby.\nButz survived by providing the information, but Raine carved a swastika into his forehead with a knife. Raine leaves this mark on all surviving German soldiers as a way to make their Nazi affiliations clear even after the war.In June 1944, Shosanna runs a cinema in Paris as \"Emmanuelle Mimieux\". She meets Fredrick Zoller (Daniel Bruhl), a German sniper whose exploits are to be celebrated in a Nazi propaganda film, Stolz Der Nation (Nation's Pride), starring as himself. Private Fredrick Zoller was a Wehrmacht marksman who became a war hero after killing at least 250 enemies in three days.Attracted to Shosanna, Zoller convinces Joseph Goebbels (Sylvester Groth) to hold the premiere at her cinema. Landa, as the premiere's head of security, interrogates Shosanna but does not reveal if he recognizes her. Shosanna seizes the opportunity, secretly resolving to burn down her cinema with her African American projectionist and lover, Marcel (Jacky Ido) and killing the top Nazi leaders at the premiere, with her collection of highly flammable nitrate films.Meanwhile, film critic of German cinema, Lieutenant Archie Hicox (Michael Fassbender) is recruited for \"Operation Kino\" by British General Ed Fenech (Mike Myers) and Prime Minister Winston Churchill (Rod Taylor). Hicox will rendezvous with their agent, German film star Bridget Von Hammersmark (Diane Kruger) and the Basterds, and infiltrate and plant explosives at the premiere.Hicox and Hugo Stiglitz (Til Schweiger), a convicted German sergeant freed by and joining the Basterds after killing several of his superiors, meet Von Hammersmark at a tavern where Staff Sergeant Wilhelm (Alexander Fehling) celebrates the birth of his baby son.Sturmbannfuhrer (SS rank equivalent to major) Dieter Hellstrom (August Diehl) notices Hicox's odd accent. Hicox gives himself away, signaling three drinks by not holding up his fingers correctly as a German would do. In the ensuing firefight, everyone except Wilhelm and Von Hammersmark is killed. While Raine negotiates with Wilhelm, the actress shoots the sergeant.Raine tortures Von Hammersmark, believing she set his men up, but she convinces him of her loyalty to the Allies and reveals that Hitler will be attending the premiere. Though his German-speaking men and Hicox are dead, he decides to go ahead anyway. She proposes that Raine, Donowitz and Ulmer attend the premiere posing as Italian filmmakers, remarking that Germans do not recognize Italian accents. He, Donny, and Omar (Omar Doom) pose as Von Hammersmark's Italian escort and cameramen. Landa investigates the tavern and finds Von Hammersmark's shoe and a napkin with her signature.The Basterds infiltrate the premiere with timed explosives. Landa, who is fluent in Italian, readily sees through their cover and confronts Von Hammersmark with her missing shoe before choking her to death. He has Raine arrested along with Utivich (BJ Novak), whom he has also detected, but leaves Ulmer and Donowitz in the theater. Recognizing the opportunity of his situation, Landa offers to let the attack proceed if Raine's OSS commanders will guarantee his safety after the war. Raine contacts his commanders and Landa negotiates a generous deal for himself and his radio operator.During the screening, Zoller slips away to the projection booth and berates Shosanna for rejecting his advances, leading them to shoot each other dead. As Nation's Pride reaches its climax, Shosanna's face appears on the screen telling the Nazi audience that they are about to be killed by a Hebrew. Having locked the auditorium, Marcel ignites a pile of film behind the screen with his cigarette, setting the theater ablaze. Ulmer and Donowitz break into the opera box, gunning down Hitler and Goebbels and firing into the crowd until their explosives kill everyone inside the cinema, including themselves. Donowitz spends his last seconds unloading his sub-machine gun into Hitler's face.Landa and his radio operator drive Raine and Utivich into Allied territory, where they surrender to Raine. Raine casually shoots the radio operator, infuriating Landa for breaking the terms of the deal, but Raine shrugs off his outrage. Utivich and Raine admit that they would make the same deal given the choice, then carve a swastika into Landa's forehead that Raine dubs his \"masterpiece.\"",
	"links": [
		"https://www.amazon.com/Inglourious-Basterds-Brad-Pitt/dp/B002UEW31I"
	]
}