{
	"title": "Jurassic World",
	"release_year": "2015",
	"runtime": "124",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.9,
	"actors": [
		"Chris Pratt",
		"Bryce Dallas Howard",
		"Ty Simpkins",
		"Judy Greer",
		"Irrfan Khan",
		"Vincent D'Onofrio",
		"Nick Robinson",
		"Jake Johnson",
		"Omar Sy",
		"BD Wong"
	],
	"staff": [
		"Colin Trevorrow",
		"Rick Jaffa",
		"Amanda Silver",
		"Colin Trevorrow",
		"Derek Connolly",
		"Patrick Crowley",
		"Frank Marshall",
		"Michael Giacchino",
		"John Schwartzman",
		"Kevin Stitt",
		"John Papsidera",
		"Ed Verreaux"
	],
	"links": [
		"https://www.amazon.com/Jurassic-World-Dominion-Chris-Pratt/dp/B0B5KXT1LL"
	],
	"votes": 687682,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzBhNzlkM2UtZTQyOC00NjUyLTkzMmMtNDQ1YTM5N2NmMGE5XkEyXkFqcGc@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "Twenty-two years after the incident at Jurassic Park, a new theme park, Jurassic World, now operates in Isla Nublar. Brothers Zach (Nick Robinson) and Gray Mitchell (Ty Simpkins) are sent there to visit their aunt, Claire Dearing (Bryce Dallas Howard), the park's operations manager, for their winter break which will last a week.\nZach and Gray are sons of Karen (Judy Greer) and Scott (Andy Buckley), and Karen is Claire's sister. The brothers are big time dinosaur aficionados. Claire manages 20,000 people a day at the park. To get to the park, the brother take a flight to Costa Rica and from there, they get on a ferry to Isla Nublar. When the park opened it has 8 species, and now has 8 herbivores and 6 carnivores. The ferry jetty is connected to the main park area via a cross Island electric train.Claire has granted Zach and Gray VIP access, so they can get into all the rides without waiting in line anywhere.\nClaire's assistant Zara (Katie McGrath) is their guide as Claire is too busy recruiting corporate sponsors with a new attraction, a genetically modified dinosaur called Indominus Rex. The dinosaur has the DNA of several predatory dinosaurs as well as modern-day animals; chief geneticist Dr. Henry Wu (B. D. Wong) keeps the exact genetic makeup classified.The operating costs of the park are up, and revenues are falling as kids these days are not excited by seeing a dinosaur anymore. Hence cooking up hybrid species of dinosaurs is critical to maintaining audience interest. Consumers want them bigger, louder with more teeth. Wu is using gene Splicing to mix the DNA of different dinosaurs to come up with new species. Indominus Rex was designed to be 50 feet tall. Attendance spike with unveiling of every new asset, with global news coverage and celebrity visitors.Claire cannot see the kids till later that night. Gray and Zach escape from Zara and go off to explore the park on their own. The park control room is manned by Lowrey (Jake Johnson) and Vivian (Lauren Lapkus). The park also hosts one of the older T Rex from the original Jurassic Park.Owen Grady (Chris Pratt) trains the park's Velociraptor pack that considers him their alpha. The raptor squad is composed of Blue, Charlie, Delta, and Echo, and Owens is researching their intelligence.\nHoskins (Vincent D'Onofrio), head of park security, believes they are trainable for military use, but Owen disputes this. Hoskins says that the military is looking for ways to reduce casualties and replacing them with trained predators evolved 75 million years ago, would revolutionize the whole war zone.Park owner Simon Masrani (Irrfan Khan) (CEO of the Masrani Corporation) has Owen evaluate the Indominus ' enclosure before the attraction opens in 3 weeks' time. Hammond entrusted Masrani with his dying wish InGen, which controls the park and the Island.\nOwen warns Claire that the Indominus is particularly dangerous because it is not socialized to other animals. Indominus is white, bigger than anticipated, can sense thermal radiation and has displayed intelligence by anticipating where is gets its food from. Indominus ate its own sibling.Owen and Claire went on a date earlier but didn't hit it off. Claire was too organized, and Owen turned up to a date in shorts.\nOwen and Claire discover that the Indominus has seemingly escaped (there are claw marks on the outer walls and the thermal scanners inside the enclosure cannot detect a heat signature). Owen and two staff enter the enclosure, but the Indominus ambushes them, having faked its escape. Claire finds from the control room that the Indominus is in the enclosure (from the tracker embedded in it).\nThe Indominus, which can camouflage itself and mask its heat signature, suddenly appears and devours the other two men, but Owen manages to survive (he pours gasoline on himself as Claire had told him that the Indominus is sensitive to smell). However, the Indominus escapes from its paddock (removes the tracker from its back) and into the island's interior.Realizing that it is highly vicious and intelligent, Owen advises Masrani to have the specimen destroyed but to protect his company's investment, Masrani dispatches a specialized Asset Containment Unit to subdue it with non-lethal weaponry so that it can safely be returned to its paddock. When it kills most of the team, Claire orders the northern portion of the island to be evacuated. Masrani ponders Owen's warning and accosts Wu.Zach and Gray, having sneaked away to explore, ignore the evacuation order and wander into a restricted area in a Gyrosphere. The vehicle is attacked by the Indominus but they escape unharmed. They find the ruins of the original Jurassic Park Visitor Center, and, after repairing an old Jeep, drive back to the park's resort area. Owen and Claire trail them after barely escaping the Indominus themselves. The Indominus continues its rampage and breaks into the park's Pterosaur aviary.Masrani and two troopers hunt the Indominus by helicopter, but a collision with the escaping Pterosaurs causes them to crash, killing everyone aboard, before converging onto the resort, and attacking everyone, including Zara who is then devoured by a Mosasaurus.\nGray and Zach arrive at the resort as the Pterosaurs begin attacking the visitors. They find Owen and Claire while armed troopers subdue the Pterosaurs.Hoskins assumes command and decides to use the raptors to track the Indominus; Owen reluctantly agrees to go along with the plan. The raptors follow the Indominus ' scent into the jungle. However, the Indominus, having raptor DNA, communicates with the raptors and turns them against the humans. Troops fire on the Indominus, but it escapes. The raptors slaughter most of the soldiers, while Charlie is killed in the chaos.Hoskins, meanwhile, has Dr. Wu helicoptered off the island with the dinosaur embryos, protecting his research. Owen, Claire, and the boys find Hoskins in the lab packing up remaining embryos. As Hoskins unveils his intention to create more genetically modified dinosaurs as weapons, Delta breaks into the lab and kills him.Outside, the raptors corner Owen, Claire, and the boys. Owen reestablishes his alpha bond with them before the Indominus appears. They attack the hybrid, but Delta and Echo are killed while Blue is knocked unconscious.\nRealizing they are outmatched; Claire lures the park's veteran Tyrannosaurus Rex into a battle with the Indominus. The T. Rex is overpowered until the lone surviving raptor Blue attacks. The raptor and T. Rex force the overwhelmed Indominus towards the lagoon, where it is dragged underwater by the park's resident Mosasaurus (a large water residing dinosaur).The survivors are evacuated to the mainland and the island is abandoned to the dinosaurs. Zach and Gray are reunited with their parents, while Owen and Claire decide they will stay together \"for survival\".\nBack on the now-abandoned Isla Nublar, the Tyrannosaurus goes up to the helicopter landing pad and roars in victory, reestablishing her dominance as Queen of the Island."
}