{
	"title": "A Good Year",
	"release_year": "2006",
	"runtime": "117",
	"tags": [
		"Comedy",
		"Drama",
		"Romance",
		"amazon"
	],
	"rating": 6.9,
	"actors": [
		"Russell Crowe",
		"Abbie Cornish",
		"Albert Finney",
		"Marion Cotillard",
		"Freddie Highmore",
		"Rafe Spall",
		"Archie Panjabi",
		"Richard Coyle",
		"Ben Righton",
		"Patrick Kennedy"
	],
	"staff": [
		"Ridley Scott",
		"Marc Klein",
		"Peter Mayle",
		"Ridley Scott",
		"Marc Streitenfeld",
		"Philippe Le Sourd",
		"Dody Dorn",
		"Antoinette Boulat",
		"Jina Jay",
		"Sonja Klaus"
	],
	"votes": 102424,
	"cover": "https://m.media-amazon.com/images/M/MV5BYTc5Mzk3ZWItOWEzNC00NjAyLWE3MGMtYTlhMDQwNzAyOWQwXkEyXkFqcGc@._V1_QL75_UY281_CR2,0,190,281_.jpg",
	"description": "Young Max Skinner (Russell Crowe), whose parents died in an accident, spends his childhood summer holidays learning to appreciate the finer things at his Uncle Henry's (Albert Finney) vineyard estate in Provence in southeastern France. Max learns about the vintages and tastes of wines from Uncle Henry. He also learns that a blue suit is indispensable and learns to play chess. Uncle Henry also taught Max to lose gracefully. He says that losing is inevitable and the trick is not to make a habit of it.Twenty-five years later, Max is a successful but arrogant workaholic trader in London with a Cheeky-Chappy persona. Max is a master manipulator of the markets. He engineers a crisis in bonds by selling them. This prompts the other holders to sell them as they believe that the market is tanking, and then he buys the same bonds back for cheap. He makes $77 million in one day of trading. There is talk of insider trading and market manipulation.\nBert (Daniel Mays) is the doorman of the exclusive apartment where he stays. Max thrives on people hating him. Charlie Willis (Tom Hollander) is Max's real estate agent in London.Following his uncle's death, Max is the sole beneficiary of the French property. He travels to Provence to prepare a quick sale. Max arrives at the estate and has a brief tinge of nostalgia when he remembers all the places where he spent time with Uncle Henry.\nCharlie continues to guide Max on the proper legal procedure to sell the estate as fast as possible. Charlie gets Max to get the soil of the vineyard tested and get some photos to get the best value out of the sale.Shortly after arriving, by driving while fumbling with a cell phone (talking to Charlie and trying to write down his email ID), he unknowingly causes a local cafe owner, Fanny Chenal (Marion Cotillard), to crash her bicycle.\nSubsequently, he discovers that his latest City financial stunt has caused real trouble for the owners of the trading company he works for, and he is ordered to return to London as soon as possible.\nNathalie Auzet (Valeria Bruni Tedeschi) is the town Notaire. A Notaire is a government-appointed lawyer whose role is essential for all real estate transactions: if property is bought, sold, donated or inherited, a Notaire will draft the act, record it, levy the appropriate taxes (such as inheritance taxes), and deliver the deeds of property. Max tells Auzet that he plans to sell the estate and return to his life in LondonTo assist in his planned sale of the property, Max hurriedly snaps some photos and, in the process, falls into an empty swimming pool. He is unable to escape until Fanny, driving by and spotting his rental car, turns on the water supply in retaliation. This delay causes Max to miss his flight and, having failed to report to the directors in person, he is suspended from work and trading activities for one week.On Henry's estate, Max must deal with a gruff, dedicated winemaker, Francis Duflot (Didier Bourdon), who fears being separated from his precious vines. Duflot tells Max that Uncle Henry didn't want Max to sell the property, but Max is clear that they can never be certain as Henry never left a will. Max offers a generous settlement to Duflot when he sells the estate, but this only insults Duflot.\nDuflot pays a vineyard inspector to tell Max that the soil is bad and the vines worthless.Charlie and Max anyways had the strategy to sell the estate to an American buyer, who would not know anything about vines.They are surprised by the arrival of young Napa Valley Oenophile Christie Roberts (Abbie Cornish), who is backpacking through Europe and claims to be Henry's previously unknown illegitimate daughter. Max realizes, but does not tell her, that French law decrees that even though she is not his uncle's legitimate daughter, she still becomes the rightful heir to the Chateau and vineyards.As Max did earlier, Christie finds the house wine unpalatable but is impressed by Max's casual offering of the boutique Le Coin Perdu (\"the lost corner\") vintage, noting some intriguing characteristics. During dinner at the Duflot house, while slightly inebriated, Max exposes his concern that she might lay claim to the estate and brusquely interrogates her.\nMax's assistant Gemma (Archie Panjabi) warns him of the ambitious antics of other employees. To ensure he is not usurped by Kenny (Rafe Spall), his second-in-command in London, through whom Max continues to direct trades, he intentionally gives the ambitious young trader bad advice, getting him fired.Max becomes enamored with Fanny, who is rumored to have sworn off men. He successfully woos her into his bed. She leaves him the next morning, expecting him to return to his life in London. A disillusioned Christie also decides to move on. Max finds his uncle's memoirs, which contain proof of her heritage.\nMax bids her farewell while handing her an unexplained note inside a book she was reading. While informing Duflot of the pending estate sale, Max learns that the mysterious expensive Le Coin Perdu was made by Henry and Duflot with \"illegal vines\" from the estate, bypassing wine classification and appellation laws.The estate is sold and Max returns to London where Sir Nigel (Kenneth Cranham), the company chairman, offers him a choice: either a large discharge settlement, or the partnership in the trading firm. Max asks about Nigel's art in the conference room, van Gogh's \"Road with Cypress and Star\", which Fanny has a copy of in her restaurant. Upon Nigel's dismissive comment that the real one is kept in a vault and the $200,000 copy in the office is for show, Max reconsiders if he wants to still be like Nigel.Max invalidates the estate's sale with the farewell letter he gave to Christie, which he forged, along with real photos confirming Christie as Henry's daughter with a valid claim to the entire estate. (As a child, Max signed checks for his uncle and is able to replicate his handwriting.)He puts his London residence up for sale and returns to Provence, entering into a relationship with Fanny, both of them remembering their connection as kids. Christie also returns and she and Francis jointly run the vineyard while trying to reconcile their vastly different philosophies of wine production. This enables Max to focus his entire attention on Fanny.",
	"links": [
		"https://www.amazon.com/Good-Year-Russell-Crowe/dp/B000NTMWYU"
	]
}