{
	"title": "The Lake House",
	"release_year": "2006",
	"runtime": "99",
	"tags": [
		"Drama",
		"Fantasy",
		"Romance",
		"amazon"
	],
	"rating": 6.8,
	"actors": [
		"Keanu Reeves",
		"Sandra Bullock",
		"Christopher Plummer",
		"Ebon Moss-Bachrach",
		"Willeke van Ammelrooy",
		"Dylan Walsh",
		"Shohreh Aghdashloo",
		"Lynn Collins",
		"Mike Bacarella",
		"Kevin M. Brennan"
	],
	"staff": [
		"Alejandro Agresti",
		"David Auburn",
		"Eun-Jeong Kim",
		"Ji Na Yeo",
		"Doug Davison",
		"Roy Lee",
		"Rachel Portman",
		"Alar Kivilo",
		"Alejandro Brodersohn",
		"Lynzee Klingman",
		"Nathan Crowley"
	],
	"votes": 158997,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTYxMTgxNDI3MV5BMl5BanBnXkFtZTcwMzIxMTIzMw@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "In 2006, Dr. Kate Forster (Sandra Bullock) is leaving a lake house that she has been renting in Chicago. Kate leaves a note in the mailbox for the next tenant to forward her mail, adding that the paint-embedded paw-prints on the path leading to the house were already there when she arrived.Two years earlier in 2004, Alex Wyler (Keanu Reeves), an architect, arrives at the lake house and finds Kate's letter in the mailbox. The house is neglected, with no sign of paw prints anywhere. During the subsequent restoration of the house, a dog runs through Alex's paint and leaves fresh paw prints right where Kate said they would be. Baffled, Alex writes back, asking how Kate knew about the paw prints since the house was unoccupied until he arrived. On Valentine's Day 2006, Kate witnesses a traffic accident near Daley Plaza and tries to save the male victim, unsuccessfully. She impulsively drives back to the lake house, finds Alex's letter and writes back.Alex is estranged from his father Simon J. Wyler (Christopher Plummer), who runs a large architecture firm, but stays in touch with his brother Henry. The lake House was built by Simon and Alex has purchased it, so that he can relive the memories of his childhood. Simon had built the lake house with his own hands, before he was a big shot and was still in love with his wife Mary (the house was a gift to her). But as Simon became more successful, he also became more difficult to live with, until Mary ditched him. She got sick and died within a year, but Simon didn't attend her funeral.\nAlex visits the address given by Kate but finds no building there (it is still under construction in 2004).Both Alex and Kate continue passing messages to each other via the mailbox, and each watches its flag go up and down as the message leaves and the reply arrives as they wait at the mailbox. They cautiously look around each time the flag changes, hoping to somehow spot the other. It is in vain as they are alone at the mailbox. They then discover that they are living exactly two years apart. Their correspondence takes them through several events, including Alex finding a book, Jane Austen's Persuasion, at a railway station where Kate said she would have lost it, and Alex taking Kate on a walking tour of his favorite places in Chicago via an annotated map that he leaves in the mailbox.In 2004, Kate was dating Morgan Price (Dylan Walsh), who had come to town to meet her. Alex's dog (in 2004) Jake runs to Kate's house and Alex chases him. Thats how Alex meets Morgan and tells him how he lives on the house on the lake. Morgan says that he wants to rent the house for Kate. Morgan invites Alex for his party.\nAlex eventually meets Kate at her boyfriend's party; however, he doesn't mention their exchange of letters because it had not happened to Kate yet. Kate later remembered the meeting as a vague memory in the past. They shared a dance (& a kiss) and talked about Kate's favorite book \"Persuasion\", which is about true love having to wait for the right time before the lovers could unite.As Alex and Kate continue to write to each other, they decide to try to meet again. Alex makes a reservation at the Il Mare restaurant - two years into Alex's future, but only a day away for Kate. Kate goes to the restaurant, but Alex fails to show. Heartbroken, Kate asks Alex not to write to her again, recounting the accident a year before. Both Alex and Kate leave the lake house, continuing on with their separate lives. Kate gets back together with Morgan; Alex vacates the lake house and rents it out to Morgan and Kate starts living there.On Valentine's Day 2006 for Alex, Valentine's Day 2008 for Kate, he returns to the lake house after something about the day triggers a memory. Meanwhile, Kate goes to an architect to review the renovation plans for a house that she now wants to buy. A drawing of the lake house on the conference room wall catches her attention and upon asking, Henry Wyler (Ebon Moss-Bachrach) informs her the artist was his brother, Alex, and Kate realizes that this was the same Alex with whom she had been corresponding. She also learns that Alex was killed in a traffic accident exactly two years ago to the day and realizes why he never showed up for their date - he was the man who died in Daley Plaza.Rushing to the lake house, Kate frantically writes a letter telling Alex she loves him but begs him not to try to find her if he loves her back. Wait two years, she says, and come to the lake house instead. Meanwhile, in 2006, Alex has gone to Daley Plaza to look for Kate.\nAt the lake house, Kate drops to her knees sobbing, fearing that she has arrived too late to stop Alex. After a long pause, the mailbox flag finally lowers; Alex has picked up her note. Not long afterwards, a familiar mint-green truck pulls up. She walks forward smiling as the driver, clad in jeans and a familiar tan jacket, approaches. She and Alex kiss and walk toward the lake house.",
	"links": [
		"https://www.amazon.com/Lake-House-Keanu-Reeves/dp/B000K8EQ5W"
	]
}