{
	"title": "P.S. I Love You",
	"release_year": "2007",
	"runtime": "126",
	"tags": [
		"Comedy",
		"Drama",
		"Romance",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Hilary Swank",
		"Gerard Butler",
		"Harry Connick Jr.",
		"Lisa Kudrow",
		"Gina Gershon",
		"James Marsters",
		"Kathy Bates",
		"Nellie McKay",
		"Jeffrey Dean Morgan",
		"Dean Winters"
	],
	"staff": [
		"Richard LaGravenese",
		"Richard LaGravenese",
		"Steven Rogers",
		"Cecelia Ahern",
		"Wendy Finerman",
		"Broderick Johnson",
		"Andrew A. Kosove",
		"Molly Smith",
		"John Powell",
		"Terry Stacey",
		"David Moritz",
		"Shepherd Frankel"
	],
	"votes": 219658,
	"cover": "https://m.media-amazon.com/images/M/MV5BNTg2MDg4MjI5NV5BMl5BanBnXkFtZTcwMzQ0MDczMw@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "On a country road in Ireland over ten years ago, it was love at first sight for Holly, a lost young tourist (Academy Award® winner, Hilary Swank), and Gerry, a charming local lad (Gerard Butler). Hollys formidable mother, (Kathy Bates), disapproved of the couple, concerned that her spirited daughter was too young for marriage. In the years since, the once fearless Holly has become unsure of her own identity. When Gerry dies with a brain tumor and leaves Holly a widow just shy of her thirtieth birthday, her family and best friends (Lisa Kudrow, Gina Gershon) are concerned that she will never emerge from her takeout container-strewn Manhattan apartment. After weeks holed up watching old movies, a birthday cake and tape recording message from Gerry mysteriously arrives, marking the beginning of a series of letters instructing her to perform unusual requests. With the help of her girlfriends, Holly begins a year of wild adventures and a life journey that Gerry has planned for her, helping her to discover who she is without him and reminding her - p.s. I Love You.P.S. I Love You is based on the best-selling novel by Cecelia Ahern.",
	"links": [
		"https://www.amazon.com/P-S-Love-You-Hilary-Swank/dp/B00171EO0I"
	]
}