{
	"title": "Open Season",
	"release_year": "2006",
	"runtime": "86",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Ashton Kutcher",
		"Martin Lawrence",
		"Debra Messing",
		"Gary Sinise",
		"Billy Connolly",
		"Georgia Engel",
		"Jon Favreau",
		"Jane Krakowski",
		"Gordon Tootoosis",
		"Patrick Warburton"
	],
	"staff": [
		"Roger Allers",
		"Jill Culton",
		"Steve Bencich",
		"Ron J. Friedman",
		"Nat Mauldin",
		"Jill Culton",
		"Michelle Murdocca",
		"Ramin Djawadi",
		"Paul Westerberg",
		"Ken Solomon",
		"Pam Ziegenhagen",
		"Mary Hidalgo",
		"Ruth Lambert",
		"Michael Humphries"
	],
	"votes": 107266,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTQwOTg2MjU0OV5BMl5BanBnXkFtZTcwMzIzNTQzMQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In the small town of Timberline, Colorado, a domesticated grizzly bear named Boog lives a cozy life as the star of the town's nature show. Raised by Beth, a compassionate park ranger who adopted him as a cub, Boog enjoys a comfortable existence in her garage-turned-habitat. One day, a hunting enthusiast named Shaw drives into Timberline with a one-antlered mule deer named Elliot tied to the hood of his truck. When Beth confronts Shaw, Boog secretly frees Elliot, who quickly decides they are friends. That night, Elliot convinces Boog to sneak out, leading the pair to raid a convenience store called PuniMart. While Elliot escapes, Boog is caught by the sheriff, Gordy, who warns Beth that Boog's instincts may be awakening and suggests it might be time to release him into the wild.The following morning, Elliot, being chased by Shaw, seeks Boog's help during the nature show. Boog tries to shoo him away, but the commotion panics the audience, who mistake it for an attack. Beth tranquilizes both animals just as Shaw attempts to shoot. To protect Boog, and following Gordy's advice, Beth relocates him and Elliot to the Timberline National Forest, two days before open hunting season. She leaves them above a waterfall, where they are legally safe from hunters.Boog, unfamiliar with the wilderness and angry about losing his home, reluctantly relies on Elliot as his guide to find a way back to Timberline. Along their journey, they encounter unfriendly forest animals, including McSquizzy, a Scottish-accented squirrel who leads an army of acorn-throwing squirrels; Reilly, a no-nonsense beaver, and his construction crew; and Elliot's estranged herd, led by the pompous buck Ian and the doe Giselle, who is the object of Elliot's affections. Despite initial conflicts, Boog and Elliot begin to bond as they realize they are both outcasts. Boog even considers letting Elliot stay with him once they return to Beth.The next day, Elliot tries to help Boog leave the forest, but it becomes clear he has no idea where they are. Their misadventures lead them to Shaw, and in their attempt to escape, they accidentally destroy Reilly's dam, causing a massive flood that sweeps everyone over the waterfall into the hunting grounds. The other animals blame Boog for their predicament, but Elliot defends him. However, when Boog learns Elliot lied about knowing the way home, he angrily ends their friendship. Alone and upset, Boog stumbles upon Shaw's log cabin and discovers his gruesome collection of hunting trophies. When Shaw returns, Boog narrowly escapes and finds a road leading back to Timberline. Realizing the other animals are in grave danger, Boog decides to return and protect them.Reunited with Elliot, Boog rallies the forest animals to fight back against the hunters. They scavenge supplies from an RV owned by Bob and Bobbie, a quirky couple searching for Bigfoot, while their dachshund, Mr. Weenie, joins the forest animals. The next day, Boog leads a counterattack, turning the tables on the hunters. McSquizzy dramatically ends the battle by using a propane tank to blow up the hunters' trucks, sending them fleeing.Shaw, however, refuses to give up and confronts Boog for a final showdown. When Shaw aims his gun at Boog, Elliot leaps in the way and takes the shot. Enraged, Boog overpowers Shaw and ties him up with his own rifle. The animals celebrate their victory, and Boog discovers Elliot survived the ordeal, though he lost his remaining antler. Together, the forest animals humiliate Shaw by covering him in honey and feathers, sending him running into the woods.Beth arrives in a helicopter to take Boog home, but he chooses to stay in the forest, having found a new family among the wildlife. With Beth's blessing, Boog embraces his new life in the wild.In a humorous post-credits scene, a tarred and feathered Shaw emerges from the forest at night, only to be mistaken for Bigfoot by Bob and Bobbie, who accidentally run into him with their RV.",
	"links": [
		"https://www.amazon.com/Open-Season-Martin-Lawrence/dp/B000N2MOX6"
	]
}