{
	"title": "Disturbia",
	"release_year": "2007",
	"runtime": "105",
	"tags": [
		"Crime",
		"Drama",
		"Mystery",
		"amazon"
	],
	"rating": 6.8,
	"actors": [
		"Shia LaBeouf",
		"David Morse",
		"Carrie-Anne Moss",
		"Sarah Roemer",
		"Aaron Yoo",
		"Jose Pablo Cantillo",
		"Matt Craven",
		"Viola Davis",
		"Brandon Caruso",
		"Luciano Rauso"
	],
	"staff": [
		"D.J. Caruso",
		"Christopher Landon",
		"Carl Ellsworth",
		"Jackie Marcus Schaffer",
		"Joe Medjuck",
		"E. Bennett Walsh",
		"Geoff Zanelli",
		"Rogier Stoffers",
		"Jim Page",
		"Deborah Aquila",
		"Tricia Wood",
		"Tom Southwell"
	],
	"votes": 259343,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTMyNTIxOTQ3M15BMl5BanBnXkFtZTcwMjU2NzAzMw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Troubled outcast teenager Kale Brecht (Shia LaBeouf) punches his Spanish teacher Senor Gutierrez (Rene Rivera), in the face when the Spanish teacher mentions his recently deceased father while reprimanding him for sleeping in class. A sympathetic judge (Charles Carroll) sentences him to three months house arrest, with an ankle monitor and a proximity sensor.Kale's father Danny (Matt Craven) died recently in a car accident. Kale was very close to Danny and the 2 would frequently go fishing together. They were returning from a fishing trip and Kale was driving when the car overturned when Kale was distracted while talking on the phone with his mother. Then another car crashes into their overturned car and that led to Danny's death. Kale blames himself for the loss of life that day.On Kale's first day of house arrest, Detective Parker (Viola Davis) explains the monitor. Kale is only allowed to go 100 feet from the proximity sensor (which is set up inside the house). Once the sensor is triggered, Kale has 10 seconds to get back to the safe zone. Julie, his mother, has to pay a daily incarceration fee of $12.\nThe officer overseeing him, Gutierrez, is revealed to be the cousin of the Spanish teacher he had hit. Kale watches TV and plays video games until his frustrated mother Julie (Carrie-Anne Moss) cancels his Xbox Live subscription and cuts his TV's cord. Kale clearly misses his father. Julie has a full-time job as a real estate agent and wants Kale to at least keep the house clean.\nBored, Kale watches his neighborhood with binoculars, including his attractive new neighbor Ashley Carlson (Sarah Roemer), and Robert Turner (David Morse), a solitary man. Ashley has moved in with her parents Mr Carlson (Kevin Quinn) and Mrs Carlson (Elyse Mirto).Kale accidentally trips his proximity sensor after chasing prankster children (Luciano Rauso, Brandon and Daniel Caruso) who had put a pile of flaming poo on his doorstep. Kale manages to return to the safe zone in time. Still, Gutierrez shows up and cuffs Kale and is rough with him. Kale believes that Gutierrez will never treat him fairly as he is the teacher's cousin.\nGradually, Kale introduces himself to Ashley. Ashley knows that Kale is observing her from his house, using binoculars.One night, Kale becomes suspicious of Turner after he returns home in a 1960s Ford Mustang with a dented fender, which matches the description of a car given on a news report of a serial killer at large. Befriending Ashley (she comes to meet Kale and Robbie when she gets locked out of her own house and realizes that they have been spying on neighbors), they begin to spy on Turner with Kale's best friend Ronnie (Aaron Yoo). But when Ashley sees the mustang, she finds no dent on the left fender.\nTurner arrives home with a woman, who they later see running frantically from him. Turner sees that Kale is watching his house with binoculars. But later, the woman simply appears to drive away from Turner's home, as Kale sees a woman getting into her car and drive away.The next day Turner helps Julie with a flat tire at the grocery store and uses that as an excuse to enter her house and meet Kale formally. Turner sees that Kale wears an ankle proximity bracelet.Kale becomes jealous when Ashley throws a party and flirts with popular people from school, prompting him to blast non-party-related music to disrupt her party. Ashley breaks into the house to turn it off, and Kale reveals he has been observing her since she moved in and is romantically interested, so they kiss.\nAt the same time, Turner is shown to have slashed something with blood in his house and carry the body in a blue bag to his garage. Ashley only manages to get a glimpse of the blue bag with some red smears on it. Ashley and Kale decide to investigate further.The following day, Kale has Ashley follow Turner to the supermarket so Ronnie can obtain Turner's garage controller's code. She agrees, but Turner catches her in the parking lot and intimidates her. Shaken, Ashley stops helping in the investigation.\nRonnie then realizes he left his phone in Turner's car and breaks into his garage, with Kale watching at a distance. When Ronnie gets trapped when the garage door closes, Kale tries to rescue him, but alerts the police by tripping the ankle monitor. They arrive and search the garage, as Kale accuses Turner of murder. However, they only find a bag containing a roadkill deer. The officers don't find Ronnie and Kale suspects that Turner has taken them hostage.Julie goes to Turner's house to convince him not to press charges against Kale. Ronnie escapes from Turner's house and gives Kale the video he made while running through the house. Freezing a frame and zooming in, Kale sees the corpse of the woman from earlier. Kale realizes that the woman never drove away, and it was Turner in a disguise who drove the woman's car away to remove the suspicion.Meanwhile, Turner incapacitates and binds Julie. Turner enters their house, bashing Ronnie over the head with a bat. After binding and gagging Kale, he reveals he will frame him for the murders (He says Kale will appear to have killed Ronnie for seeing Ashley behind his back. Then Kale would kill Julie for blaming him for his father's death) and make it appear that Kale then killed himself.\nHowever, Ashley arrives, distracting Turner and allowing Kale to club him in the face. Kale throws him from the top of the stairs before Ashley frees him. They jump out of the window into her pool as Turner resurfaces. Kale's ankle monitor again alerts the police.Looking for his mother, Kale enters Turner's home. Inside, he finds evidence of Turner's previous murders, including the corpses of his victims and a woman's dress and wig, indicating Turner posed as the woman leaving the house the night Kale and Ashley were watching. When Officer Gutierrez (Jose Pablo Cantillo) arrives, Turner snaps his neck. Kale finds his mother bound and gagged in the cellar. Turner appears, slashes him in the back and pins him to a wall. Before Turner can kill Kale, Julie stabs him in the leg with a screwdriver, allowing Kale to impale Turner with gardening shears.Following the discovery of the murders, Kale's ankle bracelet is removed early for good behavior. Kale exacts revenge on the prankster neighborhood children before kissing Ashley on his sofa, while Ronnie playfully videotapes them.",
	"links": [
		"https://www.amazon.com/Disturbia-Widescreen-Shia-LaBeouf/dp/B000RO6K9E"
	]
}