{
	"title": "War of the Worlds",
	"release_year": "2005",
	"runtime": "116",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Tom Cruise",
		"Dakota Fanning",
		"Tim Robbins",
		"Miranda Otto",
		"Justin Chatwin",
		"Rick Gonzalez",
		"Yul Vazquez",
		"Lenny Venito",
		"Lisa Ann Walter",
		"Ann Robinson"
	],
	"staff": [
		"Steven Spielberg",
		"Josh Friedman",
		"David Koepp",
		"H.G. Wells",
		"Kathleen Kennedy",
		"Colin Wilson",
		"John Williams",
		"Janusz Kaminski",
		"Michael Kahn",
		"Terri Taylor",
		"Debra Zane",
		"Rick Carter"
	],
	"votes": 480674,
	"cover": "https://m.media-amazon.com/images/M/MV5BNDUyODAzNDI1Nl5BMl5BanBnXkFtZTcwMDA2NDAzMw@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "The film begins with Morgan Freeman's voice saying \"No one would have believed in the early years of the 21st century that our world was being watched by intelligence greater than our own; that as men busied themselves about their various concerns, *they* observed and studied, the way a man with a microscope might scrutinize the creatures that swarm and multiply in a drop of water. With infinite complacency, men went to and fro about the globe, confident of our empire over this world. Yet across the gulf of space, intellects vast and cool and unsympathetic regarded our planet with envious eyes and slowly, and surely, drew their plans against us.\"Ray Ferrier (Tom Cruise) a container crane operator at New York city port, estranged from his children, is visited by his ex-wife, Mary Ann (Miranda Otto), who drops off their children, Rachel (Dakota Fanning) and Robbie (Justin Chatwin), at his house as she is going to Boston to meet her parents. When Robbie takes Ray's car out without his permission, Ray goes out to search for him and notices a strange wall cloud, which starts to send out electromagnetic pulses in the form of lightning. This disables all electronic devices in the area, including cars, forcing Robbie to return. Ray leaves to investigate, telling Manny, the local mechanic, to replace the solenoid on a dead car.Ray reaches the place where lighting struck and finds a hole has appeared in the ground from which a massive machine with three long legs appears. After emerging, the Tripod opens fire with destructive heat-rays, vaporizing bystanders and destroying everything in its path. Ray manages to escape; he packs up his kids and leaves in the vehicle Manny repaired as the Tripod destroys the town. He drives to Mary Ann's house to take refuge that night. Loud and violent explosions occur in their sleep. The next morning, he discovers that the tripods have caused a Boeing 747 to crash into the houses. He meets a news team surveying the wreckage. The sole female member shows him footage of Tripods invading Earth, with the unknown pilots riding down the lightning to the machines and using them to destroy other cities, revealing that they have been preparing this invasion for a long time.Ray flees to join Mary Ann in Boston. Robbie, obsessed with joining the fight against the hostile aliens, tries to leave with the U.S. military, but Ray and Rachel stop him. They are forced to leave their car after a mob attacks them in order to take the vehicle, and survive a Tripod attack while navigating the Hudson River on a ferry. The family then encounters the military preparing an attack on the Tripods. Upon seeing Robbie's determination to join the fight, Ray lets him go with the military. After he disappears, the tripods destroy all military resistance and presumably killing Robbie in the process. The tripods are revealed to be protected by some kind of energy shield that makes them invulnerable to all forms of attack. While escaping, Ray and Rachel are offered shelter and protection by a stranger, Harlan Ogilvy (Tim Robbins), who vows revenge on the aliens after his family was killed upon their arrival.While hiding in Harlan's basement, they witness the Tripods spreading a strange red weed substance over the ground, and avoid detection by aliens who arrive to explore the basement. The following morning, Ogilvy suffers a mental breakdown after witnessing a Tripod harvesting blood and tissue from a human to fertilize the weed. Concerned that Ogilvy's yelling and ranting will attract the Tripods, Ray kills Ogilvy to silence him.Ray and Rachel's hideout is exposed when a probe catches them. Ray cripples the probe using an ax, but Rachel is caught by a Tripod, ironically the same one that Ray saw in the beginning that destroyed the town. While pursuing the Tripod, Ray finds several hand grenades and detonates one of them to attract the Tripod's attention, intending to be captured to try to rescue Rachel. His plan works and he is put into a basket with Rachel and several other prisoners. The aliens try to pull Ray inside the Tripod to be used as fertilizer, but the other prisoners manage to save him. Then, the grenades left by Ray inside the Tripod detonate, causing the Tripod to collapse, and freeing all the captives.Ray and Rachel arrive in Boston, where they notice the red weeds are starting to dry up and die, and the Tripods appear to be dying also. They witness a Tripod acting strangely. Ray notices that a cluster of birds are circling and landing on the machine, indicating its force fields are no longer functioning. Ray alerts nearby soldiers, who attack and destroy the Tripod. Approaching the downed machine, a hatch opens, releasing a copious amount of red weed fertilizer and revealing an alien as it dies. Ray and Rachel reach Mary Ann's parents' (who are portrayed by Ann Robinson and Gene Barry, the stars of the 1953 film version) house and find her and, to their surprise, Robbie, who has survived the attacks.As the camera zooms out, the film ends with Freeman's voice saying, \"From the moment the invaders arrived, breathed our air, ate and drank, they were doomed. They were undone, destroyed, after all of man's weapons and devices had failed, by the tiniest creatures that God in his wisdom put upon this earth. By the toll of a billion deaths, man had earned his immunity, his right to survive among this planet's infinite organisms. And that right is ours against all challenges. For neither do men live nor die in vain.\"",
	"links": [
		"https://www.amazon.com/War-Worlds-Tom-Cruise/dp/B00005JNTI"
	]
}