{
	"title": "The Illusionist",
	"release_year": "2006",
	"runtime": "110",
	"tags": [
		"Drama",
		"Fantasy",
		"Mystery",
		"amazon"
	],
	"rating": 7.5,
	"actors": [
		"Edward Norton",
		"Jessica Biel",
		"Paul Giamatti",
		"Rufus Sewell",
		"Eddie Marsan",
		"Jake Wood",
		"Tom Fisher",
		"Aaron Taylor-Johnson",
		"Eleanor Tomlinson",
		"Karl Johnson",
		"Karl Johnson"
	],
	"staff": [
		"Neil Burger",
		"Neil Burger",
		"Steven Millhauser",
		"Brian Koppelman",
		"David Levien",
		"Michael London",
		"Cathy Schulman",
		"Philip Glass",
		"Dick Pope",
		"Naomi Geraghty",
		"Deborah Aquila",
		"Nina Gold",
		"Tricia Wood",
		"Ondrej Nekvasil"
	],
	"votes": 392322,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzNmYmI4YWMtMGFkOS00ODVkLTg3MTEtOTExNDg3ZjQ0MGM3XkEyXkFqcGc@._V1_QL75_UY281_CR4,0,190,281_.jpg",
	"description": "Vienna, Austria-Hungary, 1889. The film begins in medias res as Chief Inspector Walter Uhl (Paul Giamatti) of the Vienna Police announces the arrest of Eisenheim (Edward Norton) during what appears to be necromancy passed off as a magic show. Later, he recounts the story of Eisenheim's life for Crown Prince Leopold (Rufus Sewell).Eisenheim was born the son of a peasant cabinetmaker in a rural village. One day as a teenager, Eisenheim (Aaron Johnson) meets a traveling magician who performs several tricks for him. Eisenheim becomes obsessed with magic tricks after this. He also falls in love with Sophie, the Duchess Von Teschen (Eleanor Tomlinson), a noblewoman well above his social class. Although the two are forbidden to see each other, they meet secretly until at last they are caught and forcefully separated.Eisenheim then leaves home and travels the world, perfecting his craft. He returns to Vienna years later as a master illusionist. He again meets the adult Sophie (Jessica Biel) at one of his performances, when she is volunteered by Crown Prince Leopold as a reluctant participant in an illusion. He soon learns that Sophie is expected to marry the Crown Prince, whose \"Progressive sympathies\" mask a rumored history of brutality towards women. After humiliating the Crown Prince during a private show, Eisenheim finds his hit performance banned from Vienna.When Sophie comes to offer him help, they argue vitriolically before surrendering to their feelings and making love. Eisenheim suggests that they flee the Empire together. Sophie, however, explains that it is not so easy. The Crown Prince is planning a coup to usurp the Crown of Austria from his elderly father, the Emperor Franz Joseph I. He plans to use his engagement to her to win the Hungarian half of the Empire as well. Horrified, Eisenheim warns that such a plot could easily turn out very badly for her.Sophie also says that, if she leaves Leopold or otherwise obstructs his plot, the Crown Prince will have them both hunted to the ends of the earth and murdered. Although aware of the risk, Eisenheim asks whether she really wants to leave with him. Without hesitation, Sophie responds in the affirmative.\nSoon after, Uhl's policemen, who have Sophie under surveillance, witness Sophie and Eisenheim kissing in a carriage. Uhl gently informs the Crown Prince that Sophie was \"seen\" with Eisenheim.That evening, Leopold confronts Sophie at the Mayerling hunting lodge and accuses her of being unfaithful. She tells him that she will not marry him or have anything to do with his plans. As she leaves, an enraged Leopold is seen to draw his sword and chase her into the stables.The following day, Sophie's horse returns to Vienna covered in blood and without its rider. Within hours, a search party finds Sophie dead in the Vienna Woods with a sword cut across her neck. Enraged, Eisenheim tells Uhl that Sophie was about to leave the Crown Prince for him. Uhl refuses to believe this, regarding the alternative unthinkable. As Eisenheim plunges into despair and the citizens of Vienna begin to suspect Leopold of Sophie's murder, Uhl observes Eisenheim's actions more closely on behalf of Leopold.Wracked with grief, Eisenheim prepares a new kind of magic show, using mysterious equipment and Chinese stagehands. During his show, Eisenheim apparently summons spirits, leading many to believe that he possesses supernatural powers. Leopold decides to attend one of Eisenheim's shows incognito. During this show, Eisenheim summons the spirit of Sophie, who says that someone in the theater murdered her. Panicking, Leopold orders Uhl to arrest Eisenheim for fraud. Uhl pleads with Eisenheim to never summon Sophie again. Eisenheim, however, promises only that Uhl will enjoy the next performance.Returning to the opening scene of the movie, Uhl witnesses Eisenheim summons Sophie a second time. She laments that she lost her locket, a gift from Eisenheim, when she died. Uhl attempts to publicly arrest Eisenheim on the spot, only for the illusionist to fade and disappear like his summoned spirits.\nFinishing his story to the Crown Prince, Uhl explains to Leopold that he has found evidence that Sophie was murdered by him in the Mayerling stables. He cites the evidence he found there after Eisenheim's disappearance: a jewel from the prince's bloodstained sword and Sophie's locket. Leopold first reminds Uhl that the Vienna police have no jurisdiction over his hunting lodge. He demands that Uhl return the evidence immediately, reminding him of the political career and title of nobility which he was promised in return for supporting the upcoming coup.To his horror and outrage, Leopold discovers that Uhl no longer cares about anything but justice for Sophie. Uhl announces that he has already informed the Emperor and the General Staff of Leopold's conspiracy to usurp the Imperial and Royal throne. Seething with hatred, Leopold aims a revolver at Uhl's face, vowing to kill him, too. As the Austro-Hungarian Army storms the Mayerling hunting lodge, Leopold vents his hatred for his father's constitutional monarchy, which he says is letting the Empire be \"governed by mongrels.\" The only hope for, \"anything to get done,\" was for him to seize power, abolish Parliament, and govern by decree. As the officers start to break down his door, the Crown Prince shoots himself through the head.Having been dismissed as Chief Inspector, Uhl leaves the Imperial Palace and is approached by a boy who had appeared as a ghost in Eisenheim's show and receives a folio explaining one of Eisenheim's magic tricks. Uhl demands to know where the child obtained the folio; the child reveals that Eisenheim had given it to him. Uhl then reaches for Sophie's locket, only to discover that someone removed it from his pocket while he spoke to the boy. Recognizing a disguised Eisenheim, Uhl follows him to the train station. As the train leaves, a montage shows an admiring Uhl putting the pieces together in his mind. In reality, Eisenheim and Sophie have framed Leopold for a murder which never took place. Eisenheim is then seen walking up to a house in the country, where he and Sophie embrace passionately.Eisenheim's previous words are then heard in voiceover: \"Everything you have seen is an illusion -- a trick.\"",
	"links": [
		"https://www.amazon.com/Illusionist-Neil-Burger/dp/B0CGM1T6RJ"
	]
}