{
	"title": "Just Friends",
	"release_year": "2005",
	"runtime": "96",
	"tags": [
		"Comedy",
		"Romance",
		"amazon"
	],
	"rating": 6.2,
	"actors": [
		"Ryan Reynolds",
		"Amy Smart",
		"Anna Faris",
		"Chris Klein",
		"Christopher Rodriguez Marquette",
		"Giacomo Beltrami",
		"Fred Ewanuick",
		"Amy Matysio",
		"Julie Hagerty",
		"Wendy Anderson"
	],
	"staff": [
		"Roger Kumble",
		"Adam 'Tex' Davis",
		"Chris Bender",
		"Bill Johnson",
		"Michael Ohoven",
		"J.C. Spink",
		"Jeff Cardoni",
		"Anthony B. Richmond",
		"Jeff Freeman",
		"Rick Montgomery",
		"Robb Wilson King"
	],
	"votes": 128635,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjA0Mzg2NjUzMl5BMl5BanBnXkFtZTcwNDg2ODUzMQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1995, New Jersey, obese high school senior Chris Brander (Ryan Reynolds) is secretly in love with his classmate and best friend Jamie Palamino (Amy Smart). Jamie and Chris have been friends for a really long time.\nConfessing his feelings by writing in her yearbook, he attends their graduation party. Chris' friends are rooting for him to get out of the \"friend zone\" with Jamie. Jamie leads Chris on in all sorts of way. She has many admirers like the freckled face Dusty Dinkleman, who has written a song for Jamie.\nAs he returns Jamie's yearbook, it is swapped by her ex-boyfriend, Tim (Ty Olsson), who reads the declaration aloud to everyone, humiliating Chris. After kissing him on the cheek, Jamie admits she does not reciprocate his affections and thinks of him like a brother. Chris leaves the party in tears, announcing he will never return and vowing to be more successful than everyone else.Ten years later, a womanizing Chris has lost weight and lives in Los Angeles as a successful record producer and vice president of the company. Chris was aspiring female musicians throwing themselves at him and he treats all of them like a one-night stand and is not interested in anything more than sex. He now advises his friends on how to avoid the \"friend zone\" with the girls.Before Christmas, company CEO KC (Stephen Root) asks him to accompany emerging pop singer Samantha James (Anna Faris) to Paris so she signs with their label, and Chris reluctantly complies. KC insists on Chris as he went on a date with her. Chris says that Samantha is a crazy person. KC wants Samantha as she has just released a provocative poster, with her breasts covered in ice-cream, and it is the hottest selling poster in the USA. MTV just got her a new reality show. If she signs with their label, the label gets free promotion. KC says that he will fire Chris if he cannot deliver Samantha.Samantha is extremely difficult to work with and has her own quirks and fancies.\nSamantha wants a relationship with him, but Chris has no interest after their only date previously led to his hospitalization. Samantha is all over the place, wants to lick Chris's skin off, acts like a cat, is completely horny and so on. She is a female rock star. She takes Chris' pants off for sex, and then makes him listen to a new song that she wrote.\nOn the way to Paris, Samantha accidentally sets her private jet on fire (when she microwaves tuna in a tin foil), causing an emergency landing in New Jersey, near Chris' hometown.Chris takes Samantha to his mother's Carol (Julie Hagerty) for the night and re-engages with his teenage past, including his unresolved feelings for Jamie. Chris' shrine for Jamie is still intact in his room.\nShe meets his mother and 18-year-old brother Mike (Christopher Marquette), a fan of Samantha who is infatuated with her. At a bar, Chris encounters old classmates, including his other best friend Clark (Fred Ewanuick) and his wife Darla (Amy Matysio). Tim is now bald and a certified loser.Chris also sees Jamie, working as a bartender to pay for graduate school for teaching. Jamie is still living with her parents. Chris asks Jamie out, but she invites him for lunch, immediately putting him into the friend zone. Chris asks Mike to keep Samantha busy during his date with Jamie, but realizing their platonic friendship is important to him hampers his plan for them to have sex.\nDuring a friendly ice skating \"day date\", Chris is taken away in an ambulance after injuring himself during a hockey game with Jamie and three kids (who dislike him). At the scene, Jamie is reunited with Dusty Dinkleman (Chris Klein), a paramedic and former high school classmate also in love with Jamie even now.The next night, Chris goes to Jamie's Christmas party to express his feelings for her, but Dusty is already there, charming everyone on guitar. Back at Chris's, Samantha ambushes Mike, demanding he reveal Chris's location. He refuses until she kisses him. Enraged, she drives to Jamie's, crashing through her fence and destroying the Christmas decorations. Chris returns home in embarrassment, and Jamie follows. Jamie says she is not mad, and they spend the night catching up and reminiscing. However, due to Chris's continuing lack of assertion, they end up sleeping and nothing happens.The next day, Jamie speaks with Darla about the night before, while Chris goes to Clark for advice. Jamie admits that while they are \"just friends\", she tried to show Chris she is interested in more. Clark tells Chris that \"the timing wasn't right\" and their history hinders him. Outside the office, Chris and Clark catch Dusty singing to a nurse and then kissing her. Dusty reveals his plans to have sex with Jamie and humiliate her in a way he felt she humiliated him in high school when he was attracted to her.Chris tries to warn Jamie but instead attacks Dusty in front of her. She refuses to listen when he tries to explain. Consequently, he gets drunk and goes to Jamie's bar, finding her there with Dusty. When she gently declines Dusty's sexual advances, he storms out. Chris and Jamie get into another fight, where he blames her for keeping him in the \"friend zone\" and says she will never amount to anything. Furious, Jamie strikes Chris and he is tossed out.Upon returning to Los Angeles and rejecting Samantha's continued advances when she sees him again, Chris realizes that Jamie is his one and only true love. He returns to New Jersey, declares his love to her and they kiss, while the three kids watch in disgust. One of the boys hands the girl a cookie, which she gives to the other. She calls the boy who gave her a cookie her friend, to which he replies with \"the Bestest\" before realizing he has been put in the friend zone.",
	"links": [
		"https://www.amazon.com/Just-Friends-Ryan-Reynolds/dp/B002R20DGK"
	]
}