{
	"title": "The 40 Year Old Virgin",
	"release_year": "2005",
	"runtime": "116",
	"tags": [
		"Comedy",
		"Romance",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Steve Carell",
		"Catherine Keener",
		"Paul Rudd",
		"Romany Malco",
		"Seth Rogen",
		"Elizabeth Banks",
		"Leslie Mann",
		"Jane Lynch",
		"Gerry Bednob",
		"Shelley Malil"
	],
	"staff": [
		"Judd Apatow",
		"Judd Apatow",
		"Steve Carell",
		"Judd Apatow",
		"Shauna Robertson",
		"Clayton Townsend",
		"Lyle Workman",
		"Jack N. Green",
		"Brent White",
		"Marla Garlin",
		"Allison Jones",
		"Jackson De Govia"
	],
	"votes": 474112,
	"cover": "https://m.media-amazon.com/images/M/MV5BMzFiNzU2NjQtZTcwZC00Nzc3LTk3NjEtMDZmMDhmYjQ4NTAwXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The movie begins as we meet Andy Stitzer (Steve Carell). He lives in a downstairs apartment and is unusually organized and tidy. He has a massive collection of action figures and video games. He also has a high tech video system and even a video chair for playing his games. This is the perfect 20 year old's apartment; unfortunately, he's 40. As he wakes up we watch as he struggles to pee with his \"morning wood\" and then makes a perfect breakfast omelet with fruit and juice. Again, everything is neat, organized and well planned out. He goes out and chit chats with the upstairs neighbor and his wife, making plans to come over to watch Survivor. He gets on his bike and rides to work.He works at a giant electronics store, think \"Best Buy\" or something similar. He works in the inventory control room, away from the public. He's actually a very nice guy but his co-workers think he's weird and possibly a serial killer.\nOne day his coworkers discover they are one person short for a poker party they are planning later that night so they decide to ask Andy; he accepts their offer. Much to their surprise, Andy's great and beats them all. Everyone's sitting around swapping sex stories and when it comes to Andy he makes something up and it's obvious he's lying. They call him out and ultimately it is revealed that he is a virgin.Andy \"rides\" home in shame, completely embarrassed and ready to quit his job. He's up all night and just can't stop thinking about the humiliation that awaits him in the morning.\nThe next morning he cautiously enters work and everything is fine at first and then one by one, different co-workers start making cracks about him. He runs out of the place in shame but one of his poker buddies stops him and eventually all his buddies get together and make it their personal goal to help him with his problem.For the next 45 minutes or so of the movie we see many different parties, clubs, and encounters he gets set up on, all pretty funny but none of them work. Among them by far the funniest is when they decide he needs to have his chest waxed. The torture he goes through is hilarious and gets even funnier when we see him walking home with a little blood on his shirt. At a bar one night they advise him on finding a drunk girl to take home. He does but since he doesn't have a car or license, the drunk girl drives, almost killing him and the evening ends with her throwing up on him. She offers to still have sex with him but he turns her down.\nOne day at work he is forced to work out on the floor for a bit and meets Trish (Catherine Keener). Trish owns a small store across the street called \"We Sell Your Stuff On eBay\" The two hit it off and she gives him her phone number.\nHe tells his buddies about her but they insist that he if he really loves her he can't have sex with her until after he loses his virginity. If his first time is with her it will be awful and she'll think he's a freak.Again they try to hook him up but nothing works.\nFinally after a date with Trish it looks like it's actually going to happen. They're on her bed making out when she goes into the bathroom to get ready. She tells him that there are condoms in the drawer but check the expiration date because they're pretty old. He starts reading instructions and such, not quite sure how to use one. He goes through a dozen or so just trying to get one on when suddenly Trish's daughter and boyfriend walk in. Her daughter is angry and she and her mom get into a huge argument. The boyfriend looks down on the what looks like a dozen used condoms laying on the bed and whispers to Andy, \"teach me!\"\nAndy and Trish decide to put off sex for awhile and just get to know each other. They decide to wait until their 20th date to have sex.They have many dates and Andy and Trish's daughter are actually becoming quite close. Trish helps him with his dream of opening his own electronics store by selling some of his collection at her eBay store. Things are going just great between the two of them.\nOne day Trish goes over to Andy's apartment and finds a collection of porn that one of Andy's buddies gave him. Trish can't believe what kind of freak Andy is and rushes out. Andy chases after her and the chase ends with Andy crashing his bike into a billboard truck, landing right in front of her. As she is leaning over him he finally confesses to her that he is a virgin. The two have a passionate embrace.The next thing we know it's their wedding day.\nOn the wedding night they finally make love. She tells him, congratulations, you are officially not a virgin. This encounter lasts 1 minute. She asks if he wants to do it again and he says sure...\nTwo hours later we see them lying in bed with big grins on their faces. She asks him how it was and then the movie breaks into a strange video of him singing \"Aquarius\" with many of the cast of characters from the film in the background.",
	"links": [
		"https://www.amazon.com/40-year-old-virgin-Judd-Apatow/dp/B000I3SPLK"
	]
}