{
	"title": "Life of Pi",
	"release_year": "2012",
	"runtime": "127",
	"tags": [
		"Adventure",
		"Drama",
		"Fantasy",
		"amazon"
	],
	"rating": 7.9,
	"actors": [
		"Suraj Sharma",
		"Irrfan Khan",
		"Adil Hussain",
		"Tabu",
		"Ayush Tandon",
		"Gautam Belur",
		"Ayaan Khan",
		"Mohd. Abbas Khaleeli",
		"Vibish Sivakumar",
		"Rafe Spall"
	],
	"staff": [
		"Ang Lee",
		"Yann Martel",
		"David Magee",
		"Ang Lee",
		"Gil Netter",
		"David Womark",
		"Mychael Danna",
		"Claudio Miranda",
		"Tim Squyres",
		"Avy Kaufman",
		"David Gropman"
	],
	"votes": 673096,
	"cover": "https://m.media-amazon.com/images/M/MV5BNTg2OTY2ODg5OF5BMl5BanBnXkFtZTcwODM5MTYxOA@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "A novelist has come to talk to Pi Patel (Irrfan Khan), a middle-aged Indian immigrant from Pondicherry, living in Montreal, Canada. Pi's father named him Piscine Molitor after a swimming pool in France. As a child he changed his name to \"Pi\" (the mathematical symbol, p) because he was tired of being called \"Pissing Patel\". In flashback it was seen that his family owned a zoo, and Pi took great interest in the animals, especially a Bengal tiger named Richard Parker. In fact, when French Pondicherry was liberated, Pi's father Santosh bought the zoos where Pi's mother (Tabu) worked as a zoologist.When Pi tries to feed the tiger in great curiosity, his father runs in and angrily tells him that the tiger is dangerous and not like a human. He forces Pi to witness the tiger killing a goat to prove his point. Pi is raised Hindu and vegetarian, but at 12 years old, he is introduced to Christianity and then Islam, and starts to follow all three religions as he \"just wants to love God.\" His mother supports his desire to grow, but his father, a rationalist, tries to convert him to his own way of thinking (\"think rationally\").Pi meets Anandi. She is a dancer & they promptly fall in love. But Pi's father is afraid that they have no life in India if the town stops supporting the zoo. He feels that the animals are worth far more overseas, and he will get enough money to start a new life.When Pi is 16, his father decides to move the family to Winnipeg, Manitoba, Canada, where he intends to settle and sell the zoo animals. They book passage on a Japanese freighter named Tzimtzum. One night there is a storm; the ship begins to founder while Pi is on deck. He tries to find his family, but a crew member throws him into a lifeboat. Just as the ship falls into the sea, a freed zebra leaps from the ship to land on the boat with him. Pi then watches helplessly as the ship sinks, killing his family and the crew.After the storm, Pi finds himself in the lifeboat with the injured zebra and is joined by an orangutan. A spotted hyena emerges from the tarp covering half of the boat. The hyena kills the zebra and then the orangutan. The orangutan staunchly defends Pi as the Hyena tries to attack him. But the orangutan is weak from lack of food and exhaustion & is promptly finished off by the Hyena.Suddenly the tiger Richard Parker emerges from under the tarp, killing the hyena. Richard Parker then takes numerous swipes at Pi, practically running him off the boat; the tiger then devours the bodies of the other animals at night.Pi gets out biscuits, water rations, and a hand ax and builds a small raft to stay at a safe distance from the tiger. Pi begins fishing and is able to feed the tiger. He also collects rainwater for both to drink. When the tiger jumps off to hunt fish, at first Pi wants to let it drown, then he relents and helps it climb back into the boat. At one point, in a nighttime encounter with a breaching whale, Pi loses much of his supplies. After many days at sea, Pi trains the tiger to accept him in the boat. He also realizes that caring for the tiger is keeping him alive.Weeks later and half dead, they reach a mysterious floating island of edible plants, supporting a mangrove jungle, freshwater pools, and a large population of Meerkats. Both Pi and Richard Parker eat and drink freely and regain strength. But at night the island transforms into a hostile environment: the fresh water turns acidic digesting all the dead fish that died in the pools, Richard Parker returns to the lifeboat, the resident Meerkats sleep in the trees, the plants are carnivorous. Pi discovers the island's secrets when he finds a human tooth. The next day, Pi and the tiger leave the island.The lifeboat eventually reaches the coast of Mexico. Pi is crushed that the tiger does not acknowledge him before disappearing into the jungle. Pi is rescued and carried to a hospital, weeping. Insurance agents for the Japanese freighter come to interview him. They do not believe his story and ask what \"really\" happened. He tells a less fantastic account of sharing the lifeboat with his mother, a Buddhist sailor with a broken leg, and the cook. The cook kills the sailor in order to eat him and use him as bait. In a later struggle, Pi's mother pushes him to safety on a smaller raft, and the cook stabs her as she falls overboard. Later, Pi returns, takes the knife and kills the cook.In the present day, the novelist notes the parallels between the two stories: the orangutan was Pi's mother, the zebra was the sailor, the hyena was the cook, and Richard Parker, the tiger, was Pi himself. Pi asks him which story the writer prefers, and the writer chooses the one with the tiger because it \"is the better story\", to which Pi responds, \"Thank you. And so, it goes with God\". Glancing at a copy of the insurance report, the writer sees the agents wrote that Pi somehow survived 227 days at sea with a tiger: the insurance agents had also chosen the more fantastic story.",
	"links": [
		"https://www.amazon.com/Life-Pi-Suraj-Sharma/dp/B00AQMGQV4"
	]
}