{
	"title": "The Prestige",
	"release_year": "2006",
	"runtime": "130",
	"tags": [
		"Drama",
		"Mystery",
		"Sci-Fi",
		"amazon"
	],
	"rating": 8.5,
	"actors": [
		"Christian Bale",
		"Hugh Jackman",
		"Scarlett Johansson",
		"Michael Caine",
		"Piper Perabo",
		"Rebecca Hall",
		"Samantha Mahurin",
		"David Bowie",
		"Andy Serkis",
		"Daniel Davis"
	],
	"staff": [
		"Christopher Nolan",
		"Jonathan Nolan",
		"Christopher Nolan",
		"Christopher Priest",
		"Christopher Nolan",
		"Aaron Ryder",
		"Emma Thomas",
		"David Julyan",
		"Wally Pfister",
		"Lee Smith",
		"John Papsidera",
		"Nathan Crowley"
	],
	"votes": 1464485,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjA4NDI0MTIxNF5BMl5BanBnXkFtZTYwNTM0MzY2._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "A magician performs an illusion for a young girl explaining that each trick has three parts; the pledge, where the audience is presented with an ordinary object; the turn, where the object is turned into something extraordinary; and the prestige, where the object is brought back.\nMagician Alfred Borden (Christian Bale) is sentenced to death for the murder of rival Robert Angier (Hugh Jackman) by drowning him in a water tank during Angier's performance. Both began their careers as shills for \"Milton the Magician\" with engineer John Cutter (Michael Caine) and Angier's wife Julia. The pair observe an elderly Asian magician who is able to make a large fishbowl appear seemingly from nothing. Borden realizes that the man's frailty is in fact the act and comments how true magic requires commitment and sacrifice.Julia drowns in a tank during a water escape performance. Angier blames Borden, who cannot recall if he tied her with an experimental knot. The two go on to lead separate careers. Borden becomes \"The Professor\" with the enigmatic Bernard Fallon as his engineer while Angier becomes \"The Great Danton\" with new love Olivia Wenscombe (Scarlett Johansson) and Cutter. Borden meets and marries Sarah (Rebecca Hall) and they have a daughter, Jess, incensing Angier. Angier sabotages Borden's bullet catch, costing Borden two fingers. Borden then ruins Angier's bird cage act, maiming an audience member and damaging Angier's reputation.Borden soon begins performing an impressive trick called The Transported Man, where he enters one cabinet and exits another across the stage. Cutter insists that Borden is using a double, which Angier refuses to accept. Nevertheless, Angier begins performing The New Transported Man using a double but becomes frustrated at ending up below the stage while his double receives the applause. Angier sends Olivia to discover Borden's secret, but she instead grows close to Borden. Borden sabotages Angier on stage, crippling his leg, and begins performing The Original Transported Man with Olivia, allowing him to stage it more successfully.Olivia sends Angier an encrypted diary which supposedly contains the secret to Borden's trick. Angier and Cutter kidnap Fallon to force Borden to give the key to the Cypher. Upon learning that the key word is \"Tesla\", Angier pursues Nikola Tesla to Colorado Springs alone as Cutter abandons him to his obsession, and Angier enlists Tesla to make a copy of the teleportation machine that he believed Borden used. Angier deciphers Borden's diary and discovers it to be a fraud that Borden had Olivia give him and is further angered when the machine fails. However, he and Tesla soon discover that the machine actually works by creating an exact duplicate of whatever is placed inside it. After rival Thomas Edison sends henchmen to torch his lab, Tesla leaves, warning Angier to destroy it. Meanwhile, Borden's pursuits drive Sarah to hang herself: there are hints that Borden's dual identity has become known to Sarah-she asked to meet Olivia to tell her \"The truth.\"Angier returns to London, electrifying audiences with The Real Transported Man, vanishing within the machine and reappearing in the back of the hall. In reality, Angier falls through a trap door and plunges into a water cell tank, drowning, while his duplicate reappears; the tanks are disposed of by blind stagehands every night. Borden witnesses Angier drown while slipping backstage to discover his secret but is caught and convicted of murder of Angier in the tank. In prison, Borden is visited by the agent of a Lord Caldlow, who offers to care for Jess in exchange for Borden's secrets. Borden is given Angier's diary and finds his conviction has been orchestrated by Angier, recognizing Lord Caldlow as Angier when he comes to collect the secret.Instead, Angier no longer needs them, rips them and leaves with Jess. Borden is hanged, after encouraging Fallon to live for them both. Cutter learns that Caldlow has bought all of Angier's tricks, including the machine, and visits Caldlow to plead for its destruction. He recognizes Angier, who admitted earlier to Borden he has always been Lord Caldlow (he had used the name Robert Angier to spare his family the embarrassment of his theatrical career). Cutter is disgusted with Angier for letting Borden hang and taking Borden's daughter.Cutter accompanies Angier as he stores the machine beneath the theater with the rest of the \"prestige materials.\" On his way out, Cutter recognizes and nods to Fallon as he enters. Angier is shot, and sees his shooter is missing two fingers and has Borden's face. He then realizes that \"Borden\" was actually identical twins who shared their lives on stage and off. Just as they took turns being the man in the box and the prestige, they took turns being Borden and (by wearing makeup) Fallon. When one twin lost his fingers because of Angier, the other had his brother remove his own so they could continue to look alike in order to keep up the illusion there was only one Borden. One twin (the one alive) loved Sarah and was the girl's father, while the other twin (the one hanged) loved Olivia.So, they each had half of a full life, which was enough for them but not the women they loved. He berates Angier for not knowing what true sacrifice for a good trick means, and that it takes nothing to steal someone else's work. Angier explains that it took courage to enter the machine every night knowing that he would drown in the box while his duplicate appeared at the back of the theater. Borden leaves him to die as a fire consumes the building, casting light on rows of tanks containing drowned Angiers.Cutter repeats the trick of vanishing the bird for the delight of the little girl. Borden appears to reclaim his daughter.",
	"links": [
		"https://www.amazon.com/Prestige-Hugh-Jackman/dp/B003QS67F0"
	]
}