{
	"title": "Knowing",
	"release_year": "2009",
	"runtime": "121",
	"tags": [
		"Action",
		"Mystery",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.2,
	"actors": [
		"Nicolas Cage",
		"Chandler Canterbury",
		"Rose Byrne",
		"Lara Robinson",
		"Lara Robinson",
		"D.G. Maloney",
		"Nadia Townsend",
		"Alan Hopgood",
		"Adrienne Pickering",
		"Joshua Long",
		"Danielle Carter"
	],
	"staff": [
		"Alex Proyas",
		"Ryne Douglas Pearson",
		"Juliet Snowden",
		"Stiles White",
		"Todd Black",
		"Jason Blumenthal",
		"Alex Proyas",
		"Steve Tisch",
		"Marco Beltrami",
		"Simon Duggan",
		"Richard Learoyd",
		"Gregory Apps",
		"Steven Jones-Evans"
	],
	"votes": 250478,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTMyMjgyMDIyM15BMl5BanBnXkFtZTcwNjg3MjAyMg@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The movie opens at an elementary school in Lexington, Massachusetts, 1959. Little Lucinda (Lara Robinson) stares into the distance as if she is witnessing some catastrophic event. The teacher, Miss Taylor (Danielle Carter), repeatedly instructs Lucinda to come back into the class. During the class session Miss Taylor tells the students that as part of a celebration, the students will be writing/drawing predictions for the future and placing them in a time capsule. She tells them this is Lucinda's idea (important later). As they start writing, we see Lucinda in a trance, furiously scribbling seemingly random numbers onto a sheet. It appears that mysterious voices are controlling Lucinda's thoughts and actions.\nDuring the ceremony, the time capsule is lowered into the school grounds. Lucinda is alone and staring at the proceedings. A few minutes later Miss Taylor notices Lucinda gone from her spot. Eventually, Miss Taylor finds Lucinda in a school closet storage space, her fingers bloodied as she scratched even more numbers onto the wooden door.Present day 50 years later. M.I.T. professor John Koestler (Nicolas Cage) and his son Caleb (Chandler Canterbury) at their house. John drinking from a bottle of whiskey, still coping with the devastating loss of his wife. After his lecture class the next day, he is talking to his colleague Phil (Ben Mendelsohn) when he realizes he is missing his son's school celebration where they are opening the same time capsule shown at the beginning of the movie.The honored Miss Taylor (now played by Alethea McGrath) starts handing out the various letters and drawings to the current students. Miss Taylor hands Lucinda's page of numbers to Caleb. As Caleb opens the letter and looks at it, he notices a strange-looking man in the distance dressed in a trench coat and starts to hear voices in his head. Caleb takes the letter home.That night John finds the letter and reads it closely, he suddenly finds the date of the September 11, 2001, terrorist attack within the numbers, along with the total number of victims. Startled, he writes the entire page of numbers onto the board, and with the help of the Internet, he finds the number groupings seem to predict the dates of every major catastrophic event of the past 50 years along with the body count. There are a few groups of numbers left that are not circled and accounted for, meaning that these numbers may predict future events. John's sister Grace (Nadia Townsend) is worried about him dealing with his wife's death.He tells his colleague Phil about the numbers and is met with ridicule. Determined, John tracks down Miss Taylor at her home. He finds out about Lucinda, how she disappeared, and how they found her in the closet when she scratched numbers onto the door (again, important later). Miss Taylor tells him that Lucinda died a while ago.A black car filled with several of the mysterious-looking strangers approaches Caleb. One of them reaches out of the window and hands him a smooth black stone. John sees this and rushes outside, but the men leave. On his way to pick up his son, John finds himself stuck on a highway due to an accident. He then uses his truck's GPS system to try and find an alternate route. All of a sudden, he notices the present latitude/longitude coordinates on the GPS system and looks at Lucinda's letter and notices the same group of numbers (previously he had only circled the dates of disasters but was unable to find meaning in the other encircled groups of numbers; now he realizes these numbers are the coordinate locations of the disasters)! As he is talking to the police, an airplane comes out of nowhere and crashes directly into the path of his truck before continuing to the fields next to the highway.Later that night Caleb is awakened in his room by one of the strangers, who points to the window. As Caleb goes to the window he is greeted by a horrifying sight, a terrible forest fire and hundreds of animals being burned alive. As he screams, John rushes up to his room to comfort him, and then he notices the stranger again outside the house standing by the trees. He attempts to confront him but is gone by the time he gets outside.The next day John and Caleb track down Diana (Rose Byrne) and her daughter Abby (also played by Lara Robinson). Diana is the daughter of little Lucinda we meet in the beginning. They are at a museum when John uses Caleb as a ploy to start a discussion with Diana. There John reveals the truth about the numbers. Angered by this deception, Diana storms off with Abby.\nNext day John hears of a Terrorist plot in NYC. He puts the coordinates into his computer & finds that the numbers match those on the sheet. He goes to NYC to try and prevent the attack. He thinks he has found a person with a bomb but turns out to be some stolen DVDs. Then a train is improperly switched & rams into a standing train at a station & causes immense destruction. John is convinced about the letter.When John gets back home, he sees Diana and Abby sitting outside his house. She is now sympathetic to him. As they drive, she shares with him that her mother told her that she would die on October 22 (in a few days). That is also the date that is in the final groupings of numbers (which are ended by what appears to be the backwards double letter E).In Lucinda's room, John notices numerous newspaper clippings of disasters around the world pasted on the wall. At the far end of the room, he notices a drawing of Judgment Day with a picture of a large bright object in the middle. John stumbled on something and noticed it's a smooth black rock similar to the one Caleb received earlier. He looks under the bed and notices more rocks, then looks at the underside of the bed. Noticing some writing, he turns the bed over to expose the backside of the bed. It is covered everywhere with the writing, Everyone Else (the EE from the last part of the letter). John then realizes that the final prediction will affect everyone on the planet.The mysterious strangers appear again and approach the truck, and we can hear the mysterious voices start to appear. Hearing a scream, John and Diana run to the truck. Abby mentions that the men were talking to her, and we realize that Abby, too, has the gift to hear voices. John sees the man standing still facing away from him. He points his gun at him and orders him to turn around. The stranger opens his mouth as a bright shining light emanates from inside his body. This light blinds John and the stranger gets away.It suddenly dawns on John that the final event is related to the sun. They all drive to John's lab office, where he meets Phil. John mentions to him about a hypothetical catastrophic solar flare model they worked on before. John says that in fact this model is of the earth, and that this flare will destroy life as we know it. He tells Phil to go home and spend time with his wife.\nAs they are packing, John's thoughts go back to the last part of Lucinda's letter, and he realizes that unlike the previous predictions, there were no coordinates. He then remembers Miss Taylor's discussion about Lucinda scratching numbers onto the closet door.They all rush to the school as John breaks into the school and makes his way to the closet. As soon as he finds the last set of numbers, he writes them down and runs out to his truck but realizes that Diana & the children are gone.\nEntering the numbers into the GPS he is shocked to find that the coordinates point to Lucinda's trailer they previously visited. John is able to reach Diana on her cell phone, and he desperately tries to convince her to take both kids to Lucinda's trailer instead of the caves. This flare will penetrate miles underground and will kill everyone.As Diana stops at a gas station, Caleb is taken by the mysterious stranger, who gets in Diana's car and drives off with the two kids. Diana chases but has an accident.\nJohn takes off in the direction of the chase, and he comes across the intersection where Diana was hit. He walks to the rear of the ambulance where paramedics desperately try to revive her with no success. As they call her time of death, John notices it is just past midnight, signifying that it is now October 22, the date of the final disaster and Diana's date of death predicted by her mother. John goes off to Lucinda's trailer.When he reaches the trailer, he notices tire tracks going off into the woods, and follows these tracks. When he gets to a clearing, he notices the ground is covered in the exact same black smooth stones seen several times in the movie. Agonizing over his missing son, Caleb suddenly appears safe and calm, holding a white rabbit. He also finds Abby safe, and she tells John that they (being the mysterious strangers) told her that her mother is now in a safe place. We now realize that the reason why the stranger abducted Caleb and Anthony was because Diana was not going to take them to Lucinda's trailer.Caleb tells his dad that they are taking them away, meaning to a safer place away from the impending catastrophe. We then see four of the mysterious strangers standing in front of them.\nWe then see a pattern of lights high in the sky, and from out of the clouds an enormous spacecraft emerges. The bottom opens up and a huge orb-like transporter is beamed to the ground. It is now apparent that these mysterious strangers are beings from another universe, and that they have come to save this family. As they get ready to move towards the orb, John sadly realizes that the aliens came to specifically save Caleb and Abbey, and not the adults. At first Caleb protests, but John convinces him that he will always be with him, and that he must go with Abby to be saved. After an emotional goodbye, Caleb and Abby walk towards the orb. As they do so, the strangers shed their human skins and reveal their true alien selves, bodies that give off bright lights. The orb goes back towards the mother ship and takes off into space. As the ship leaves the Earth, we notice hundreds of other ships also leaving, showing that many children from around the World are also being saved (John and Caleb's story was only one of countless others).John collapses and is awoken the next day by a light rain and an eerie orange glow in the sky (the flares are starting). We see him driving through the city being destroyed by the approaching flare: buildings on fire, rising temperatures, and people in panic throughout the streets. As he drives on, he sees his old partner Phil holding his wife on the street. He then stops in front of an apartment, where he sees his sister and parents inside. He tells his sister Caleb is in a safe place now. All four then have a group hug and hold onto each other as the flare incinerates and vaporizes everything in the city. The last shot of Earth is from space as it is breaking up.We then see what appears to be the landscape of a faraway planet, full of odd colors, yet sustaining plant life. The spaceship we saw earlier appears and drops off young Caleb and Abby onto the surface with their pet rabbits before leaving. As they smile, we see more spaceships arrive to drop more children, and the final shot is of a huge and magnificent glowing tree in the background.",
	"links": [
		"https://www.amazon.com/Knowing-Nicolas-Cage/dp/B002B71XWE"
	]
}