{
	"title": "Blood Diamond",
	"release_year": "2006",
	"runtime": "143",
	"tags": [
		"Adventure",
		"Drama",
		"Thriller",
		"amazon"
	],
	"rating": 8.0,
	"actors": [
		"Leonardo DiCaprio",
		"Djimon Hounsou",
		"Jennifer Connelly",
		"Kagiso Kuypers",
		"Arnold Vosloo",
		"Antony Coleman",
		"Benu Mabhena",
		"Anointing Lukola",
		"David Harewood",
		"Basil Wallace"
	],
	"staff": [
		"Edward Zwick",
		"Charles Leavitt",
		"C. Gaby Mitchell",
		"Gillian Gorfil",
		"Marshall Herskovitz",
		"Graham King",
		"Paula Weinstein",
		"James Newton Howard",
		"Eduardo Serra",
		"Steven Rosenblum",
		"Victoria Thomas",
		"Dan Weil"
	],
	"votes": 593212,
	"cover": "https://m.media-amazon.com/images/M/MV5BOGYzOGI0YTUtNTAwYy00M2JhLTgyODEtMjlhZTk1Yzc5ZTBhXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "It is 1999 and Sierra Leone is ravaged by major political unrest. Rebel factions such as the Revolutionary United Front frequently terrorize the countryside, intimidating Mende locals and enslaving many to harvest diamonds, which fund their increasingly successful war effort. One such unfortunate local is fisherman Solomon Vandy (Djimon Hounsou) from Shenge, who is separated from his family and assigned to a workforce overseen by Captain Poison (David Harewood), a ruthless warlord.One morning, Vandy discovers an enormous pink diamond in the river. Captain Poison tries to take the stone, but the area is suddenly raided by government troops. Vandy buries the stone before being captured. Both Vandy and Poison are incarcerated in Freetown, along with Danny Archer (Leonardo DiCaprio), a white Rhodesian gunrunner, whose family was killed in the Rhodesian Bush War. Archer, also a veteran of the 32 Battalion fighting in the South African Border War, was jailed while trying to smuggle diamonds into Liberia (He had got the diamonds in exchange for selling arms to the rebels in Sierra Leone. He was smuggling them into Liberia hidden under the skin of goats, when an army patrol stopped him and found the hidden diamonds). They were intended for Rudolph Van De Kaap (Marius Weyers), a corrupt South African mining executive.Hearing of the pink diamond in prison (Poison was in the same prison and offered $1000 to any man who could cut the diamond out of Vandy), Archer arranges for himself and Vandy to be freed from detention. He also meets American journo Maddy Bowen (Jennifer Connelly), who is curious as to why Sierra Leone has not exported any diamonds for 2 yrs and neighboring Liberia has exported $2 Bn worthwhile not having any diamonds in the first place. She knows Archer is selling to Van De Kaap and wants his help to expose the entire conflict diamond trade.He travels to Cape Town to meet his employer: Colonel Coetzee (Arnold Vosloo), an Afrikaner formerly with the apartheid-era South African Defense Force, who now commands a private military company. Archer wants the diamond so he can sell it and leave the continent forever, but Coetzee wants it as compensation for Archer's botched smuggling mission. Archer returns to Sierra Leone, locates Vandy, and offers to help him find his family if he will help recover the diamond.Meanwhile, RUF insurgents escalate hostilities; Freetown falls to their advance while Vandy's son Dia (Kagiso Kuypers) is among those rounded up to serve as a child soldier under a liberated Captain Poison. Archer and Vandy narrowly escape to Lungi, where they plan to reach Kono with an American journalist, Maddy Bowen (Jennifer Connelly); in exchange, Archer will provide her evidence of the illicit diamond trade. Maddy is able to track down UN databases and find Vandy's family in a refugee camp in Guinea. Thats where Vandy finds that his son Dia has been captured by rebel forces in Sierra Leone. Maddy lashes out at Danny saying that she can only write about victims unless she has a witness, facts, photos and bank account numbers that can prove the trade in conflict diamonds. Danny agrees to provide everything but after he has the chance to sell the pink diamond to secure his own future.The trio arrive in Kono after a harrowing journey (their convoy is attacked by RUF patrols and many of their colleagues die. They find a route on foot through the jungle territory where local militia protect their own villages. They are taken to a local NGO who runs a school for decapitated children rescued from RUF. The NGO caretaker Benjamin (Basil Wallace) is shot when he is driving the trio to Kono), where Coetzee and his private army-contracted by the Sierra Leone government-prepare to repulse the rebel offensive.While Maddy gets out with her story (Danny gives her his diary and puts him on the plane out of Sierra Leone), the two men set out for Captain Poison's encampment alone, and dodging the private army commandeered by Coetzee. Vandy desperately wants to find Dia and he checks every RUF patrol along the way to see if Dia is a part of it. Many times, he puts Danny's life in danger, and eventually Danny understands that Vandy holds himself responsible for being a bad father. They reach the mine, where Vandy has hidden the diamond.\nDia, stationed with the RUF garrison there, is confronted by Vandy, but having been brainwashed he refuses to acknowledge his father. Vandy is captured by Captain Posion who wants Vandy to hand over the diamond to him. Archer radios the site's coordinates to Coetzee, who directs a combined air and ground assault on the camp; Vandy finds Captain Poison and beats him to death with a shovel as the mercenaries overwhelm the RUF defenders. Coetzee then forces Vandy to produce the diamond, but Coetzee is killed by Archer, who realizes Coetzee would eventually kill them both. Dia holds the pair briefly at gunpoint, but Solomon confronts him again and cleanses him by revealing who he really was, sparking Dia's memory. Pursued by vengeful mercenaries, Archer discloses he has been mortally wounded and entrusts the stone to Vandy, telling him to take it for his family. Vandy and his son rendezvous with Archer's pilot, who flies them to safety while Archer makes a final phone call to Maddy; they share final farewells as he asks her to assist Vandy and gives her permission to finish her article. Archer finally takes in the beautiful African landscape before dying.Vandy arrives in London and meets with a Van De Kaap representative (Simmons); he exchanges the pink diamond for a large sum of money and being reunited with his entire family being extradited to London. Maddy takes photographs of the deal to publish in her article on the diamond trade, exposing Van De Kaap's criminal actions. Vandy appears as a guest speaker at a conference on \"blood diamonds\" in Kimberley and is met with a standing ovation.\nin 2003, in Johannesburg, as many as 40 countries signed \"The Kimberly Process\" agreement to handle the sale of illegal diamonds. However, it is up to the buyer to buy diamonds that are completely free from conflict.",
	"links": [
		"https://www.amazon.com/Blood-Diamond-Leonardo-DiCaprio/dp/B001XVCX96"
	]
}