{
	"title": "Harold & Kumar Escape from Guantanamo Bay",
	"release_year": "2008",
	"runtime": "114",
	"tags": [
		"Adventure",
		"Comedy",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"John Cho",
		"Kal Penn",
		"Neil Patrick Harris",
		"Rob Corddry",
		"Jack Conley",
		"Roger Bart",
		"Danneel Ackles",
		"Eric Winter",
		"Paula Garcés",
		"Jon Reep"
	],
	"staff": [
		"Jon Hurwitz",
		"Hayden Schlossberg",
		"Jon Hurwitz",
		"Hayden Schlossberg",
		"Nathan Kahane",
		"Greg Shapiro",
		"George S. Clinton",
		"Daryn Okada",
		"Jeff Freeman",
		"Richard Hicks",
		"David Rubin",
		"Tony Fanning"
	],
	"votes": 142769,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTQ3NTg3OTk0OV5BMl5BanBnXkFtZTcwODAwMzU1MQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "After returning home from White Castle, Harold Lee (John Cho) and Kumar Patel (Kal Penn) decide to travel to Amsterdam, Netherlands so Harold can surprise his neighbor and love interest Maria (Paula Garcés) as well as smoke Cannabis. Harold is hyper-organized and likes to plan everything in his life, whereas Kumar is equally all over the place, random and lives in the moment.At the airport, Kumar is subjected to a \"random\" pat-down at security, which he considers racist as he believes it is due to the color of his skin.\nThe duo encounters Kumar's ex-girlfriend Vanessa Fanning (Danneel Harris), who is engaged to Colton Graham (Eric Winter), a college friend of Harold's whose family has political connections (President Bush and Colton's father were in the same fraternity). The marriage is within a week.While on the flight, passengers mistake Kumar's new invention, a smokeless bong, for a bomb. Harold begged Kumar not to light it on the plane since in a few short hours they would be in Amsterdam, the bong capital of the world. Sky marshals apprehend the duo, and the plane is turned back to the USA.\nRon Fox (Rob Corddry), a neurotic and extremely racist Deputy Secretary of Homeland Security, believes the duo are agents of a joint Al-Qaeda and North Korean conspiracy and sends them to the Guantanamo Bay detention camp in Cuba against the advice of NSA Deputy Director Dr. John Beecher (Roger Bart). Fox does not even allow them their mandatory phone call before deporting them.The duo are put in a cell next to 2 known terrorists. They realize that the only lunch inmates get a \"Cockmeat Sandwich\" which is essentially a b**w job given by the cell mates to the guard. The duo narrowly avoids being sexual assaulted by a guard at the detention camp due to the accidental assistance of their next cell mates, who bite the d**k of their guard, thereby diverting everyone's attention.\nHarold and Kumar escape the prison and board a Cuban refugee boat to Miami, Florida. They meet up with their college friend, Raza (Amir Talai), at his home (where Raza is having a bottomless party, instead of a topless one), who loans them a car so they can travel to Texas, hoping Colton can help clear their names. Colton is getting married to Vanessa at his family's estate in Hewitt, Texas.Beecher again tells Fox that he has read Harold and Kumar's files and there is nothing in them to indicate that they are terrorists. Meanwhile, Fox tries to find them through several racist interrogation techniques. Fox brings in Harold and Kumar's parents for questioning.Kumar remembers that he first met Vanessa at the library in college. Kumar was brilliant at mathematics and was taking classes in creative writing. But then Vanessa introduced Kumar to pot to help him relax, and that led to Kumar's current state of affairs.Harold and Kumar endure several misadventures on their way to Texas, first crashing their car into an African-American neighborhood in Birmingham, Alabama (in which the neighborhood offers to help fix their car, but Harold and Kumar believe that they are being attacked and run away). The incident is reported, and Fox and Beecher reach the location, where Fox continues his racist rants against African Americans. Meanwhile Beecher starts a track on a Nokia device that was found missing from the car.Then they stay at the home of an incestuous sibling couple Raylene (Missi Pyle) and Raymus (Jon Reep) and their inbred son. The duo to run away when their single eyed son tries to climb into bed with Harold, freaking him out. Then afterward they come across 2 KKK members urinating in the woods and overpower them. They take their costumes to join the KKK rally (as they were serving food and alcohol) but are soon exposed when the original members show up. As such, the duo has to escape the Ku Klux Klan rally.Fox and Beecher had tapped the phones of Kumar's friends Rosenberg (Eddie Kaye Thomas) and Goldstein (David Krumholtz) and knew that they were headed to Texas.\nAs Harold and Kumar hitchhike through a forest, they are picked up by Neil Patrick Harris, who manages to get them through a checkpoint set up by Fox (as Fox is a huge fan of Neil), but then takes them to a brothel, where the mistress then shoots Harris for branding one of the prostitutes.\nWhen Harold and Kumar reach Texas, Colton agrees to help exonerate the duo. However, upon seeing Kumar reconnect with Vanessa, Colton instead delivers Harold and Kumar to Fox.On the flight back to prison, Harold and Kumar manage to subdue Fox's men with a can of mace belonging to Harris and their fists, but Fox holds them at gunpoint, until an enraged Beecher intervenes, telling Fox that it's because of people like him that the rest of the world thinks Americans are racist and stupid.\nBeecher promises to get Harold and Kumar cleared, but trips and accidentally opens the cabin door, sucking out him, Harold, and Kumar. Harold manages to grab a parachute and he pulls it open for him and Kumar just as Fox falls by to his death, having jumped after them (without a parachute) to finish them off.Harold and Kumar land through the roof of a luxurious ranch, which turns out to be President George W. Bush's (James Adomian) estate. After befriending and smoking Kush with Harold and Kumar, the duo explains their misadventures and Bush gives them both a presidential pardon, and also gets the Secret Service to escort the pair to Vanessa and Colton's wedding.\nThey expose Colton's betrayal to Vanessa and the guests, and Colton attempts to attack them, but Harold knocks him out. Kumar consoles a furious Vanessa by reciting a poem he wrote for her in college, and they reconcile.\nHarold, Kumar and Vanessa then travel to Amsterdam where Harold finds Maria, and the couples happily tour the city together while getting high on cannabis. A post-credits scene shows Harris coming to after being presumed dead outside the brothel.",
	"links": [
		"https://www.amazon.com/Harold-Kumar-Go-White-Castle/dp/B0091WYVSU"
	]
}