{
	"title": "Beowulf",
	"release_year": "2007",
	"runtime": "115",
	"tags": [
		"Action",
		"Adventure",
		"Animation",
		"max",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Ray Winstone",
		"Ray Winstone",
		"Ray Winstone",
		"Crispin Glover",
		"Angelina Jolie",
		"Robin Wright",
		"Anthony Hopkins",
		"Paul Baker",
		"John Bilezikjian",
		"Rod D. Harbour",
		"Brice Martin",
		"Sonje Fortag"
	],
	"staff": [
		"Robert Zemeckis",
		"Neil Gaiman",
		"Roger Avary",
		"Anonymous",
		"Jack Rapke",
		"Steve Starkey",
		"Robert Zemeckis",
		"Alan Silvestri",
		"Robert Presley",
		"Jeremiah O'Driscoll",
		"Nina Gold",
		"Ronna Kress",
		"Doug Chiang"
	],
	"links": [
		"https://www.max.com/movies/beowulf/d3cd26ee-6ac7-4e3f-ac47-15262abc48c9",
		"https://www.amazon.com/Beowulf-Ray-Winstone/dp/B07FZSMLLM"
	],
	"votes": 175375,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTUzMjM0MTc3MF5BMl5BanBnXkFtZTcwNzU0ODMyMw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The Great Hall of Heorot was built by Hrothgar King of the Danes. The Danes are celebrating and are really drink and partying very loudly. The most drunk of all the Danes is Hrothgar himself who is very inebriated, half-naked and barely able to keep his balance. He's somewhat repulsive and a bit of an embarrassment to his young wife, Queen Wealthow.As the night progresses, the noise from the festivities only grow. In the snowy hills surrounding the kingdom there is a cave miles away, where the noise from the festivities is heard at an almost unbearably loud level. A creature inside the cave screams in pain, as if the noise is too much for it to bear.Back to Heorot, the party is still going on in full blast. The large wooden entrance doors are blasted off their hinges, the halls torches blow out, and the hearth in the middle of the hall erupts in eerie blue flames. The creature from the cave arrives at the doorstep of the Heorot and screams right outside Heorot's doorway. The creature and the Danes prepare for battle.\nThe creature is about 15 feet tall and humanoid in appearance, but clearly not all human. Its misshapen, deformed, and appears to have some highly sensitive pads that serve as hearing organs. The screaming of the Danes is physically hurtful the creature's ears and, enraged, he begins to tear the revelers apart.After fighting through all of the Danes, the creature makes his way to Hrothgar, who stands his ground. Hrothgar challenges the creature to a fight, but after a long pause, the creature decides to withdraw from battle and returns to his cave.\nBack at the cave, the monster is chastised by his mother for killing men. The mother's reflection falls on a pool inside the cave and she is revealed to not be human either.The dead are removed from Heorot and burned, and Hrothgar is forced to seal the Hall as a place of evil. Hrothgar confers with his majordomo Unferth (John Malkovich). Unferth says that the creature is named Grendel and that he has attacked Danes in the past. The King tells Unferth to put out the word that the man who slays Grendel will earn half of the kingdom's riches in return. Hrothgar needs a hero to slay the monster Grendel (Crispin Glover), a hideously disfigured troll-like creature with superhuman strength.Beowulf (Ray Winstone) is a brave legendary Geatish warrior who travels to Denmark alongside his band of soldiers, which include his best friend, Wiglaf (Brendan Gleeson), in answer to the call of King Hrothgar (Anthony Hopkins). Beowulf and Wiglaf are unfazed by the extremely rough seas, and discuss with much bravado how they are on their way to take up Hrothgar's offer and slay Grendel, and how the glory of their deeds will live eternally.\nUpon arriving, Beowulf immediately becomes attracted to Hrothgar's wife, Queen Wealtheow (Robin Wright Penn), who does not love her husband, and also takes interest in him. Unferth is angered by Beowulf's presence, and calls him out. Unferth had heard a story about Beowulf being challenged to a swimming race and losing. Unferth is curious about how Beowulf expects himself to slay Grendel if he can't even out-swim a human opponent in a simple race. Beowulf narrates that swimming in the ocean against his opponent, he was set upon by a giant sea monster. As his competitor swims to safety, Beowulf fights and kills the monster, and another, and another each in increasingly fantastic fashion. After fighting the monsters underwater, Beowulf came across a siren/mermaid/water nymph. Shes breathtakingly beautiful, in an otherworldly sort of way, and Beowulf cant take his eyes off her.Queen sings a song for the Geats (a.k.a. folks from Sweden), though the song is meant for Beowulf alone. When the Queen finally retires, and Hrothgar demands that she get in bed and produce an heir, Wealthow states that she could never lie with the King, knowing that you laid down with her. The King is duly shamed, although the reason is not made clear.Beowulf asks that Heorot be reopened, and Hrothgar acquiesces, providing Beowulf and his crew with food, drink and lodging as they rest in preparation for their battle.\nBeowulf and his men celebrate in Heorot, in order to lure Grendel out. When the beast does attack, Beowulf attacks him unarmed and naked, determining that since Grendel seems to be immune to mortal weapons and carries no weapons of his own, armor and a sword would be pointless in the fight.Watching his reactions during the melee, Beowulf discovers that Grendel has hypersensitive hearing, which is why he interrupts Hrothgar's celebrations - the noise they make is physically painful to him.\nHe promptly jumps onto Grendel's back and hammers at the beast's sensitive ear-pads, which causes the monster extreme pain. Beowulf ruptures the creature's eardrum. As Grendel tries to retreat, his arm is caught in some chains, and Beowulf grabs hold, preventing Grendel from escaping just as the monster goes out the big main door. Grendel's arm is pinned between the door and the doorjamb, and Beowulf, after victoriously announcing his name to the monster, rips off Grendel's arm. Grendel flees to his cave.\nGrendel shrinks in size and manages to escape.\nAs thanks for freeing his kingdom from the monster that plagued them for years, Hrothgar gives Beowulf his golden drinking horn, which represents the time Hrothgar slew the mighty dragon Fafnir. The horn is in the shape of a dragon, with a red jewel at the neck, and Hrothgar makes an off-hand remark about how hitting the neck is the only way to kill a dragon. Unferth apologizes for doubting him, and Wealthow is even more smitten with their hero.Back in the cave, Grendel is dying. We hear his mother asking who did this to him, and Grendel says Beowulf before he dies. Grendel's mother sings a lullaby as she carries her boys body to an altar of sorts. As she places the body down, her voice starts to crack and she sobs before starting to scream with rage. Grendel's Mother travels to Heorot in the night and slaughtering Beowulf's men while they were sleeping after the celebration.\nHrothgar tells both Beowulf and Wiglaf who had been sleeping outside the hall at the time that it was the work of Grendel's mother, the last of the Water Demons, who was thought by Hrothgar to have left the land. Hrothgar's adviser, Unferth, offers Beowulf his sword Hrunting to slay Grendel's mother.Beowulf and Wiglaf travel up to the cave of Grendel's mother to slay her. Only Beowulf enters the cave where he encounters Grendel's mother (Angelina Jolie), who takes the form of a beautiful, gold-covered naked woman. He tries to kill her with Hrunting but fails due to her magic. Beowulf tries to run her through with Unferth's sword, but it just passes through her like she is a ghost.\nShe offers to make him the greatest king who ever lived if he would agree to give her a son to replace Grendel and let her keep the golden drinking horn. She grabs hold of Unferth's blade and it melts like butter. It is apparent that she could slaughter Beowulf at any time. She says that her promise is valid as long as she has that horn. And Beowulf seems on the verge of yielding to her offer.Afterwards, Beowulf returns to Heorot with Grendel's head and announces he has killed Grendel's mother. He recounts embellished stories of a fight, claiming he left the sword impaled in the body of Grendel's mother and lost the golden drinking horn in the battle. Hrothgar has no heirs and he declares that everything he has, including the kingship and Wealthow, will go to Beowulf when he dies.Hrothgar speaks to Beowulf privately and asks if he truly killed Grendel's mother. Despite Beowulf's boasting and calling Grendel's mother a hag, Hrothgar is not fooled and realizes the truth.\nHe tells Beowulf indirectly that, much like Beowulf, he was also seduced by Grendel's mother and was Grendel's father. Beowulf is shocked upon realizing Hrothgar is Grendel's father and that the curse has now been passed on to him after his affair with the demon. Hrothgar declares Beowulf to be king upon his death and he commits suicide by jumping from the castle parapet onto the beach below. Grendel's mother appears as a gold light in the surf and drags Hrothgar's corpse into the sea as the crowd kneels to the newly crowned King Beowulf, fulfilling their bargain.\nUnferth (John Malkovich) was not happy as he had hoped to ascend the throne after Hrothgar.50 years later, an elderly Beowulf is married to Wealtheow (Robin Wright), who refuses to give him an heir since he had previously slept with the water demon. As a result, Beowulf takes a mistress, Ursula (Alison Lohman). But his tryst with Grendel's mother has left him sterile to both his wife and mistressOne day, Unferth's slave Cain (Dominic Keating) finds the golden drinking horn in a swamp near Grendel's cave and, not realizing why it is there, brings it back to the kingdom. That night, a nearby village is destroyed by a dragon, which leaves Unferth alive in order to deliver a message to King Beowulf (which is \"The Sins of the Fathers\", revealing that the dragon is actually Beowulf's son born to Grendel's mother). Removing the horn has reneged on the agreement between Beowulf and Grendel's mother, who has now sent their son, the dragon, to destroy his kingdom.\nAfterwards, Beowulf privately confesses to Wealtheow about his affair with Grendel's mother and they reconcile.Beowulf and Wiglaf go to the Cave once again and Beowulf goes into the cave alone. When Grendel's mother does appear, Beowulf throws the Golden Horn towards her in return for her not attacking the lands. Grendel's mother considers it too late for any kind of agreement and so she releases the dragon from the cave to attack Beowulf's Kingdom.The dragon flies out and heads toward Heorot. Beowulf grabs onto the dragon and tries to fight it mid-flight. Wiglaf follows on his horse. At some point, Beowulf gets a chain of some kind lashed around the dragon's neck. When Beowulf is on the back of the dragon, it nose dives into the ocean and plunges deep to the seabed. Beowulf is violently thrown off its back but luckily chances upon an old anchor with a heavy chain, grabs hold of it and jams it in the mighty jaws of the dragon just as it was about to surface above out of the ocean.Beowulf isn't very successful in slowing up the dragon, and it starts to lay fiery siege to the castle's perimeter. As it just so happens, both Wealthow and Ursula are talking on the castles rampart as the dragon approaches, and it makes a beeline for them. The dragon burns both of the ramparts exits, leaving the women trapped and with no place to hide.Beowulf find himself dangling on the chain, swinging right in front of the dragons neck, where Beowulf spots a large glowing red area, just like the red jewel in Hrothgar's horn. Beowulf stabs the red area, to find that it opens up into the dragons throat and also happens to give Beowulf a clear shot at the dragons heart.However, Beowulf cant reach the heart. Try as he might, he's always a few inches too far away. Knowing its only a matter of time before the dragon burns the women, Beowulf takes his sword and chops off most or his arm holing the chain. He loses his sword, but the partial separation of his arm from his torso gives him the extra few inches needed to grab the heart and rip it out.\nHe and the creature tumble to the rocky beach below the castle. The dragon's fall mortally wounds Beowulf, but he lives long enough to watch the carcass of the dragon transform into its true form, the humanoid body of his son, before it is washed out to sea.Beowulf then shares words with Wiglaf and tries to tell him the truth but dies before he can finish. Wiglaf dismisses his words as mere disillusions-although it seems clear from the earlier conversation with Beowulf outside the dragon's cave, where Wiglaf refuses to listen to Beowulf's confession, that Wiglaf is all too aware of the truth.Shortly thereafter, Wiglaf, the new king, gives Beowulf a Norse funeral and watches on the shore as the hero's body is taken by the sea. As he watches the ship engulfed by flames, he sees Grendel's mother appear still human and nude, but with demon wings and a serpent tail, descend onto the boat and give Beowulf a parting kiss. Now it is impossible to pretend not to know the truth. Wiglaf finds the golden horn in the sand.At this moment it appears that Grendel's mother attempts to seduce him. Wiglaf steps out into the water, clearly tempted. He holds the golden drinking horn, before pausing halfway in the surf. They both stare at each other, with Grendel's mother seductively waiting and Wiglaf clearly tempted but showing resistance."
}