{
	"title": "Rescue Dawn",
	"release_year": "2006",
	"runtime": "125",
	"tags": [
		"Adventure",
		"Biography",
		"War",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"Christian Bale",
		"Steve Zahn",
		"Jeremy Davies",
		"Zach Grenier",
		"Marshall Bell",
		"Toby Huss",
		"Pat Healy",
		"GQ",
		"James Aaron Oliver",
		"Brad Carr"
	],
	"staff": [
		"Werner Herzog",
		"Werner Herzog",
		"Elton Brand",
		"Harry Knapp",
		"Steve Marlton",
		"Klaus Badelt",
		"Peter Zeitlinger",
		"Joe Bini",
		"Eyde Belasco"
	],
	"links": [
		"https://www.amazon.com/Rescue-Dawn-Christian-Bale/dp/B0BHXCQPQG"
	],
	"votes": 111860,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzUxNzUzNzU2MV5BMl5BanBnXkFtZTcwNTgzNzU2NA@@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "Dieter Dengler (Christian Bale), a German-born U.S. Navy pilot in squadron VA-145, is shot down in his A-1 Skyraider over Laos in February 1966, while on a combat mission. Its 1966 and the conflict in Vietnam is still nascent & in early stages with the US adopting the strategy of bombing strategic targets in North Vietnam & disrupting supply routes in Laos. Dieter is on such routine mission when his wings are hit after he drops the bombs & he is forced to bail in Laos.\nDengler survives the crash only to be pursued, and ultimately captured, by the Pathet Lao. However, Dengler holds out for a while before capture & displays a great application of jungle survival skills that he picked up in training and via Navy informational videos.Dengler is given the chance for leniency by the province Governor (François Chau) if he signs a document condemning America, but he refuses. He is tortured and taken to a prison camp. There he meets fellow American military soldiers and pilots, such as Gene DeBruin (Jeremy Davies) and Duane W. Martin (Steve Zahn), some of whom have been captive for years. Dengler begins planning an escape, much to the disbelief of his fellow combatants, who have been downtrodden through physical and psychological torture by the camp guards. Gene believes that peace is just around the corner in Vietnam and that all prisoners will be released soon & if Dengler tries to escape, that will screw up their release. Martin is much more practical and knows there is no peace.To complicate matters, the prisoners are guarded by 6 armed men during the day & in the night they are tethered to a wooden log at the legs, so as to make any movement impossible. Dengler steals a nail & fashions it into a lock pick which the prisoners use to open their handcuffs at night, when they are unsupervised. With their newfound night time freedom Dengler gets more confident of an escape and speaks to Martin & Gene about escaping into Thailand via the Mekong river.When Dengler gets serious about his escape plans, Gene declares that he will sabotage Dengler if he tries to escape, since Gene believes that the prisoners will be released any day now & Dengler's escape plans will only get them all killed.Dengler & Martin start saving food from their daily rations to prepare for their escape. Dengler starts to use the nighttime freedom to spy on the premises & to chart the most feasible escape routes from the camp. The 2 decide that monsoon is their best chance of escaping as without water they wouldn't last 2 days in the jungle. But the monsoons are unpredictable and they are forced to wait before effecting their plan.Due to the incessant US bombings, the entire province cannot grow any rice & the camp begins to starve. The prisoners overhear the guards making plans to take the prisoners out to jungle & shooting them, making it look like a failed escape. Then the guards plan to go back to their villages to help their families with food. Dengler brings his escape plan forward. The plan is for Dengler to steal the guns as the guards dine in the kitchen. Then Dengler & Martin in 1 group, & rest in the other group to split & approach the kitchen from opposite sides to encircle the guards.Eventually, all the prisoners agree to escape, only Dengler and Martin follow through with the plan as the others disappear and are not seen again in the film. Dengler curses Gene for sabotaging his escape plan, as he had always promised. Dengler and Martin try to reach the Mekong River to cross over into Thailand. They battle the heavy rains, jungle terrain & decease to reach a river. They build a raft to navigate the river and speed up their progress. But gradually Martin loses his strength to the extent that both Dengler and Martin are forced to abandon their rifles. They find an abandoned village in the middle of the jungle & take shelter. Dengler sets fire to the village to attract attention of the helicopters who are seen flying sorties in that area. However, the helicopters only shoot at Dengler.The next day the villagers come back to the village. Martin is killed by a mob of angry villagers, before Dengler uses his machete to scare them and escape.\nEventually, Dengler is rescued by an American helicopter after being spotted from the air but sequestered in a hospital due to the secret nature of his mission. He is visited by some of his squadron who covertly takes him back to his ship, where he is welcomed as a hero by the crew."
}