{
	"title": "Scott Pilgrim vs. the World",
	"release_year": "2010",
	"runtime": "112",
	"tags": [
		"Action",
		"Comedy",
		"Fantasy",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Michael Cera",
		"Mary Elizabeth Winstead",
		"Kieran Culkin",
		"Anna Kendrick",
		"Alison Pill",
		"Aubrey Plaza",
		"Jason Schwartzman",
		"Johnny Simmons",
		"Mark Webber",
		"Ellen Wong"
	],
	"staff": [
		"Edgar Wright",
		"Michael Bacall",
		"Edgar Wright",
		"Bryan Lee O'Malley",
		"Eric Gitter",
		"Nira Park",
		"Marc Platt",
		"Edgar Wright",
		"Nigel Godrich",
		"Bill Pope",
		"Jonathan Amos",
		"Paul Machliss",
		"Robin D. Cook",
		"Jennifer Euston",
		"Allison Jones",
		"Marcus Rowland"
	],
	"votes": 471168,
	"cover": "https://m.media-amazon.com/images/M/MV5BNTA5ZWMwNmYtNWI1ZS00NDRlLTkxNzktMzdhZDU2ZDhjNDJmXkEyXkFqcGc@._V1_QL75_UY281_CR5,0,190,281_.jpg",
	"description": "To the chagrin of his band mates, roommate Wallace Wells, and younger sister Stacey Pilgrim, Scott Pilgrim, 22, the bassist for the failed indie garage band Sex Bob-Omb, is in a relationship with Knives Chau, a 17-year-old high school student, in Toronto. After seeing her in a dream, Scott eventually meets Ramona Flowers, an American Amazon delivery girl. After losing interest in Knives, Scott pursues Ramona instead of ending their relationship. Ramona's ex-boyfriend Matthew Patel attacks Scott when Sex Bob-Omb participates in a battle of the bands event sponsored by record executive Gideon Graves. After defeating Patel, Scott finds out that in order to date Ramona, he needs to defeat her six other evil ex-boyfriends.Knives blames Ramona and vows to become more like him in order to win him back, but Scott ends their relationship. In addition to facing his own ex, pop star Envy Adams, Scott defeats Ramona's next three ex-boyfriends: lesbian ninja Roxy Richter, super-powered vegan Todd Ingram, and Hollywood actor and skateboarder Lucas Lee. Scott, however, becomes irritated during the process, and Ramona ends their relationship after a tirade about her past relationships.Sex Bob-Omb earns Scott an extra life at the next battle of the bands by defeating twins Kyle and Ken Katayanagi, Ramona's fifth and sixth evil ex-boyfriends. In spite of this, Ramona seems to reconcile with Gideon, her seventh and last evil ex. Scott leaves the band in protest, but Sex Bob-Omb accepts Gideon's record deal. Scott receives an invitation from Gideon to the Chaos Theater, where Sex Bob-Omb is performing. Scott vows to win Ramona back and challenges Gideon to a duel for her love, winning the \"Power of Love\" sword in the process. Scott is forced to admit that he cheated on both of them after Knives breaks up the fight and attacks Ramona. After Gideon murders Scott, Ramona goes to see him in limbo and tells him that Gideon gave her a mind control implant.Scott re-enters the Chaos Theatre after using his 1-up to revive himself. After reconciling with his friends, he challenges Gideon for his own sake and wins the \"Power of Self-Respect\" sword. Scott joins forces with Knives and defeats Gideon after he accepts his own shortcomings and apologizes to Ramona and Knives for cheating on them. Ramona is ready to go now that she is not under his control. Knives acknowledges that she and Scott are no longer together, and he departs with Ramona to \"try again\" at her insistence.",
	"links": [
		"https://www.amazon.com/Scott-Pilgrim-World-Michael-Cera/dp/B00448SE4S"
	]
}