{
	"title": "Talladega Nights: The Ballad of Ricky Bobby",
	"release_year": "2006",
	"runtime": "108",
	"tags": [
		"Comedy",
		"Sport",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Will Ferrell",
		"John C. Reilly",
		"Sacha Baron Cohen",
		"Gary Cole",
		"Michael Clarke Duncan",
		"Leslie Bibb",
		"Jane Lynch",
		"Amy Adams",
		"Andy Richter",
		"Molly Shannon"
	],
	"staff": [
		"Adam McKay",
		"Will Ferrell",
		"Adam McKay",
		"Judd Apatow",
		"Jimmy Miller",
		"Alex Wurman",
		"Oliver Wood",
		"Brent White",
		"Allison Jones",
		"Clayton Hartley"
	],
	"votes": 202908,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzAzOTk1OTIyM15BMl5BanBnXkFtZTcwNDIzNTQzMQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Ricky Bobby (Will Ferrell) was born to go fast, and is raised solely by his strict Christian mother, Lucy (Jane Lynch), while his drunk and alcoholic father, Reese (Gary Cole), is absent. When Ricky was only ten years old, Reese shows up during Career Day at Ricky's school, but after giving his vulgar speech, Reese was thrown out of the school. Before leaving, Reese told Ricky: \"If you ain't first, you're last!\", a quote that Ricky commits to memory. Fifteen years later, while working on the pit crew of Dennit Racing driver Terry Cheveaux (Adam McKay), Ricky replaces him and ends up finishing in third place, despite starting mid-race in last place. Ricky quickly soars to the top of NASCAR, achieving fame and fortune at Dennit Racing and meeting his future wife, Carly (Leslie Bibb).Ricky eventually manages to allow Dennit to field an additional car to the field and arranges to have his best friend, Cal Naughton, Jr. (John C. Reilly) on his team. While on top of the racing world, Ricky is challenged by his rival and French Formula One driver, Jean Girard (Sacha Baron Cohen), who outperforms Ricky on the track and becomes Dennit Racing's next top driver.Ricky, desperate to regain his dominance, pushes himself too hard during the race at Charlotte Motor Speedway and ends up going airborne and his car lands upside down. While paramedics attempt to take Ricky to the hospital, Ricky ends up running around on the track in his helmet and underwear to think that he is on fire. While recovering from his injury, Ricky persists in the belief that he is paralyzed, which he certainly is not, a fact that Ricky only realizes after accidentally sticking a knife in his leg while trying to prove that he is paralyzed. Ricky's tests at Rockingham Speedway shows that he has lost his touch and fails to regain a spot on his team. Carly, yearning to be married to a top NASCAR driver, plans to marry Cal before Ricky returns home that night. Cal invites Ricky to his wedding to Carly, but his invitation is immediately refused by Ricky, who becomes angry and disappointed at Cal for ruining his life.Ricky takes his two sons, Walker and Texas Ranger (Houston Tumlin and Grayson Russell) home and takes his job as a pizza delivery boy, but is reduced to use a bicycle and riding the bus after losing his license for crashing his truck into a customer's shopping cart and into the Sheriff writing him a ticket for the previous incident. With Ricky's life at its lowest point, Reese suddenly re-enters Ricky's life and attempt to teach Ricky to drive by using the fear he experienced throughout his life, using unusual methods to get Ricky back to his normal speed. With his retraining and guidance of Reese, Ricky finally regains his confidence, but is unexpectedly taken back a few steps after Reese leaves him once again. Reese leaves Ricky with the knowledge that the quote based on Ricky's entire life around him was due in part to Reese's alcoholism. When Ricky runs into his assistant, Susan (Amy Adams) at a bar, she convinces Ricky to return to NASCAR not because of his desire to live up to the expectations of those around him, but because of his nature to drive fast. While Ricky heeding Susan's advice to race at the AMP Energy 500, he and Susan fall in love with each other.Ricky eventually manages to make small amends with Cal and Girard before the start of the race. Because the pit crew has rebuilt his engine from spare parts donated by other independent drivers, Ricky is forced to start the race from the back of the starting grid. In no time, Ricky manages to pass all the drivers except Girard. Heading towards the final laps, Cal receives orders from Dennit to get Ricky out of the race, but Cal refuses and instead pulls ahead of Ricky, allowing Ricky to slingshot Cal and ends up in the lead along with Girard. On lap 182, the replacement driver of Ricky's original car runs into Cal from Dennit's orders, causing a massive wreck that collects every driver except Ricky and Girard.On the final lap, Ricky and Girard unexpectedly make contact and somersault down the front straightaway heading towards the finish line. Determined not to give up, Ricky and Girard sprint their foot to the finish line. Although Ricky wins the foot race, he and Girard are disqualified for getting out of their cars, and Cal wins the race by default, having been in third place by the time of the wrecks. Ricky and Cal finally repair their friendship and family. Ricky, Lucy, Susan, and Walker and Texas Ranger later meet together with Reese in the parking lot to reunite for a dinner party during which they plan to get thrown out of Applebee's at the end of the film, referring to the earlier scene where Reese and Ricky leave each other again.",
	"links": [
		"https://www.amazon.com/Talladega-Nights-Ballad-Ricky-Bobby/dp/B000LWUA7U"
	]
}