{
	"title": "Push",
	"release_year": "2009",
	"runtime": "111",
	"tags": [
		"Action",
		"Sci-Fi",
		"Thriller",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Camilla Belle",
		"Dakota Fanning",
		"Chris Evans",
		"Colin Ford",
		"Joel Gretsch",
		"Djimon Hounsou",
		"Robert Tsonos",
		"Brandon Rhea",
		"Neil Jackson",
		"Kai Cheung Leung"
	],
	"staff": [
		"Paul McGuigan",
		"David Bourla",
		"Bruce Davey",
		"William Vince",
		"Glenn Williamson",
		"Neil Davidge",
		"Peter Sova",
		"Nicolas Trembasiewicz",
		"Deborah Aquila",
		"Tricia Wood",
		"François Séguin"
	],
	"votes": 116348,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTM2NjE5NTYzMl5BMl5BanBnXkFtZTcwNzc3OTMyMg@@._V1_QL75_UY281_CR1,0,190,281_.jpg",
	"description": "10 years ago, Nick is in a hotel with his father (Joel Gretsch). Nick's father tells him that one day a girl will give him a flower, and that he needs to help her, explaining \"help her, help us all\". He hugs Nick, and then telekinetically shoves him through a wall just before a team of agents, led by a maid they passed in the hall, burst in and subdues him. The head agent, Henry Carver (Djimon Hounsou) enters, and a force rips through, killing Nick's father.Cassie (Dakota Fanning) narrates. In 1945, Hitler started experiments to create psychic soldiers. Other countries took it up after WWII. Watchers are able to see the future in quick flashes and scenes. Movers can move objects and people with their minds. Pushers can \"push\" people into believing that certain things are or aren't true. Bleeders emit high-pitched sonic screams that destroy their targets (glass, internal organs...) Stitches can disassemble or reassemble any damaged tissue. Sniffs can take any object and get a history. Wipers can erase controlled amounts of memory. Shifters make objects appear to be something else, retaining approximate dimensions. Shadows are people whose ability is basically to block the effectiveness of other clairvoyants (Sniffers, mainly). Cassie is a Watcher. A drug is designed to boost their powers to turn them into soldiers, but they keep dying.Today, in a government facility, Kira (Camilla Belle) is being injected with an unknown substance, while Carver watches. The girl drops a glass marble, and appears to die. She suddenly revives & escapes, the glass marble obstructing closing doors, aiding her escape. Carver and his Mover Victor (Neil Jackson) discuss the fact that Kira is the first to survive the injection. She is also the first to escape with a vial of the drug, which could be dangerous in the hands of others.Nick is now grown, and a Mover. He bets on a roll of dice and loses when he fails to make them land correctly. He owes the other players $6,000. Two Sniffer agents from Division, Mack and Holden, show up. From them we learn that many Americans with powers have expatriated to Hong Kong to avoid Division. They start sniffing to find a trace of Kira, and leave when they don't, after warning Nick to stay out of trouble.Cassie arrives at Nick's apartment, never having met him before. She tells Nick of a case with $6 million. They talk, and Nick learns that Cassie's mother was abducted by Division. They are attacked by the children of the Pop family, (an organized crime family comprised of those with powers) another Watcher, (Xiao Lu Li, credited as \"Pop Girl\") and her Bleeder brothers. Nick and Cassie are caught by the sound and fall to the ground. Nick successfully Moves Cassie out of the line of fire. Pop Girl sees a vision of Kira sitting on a bench fading away, and stops her brothers from killing Nick. She says if they kill him now, they lose the girl, and that Nick will die regardless.Kira wakes up on a boat not far from the docks, near a Chinese fisherman with long fingernails. She sees a mirror that has \"4100\" and \"Nick\" written in her own handwriting.Cassie takes Nick to Teresa (a Stitch). Teresa was told to be there, and to help them, by Cassie's mother. Teresa repairs Nick. Cassie gives Nick a flower, convincing him to help her, as told by his father years earlier.Mack and Holden locate Kira, But she Pushes Mack into thinking that Holden killed his brother. He shoots Holden and Kira escapes.Discovering his blunder, Carver Pushes Mack to kill himself. Nick and Cassie head to a club based on Cassie's drawings, and meet ex-Division agent, Hook Waters (a Shifter). They tell him about the bead, and he makes a nearby woman's earring look like the picture Cassie drew. Hook also tells them about a Sniffer named Emily, who could help them track down the case. They take the fake bead to her.Emily (Ming-Na) takes the fake bead and shows them the identical, real bead she has been given. The beads in question had broken off of Kira's bracelet during her fight with Mack. They have been distributed by Carver to Sniffers across the country.Emily directs them to a pier where they find Kira, who fires a gun at Nick. He recognizes her as his ex-girlfriend, who he used to run cons with on Coney Island. Kira has had her memory wiped to escape Division. Cassie pulls Nick aside and shows him a drawing that shows her, Nick and her mother dead. Cassie wants to dump Kira, stating that she is changing the future for the worse, but Nick calls Pinky, a Shadow. They get a room, and Pinky promises to hide Kira from the Sniffers. Cassie finds a key in Kira's shoe which says \"4100\". She steps out and walks the streets, and Nick and Kira reconcile in the bathroom.Outside Cassie finds Pop Girl tracking her. Nick decides they need to split up. The next day, Pop Girl tracks them down, but Cassie sees her coming. They escape and Nick sends Kira away with Pinky.Nick uses Emily to track Carver, following him into a restaurant. Cassie waits outside. Carver tells Nick that Kira will die without consistent injections of the drug. Nick falters. Carver's men attack Nick, as Carver steps out to find Cassie. She tells Carver that if Nick dies, they lose Kira. Carver goes back in and orders Nick's release.Nick figures out that Pop Girl is able to track them because the future is predictable, and the only way to throw her off is to make the future unpredictable. Nick writes letters to Cassie, Hook, Emily, Pinky and Kira, and a last one to himself. After he gives them all the letters, he plans to get his memory Wiped of ever having written them.Kira, who is beginning to get sick, reveals to Nick that the case contains the drug. Cassie and Emily track the case to a building in HK, and also realize that the key opens a locker that holds the case. Pop Girl \"Sees\" this & draws the case and the syringe.Nick puts Kira in a cab with Pinky. She asks him when she should open her envelope, and he says, \"when you start to doubt the truth.\"Pinky hands Kira, who is visibly sick and appearing to have trouble holding herself up, over to Carver and Victor. Pinky leaves and opens his envelope. Getting out of a taxi and meeting up with Nick, he says, \"he knew he wasn't getting paid yet.\"They head to the docks, where they find the same old man who Wiped Kira. The old man tells Nick that a woman paid for Kira's Wipe 5 years ago. Nick pays the man, with the money Carver gave Pinky, to wipe the last 2 hours from his mind, and to read a red envelope afterwards. As the memory is wiped, Pop Girl loses the connection and is stunned.Hook passes through security posted at the base of the Shadowed building with Shifted credentials. He rides an elevator to the top floor, where an old woman points a gun at him. He tells her she has done well and that the job is over. She was placed there by Kira to hide the case from Division. Hook takes the case back to the room where Cassie and Emily are waiting, and makes an identically shaped red suitcase look like the Division case. Cassie takes the case, and exits the room.Nick wakes up in the same boat as Kira. He opens his envelope, and it says, \"go home.\" Teresa attacks him when he gets there, having been sent by the Pop family. The Bleeder brothers take the case to their father. Cassie finds Nick, and Nick tells her to run in a random direction so no Watcher can track her. Cassie does as he says, but Pop Girl still finds her. Pop father finds the case with a Soy Sauce bottle shifted to look like a syringe.Carver tells Kira that she was an agent, but something went wrong when she took the injection. Cassie is traced by Pop Girl, but just as she is about to shoot, the Chinese man grabs her and Wipes her memory. He reveals that Cassie's mother paid for Kira's memory wipe, 5 years ago.Nick calls Carver and asks to deal the drug for Kira. When he gets to their room, she is dressed as an agent, and tells Nick their relationship was a lie. She and Carver make him take them to the location of the case when the Pop Family arrives. As the fight ensues for the case, Nick tells Kira that her memory of being an agent is a Push. Carver tries to Push him to jump off the building, but Nick injects himself with the drug & appears to die. Kira and Carver leave.Later, Cassie arrives & kicks Nick up. She hid the case in a dumpster outside the building. Nick had injected himself with soy sauce.Nick asks Cassie how long her mother has been planning all of this, and Cassie replies \"probably since before I was born\".Now, we understand that Cassie's mother allowed herself to be captured, to place herself inside the Division headquarters at precisely the right time to help Kira escape, and let everything else fall into place. The entire plot of the story was foreseen by her and manipulated into being by her actions.At that moment, Carver and Kira are sitting on a plane headed for the U.S. Carver is asleep. Kira looks worried, and is going through her purse, when she finds the red envelope. She remembers what Nick told her, \"open it when you begin to doubt the truth.\" She opens it, and there is a picture of a slightly younger Nick and Kira smiling at a camera, with the Coney Island entrance in the background. On the photo is written, \"Kill him. See you soon. Nick.\" She stares at the photo in shock, and then her eyes narrow as she stares at Carver. We see him in the reflection of her eyes, and his own eyes open as she says, \"put your gun in your mouth. Pull the trigger,\" and the screen fades to black.",
	"links": [
		"https://www.amazon.com/Push-Colin-Ford/dp/B09XVNX6RY"
	]
}