{
	"title": "The Equalizer",
	"release_year": "2014",
	"runtime": "132",
	"tags": [
		"Action",
		"Crime",
		"Thriller",
		"amazon"
	],
	"rating": 7.2,
	"actors": [
		"Denzel Washington",
		"Marton Csokas",
		"Chloë Grace Moretz",
		"David Harbour",
		"Haley Bennett",
		"Bill Pullman",
		"Melissa Leo",
		"David Meunier",
		"Johnny Skourtis",
		"Alex Veadov"
	],
	"staff": [
		"Antoine Fuqua",
		"Richard Wenk",
		"Michael Sloan",
		"Richard Lindheim",
		"Todd Black",
		"Jason Blumenthal",
		"Tony Eldridge",
		"Mace Neufeld",
		"Harry Gregson-Williams",
		"Mauro Fiore",
		"John Refoua",
		"Lindsay Graham",
		"Lisa Lobel",
		"Mary Vernieu",
		"Naomi Shohan"
	],
	"votes": 430026,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTQ2MzE2NTk0NF5BMl5BanBnXkFtZTgwOTM3NTk1MjE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Boston-based Robert McCall, a retired DIA/DCS officer and former Marine, works at a big-box home improvement store. Ralphie, a coworker, receives assistance from Robert in his security guard training. Teri, a young sex slave trafficked by the Russian mafia, becomes Robert's companion at the all-night cafe where he frequently spends late hours reading since he can not sleep.One night, Teri reveals that she wants to be a singer and that her actual name is Alina. Slavi, Alina's pimp, shows up out of the blue, punches Alina, and pushes her into a car when they are out on a walk with Robert. Before leaving in their automobile, Slavi gives Robert their business card for the escort service. Alina is taken to the intensive care unit (ICU) of a local hospital a few nights later after suffering severe injuries. Robert finds out via her friend Mandy that Slavi is to blame for her illness after receiving the news. When Robert attempts to purchase Alina's freedom, he is flatly rejected when he sees Slavi and his men in their restaurant. Robert quickly eliminates Slavi and his goons.Robert is unaware that Slavi and his guys are a part of a much larger criminal organization headed by Russian tycoon Vladimir Pushkin. Pushkin's enforcer, Teddy Rensen, travels to Boston to look into the assault. Teddy canvases local rival gangs with the help of Boston police investigators working for Pushkin. To deliver a message, Teddy almost kills Irish mob lieutenant \"Little John\" Looney. Robert keeps punishing the offenders he comes across with vigilante punishment. After a gunman robs the hardware shop and takes a coworker's heirloom ring from her, Robert smashes the shooter with a hammer and blackmails two dishonest police officers into giving Ralphie's mother the racketeering money back.After discovering that Mandy has lied about her friendship with Alina and withheld information concerning Robert, Teddy murders her. Posing as a detective, Teddy pays Robert a visit at his flat and, before leaving, displays the photo of Mandy's body as a warning. Robert seeks Susan Plummer, a former DIA colleague, and her husband Brian for assistance in identifying Teddy. Teddy's true identity is Nicolai Itchenko, a former Spetsnaz member who is now a Russian secret police agent, Susan tells him about Pushkin's mission. Susan also discloses that two Boston police officers were killed by Nicolai, and that third detective, Frank Masters, had gone missing for days.After locating Masters, Robert scares him into assisting in the destruction of one of Pushkin's money laundering facilities. After the police come and discover a letter left by Robert instructing them to \"follow the money,\" Masters and Pushkin's men are arrested. Threatening to do further harm if Nicolai pursues him further, he confronts him once again. Two of Pushkin's oil tankers are destroyed by Robert. Nicolai kidnaps Robert's hardware shop coworkers in order to make him attend a meeting. Unexpectedly, Robert skips the meeting and murders the guys in order to protect the captives they were defending, shocking Nicolai. When Nicolai and his men come, Robert uses homemade weapons he finds lying around the hardware shop to murder them covertly. Later, he uses a nail gun to kill Nicolai in order to save a cornered Ralphie.Robert murders the guards and deceives Pushkin into electrocuting himself after discovering him at his estate in Moscow three days later. Alina meets Robert when she recovers and tells him that she has used the money Robert left at her hospital bed to start a new life. Motivated to keep assisting people, Robert answers online requests for assistance, identifying himself as The Equalizer.",
	"links": [
		"https://www.amazon.com/El-justiciero-Antoine-Fuqua/dp/B00NXL7GIM"
	]
}