{
	"title": "Hancock",
	"release_year": "2008",
	"runtime": "92",
	"tags": [
		"Action",
		"Comedy",
		"Drama",
		"amazon"
	],
	"rating": 6.4,
	"actors": [
		"Will Smith",
		"Charlize Theron",
		"Jason Bateman",
		"Jae Head",
		"Eddie Marsan",
		"David Mattey",
		"Maetrix Fitten",
		"Thomas Lennon",
		"Johnny Galecki",
		"Hayley Marie Norman"
	],
	"staff": [
		"Peter Berg",
		"Vy Vincent Ngo",
		"Vince Gilligan",
		"Akiva Goldsman",
		"James Lassiter",
		"Michael Mann",
		"Will Smith",
		"John Powell",
		"Tobias A. Schliessler",
		"Colby Parker Jr.",
		"Paul Rubell",
		"Francine Maisler",
		"Neil Spisak"
	],
	"votes": 517760,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTgyMzc4ODU3NV5BMl5BanBnXkFtZTcwNjk5Mzc1MQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "John Hancock (Will Smith) is an alcoholic man with superpowers, including flight, invulnerability, immortality and superhuman strength. Hancock is homeless and lives on the street.\nThough he uses his powers to stop criminals in his current residence of Los Angeles, his activity inadvertently causes millions of dollars in property damage due to his constant intoxication. As a result, he is routinely jeered at the crime scenes. He is shunned, ridiculed and hated by the public for his drunken and careless crime fighting acts and rude and unpleasant disposition. The cops hate Hancock as he does not work collaboratively with law enforcement agents.\nHancock also ignores court summons from the city of Los Angeles to address the property damage he has caused.Public relations spokesperson Ray Embrey (Jason Bateman) departs from an unsuccessful meeting pitching his All-Heart logo for corporations who are extraordinarily charitable. Ray was selling the right for a pharmaceuticals company to bear his \"AllHeart\" logo if they agreed to make their TB drug Mycodin free to all patients who would die without the drug. Ray says that his brand \"AllHeart\" represents a fair and better world. The pitch fails as Ray has no big names already signed up for this initiative.\nRay becomes trapped on railroad tracks (due to a traffic jam) with an incoming freight train. Hancock saves Ray's life, but he causes the train to needlessly derail and nearly injures another driver. Hancock is jeered by other drivers for causing more damage, but Ray steps in and thanks Hancock for saving his life.Ray offers to improve Hancock's public image, and Hancock grudgingly accepts. The spokesperson convinces the alcoholic superhero to permit himself to be jailed for outstanding subpoenas so they can show Los Angeles how much the city really needs Hancock.\nTwo inmates threaten him as he put them there, so he shoves one of their heads up the other inmate's buttocks. Hancock is visited by Ray, who encourages him to be patient. When he hears he might be in for 8 years, he panics and starts to break out, but Ray persuades him to stay and stick to the plan. Hancock is later visited by Ray's wife Mary and his son Aaron, who bring him homemade spaghetti with meatballs.When the crime rate rises after Hancock's incarceration, the superhero is contacted by the Chief of Police. With a new costume from Ray, Hancock intervenes with a bank robbery, rescuing a cop and stopping the leader of the robbers, Red Parker (Eddie Marsan) by cutting his hand off preventing him from activating a dead man's switch. Parker, incarcerated, pledges revenge and recruits accomplices.After the rescue, Hancock is applauded for handling the bank robbery. The superhero becomes popular once more, as Ray had predicted. Hancock goes out to dinner with Ray and his wife Mary (Charlize Theron), with whom he reveals his apparent immortality and his amnesia from 80 years ago. At that time, he says, he was asked for his John Hancock, so he decided that was his name. Ray tells Hancock that Mary is Aaron's stepmother and that his biological mother had died in childbirth.Carrying a drunk Ray home, Hancock kisses Mary, who kisses him back but then throws him through the wall, revealing that she also has superpowers. He threatens to expose her until she explains their origins, and she tells him that they have lived for 3,000 years with their powers, having been called gods and angels in their time. She explains that they are the last of their kind and that their kind are paired. The other super-humans paired up, lived human lives and then died.Mary does not tell Hancock the entire truth, and Hancock departs to tell Ray about the conversation. The exchange results in a battle between Hancock and Mary that takes them to downtown Los Angeles, causing significant damage to the area. Ray, downtown in a business meeting, sees and recognizes Mary using superhero powers like Hancock.Hancock meets Ray and Mary back at their house. Mary explains that Hancock is technically her husband, explaining that they were built in twos, and that they are drawn to each other over time and great distances.Hancock is later shot twice in the chest and wounded when he stops a liquor store robbery. After he is rushed to the hospital, Mary visits him and explains that as the pair of immortals gets close, they begin to lose their powers. Mary explains that the closer they are, the more mortal they become. They will lose their powers unless they stay apart. She also explains that Hancock was attacked in an alley 80 years prior, causing his amnesia. Mary deserted him then in order for him to recover from his injuries.While hospitalized, he and Mary are attacked by Red Parker, the bank robber, and two men that Hancock had humiliated during his incarceration. During the attack, Mary is shot. Hancock is able to stop two of the men but is further wounded by them. When Red attempts to finish Hancock off, Ray comes to the rescue and disarms and kills the bank robber with a fire ax. With Mary nearly dying, Hancock flees from the hospital so their parting would allow her to heal with her powers.Hancock later winds up in New York City, working as a superhero. Ray is seen walking with Mary, discussing historical events such as the reign of Attila the Hun in a jovial manner. In gratitude to Ray, Hancock paints Ray's All-Heart logo on the moon and calls the spokesperson, telling him to look up in the night sky, where he sees the worldwide advertisement.At the end, in New York, Hancock flies down to a scene where a criminal has taken a woman hostage at gunpoint. The criminal demands that Hancock tell the police to put their guns down, to which Hancock reluctantly agrees, just before the criminal calls Hancock an \"a**hole\" (or psycho, in the version edited for TV). These are words that earlier trigger Hancock to take revenge on whoever uses them. Hancock stares at the criminal, presumably just before he attacks and takes the criminal down.",
	"links": [
		"https://www.amazon.com/Hancock-Unrated-Will-Smith/dp/B001KB5UZS"
	]
}