{
	"title": "She's the Man",
	"release_year": "2006",
	"runtime": "105",
	"tags": [
		"Comedy",
		"Romance",
		"Sport",
		"amazon"
	],
	"rating": 6.4,
	"actors": [
		"Amanda Bynes",
		"Laura Ramsey",
		"Channing Tatum",
		"Vinnie Jones",
		"David Cross",
		"Julie Hagerty",
		"Robert Hoffman",
		"Alexandra Breckenridge",
		"Jonathan Sadowski",
		"Amanda Crew"
	],
	"staff": [
		"Andy Fickman",
		"Ewan Leslie",
		"Karen McCullah",
		"Kirsten Smith",
		"Ewan Leslie",
		"Lauren Shuler Donner",
		"Nathan Wang",
		"Greg Gardiner",
		"Michael Jablow",
		"Sarah Finn",
		"Randi Hiller",
		"David J. Bomba"
	],
	"votes": 178611,
	"cover": "https://m.media-amazon.com/images/M/MV5BYjVkM2VmZDYtM2E2OS00NTIwLThlZjctM2NkM2QwYmIxMTFiXkEyXkFqcGc@._V1_QL75_UY281_CR1,0,190,281_.jpg",
	"description": "Viola Hastings (Amanda Bynes) is a high school soccer player at Cornwall, which has just cut its girls' soccer team. Viola is into sports and is really passionate about football. Viola is dating Justin, a fellow soccer player on the boy's team. Viola knows that she plays better than half the boys on the team.\nAfter her request to join the boys' team is refused by the misogynistic coach Pistonek (Robert Torti), she finds a way to play for Cornwall's rival, Illyria. Viola breaks up with Justin when he laughs at her idea of trying out for the boy's team.\nViola's twin brother, Sebastian (James Kirk), is supposed to enter Illyria as a new student, and since he is instead going to a contest in London with his fledgling band, Sebastian asks Viola to cover for him by telling the school that he is sick and each of their parents (who are divorced) Daphne (Julie Hagerty) and Roger (John Pyper-Ferguson) thinks that he is staying with the other. Viola is not thrilled about the idea as Sabastian just got kicked out of Cornwall for skipping.\nSebastian is dating Monique (Alex Breckenridge). Daphne wants Viola to attend the debutante pageant, which she believes is archaic.Viola instead decides to pass herself off as Sebastian and join the boys' soccer team at Illyria. Illyria is coached by Dinklage (Vinnie Jones). She hopes to beat the Cornwall team and humiliate her sexist goalie ex-boyfriend, Justin (Robert Hoffman) who plays for the rival team. With the help of her stylist friend Paul (Jonathan Sadowski) and her girlfriends, Viola becomes the quirky \"Sebastian\".At Illyria, Viola's roommate is Duke Orsino (Channing Tatum), a good-looking striker on the soccer team. Duke finds tampons in \"Sebastian's\" backpack, which he says is for nose bleeds.\nTry-outs see Viola assigned to second string, much to her dismay. \"Sebastian\" avoids removing his shirt on the playground by saying that he is allergic to the sun.\n\"Sebastian\" is taken a ragging event for soccer newbies, and he only escapes by triggering the fire alarm. Everybody thinks that \"Sebastian\" is a dork, so Viola asks her friends Kia (Amanda Crew) and Yvonne (Jessica Lucas) to dress provocatively and flirt with \"Sebastian\" shamelessly, to improve his image in front of the guys. But then Monique comes looking for Sebastian, and \"Sebastian\" has to run away.\nMeanwhile, \"Sebastian's\" lab partner, Olivia (Laura Ramsey), develops a crush on him, which frustrates Duke, who likes Olivia. In exchange for \"Sebastian's\" help in getting Olivia's attention, Duke agrees to put in extra soccer practice time with him. Coach Dinklage eventually moves \"Sebastian\" up to first string, and he is delighted.\nMeanwhile \"Sebastian\" realizes that Duke is not good with talking to girls. \"Sebastian\" helps Duke in having a casual conversation with any girl.\"Sebastian\" is reminded, by a message from his mother, about the Junior League carnival that the siblings promised to attend. Since Duke's mother is also a part of the Junior League, he must go as well. \"Sebastian\" is forced to switch between herself (Viola) and Sebastian the whole time, while trying to avoid her mother and Monique so that she is not discovered as impersonating her brother.\nViola is trying to run around and do both her and her brother's jobs at the carnival. Duke misses his chance with Olivia when her shift is up at the kissing booth. He is not disappointed by her replacement, who turns out to be \"Sebastian's\" sister, Viola. Duke and Viola meet for the first time and exchange their kiss at the kissing booth, only to be interrupted by Viola's ex-boyfriend, Justin. Duke and Justin get into a fight and decide they will finish the battle on the soccer field. Duke realizes he might be crushing not only on Olivia, but on Viola as well. \"Sebastian\" tells Duke to go after Viola.\"Sebastian\" had told Olivia that she is not his type. Olivia goes on a date with Duke to make \"Sebastian\" jealous, remaining far more interested in him than in Duke. Duke is smitten with Olivia and agrees to go on a date with her, despite \"Sebastian\" reminding him to call Viola instead.\n\"Sebastian\" barges in by convincing Olivia to do a double date with him and Eunice, and Olivia and Duke.\nEncouraged by Viola (who meets Olivia at a preparation session for the debutante's ball), Olivia decides to go directly to \"Sebastian\" and tell him how she feels. Monique and Olivia end up in a big fight when Olivia taunts her that Sebastian dumped Monique.Things become complicated when the real Sebastian returns from London a day early. Sebastian had left Monique a message that he was in London but is heading home. This makes Monique wonder about who has been masquerading Sebastian all this while.When he arrives at Illyria, Olivia runs up and kisses him. Duke, seeing this, believes his roommate has betrayed him and after arguing with \"Sebastian\" kicks him out. Viola stays in Eunice's room and oversleeps, causing the real Sebastian to wind up on the field playing in what should be his sister's spot in the next day's much-anticipated game against Cornwall.Principal Gold (David Cross), who has been told of Viola's impersonating Sebastian by two students, Monique, and Malcolm, halts the game and informs the crowd that Sebastian is a girl. The real Sebastian being present instead, he proves himself to be male by pulling down his shorts and exposing his genitals. At half-time, Viola explains the situation to Sebastian, and they switch places again.Later on, in the game Viola explains that she has been impersonating her brother, finally convincing Duke and everyone else by showing them her breasts. The coach agrees to let Viola keep playing anyway, sternly informing the Cornwall coach that Illyria doesn't discriminate based on gender and he calls out the coach for his sexist ways. Illyria wins the game on a penalty kick when Viola scores a goal (after a save and then pass from Duke) pass her ex-boyfriend Justin.\nEveryone at Illyria celebrates their victory over Cornwall, except for Duke who is hurt at Viola's deception. She invites Duke to her debutante ball. They meet in a garden and head to the Debutante ball, where they are introduced, come on stage, and kiss. At the end of the film, Viola and Duke are shown playing on the soccer team of Illyria a year later, both on the first string.",
	"links": [
		"https://www.amazon.com/Shes-Man-Andy-Fickman/dp/B0DHKRP4Z1"
	]
}