{
	"title": "Hot Fuzz",
	"release_year": "2007",
	"runtime": "121",
	"tags": [
		"Action",
		"Comedy",
		"Mystery",
		"amazon"
	],
	"rating": 7.8,
	"actors": [
		"Simon Pegg",
		"Nick Frost",
		"Martin Freeman",
		"Bill Nighy",
		"Robert Popper",
		"Joe Cornish",
		"Chris Waitt",
		"Eric Mason",
		"Billie Whitelaw",
		"Peter Wight"
	],
	"staff": [
		"Edgar Wright",
		"Edgar Wright",
		"Simon Pegg",
		"Tim Bevan",
		"Eric Fellner",
		"Nira Park",
		"David Arnold",
		"Jess Hall",
		"Chris Dickens",
		"Nina Gold",
		"Marcus Rowland"
	],
	"votes": 541713,
	"cover": "https://m.media-amazon.com/images/M/MV5BYjFkZTkzZTQtNjM1ZS00M2EyLWE3MTAtMmY5Yzk0NTc0NDc3XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "PC Nicholas Angel (Simon Pegg), a high-achieving officer of the London Metropolitan Police Service, is promoted to Sergeant (He is a bit of an all-rounder, with 9 commendations in the last 12 months and the highest arrest record for any officer on the force), but his colleagues arrange for him to be reassigned to the small rural town of Sandford, Gloucestershire, a regular \"Village of the Year\" winner. Angel's ex-girlfriend Janine tells him that he is too dedicated to the force and needs to care about other people as well.Mary Porter (Julia Deakin) & Roy Porter (Peter Wight) own the local pub. Angel angers them off when he forces all the underage drinkers out of the pub to follow the letter of the law. They argue that keeping the kids in the pub keeps them off the street and off trouble. On his first night, Angel arrests 5 people for drunk driving, urinating in the streets, vandalism and so on. The next day he figures that one of the perpetrators is a fellow officer, Danny.Angel is soon frustrated by the mundane nature of the village and his lazy and incompetent colleagues. His partner, PC Danny Butterman (Nick Frost), is a fan of buddy cop films and son of Inspector Frank Butterman (Jim Broadbent), Angel's superior. Angel was promised a cottage as his accommodation, but since it is not ready, he is to stay at the local hotel run by Joyce Cooper (Billie Whitelaw).Other officers include Detective Sergeant Andy Wainwright (Paddy Considine), Sandford Police. Sergeant Turner (Bill Bailey), both twin-brother desk sergeants at Sandford. PC Bob Walker (Karl Johnson), the oldest officer in the Sandford police. Detective Constable Andy Cartwright (Rafe Spall), Sandford Police. Sergeant Tony Fisher (Kevin Eldon), Sandford Police. PC Doris Thatcher (Olivia Colman), the sole female police officer at Sandford.\nSimon Skinner (Timothy Dalton) runs the local supermarket and invites Angel to visit the store. Angel witnesses a petty thief and chases him across town to apprehend him, but Simon refuses to press charges.Martin Blower (David Threlfall) and Eve Draper (Lucy Punch), the two lead actors of a local production of Romeo and Juliet, whom Angel had pulled over earlier for speeding, are murdered by a cloaked figure wielding an ax, who disguises it as a car accident. Angel is the only officer who suspects foul play (There were no skid marks at the \"accident\" site). Sent to resolve a dispute, Angel discovers a stash of illegal weapons, including an old naval mine, and locks them in the police station. Angel warms to Danny, and they binge-watch action movies at Danny's home. That night, wealthy land developer George Merchant (Ron Cook) is attacked in his home by the cloaked figure and killed in a deliberate gas explosion.Angel suspects that the killings are connected to a recent property deal. A local journalist, Tim Messenger (Adam Buxton), approaches Angel at a church, claiming to have information, but another cloaked figure dislodges the spire atop the church's steeple, which falls and crushes Messenger's head, killing him. Leslie Tiller (Anne Reid), the village florist, tells Angel about her plans to sell her house to Merchant's business partners. While Angel is distracted, she is stabbed in the neck with her garden shears; Angel gives chase but loses the killer. Angel suspects Simon Skinner (Timothy Dalton), the sinister manager of the local supermarket, as the property deal would have built a rival supermarket, but Skinner has an alibi.Nobody at the station, except Danny believes that Angel saw the murder with his own eyes. They want to convince him that this was yet another \"accident\".Angel is attacked in his hotel room by one of Skinner's employees, Michael \"Lurch\" Armstrong (Rory McCann). Angel knocks him out and learns of a secret Neighborhood Watch Alliance (NWA) meeting at Sandford Castle. Angel confronts the NWA, led by Frank, who reveals that they carried out the murders, staged as accidents, for various petty reasons as each victim supposedly threatened Sandford's chances of winning Village of the Year. Frank's motive is his late wife Irene had put everything into helping Sandford win the first \"Village of the Year\", but travelers ruined their chances the night before the judges arrived, driving her to suicide. Angel flees and falls into the castle's catacombs, where he finds the corpses of the NWA's other victims. Danny appears and fakes killing Angel. Pretending to dispose of the body, Danny drives Angel away and urges him to return to London for his own safety. At a petrol station, while paying for petrol, Angel sees a rack of the films he and Danny bonded over and decides to return to Sandford.The next day, Angel arms himself with the confiscated guns at the station. He and Danny engage in a shootout with the NWA. When Frank sends the other officers to arrest them, Angel and Danny convince them that Frank is the culprit. Frank flees and the officers besiege the supermarket, with Skinner fleeing in a car with Frank. After a car chase, Angel corners Skinner at a model version of the village, and Skinner is impaled through the jaw by a miniature church steeple, while Frank is caught after being attacked by a swan that Angel and Danny had in their car earlier.Angel's former superiors (Met Chief Inspector Kenneth (Bill Nighy) & Met Sergeant (Martin Freeman), from the Metropolitan Police in London) arrive and ask him to return to London, as the crime rate has risen heavily in his absence, but Angel decides to remain in Sandford. While the Sandford Police are going over the paperwork of the arrests, the elderly Tom Weaver (Edward Woodward) (a professor who represents the Neighborhood Watch Alliance and looks over the town with a number of surveillance cameras), the last NWA member, bursts into the station wielding a blunderbuss. He shoots at Angel, but Danny jumps in front. In the resulting struggle, Weaver accidentally activates the naval mine, killing himself and destroying the station.\nOne year later, Angel has been promoted to Inspector and head of the Sandford police, and Danny is Sergeant. After visiting Irene's grave, the two drive off to their next crime scene.",
	"links": [
		"https://www.amazon.com/Hot-Fuzz-Simon-Pegg/dp/B000UIVRXG"
	]
}