{
	"title": "Pride & Prejudice",
	"release_year": "2005",
	"runtime": "129",
	"tags": [
		"Drama",
		"Romance",
		"amazon"
	],
	"rating": 7.8,
	"actors": [
		"Keira Knightley",
		"Matthew Macfadyen",
		"Brenda Blethyn",
		"Donald Sutherland",
		"Talulah Riley",
		"Rosamund Pike",
		"Jena Malone",
		"Carey Mulligan",
		"Claudie Blakley",
		"Sylvester Morand"
	],
	"staff": [
		"Joe Wright",
		"Deborah Moggach",
		"Jane Austen",
		"Tim Bevan",
		"Eric Fellner",
		"Paul Webster",
		"Dario Marianelli",
		"Roman Osin",
		"Paul Tothill",
		"Jina Jay",
		"Sarah Greenwood"
	],
	"votes": 337403,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTA1NDQ3NTcyOTNeQTJeQWpwZ15BbWU3MDA0MzA4MzE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "This film is the story of the Bennet family, a middle-class family in England around 1800. The principal characters are:\nMrs. Bennet, a hyper-excitable woman obsessed with getting at least one of her daughters into a financially advantageous marriage. Mr. Bennet (Donald Sutherland), who is relaxed, easygoing, and unflappable. He is somewhat amused by the high-spirited behavior of the rest of the family.\nJane (Rosamund Pike), the oldest of the daughters. She is serious and thoughtful, but quite shy.Elizabeth (Lizzie, Kiera Knightly), the second daughter and the main character. She is wise, witty, and outspoken. She enjoys (and is very good at) verbal sparring. Mary (Talulah Riley), the third, not at all interested in chasing men. She spends her time reading, playing the piano. Katherine (Kitty) (Carey Mulligan), like Lydia (Jena Malone), is a boy-crazy teenager. The two of them are not interested in any serious pursuits; they just want to go to parties and dances. Kitty is impressionable and takes her cues from Lydia. Lydia is even more frivolous than Kitty.Charles Bingley (Simon Woods) is a wealthy and good-nature gentleman from London who moves into a nearby estate, causing great interest among the Bennets. Fitzwilliam Darcy (Matthew Macfayden) is an extremely wealthy gentleman from the North of England.\nThe reason that an advantageous marriage is important is that the house and land are covered by a covenant that would give it to the eldest male heir on Mr. Bennet's death, but, having no sons, it will go to their cousin, William Collins. This would leave the family destitute.Elizabeth \"Lizzie\" overhears her mother telling her father a nearby estate, has been rented by a Mr. Bingley. Mr. Bennett finally divulges that he has already met Mr. Bingley.\nHe says that they can all expect to see Mr. Bingley at an upcoming public ball. Lizzie herself and the eldest sister Jane smile with pleasure, as the younger Lydia and Kitty jump up and down.\nAt the public ball, Mr. Bingley enters the hall along with his pretentious sister Caroline, and Mr. Darcy. Mrs. Bennet introduces her daughters to the newcomers. She also introduces Lizzie's close friend Charlotte Lucas. Mr. Bingley strikes up a conversation with Jane. Darcy makes a cruel remark about Lizzie & she engages in verbal sparring with him. Caroline invites Jane to stay at Netherfield. Mrs. Bennet plans a cold on Jane (By making her go on horseback in a storm) so that she has to stay a few days there.Lizzie, worried about Jane, goes to visit on foot & is seen by Caroline & Darcy in her dis-shelved look. Lizzie is sure that Charles loves Jane, by the way he cares for her.\nCaroline insults the unpolished behavior of the Bennet family & engages Lizzie in verbal spars. Soon Lizzie and Jane leave.\nThen the dreaded cousin William Collins, a minister, comes to visit the Bennets. He is extremely shallow, pompous, patronizing, boring, and conceited. Dinner is very tense; the family sees right through him. Lizzie, in particular, does some verbal sparring with him. After dinner, he approaches Mrs. Bennet about marrying Jane. Mrs. Bennet says that Jane appears to be taken, but that Lizzie is available.The next morning, the girls go out to see a parade of the militia; Kitty and Lydia are particularly interested in flirting with them. Later, they meet one of them, a handsome lieutenant named Wickham. On their walk home they encounter Bingley and Darcy. Darcy and Wickham stare at each other coldly. Wickham tells Lizzie that Darcy had cheated him out of Darcy's father's generous bequest to him. Her opinion of Darcy goes even lower.The family goes to Bingley's dance. Collins asks Lizzie to dance with her, to her great disgust. Then Darcy appears and asks Lizzie to dance. She accepts. She asks Darcy about Wickham, & he dodges the subject. Caroline, as usual, makes insulting remarks to Darcy about the Bennets.\nCaroline notices Charles smiling at Jane & knows he loves her & she is determined to stop him.\nCollins proposes to Lizzie & she turns him down. Mrs. Bennet is angry, but Mr. Bennet supports her. Caroline sends a letter saying that they are all leaving Netherland with Charles going with Darcy's sister Georgina. Lizzie tells Jane to go to London and stay with their aunt and uncle, and she is sure that Bingley will send for her before the week is out.Charlotte Lucas comes to visit Lizzie and tell her that she is engaged to Mr. Collins. Lizzie is appalled that she would marry such a shallow man. Charlotte replies that she is desperate--she is 27 and in danger of becoming a penniless old maid.A few weeks later, Charlotte invites Lizzie to visit her at her new home with Mr. Collins. Mr. Collins takes Lizzie and Charlotte to visit his patron, aristocratic Lady Catherine DeBourg, who is also Darcy's aunt. Mr. Darcy, and his cousin, Colonel Fitzwilliam, are also there. Lady DeBourg is an incredibly haughty, arrogant, insolent, and overbearing person. She is openly disdainful of the Bennets' lower-class upbringing.FritzWilliam asks Lizzie about Darcy & Darcy is surprised to find out that Lizzie thinks he is a pompous ass. Fitzwilliam reveals that Darcy, not Caroline, was the one who had separated Mr. Bingley from Jane.\nDarcy proclaims his love for Lizzie, but Lizzie is angry at him for breaking up Jane & Charles. But Darcy says that he knew Jane didn't love Charles as all Bennets think about is money. Lizzie throws the Wickham story in his face. Darcy explains the relationship with Wickham. Darcy's father did indeed leave Wickham with a generous allowance. Wickham gambled it away and came back for more. Darcy refused. Later, Wickham returned, and tried to elope with Darcy's sister Georgiana, to get her 30,000-pound inheritance. Georgiana was only 15 at the time and was thrown into a state of deep despair by this.Lizzie and Jane both return home. Lizzie hasn't told Jane that Darcy has intentionally kept Charles away from her. Lydia has been invited by Colonel Forster to go on a trip to the South coastal resort at Brighton. Mr. Bennet allows it, over Lizzie's protests. The Bennet sisters' aunt and uncle, Mr. and Mrs. Gardiner, are visiting, and will be going on.\na vacation in the Peak district to the North. They invite Lizzie to come with them, and she accepts. Lizzie's aunt and uncle suggest a visit to Pemberley, Darcy's grand estate, which is nearby and is open for visitors. Lizzie consents to the trip when she is told that Darcy is away. The housekeeper tells the visitors what a kind, caring, and generous person Mr. Darcy is. Lizzie begins to think that her earlier impression of him may have been wrong.Lizzie meets Georgina & then Darcy returns from his trip early. Georgina tells Lizzie that Darcy has told wonderful things about her. Darcy & Lizzie have a decent conversation for the first time. Lizzie receives the letter that Lydia has run away with Wickham. Darcy calls up Charles, & they both go to London looking for Lydia & Wickham.\nWickham is found & Bennet promises a settlement of 100 pounds a year to Wickham to get Lydia married to him. Darcy was the one behind the scenes driving this whole thing to protect the honor of the Bennet family.\nThe Bennets later learn that Mr. Bingley is returning to town. Mr. Bingley arrives at the house, with Darcy. Mrs. Bennet, while pretending to be indifferent, is clearly excited at the thought that Bingley will propose to Jane.Bingley and Darcy then walk a short distance from the house, and Darcy helps Bingley rehearse his proposal to Jane. Lizzie begins to realize that Darcy brought Bingley back to town, attempting to repair the damage that he had caused by separating them. Bingley returns and proposes to Jane, and she accepts.\nLady DeBourg arrives. After issuing a few insults, she imperiously demands to speak to Lizzie alone. She tells Lizzie that she has heard a rumor that her nephew Darcy and Lizzie are to be married. She demands that Lizzie promise that the rumor is false, and that she will never marry Darcy. Lizzie refuses to do so and tells Lady DeBourg to leave.Lizzie had been unaware of the rumor, and realizes that it must have come from Darcy, and that it means that Darcy is genuinely interested in her. She meets Darcy. When Lady DeBourg had reported to him Lizzie's refusal to deny the rumor, he realized that there was hope that Lizzie might marry him. He says that he hopes that her view of him has changed from their earlier encounters. He apologizes for his past behavior and proposes to her. Just at the instant the Sun is rising between them, she accepts.Later that morning, Darcy, in Mr. Bennet's study, asks for Lizzie's hand in marriage. He gives his consent, saying \"I could not have parted with you, my dear Lizzie, to anyone less worthy.\" After she leaves, Mr. Bennet, who has now had three of his five daughters betrothed or married within a few days, calls out \"If any young men come for Mary or Kitty, for heaven's sake, send them in, I'm quite at my leisure.\"",
	"links": [
		"https://www.amazon.com/Pride-Prejudice-Keira-Knightley/dp/B009CGCQPU"
	]
}