{
	"title": "X-Men Origins: Wolverine",
	"release_year": "2009",
	"runtime": "107",
	"tags": [
		"Action",
		"Sci-Fi",
		"max",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Hugh Jackman",
		"Hugh Jackman",
		"Liev Schreiber",
		"Ryan Reynolds",
		"Danny Huston",
		"Will.i.am",
		"Lynn Collins",
		"Kevin Durand",
		"Dominic Monaghan",
		"Dominic Monaghan",
		"Taylor Kitsch",
		"Taylor Kitsch",
		"Daniel Henney"
	],
	"staff": [
		"Gavin Hood",
		"David Benioff",
		"Skip Woods",
		"Hugh Jackman",
		"John Palermo",
		"Lauren Shuler Donner",
		"Ralph Winter",
		"Harry Gregson-Williams",
		"Donald McAlpine",
		"Nicolas De Toth",
		"Megan Gill",
		"Christine King",
		"Debra Zane",
		"Barry Robison"
	],
	"links": [
		"https://www.max.com/movies/x-men-origins-wolverine/925902ef-48be-4398-b28b-76944b1b60ce",
		"https://www.amazon.com/X-Men-Origins-Wolverine-Character-Schreiber/dp/B002OLG188"
	],
	"votes": 543827,
	"cover": "https://m.media-amazon.com/images/M/MV5BZjQwOGEzNjUtNDgwYS00NzUzLWJhZjAtNmFlNzY2YTQyOTllXkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "In 1845, James Howlett (Troye Sivan), a young boy living in northern Canada, sees his father killed by groundskeeper Thomas Logan (Aaron Jeffery). James is sick most of the time. Thomas was an abusive drunk. One night, Thomas returned in a drunken stupor, and was attacked by James's father and that's when Thomas killed him.\nThe trauma activates the boy's mutation: bone claws protrude from James' hands, and he kills Thomas, who reveals with his dying breath that he is James' real father. James's mother is horrified by James's mutation and refuses to have anything to do with him.James flees into the forest along with Thomas's son Victor Creed (Liev Schreiber), who is thus James' half-brother. They spend the next century as soldiers, fighting in the Civil War, both World Wars, Korean War, and the Vietnam War. James is indestructible and remains alive even after being struck by bullets and cannons multiple times during the war. James realizes that Victor enjoyed the killing and the war.\nIn 1973, Victor attempts to sexually assault a local village woman but is stopped after killing a senior officer. James (Hugh Jackman) defends his brother, and the two are sentenced to execution by firing squad, which they survive.Major William Stryker (Danny Huston) approaches them, now in military custody, and offers them membership in Team X, a group of mutants including marksman Agent Zero (Daniel Henney), swordsman Wade Wilson (Ryan Reynolds), Teleporter John Wraith (Will.i.am), invulnerable Fred Dukes (Kevin Durand) and Electropathic Chris Bradley (Dominic Monaghan). They join the team, where Stryker uses the group to attack the stronghold of a diamond trader in Lagos, Nigeria. Stryker wants the source of the piece of Adamantium that the trader had in his possession, which was a village far inland into Africa. The villagers reveal that the Adamantium is a meteor fragment but refuse to give the exact location. Stryker asks Victor to kill each and every villager, including women and children.\nThe group's questionable actions and disregard for human life cause James to leave.Six years later, James, now going by the name Logan, lives in Canada with his girlfriend, Kayla Silverfox (Lynn Collins) and works at a timber-yard. Colonel Stryker locates Logan and warns him that someone is killing members of the team; both Wilson and Bradley are dead. It is shown that Victor had killed Wilson and Bradley.\nShortly afterward, Victor murders Kayla and attacks Logan when he comes looking for him. The battle is a stalemate since neither Victor nor Logan can kill each other. Victor argues that Logan is immortal, and that Kayla was stopping him from realizing his full potential. Victor beats Logan and breaks his claws.\nStryker offers Logan a way to beat Victor; Logan undergoes an operation to reinforce his skeleton with Adamantium (Stryker says that he finally found the meteor that he was looking for in Africa), a virtually indestructible metal. Before the procedure, Logan asks for new dog tags inscribed with \"Wolverine\", based on a story that Kayla told him.\nOnce the procedure is complete, Stryker orders Logan's memory erased (and Stryker wants to use Logan's DNA to create a new weapon called XI), but Logan overhears and fights his way out. As Logan runs, Zero tracks him down. Logan had taken refuge in a barn belonging to an old couple, who give him clothes and a bike, and even feed Logan. Zero arrives and kills the couple and engages Logan. Logan retaliates and ends up killing Zero. Logan finds that Stryker was behind Zero.\nStryker prepares Adamantium bullets to take down Logan.Logan locates Wraith and Dukes and asks them about the location of Stryker's new laboratory, referred to as \"The Island\". Wraith says that Stryker is collecting mutants from all over the world for his experiment at the Island.\nThey tell him to find Remy \"Gambit\" LeBeau (Taylor Kitsch), who escaped from the facility and knows the location of The Island.\nLogan and Wraith locate Gambit in New Orleans, but when Logan asks for the Island's location, Gambit suspects he was sent to recapture him and attacks. Outside, Logan finds Victor, who had just killed Wraith and the two fight.When Logan is about to kill Victor, Gambit interrupts, and Victor escapes. Logan and Gambit fight before Logan convinces him he is not working for Stryker. Gambit takes him to Stryker's facility on Three Mile Island. After learning of Stryker's mutant son and believing that he is too emotionally close to the situation, General Munson tries to shut Weapon XI down, but Stryker kills him.There, Logan learns that Kayla is alive and conspired with Stryker in exchange for her sister's safety. Enraged, Logan leaves. Victor then arrives, demanding the Adamantium bonding promised for his service, but Stryker refuses on the basis that Victor would not survive the procedure. Victor attempts to kill Kayla, but Logan hears her screams and returns. Logan defeats and nearly kills Victor. Meanwhile, Stryker activates Weapon XI, a \"mutant killer\" with the abilities of other mutants bonded to Wade Wilson's body, which Stryker refers to as \"the Deadpool\".Kayla and Logan free the imprisoned mutants, and on their escape, they are found by Deadpool. Logan holds Deadpool off while the mutants flee. During the escape, Kayla, mortally wounded, decides to stay behind while the party led by Scott Summers (Tim Pocock) is greeted by Professor Charles Xavier (Patrick Stewart), who offers them shelter at his school.Logan lures Deadpool to the top of one of the plant's cooling towers. Logan is almost killed until Victor intervenes. After a lengthy battle, Logan manages to decapitate Deadpool and kick him into the base of the cooling tower. As he falls, the head fires optic blasts that cause the tower to start falling apart. Victor departs and Logan is saved from the collapsing tower by Gambit. After Logan finds Kayla, Stryker shoots him in the forehead with Adamantium bullets, rendering him unconscious. Kayla uses her persuasion powers to make Stryker drop the gun and commands him to \"walk until feet bleed\" before dying from her wounds.\nGambit returns as Logan regains consciousness, but the brain damage caused by the bullets has triggered amnesia. Gambit tries convincing Logan to come with him, but he declines, wanting to go his own way.In a mid-credits scene, Stryker is detained for questioning by MPs in connection with the death of General Munson, whom Stryker murdered to protect his experiment. In a post-credits scene, Weapon XI crawls out of the rocks and touches his head, which awakens and shushes the screen, revealing that he has survived being decapitated."
}