{
	"title": "Death Race",
	"release_year": "2008",
	"runtime": "105",
	"tags": [
		"Action",
		"Sci-Fi",
		"Thriller",
		"max",
		"amazon"
	],
	"rating": 6.4,
	"actors": [
		"Jason Statham",
		"Joan Allen",
		"Tyrese Gibson",
		"Ian McShane",
		"Natalie Martinez",
		"Max Ryan",
		"Jason Clarke",
		"Frederick Koehler",
		"Jacob Vargas",
		"Justin Mader"
	],
	"staff": [
		"Paul W.S. Anderson",
		"Paul W.S. Anderson",
		"Robert Thom",
		"Charles B. Griffith",
		"Ib Melchior",
		"Paul W.S. Anderson",
		"Jeremy Bolt",
		"Paula Wagner",
		"Paul Haslinger",
		"Scott Kevan",
		"Niven Howie",
		"Scot Boland",
		"Victoria Burrows",
		"Paul D. Austerberry"
	],
	"votes": 220796,
	"cover": "https://m.media-amazon.com/images/M/MV5BZjdlNmJjM2ItYjkwOS00NDMxLWFjM2QtNzcyZjJkYzEzYzQ5XkEyXkFqcGc@._V1_QL75_UY281_CR2,0,190,281_.jpg",
	"description": "In 2013, the economy of the US completely collapses, resulting in unemployment and crime rates to skyrocket, and a sharp increase of convicted criminals, which leads to privatized prisons for profit. Hennessey (Joan Allen) is the warden of Terminal Island Penitentiary, as whom she earns her profits from the pay-per-view broadcast of a modern gladiator game called \"Death Race,\" with the prisoners as the players.The racers, along with their navigators, drive a 3-part race over 3 days on a closed track at Terminal Island, with various pressure plates: swords activate the racers' offensive weapons, shields activate defensive weapons such as oil, smoke, and napalm, and skulls (\"Death Heads\") activate deadly metal traps which rise up from the track. The reward for the drivers is that if one racer wins 5 races in a row, they will be granted their freedom by Warden Hennessey.\nAt the end of one race, a masked driver named Frankenstein (Niles York (David Carradine (voice)) is nearing the finish line against his only surviving competitor and rival Machine Gun Joe (Tyrese Gibson). His navigator, Case (Natalie Martinez), reports that his defensive weapons are malfunctioning, so he drops the \"tombstone\" (a huge iron block at the back of the car as defense) but Joe avoids it, and Case is ordered to eject from the car just before Joe blows it up, sending the car in the air.On the outside, industrial worker and former NASCAR driver, Jensen Ames (Jason Statham) struggles to live normally and provide for his family in the ruined economy. When the steel factory he works at is closed, he returns home and promises his wife that he will provide for her and their newborn daughter, Piper (despite the fact that he only has $300). But just then, a mysterious assailant wearing a ski mask suddenly knocks him down. As the assailant leaves, he makes a \"gun\" gesture at Ames just before the latter passes out. Ames wakes up covered in blood, with his wife murdered. He is arrested by the police, finding he has been framed for killing his wife.Six months later, Ames has been (wrongly) convicted and sent to Terminal Island. After getting into a fight with Pachenko (Max Ryan) and his Aryan Brotherhood gang, Hennessey, along with her right-hand man, prison guard Mr. (Darryl) Ulrich (Jason Clarke), informs Ames that - unknown to the public and the other racers - Niles/Frankenstein is dead and died at the operating table. Still, as he was so wildly popular, she wants to keep his legend alive for the ratings.To keep the legend alive, She coerces Ames to clandestinely assume the persona, enticing him with only needing one victory to earn his freedom since Frankenstein held four victories. She points out that, by wearing Frankenstein's mask, only a few inside people will know he is not really Frankenstein, including his maintenance crew of Coach (Ian McShane), a professional mechanic who is deliberately staying in prison, Gunner (Jacob Vargas), and Lists (Frederick Koehler (as Fred Koehler)), a mentally unstable person who is in prison for fraud.On Day 1, Ames meets Case, who also knows he is not Frankenstein. Ames handles himself well, even taking out another racer, but his defensive weapons mysteriously malfunction, just like in the previous Frankenstein's last race. When he sees Pachenko do the same \"gun\" gesture as the person who killed his wife through the windshield, Ames is distracted and is hit by Joe, and comes in last place. In all, three racers have been killed--Siad (Abdul Ayoola (uncredited)), Hector Grimm (Robert LaSardo), and Travis Colt (Justin Mader). During a conversation with Hennessey, Ames pieces together that Pachenko had killed his wife, at the behest of Hennessey, so that she could recruit him as Frankenstein's replacement to maintain her pay-per-view profits.On Day 2, Ames forces Case to admit that she has been sabotaging Frankenstein's car on the orders of Hennessey in exchange for her release papers. Case was never meant to kill either Niles or Ames, but instead to stop them both from winning so Frankenstein could remain in Death Race. Ames targets Pachenko and causes him to crash, then he leaves his car and breaks Pachenko's neck. Then, Hennessey unleashes the Dreadnought, a massive 18-wheel tanker with many weapons that Hennessey has unexpectedly added to the race to boost ratings. It kills three more racers (Carson, Riggins, and 14K (Robin Shou)) before Ames teams up with Joe to trigger a \"Death Head\" which destroys the Dreadnought, to Hennessey's shock and horror. Since Ames had contacted Joe personally during the race, Joe has figured out Ames's identity, so Ames decides to have a talk with Joe.Aware that Ames knows her secret, Hennessey tries to maintain the ruse of granting him freedom but asks him to consider staying on permanently as Frankenstein and will gain commodity in prison in exchange. As a precaution before the final race, she has an explosive planted under his car for Day 3, knowing she can replace Ames with another masked Frankenstein driver.\nOn Day 3, Hennessey deliberately keeps Ames from activating his weapons but allows Joe to activate his. It makes no difference, as Ames (with Case) and Joe escape by driving their vehicles through a weakened wall discovered by examining footage of Grimm's demise.Hennessey still tries to activate the bomb, but she is unsuccessful, as Coach and his team had already discovered and removed it. Hennessey sends attack helicopters after Ames, Case, and Joe, who make it across the bridge that connects the island to the mainland and split up. When the helicopters follow Ames under Hennessey's orders, Case offers herself as bait in the Frankenstein costume to save Ames and also to repay Niles, and because she had already been given her release papers. She is captured while Joe and Ames escape on a freight train.Hennessey, although furious about the escape, is happy about capturing Frankenstein (unaware that it is Case) and also for her earning millions of dollars from the highly successful pay-per-view. She is given an anonymous gift for her record-breaking ratings that contains the very bomb she had failed to detonate. At that moment, Coach remotely detonates the bomb, killing Hennessey and Ulrich, and proceeds to break the fourth wall by looking into the camera and stating, \"I love this game.\"Six months afterward, Joe, Ames, and his daughter Piper are shown living honestly in Mexico, where they work as mechanics at a local used car dealership. Suddenly, Case shows up in her new modified 1970 Chevy Chevelle SS car she won in a card game. As they all begin inspecting the car, Ames reflects on how no one could love his daughter more than he does, and that she is his chance at something else, something better, which to him is \"all that really matters.\"",
	"links": [
		"https://www.max.com/movies/death-race/18684088-9982-4277-9f91-4b18f2aaba32",
		"https://www.amazon.com/Death-Race-Collection-Jason-Statham/dp/B076JJWTKT"
	]
}