{
	"title": "Match Point",
	"release_year": "2005",
	"runtime": "124",
	"tags": [
		"Drama",
		"Romance",
		"Thriller",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Scarlett Johansson",
		"Jonathan Rhys Meyers",
		"Emily Mortimer",
		"Matthew Goode",
		"Alexander Armstrong",
		"Paul Kaye",
		"Brian Cox",
		"Penelope Wilton",
		"Janis Kelly",
		"Alan Oke"
	],
	"staff": [
		"Woody Allen",
		"Woody Allen",
		"Letty Aronson",
		"Lucy Darwin",
		"Gareth Wiley",
		"Remi Adefarasin",
		"Alisa Lepselter",
		"Patricia DiCerto",
		"Gail Stevens",
		"Juliet Taylor",
		"Jim Clay"
	],
	"votes": 230176,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTQ1NzQ4OTM4MV5BMl5BanBnXkFtZTcwNzY2OTQzMw@@._V1_QL75_UX190_CR0,8,190,281_.jpg",
	"description": "Man underestimates the role of luck in life. There is a lot in life which is outside one's control and is only governed by the laws of luck which can either favor or go against you.Chris Wilton (Jonathan Rhys Meyers), a recently retired tennis professional, is taken on as an instructor at an upmarket club in London. Chris rents a small little apartment with a sofa bed, and that too costing 225 pounds per week. Chris settles into a routine, spending time reading at the apartment and teaching club members the basics of tennis. It is an easy life. Chris is from a poor Irish family and has come to England to earn money for his family back home.He strikes up a friendship with a wealthy pupil, Tom Hewett (Matthew Goode), after discovering their common affinity for opera. Tom and Chris start going to the Opera together.Tom's older sister, Chloe (Emily Mortimer), is smitten with Chris. Chloe starts joining Tom during his tennis lessons with Chris. Gradually Chris and Chloe begin dating. Chris' schedule allows him a lot of time off and he is able to spend much of it with Chloe. They end up kissing and then having sex on Chris's sofa bed in his tiny apartment.\nChloe invites Chris to her family's country house for a family gathering. At the gathering, Chris meets Tom's fiance, Nola Rice (Scarlett Johansson), and they are instantly attracted to each other. Tom and Nola have been together for 6 months. Nola came to England to study acting and they met at a party.Tom's father Alec (Brian Cox) is a rich aristocrat and businessman. Tom's mother, Eleanor (Penelope Wilton), does not approve of her son's relationship with the struggling American actress, a source of tension in the family. Chloe encourages her father to give Chris a job as an executive in one of his companies. Eleanor doesn't want Chloe to rush into anything with Chris, especially because she is not totally on terms with Nola yet.Chris and Chloe start going on double dates with Nola and Tom. Things gradually become more and more comfortable between Chris and Chloe. Although, it is clear that the class chasm between Chris and Chloe is vast and unlikely to be bridged. Chris is a middle-class person from an austere family, while Chloe is from a privileged class. Chris is a big believer in the part luck plays in one's success.\nChris begins to be accepted into the family and marriage is discussed.Chris insists on the double dates, so he can meet Nola. He even accompanies Nola to her auditions in the city for moral support. Chris goes to a drink with Nola afterwards and learns that her father left their family and never supported them, while her mother could never hold down a job. Nola is divorced and that is another reason why Eleanor hates her. Eleanor wants Tom to marry a girl named Olivia, who is his distant cousin.\nNola says that Chris is being groomed by the family and he will do well in life, unless he blows it by making a pass at her.Alec is impressed with Chris' work at the company and says that soon a significant position will open up at the company, which will pay accordingly and will have a number of perks associated to it. He also offers Chris an MBA education on the company's expense.\nOne afternoon, Tom's mother, Eleanor, questions Nola's choice of profession. During a storm, Chris follows Nola outside and confesses his feelings for her, and they passionately kiss in a wheat-field. Feeling guilty, Nola treats this as an accident; Chris, however, wants an ongoing clandestine relationship. Chris and Chloe marry, while Tom ends his relationship with Nola.Chloe, to her distress, does not become pregnant immediately. Chris vainly tries to track down Nola but meets her by chance sometime later at Tate Modern. He discreetly asks for her number, and they begin an affair.\nWhilst Chris is spending time with his wife's family, Nola calls to inform him that she is pregnant. Panicked, Chris asks her to get an abortion, but she refuses, saying that she wants to raise the child with him.\nChris's strange behavior makes Chloe suspect he is having an affair, which he denies. Nola urges Chris to divorce his wife, and he feels trapped and finds himself lying to Chloe as well as Nola. Nola confronts him at his office, and he just escapes public detection.Soon after, Chris takes a shotgun from his father-in-law's home and carries it to his office in a tennis bag. On leaving, he calls Nola on her mobile to tell her he has good news for her. He goes to Nola's building and gains entry the apartment of her neighbor, Mrs. Eastby (Margaret Tyzack).\nChris shoots and kills Mrs Eastby, then stages a burglary by ransacking the room and stealing some jewelry and drugs. As Nola returns, he shoots her in the stairwell. He then takes a taxi to the theatre to watch a musical with Chloe. Scotland Yard investigates the crime and concludes it was committed by a drug addict stealing money. The following day, the murder is in the news. Chris returns the shotgun and he and Chloe announce her pregnancy.Detective Mike Banner (James Nesbitt) invites Chris for an interview in relation to the murder. Beforehand, Chris throws Mrs. Eastby's jewelry and drugs into the river, but by chance her ring bounces on the railing and falls to the pavement. At the police station, Chris denies knowing Nola, but Banner surprises him with her diary, in which he features extensively. He confesses his affair to Banner but denies any link to the murder and appeals to the detectives not to involve him any more in their investigation, as news of the affair may well end his marriage just as he and his wife are expecting a baby.Late one night Chris sees apparitions of Nola and Mrs. Eastby, who tell him to be ready for the consequences of his actions; he replies that his crimes, though wrong, had been \"necessary\", and that he is able to suppress his guilt. At the same time, Banner dreams that Chris committed the murders. His theory is discredited by his partner Inspector Dowd (Ewen Bremner), who informs him that a drug peddler found murdered on the streets had Mrs. Eastby's ring in his pocket. The film ends with Chloe giving birth to a baby boy named Terrence, and his uncle blessing him not with goodness but luck.",
	"links": [
		"https://www.amazon.com/Match-Point-Jonathan-Rhys-Meyers/dp/B0CNH8YC3G"
	]
}