{
	"title": "Underworld: Evolution",
	"release_year": "2006",
	"runtime": "106",
	"tags": [
		"Action",
		"Fantasy",
		"Thriller",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Kate Beckinsale",
		"Scott Speedman",
		"Bill Nighy",
		"Tony Curran",
		"Derek Jacobi",
		"Steven Mackintosh",
		"Shane Brolly",
		"Brian Steele",
		"Zita Görög",
		"Scott McElroy"
	],
	"staff": [
		"Len Wiseman",
		"Danny McBride",
		"Len Wiseman",
		"Kevin Grevioux",
		"David Coatsworth",
		"Gary Lucchesi",
		"Tom Rosenberg",
		"Richard S. Wright",
		"Marco Beltrami",
		"Simon Duggan",
		"Nicolas De Toth",
		"Deborah Aquila",
		"Jennifer L. Smith",
		"Tricia Wood",
		"Patrick Tatopoulos"
	],
	"votes": 210937,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjEzNDY1OTQwOV5BMl5BanBnXkFtZTcwNjcxMTIzMw@@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "8 centuries ago, a blood feud raged between Vampires and Lycans. Markus was the first Vampire and William was the first Lycan, both brothers and sons of Alexander Cornivus.In 1202, an army led by the three vampire elders Markus (Tony Curran), Viktor (Bill Nighy), and Amelia (Zita Gorog) arrives at a Lycan-ravaged village. Viktor argues that William is out of control and needs to be dealt with. But Marcus would not allow his brother to be killed. William's actions converted an entire village to become Lycans and the Vampires had to burn the bodies and kill the ones who turned before they could be burned.\nViktor and Amelia capture their target, Markus's twin brother, William Corvinus (Brian Steele), the first and most powerful werewolf. Despite Markus's defiance, Viktor orders that William be imprisoned in a secret location forever.Selene wishes to expose the truth about the death of Viktor to the first true vampire Marcus that is hibernating. However, Marcus has already awakened and wants to release his savage Lycan brother William, who has been imprisoned for centuries, by Viktor who was opposed to the ravenous nature of the first werewolves who were uncontrollable and could not return to human form (Lucian was the first werewolf to be able to do so).Selene (Kate Beckinsale) takes Michael (Scott Speedman) to a safe house so that she can confront the vampire regent Kraven (Shane Brolly); she knows that Kraven intends to kill Markus and plans to stop him. However, Markus awakens before Kraven arrives and kills him and his men.Lorenz Macaro (Derek Jacobi), an elderly man, sends in a team of \"cleaners\" to investigate the aftermath from the battle in the Lycans' lair. He finds that Lucian and Viktor have been killed and Kraven had a hand in the plot to overthrown Marcus and Viktor.\nWhen Macaro examines Viktor's corpse, he finds a metal disc inside which is the match to a pendant originally worn by Sonja. The other half of the pendant is now possessed by Michael after the death of Lucian (who was wearing the pendant around his neck in the memory of Sonja).Using the knowledge of computers obtained from Kraven's blood, Markus tracks Selene and Michael down and attacks them in Hungary, but they evade him and hide in a warehouse. Michael is a worthy opponent to Markus and is able to hold his ground in battle against him. Markus was after the pendant around Michael's neck. Selene evades Markus by driving a truck into the sunlight, where Michael protects her and drives the truck into the warehouse. Michael covers the truck with a tarpaulin and colors the windows with black paint to protect Selene.\nMacaro is also closely tracking Selene and Michael's location.At the warehouse, Selene and Michael share their feelings and have passionate sex. Now knowing that the pendant is important to Markus, Michael and Selene set out to discover why Markus wants it. Selene recalls that she saw it as a child but does not know its significance. They travel to the hideout of the exiled vampire historian Andreas Tanis (Steven Mackintosh).Tanis reveals that Markus was the first vampire, one of the three sons of Alexander Corvinus, the first immortal. Markus was bitten by a bat and metamorphosed into a vampire, while William was bitten by a wolf and metamorphosed into a werewolf. The third son remained human and gave rise to a line of mortal descendants including Michael, who became the first Lycan-Vampire hybrid.The first werewolves created by William were entirely animal and unable to return to their human forms. Due to William's destructiveness, Markus approached Viktor, then a dying mortal warlord, and offered to metamorphose him and his army into vampires in exchange for tracking down and stopping William, and in destroying those he had infected. Viktor did not kill the brothers because he was led by Markus to believe that doing so would result in the immediate extinction of all other vampires and his Lycan slaves. Tanis further reveals that Selene's father was the architect who built William's prison and that the pendant is the key. The key was in the pendant with Lucian and now with MichaelViktor killed Selene's family because they knew the prison's location, but metamorphosed Selene into a vampire with the location of the prison encoded in her blood. Tanis then refers Selene and Michael to Macaro for help. After Selene and Michael leave, Markus arrives and drinks Tanis' blood to learn Selene and Michael's location, killing Tanis.Visiting Macaro, Selene and Michael discover he actually is Alexander Corvinus. Alexander reveals that he has devoted his entire immortal life to keeping the Vampire-Lycan war a secret and refuses to assist Selene in killing his sons. Markus arrives, fights Michael and impales him. He learns the location of William's prison by drinking Selene's blood before mortally wounding his father and obtaining the other half of the pendant. He mocks his father's refusal to help William, revealing that he intends, with William, to rule the world as the god-like master of a race of vampire-Lycan hybrids. On Alexander's bidding, Selene drinks his blood, enhancing her physical strength and healing abilities to a level equivalent to that of a hybrid. Afterwards, Alexander blows up his ship, killing himself.Selene, aboard Alexander's helicopter, leads his cleaners to the prison to confront and destroy Markus, but he has already freed William. In the ensuing battle, William bites the cleaners who thus metamorphose into werewolves. Michael, presumed dead and carried aboard the helicopter, awakens and joins the fight in his hybrid form, killing William by ripping his head off. Selene engages Markus in hand-to-hand combat, killing him by pushing him into the rotor blades of the cleaners' crashed helicopter.After the battle, Selene realizes that Alexander's blood granted her hybrid abilities, including being immune to the effects of sunlight, which is lethal to vampires.",
	"links": [
		"https://www.amazon.com/Underworld-Evolution-Kate-Beckinsale/dp/B000I9X54Q"
	]
}