{
	"title": "Captain America: The First Avenger",
	"release_year": "2011",
	"runtime": "124",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.9,
	"actors": [
		"Chris Evans",
		"Chris Evans",
		"Hugo Weaving",
		"Hugo Weaving",
		"Samuel L. Jackson",
		"Hayley Atwell",
		"Sebastian Stan",
		"Tommy Lee Jones",
		"Dominic Cooper",
		"Richard Armitage",
		"Stanley Tucci",
		"Toby Jones"
	],
	"staff": [
		"Joe Johnston",
		"Christopher Markus",
		"Stephen McFeely",
		"Joe Simon",
		"Jack Kirby",
		"Kevin Feige",
		"Alan Silvestri",
		"Shelly Johnson",
		"Robert Dalva",
		"Jeffrey Ford",
		"Sarah Finn",
		"Randi Hiller",
		"Priscilla John",
		"Rick Heinrichs"
	],
	"votes": 908911,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzUyM2YyY2MtNzNlMS00MWU5LTgxNjAtNzZlNmI2NjU2NDZlXkEyXkFqcGc@._V1_QL75_UY281_CR4,0,190,281_.jpg",
	"description": "Captain America is excavated from a crashed plane along with his shield.\nJohann Schmidt (Hugo Weaving), a high-ranking Nazi, in search of a glass cube (the Tesseract). Jonhann is the top-ranking scientist in Nazi Germany, working on superpowers from the Occult. He finds the Tesseract in Norway. In New York, Steve Rogers (Chris Evans) is a thin asthmatic found ineligible for US military service. He friend James \"Bucky\" Barnes has been accepted & is accepted to 107th infantry.Dr. Abraham Erskine (Stanley Tucci) notices Steve, & his determination despite his appearance. He is also on the recruitment board & accepts Steve when he applies next. Meanwhile Johann works with Arnim Zola to harness the power of the cube to create energy weapons. They are both part of Hydra which earlier operated under Nazi, but to grow further Johann terminates his association to Hitler & goes independent.Erskine takes Steve for basic training under Colonel Chester Phillips (Tommy Lee Jones). Chester is supervising Erskine's super soldier program. Peggy Carter (Haley Atwell) is a British Officer on the platoon. Despite being smallest & weakest, Steve impresses all with his spirit and selflessness.\nErskine reveals to Steve that he worked with Johann earlier to create a serum that gives man superhuman strength. When Erskine used it on Johann it backfired & left him as a sinewy red skeleton. Thats when Erskine had to flee & join the US. Erskine performs the procedure on Steve instantly transforming him into a super soldier.A Nazi spy kills Erskine & steals the last serum & escapes. Steve runs after the perpetrator & captures him, but the perpetrator swallows the vial of cyanide & kills himself. He has a tattoo of Hydra on himself. As Chester & Peggy conduct their investigation, Steve is enlisted by a Senator to raise funds for the bond as a comic superhero Captain America.He is taken overseas where he meets Chester & Peggy & finds that the 107th has been captured by Hydra. Eager to save Bucky, Steve wants to go in. Howard is a private defense contractor and friend of Peggy. When Chester refuses to help Steve, Howard air drops Steve behind enemy lines & near Hydra's weapons plant.Steve comes face to face with Johann & sees his red skull face. Johann escapes with Arnim, & Steve destroys the base & finds a map with the location of rest of Hydra's bases. He rescues Bucky & 500 other men of the 107th. They return with the recovered weapons, much to the astonishment of Chester.Chester offers help to Steve to pursue Johann, but Steve prefers the same team & the rescued prisoners who helped him in their first attack on Hydra. Howard gives Steve a shield made of Vibranium. Lighter than steel & the strongest metal on earth. Peggy is attracted to Steve but finds him kissing another GI & is angry.Steve manages to destroy many bases of Hydra & even captures Arnim on his journey through the Swiss Alps. But Bucky dies in that operation. Arnim reveals the location of Hydra's last base.\nSteve goes headfirst into the base & is captured & brought in front of Johann. The rest of the team attacks with surprise.Johann has created a plane & stacked it with super bombs with the name of each major city in US. He takes off. Steve pursues & kisses Peggy before he jumps on the plane.\nThe plane is powered by the cube. Steve destroys the cube console. As the cube escapes, it opens a space portal & Johann is swept into it & disintegrated.\nSteve realizes that the plane is on auto pilot. He radios Peggy & begs his forgiveness & dives the plane into the ocean.Steve awakens in a 1940's hospital. An old-fashioned radio transmits the play-by-play of a Dodger game. He gets up, looks out the windows and watches as the hospital door opens. A young woman (Amanda Righetti) who bears a striking resemblance to Peggy enters. She waits for a response from Steve, who suspiciously looks at her. He asks why the radio is playing a Mets game from May 1941... a game that he was at. She reaches into her pocket and withdraws a Walky-Talky. Two tall soldiers in black uniforms enter the room, and Steve easily tosses them through a wall. Steve steps through the hole and is surprised to see that he was on a movie-set. He runs through the dark corridors, pushes a door open and appears in a modern skyscraper, bustling with people in business suits. He flees the building and finds himself in 2011's Time Square. He peers around, shocked by his surroundings, and watches as numerous matching black SUVs encircle him.Nicky Fury (Samuel L Jackson) steps out and carefully speaks to Steve. He tells him that he's been asleep, in ice, for 70 years. The hospital set was meant to gradually introduce him to modern society. Still perplexed, Steve breathes heavily and sadly tells Fury that he had a date.\nIn a post credit scene, Steve is in an old-fashioned gym. He pummels a punching bag so hard that he knocks it off it's chain and sends it flying across the room. Fury enters the gym and asks Steve if he's had trouble sleeping. Steve cynically asks if Fury has come with another mission. Fury replies to the positive.Suddenly we see images of all the superheroes, Thor, Tony Stark (from the 'Ironman' movies), Hawkeye, Black Widow, Bruce Banner (from 'Hulk') and other Shield agents preparing for battle. Fury, tells him that \"They're up.\" His personal mission to build an army of superheroes is complete... and to be continued.",
	"links": [
		"https://www.amazon.com/Captain-America-First-Avenger-Content/dp/B078Z3MFV4"
	]
}