{
	"title": "The Kingdom",
	"release_year": "2007",
	"runtime": "110",
	"tags": [
		"Action",
		"Drama",
		"Thriller",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Jamie Foxx",
		"Chris Cooper",
		"Jennifer Garner",
		"Jason Bateman",
		"Ashraf Barhom",
		"Ali Suliman",
		"Jeremy Piven",
		"Richard Jenkins",
		"Tim McGraw",
		"Kyle Chandler"
	],
	"staff": [
		"Peter Berg",
		"Matthew Michael Carnahan",
		"Michael Mann",
		"Scott Stuber",
		"Danny Elfman",
		"Mauro Fiore",
		"Colby Parker Jr.",
		"Kevin Stitt",
		"Bruria Albeck",
		"Cathy Sandrich Gelfond",
		"Amanda Mackey",
		"Tom Duffield"
	],
	"links": [
		"https://www.amazon.com/Kingdom-Jamie-Foxx/dp/B0010T93R6"
	],
	"votes": 133215,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjA1MDIzOTYwMV5BMl5BanBnXkFtZTcwMTM5OTA1MQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "1920, Kingdom of Saudi Arabia is formed by coming together of Wahhabi tribes under the Royal family. 1933, oil is found with US help. Saudi is a religious society, so special compounds (where Islamic laws do not apply) are created for housing US workers pumping oil in KSA. Aramco is formed. As economies depend more and more on oil, US wants to have a security presence in KSA. Saudi elites start spending big and lose legitimacy in eyes of their conservative support base. In 1970, US supports Israel in Arab-Israel war. KSA stops pumping oil to bring US economy to a standstill as gas prices quadruple. US make oil a national security issue as a matter of policy.\n1990, Iraq invades Kuwait. Osama offers his services to KSA royals by bringing his army from Afghanistan to repel the Iraqis. But KSA go with the US offer. Osama is angry and start bombing targets all over the world. Sep 11, 15/19 attackers were Saudis. The monarchy is pro-US, but the Wahhabi extremists are anti-US.During a softball game at an American oil company housing compound in Riyadh, Saudi Arabia, Al-Qaeda terrorists set off a bomb, killing Americans and Saudis. While one team hijacks a car and shoots residents, a suicide bomber wearing a fake police uniform blows himself up, killing everyone near him. Sergeant Haytham (Ali Suliman) of the Saudi State Police kills the carjackers. The FBI Legal Attaché in Saudi Arabia, Special Agent Fran Manner (Kyle Chandler), calls his US colleague, Special Agent Ronald Fleury (Jamie Foxx), to advise him about the attack. Manner is discussing the situation with DSS Special Agent Rex Burr (Tom Bresnahan) when an ambulance full of explosives is detonated, killing Manner, Burr, and many others.At FBI Headquarters in Washington, D.C., Fleury briefs his rapid deployment team on the attack. Fleury suspects the attack to be led by Abu Hamza, a Osama wannabe. Although the U.S. Justice Department (Led by US Attorney General Gideon Young (Danny Huston)) and the U.S. State Department hinder FBI efforts to investigate the attack (They say that more US boots in Saudi soil will inflame an already combustible situation), Fleury blackmails the Saudi ambassador Prince Thamer (Raad Rawi) into allowing an FBI investigative team into Saudi Arabia (He tells Thamer that he has proof of Saudi Royal ladies donating funds in Boston to Islamic organizations, which fund terror training camps in Indonesia and other places).Fleury gathers Special Agent Janet Mayes (Jennifer Garner), a forensic examiner, FBI analyst Adam Leavitt (Jason Bateman), an intelligence analyst, and Special Agent Grant Sykes (Chris Cooper), a bomb technician, to go to Saudi Arabia. On arrival they are met by Colonel Faris Al-Ghazi (Ashraf Barhom), the commander of the Saudi State Police Force providing security at the compound. The investigation is being run by General Al Abdulmalik (Mahmoud Said) of the SANG, who does not give Fleury and his team permission to investigate.The team has only permission to walk the crime scene. Fluery's team already finds the detonator and speak to US witnesses together some clues. They find a video of the attack on the internet, which was filmed from a high vantage point. With Al-Ghazi, they find the building and figure out that the video was shot from the roof.The FBI team is invited to the palace of Saudi Prince Ahmed bin Khaled for a dinner. While at the palace, Fleury persuades the Prince that Colonel Al-Ghazi is a natural detective and should be allowed to lead the investigation. With this change in leadership, the Americans are allowed hands-on access to the crime scene. Mayes gets access to the dead bodies and finds the steel balls used to cause maximum damage in the explosion.While searching for evidence, Sergeant Haytham and Sykes discover the second bomb was detonated in an ambulance. They find the hospital from which the ambulance was stolen. Fleury learns the brother of one of the dead terrorists had access to ambulances and police uniforms. Colonel Al-Ghazi orders a special forces team to raid a house, managing to kill a few heavily armed terrorists. Following the raid, the team discovers clues, including photos of the U.S. and other Western embassies in Riyadh. Soon afterward, the U.S. Embassy Deputy Chief of Mission Damon Schmidt (Jeremy Piven) notifies Fleury and his team that they have been ordered to return to the United States. Damon thinks there are 5 dead guys and that's the end of the investigation, but Fleury is not convinced as these are teenagers and don't look like senior management.On their way to King Khalid International Airport, their convoy is attacked and incapacitated. Leavitt is dragged out of the wrecked car and kidnapped while Fleury manages to wound one attacker. Al-Ghazi commandeers a civilian vehicle to chase the fourth SUV and the other car holding Leavitt into the dangerous Al-Suwaidi neighborhood of Riyadh. As they pull up, a gunman fires rocket-propelled grenades at them and a fierce firefight starts. Leavitt is tied up inside a complex.While Sykes and Haytham watch the entrance to the complex, Al-Ghazi, Fleury, and Mayes follow a blood trail and kill many gunmen inside. Mayes, separated from the others, finds Leavitt and his attackers, preparing an execution video of Leavitt. She kills the remaining insurgents, and Al-Ghazi and the team start to leave. Fleury then realizes there is a trail of blood leading to the back of the apartment. After they enter, Mayes comforts a girl in the apartment and offers her candy. In return, the girl offers Mayes a marble, similar to those embedded in the bodies of some bombing victims.Al-Ghazi sees the grandfather, reaches out with his hand, and offers to help him stand. When the old man gives him his hand, Al-Ghazi sees that the man is missing the same fingers as Abu Hamza Al-Masri (Hezi Saddik) in the terrorist group's many videos and confirms his suspicion that the grandfather is the terrorist leader. Abu Hamza's teenage grandson walks out of the bedroom and shoots Al-Ghazi in the neck, then he starts to point his gun at Mayes, prompting Fleury to kill him. Abu Hamza then pulls out an assault rifle and Haytham kills him. As Abu Hamza dies, another grandchild hugs him and Abu Hamza whispers something into his ear to calm the child down. Al-Ghazi dies in Fleury's arms.At Al-Ghazi's house, Fleury and Haytham meet his family. Fleury tells his son that Al-Ghazi was his good friend, mirroring a similar scene earlier in the movie wherein he comforted Special Agent Manner's son. Fleury and his team return to the United States, where they are commended by FBI Director James Grace (Richard Jenkins) for their outstanding work. Leavitt asked Fleury and Mayes what he had whispered to her to calm her down.The scene cuts to Abu Hamza's daughter asking her own son what his grandfather whispered to him as he was dying. The grandson tells his mother, \"Don't fear them, my child. We are going to kill them all,\" a similar line to what Fleury had whispered to Mayes."
}