{
	"title": "I Am Legend",
	"release_year": "2007",
	"runtime": "101",
	"tags": [
		"Action",
		"Drama",
		"Horror",
		"amazon"
	],
	"rating": 7.2,
	"actors": [
		"Will Smith",
		"Alice Braga",
		"Charlie Tahan",
		"Salli Richardson-Whitfield",
		"Willow Smith",
		"Darrell Foster",
		"April Grace",
		"Dash Mihok",
		"Joanna Numata",
		"Abbey"
	],
	"staff": [
		"Francis Lawrence",
		"Mark Protosevich",
		"Akiva Goldsman",
		"Richard Matheson",
		"John William Corrington",
		"Akiva Goldsman",
		"David Heyman",
		"James Lassiter",
		"Neal H. Moritz",
		"James Newton Howard",
		"Andrew Lesnie",
		"Wayne Wahrman",
		"Kathleen Chopin",
		"Naomi Shohan"
	],
	"votes": 827469,
	"cover": "https://m.media-amazon.com/images/M/MV5BMGE1OWZkZmItNmVhMC00YzAxLTgxOTctNjg3NWExM2RmOWJkXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "A 2009 attempt to genetically modify the measles virus in order to treat cancer turns deadly, infecting and killing a large number of people. The people that survived were transformed into vampire, albino, cannibalistic mutants known as Darkseekers. These individuals wander at night and feed on the naturally immune survivors. They are particularly susceptible to sunlight.In 2012, three years after the outbreak, LTC Robert Neville, a U.S. Army virologist, lives alone in a strongly protected house in Washington Square Park in Manhattan. Every day, Neville searches for food and supplies, experiments on sick rats to try to cure the virus, and waits for any survivors who might react to his constant recorded radio broadcasts telling them to meet him at the South Street Seaport at noon. Neville's only friend is his German Shepherd Samantha (Sam), and he frequently \"talks\" to mannequins and the characters on video shop recordings in order to deal with his loneliness. He hides from the Darkseekers at night by barricading himself inside with Sam. Since the military was imposing a quarantine on the island and Neville remained behind with other military personnel, he is plagued by thoughts of his wife, Zoe, and daughter, Marley, who perished in a helicopter accident during the chaotic evacuation of Manhattan.One day, Sam follows a deer into a shadowy structure as Neville hunts it. Sam and Neville carefully follow her inside and find the deer's body, only to find the place crowded with Darkseekers. The sunlight kills the assaulting Darkseekers, and both make it out unscathed. Neville creates a snare trap and catches a female Darkseeker after discovering a potential therapy made from his own blood. When a male Alpha Darkseeker tries to follow them, the sunshine stops him and he retreats back into the darkness. Neville cures the woman in his laboratory in the basement of his home, but it seems to be unsuccessful.The following day, Neville shoots the confused mannequin \"Fred,\" which is typically found outside Grand Central Terminal at the neighborhood video store. Neville is aware, though, that the Darkseekers are observing him from adjacent structures. He is caught in a trap like the one he used to catch the female as he gets close to Fred, and he hits his head and is knocked out. The sun has already fallen as he awakens, and infected dogs attack him. Sam is bitten during the struggle, but Neville and Sam kill them. Dogs are resistant to the airborne version of the virus, but they can contract a separate type through bites. She receives an injection of Neville's serum, but as soon as she starts to change and exhibit symptoms of infection, Neville is compelled to strangle her to death. Enraged and heartbroken, Neville goes out the next night and intentionally assaults a group of Darkseekers before being saved by two immune humans, Anna and a small kid named Ethan, who had come from Maryland after hearing his broadcast.They take the injured Neville back to his house, where Anna tells him that they are traveling to a survivors' camp in Bethel, Vermont, after surviving the outbreak on a Red Cross evacuation ship from São Paulo. According to Neville, there is not a survivors' camp like that. Neville theorizes that he can boost the effectiveness of the therapy by using ice to reduce the female Darkseeker's body temperature as he continues to strive to heal her. A gang of Darkseekers who had been pursuing Anna and Neville the previous evening break into the residence the next evening. Together with the female test subject, Neville, Anna, and Ethan withdraw into the basement laboratory and barricade themselves in.Theatrical conclusionNeville evaluates the situation as the Darkseeker alpha male smashes himself against a glass door to break in as the Darkseekers storm the lab and learn that the previous treatment worked. Before locking Ethan and Anna in a coal tunnel at the rear of the laboratory, Neville takes a vial of blood from the woman he treated and hands it to Anna. The cure is then spared when Neville uses a grenade to destroy himself and the attacking Darkseekers.After arriving at the survivors' camp in Bethel the next day, Anna and Ethan are welcomed by military officials and other survivors before Anna gives them the cure. Anna tells the story of how Neville's sacrifices and efforts to preserve mankind became legendary.A different conclusionThe alpha male Darkseeker attempts to burst through the glass of the lab while forming a butterfly shape as the Darkseekers assault. Neville understands that the alpha male and his followers have just been attempting to reclaim his mate, and that it alludes to the butterfly-shaped tattoo on the female Darkseeker's neck. After dropping his revolver, Neville hands the woman back. After seeing the alpha male's emotional reaction to his mate's homecoming, Neville apologizes to him after they look each other down. Together with the other members of the pack, the alpha male leaves. After they are gone, a startled Neville regrets the experiments he has conducted over the years as he glances at the numerous photos of his test victims and understands he has turned into a monster in the eyes of the infected.The next morning, a transformed Neville gives up his studies and sets out for Vermont with Anna and Ethan in the hopes of discovering the survivors' colony. As they cross the George Washington Bridge, Anna gives a resolute monologue that concludes, \"You are not alone.\"Although it was first offered as a book-accurate alternate ending on the 2008 two-disc special edition DVD of I Am Legend, the \"other\" ending was taken out of the theatrical cut after receiving unfavorable feedback from audiences who saw the original test screening.The \"alternative\" ending of I Am Legend would be regarded as the canonical one in the sequel, which was revealed in February 2023. Will Smith would play Dr. Robert Neville again, continuing his experiments on the Darkseekers.",
	"links": [
		"https://www.amazon.com/I-Am-Legend-Will-Smith/dp/B0014CDKVY"
	]
}