{
	"title": "Rambo",
	"release_year": "2008",
	"runtime": "92",
	"tags": [
		"Action",
		"Adventure",
		"Thriller",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Sylvester Stallone",
		"Julie Benz",
		"Matthew Marsden",
		"Graham McTavish",
		"Reynaldo Gallegos",
		"Jake La Botz",
		"Tim Kang",
		"Maung Maung Khin",
		"Paul Schulze",
		"Cameron Pearson"
	],
	"staff": [
		"Sylvester Stallone",
		"Art Monterastelli",
		"Sylvester Stallone",
		"David Morrell",
		"Avi Lerner",
		"Kevin King Templeton",
		"John Thompson",
		"Brian Tyler",
		"Glen MacPherson",
		"Sean Albertson",
		"Sheila Jaffe",
		"Pasiree Panya",
		"Franco-Giacomo Carbone"
	],
	"votes": 246883,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTI5Mjg1MzM4NF5BMl5BanBnXkFtZTcwNTAyNzUzMw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Amid the political protests of the Saffron Revolution in Burma, ruthless SPDC officer Major Pa Tee Tint (Maung Maung Khin) leads Burmese junta army forces to pillage small villages (of the Karen ethnic community) in a campaign of fear. His soldiers sadistically slaughter innocents, abduct teenage boys to be drafted into his army and hold women hostage to be assaulted as sex slaves.Meanwhile, 20 years after the events in Afghanistan, Vietnam War veteran John Rambo (Sylvester Stallone) is still living in Thailand, making a meager living as a snake catcher and by providing boat rides. A missionary doctor from Colorado named Michael Burnett (Paul Schulze) hires Rambo to use his boat to ferry their group up the Salween River into Burma on a humanitarian mission to provide medical aid to a village inhabited by the Karen people. Rambo initially refuses, then agrees when requested by Michael's fiance Sarah Miller (Julie Benz).During the trip, the boat is stopped by pirates demanding Sarah in exchange for passage, forcing Rambo to kill them. Greatly disturbed by Rambo's actions, Michael sends him back upon arriving at their destination, claiming his group no longer wants his help. In the village, the missionaries provide aid to those attacked by Tint's soldiers. But the army strikes, the villagers are massacred and the missionaries are abducted.\nOn his way back, Rambo destroys the pirate boat by setting fire to it, but eventually gets back to the village.The pastor of the missionaries' church comes to Thailand and asks Rambo to guide a team of five foreign mercenaries on a rescue mission. Rambo takes the mercenary team to the drop-off point and offers to help, but Lewis (Graham McTavish), a former SAS soldier and the team's leader, refuses. Myint (Supakorn Kitsuwon), a Karen rebel familiar with the area, leads the mercenaries to the village of the massacre. As they survey the damage, a squad of Tint's soldiers arrive in a cargo truck with a group of villagers, intent on playing games and killing them.Outnumbered, the mercenaries take cover and watch helplessly as the soldiers prey on their hostages. Having secretly followed the mercenaries, Rambo emerges in time to kill all the soldiers with his bow and arrow, allowing the hostages to escape unharmed. Rambo joins the mercenary team and they make their way to Tint's soldiers' camp. They stealthily rescue the surviving American missionaries and Burmese hostages and flee under cover of night.The next morning, Tint and his soldiers pursue them. Rambo lures a section of the army into activating a dormant British Tallboy bomb left lying in the forest, killing his targets. Eventually, Tint's soldiers manage to capture everyone except for Rambo, Sarah, and School Boy (Matthew Marsden), the mercenaries' sniper.\nBefore Tint can execute the mercenaries, Rambo launches a surprise attack by seizing a jeep mounted with an M2 Browning machine gun, igniting a massive firefight in the jungle during which he shoots most of Tint's army dead while the mercenaries engage Tint's soldiers. The Karen rebels, led by Myint, arrive and join the fight, helping to overwhelm Tint's soldiers and kill them all. After realizing his defeat, Tint attempts to escape, but Rambo intercepts and disembowels him dead with his machete.\nSometime later, Rambo returns to the United States to visit his father at his home in Bowie, Arizona.",
	"links": [
		"https://www.amazon.com/Rambo-Last-Blood-Sylvester-Stallone/dp/B07Y24WKH2"
	]
}