{
	"title": "State of Play",
	"release_year": "2009",
	"runtime": "127",
	"tags": [
		"Crime",
		"Drama",
		"Mystery",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Russell Crowe",
		"Rachel McAdams",
		"Ben Affleck",
		"Helen Mirren",
		"Robin Wright",
		"Jason Bateman",
		"Jeff Daniels",
		"Michael Berresse",
		"Harry Lennix",
		"Josh Mostel"
	],
	"staff": [
		"Kevin Macdonald",
		"Matthew Michael Carnahan",
		"Tony Gilroy",
		"Billy Ray",
		"Paul Abbott",
		"Tim Bevan",
		"Eric Fellner",
		"Andrew Hauptman",
		"Alex Heffes",
		"Rodrigo Prieto",
		"Justine Wright",
		"Avy Kaufman",
		"Mike Styles",
		"Mark Friedberg"
	],
	"links": [
		"https://www.amazon.com/State-Play-Russell-Crowe/dp/B002GO5346"
	],
	"votes": 162054,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTI1MTQ4MDIwMl5BMl5BanBnXkFtZTcwNzgxOTc0Mg@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "One night, thief Deshaun Stagg (LaDell Preston), fleeing through Georgetown, Washington, D.C., is shot and killed by a man carrying a metal briefcase. A pizza deliveryman witnesses the crime and is also shot but left in a coma. The following morning, a young woman is killed by a Washington Metro train in what is presumed to be a suicide.Congressman Stephen Collins (Ben Affleck) is distraught to learn the dead woman was Sonia Baker (Maria Thayer), a chief researcher on his staff. Collins, who is a military veteran, is leading an investigation into PointCorp, a private defense contractor with controversial operations involving mercenaries. Pointcorp is the biggest beneficiary of DOD policy of outsourcing critical security work to private contractors. Collins breaks down at the next hearing with Pointcorp, while announcing Sonia's death and media speculates that he was romantically involved with Sonia. Collins admits as much to his party boss, who asks him to suspend his hearings into Pointcorp.\nCollins tells his old college roommate and friend Cal McAffrey (Russell Crowe), an investigative reporter for the fictional Washington Globe, that he had been having an affair with Sonia. She had sent him a cheerful video message on the morning of her death, which he believes indicates that she wasn't suicidal.\nCal is in touch with Stephen's wife Anne (Robin Wright). she says she knew He was having an affair with Sonia. Cal and Anne were having an affair of their own.Della Frye (Rachel McAdams), a political reporter and Capitol Hill blogger for the online division of the Globe, discovers Sonia's death occurred in one of the only three CCTV blind spots in the Metro camera system. Cal also finds a link between the shootings and Sonia's death. He finds Sonia's number on the cell phone of the dead man Deshaun (He got the cell phone through his contact at the morgue).\nLater, Cal is sought out by a homeless girl, Mandi (Sarah Lord) (for whom he bought a soda at the morgue), who sells him photographs that Stagg, her friend, had taken from the metal briefcase (which he stole from a random man at Starbucks), revealed to contain a gun and peculiar handmade bullets. The photos are surveillance images of Sonia talking to a well-dressed man. Della visits the hospital where the pizza deliveryman is coming out of his coma. Before she can talk to him, he is shot through the window and killed by an unseen sniper. Later, while reviewing the CCTV footage of the Metro platform area where Sonia died, Della recognizes a man as the same person she just saw at the hospital prior to the deliveryman's murder.It is revealed that PointCorp stands to gain billions of dollars from mercenary activities in the Middle East ($4 Bn annually) and domestically ($40 Bn annually). Collins accuses Pointcorp in open hearings, of employing retired US military personnel, and then increasing the company and the owner's wealth at the expense of the lives of the retired military folks and the civilians they kill.\nCollins tells Cal his findings: PointCorp, along with other defense contractors, have a monopoly on government surveillance and defense contracts, basically privatizing American Homeland security. Collins says that on paper 16 companies have contracts for Homeland security, but when you dig deeper, its only one company that controls them all, Pointcorp.\nAn unnamed PointCorp insider gives Cal information on a person (Fred Summers) connected to the suspected assassin (the guy in the photos with Sonia). Cal tracks the lead to an apartment complex but finds the assassin instead who says he is Fred's roommate & that Fred has shipped out overseas. He chases Cal to the complex's garage and tries to kill him, but Cal calls the police and the assassin flees. Cal and Della later learn that Mandi has been killed.With the aid of Sonia's flat mate Rhonda Silver (Katy Mixon), Della identifies the well-dressed man with Sonia in the photographs as Dominic Foy (Jason Bateman), a PR executive of a subsidiary of PointCorp. Silver also informs them about a threesome with Sonia and Collins (And that Stephen paid Sonia $40K credit card debt) and wants to go public with this information; however, Della and Cal doubt her credibility. Meanwhile, other media organizations report on the story. Editor Cameron Lynne (Helen Mirren) is livid, as this would have boosted the Globe's sales.Cal coerces Foy into talking about Sonia, secretly filming their conversation. Foy reveals Sonia was secretly working for PointCorp and spying on Collins. However, she fell in love and was pregnant with Collins' baby when she was killed. Cal reveals this information to Collins (by calling him to the motel where he was taping Foy) by playing the tape of the interview with Foy for him. This also indicates that someone on capitol Hill collaborated with PointCorp to get Sonia onto Collin's staff. The tape also shows that the assassin contacted Foy with a plan to kill Sonia, when she stopped giving any intelligence on Collins back to Pointcorp (presumably after she got pregnant, which Collins didn't know about).\nFurious, Collins attacks Foy, lashes out at Cal (for sleeping with Anne), and storms off. Later that evening, Cal confronts Congressman George Fergus (Jeff Daniels), the chief whip congressman who had pretended to mentor Collins and recommended Sonia for the research position on Collins' staff. Cal informs Fergus that he plans to run a story about the link between Fergus and PointCorp, and how Fergus attempted to undermine Collins's investigation.Cal's boss, Cameron Lynne, refuses to print his story due to the lack of credible sources. Just then, Collins and his wife Anne (Robin Wright) stop by the Globe's offices. Collins presents his research on PointCorp, talks about his affair with Sonia, and states his belief that PointCorp had Sonia killed when she stopped reporting back to them. Afterwards, Anne, whose conversation with Cal implies a past love triangle from their college years, casually mentions Sonia was secretly being paid $26,000 a month by PointCorp.Later, while talking with Della, Cal remembers Collins was never shown the portion of Foy's interview tape that mentioned the specific amount of money Sonia was being paid by PointCorp. He realizes Collins knows much more about Sonia's involvement with the company than he is letting on and wonders if Collins is somehow connected to Sonia's murder. Cal recognizes the assassin in an old group military photo that also features Collins, confirming his hunch. Cal goes to Collins's office to confront him. Collins admits he had been suspicious of Sonia, and that he hired the assassin, U.S. Army corporal Robert Bingham (Michael Berresse), whose life Collins had once saved, to spy on her and report back to him. Collins says that Bingham hated PointCorp more than he did, and that he never told Bingham to kill Sonia.Cal tells Collins the police will be arriving shortly. As he leaves the building, Cal is confronted by Bingham. Officers arrive and shoot and kill Bingham before he can shoot Cal. Back at the newspaper later that night, Cal types up the story. He reports that Collins was arrested for his role in the deaths of Sonia, the thief, the homeless girl, and the deliveryman. He puts Della first on the byline and lets her submit the story for publication."
}