{
	"title": "Flightplan",
	"release_year": "2005",
	"runtime": "98",
	"tags": [
		"Drama",
		"Mystery",
		"Thriller",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Jodie Foster",
		"Peter Sarsgaard",
		"Sean Bean",
		"Kate Beahan",
		"Michael Irby",
		"Assaf Cohen",
		"Erika Christensen",
		"Shane Edelman",
		"Mary Gallagher",
		"Haley Ramm"
	],
	"staff": [
		"Robert Schwentke",
		"Peter A. Dowling",
		"Billy Ray",
		"Brian Grazer",
		"James Horner",
		"Florian Ballhaus",
		"Thom Noble",
		"Deborah Aquila",
		"Jennifer L. Smith",
		"Tricia Wood",
		"Alec Hammond"
	],
	"votes": 173516,
	"cover": "https://m.media-amazon.com/images/M/MV5BMGQyZmQ1OGItYWNkNi00YzU4LWJmZjktNTQyZjNlOGNmNWJlXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Kyle Pratt (Jodie Foster) is a propulsion engineer based in Berlin, Germany. Her husband David (John Benjamin Hickey) died from falling off the roof of an avionic manufacturing building, and now Kyle and her 6-year-old daughter Julia (Marlene Lawston) are going back to NY. They fly aboard an Elgin 474 plane, which Kyle helped design (loosely based on the Airbus A380 with the aircraft's classification number being similar to the Boeing 747) operated by Aalto Airlines.\nAfter falling asleep for a few hours, Kyle wakes to find that Julia is missing. After trying to remain calm at first, she begins to panic, and Captain Marcus Rich (Sean Bean) is forced to conduct a search, while sky marshal Gene Carson (Peter Sarsgaard) monitors her. Julia's boarding pass is missing, her seat is registered empty, Flight attendant Stephanie (Kate Beahan) tells Kyle that the boarding gate has no record of her boarding, & none of the passengers remember seeing Julia.\nKyle accuses two Arab passengers of stalking her daughter the night before, resulting in a fight breaking out and Kyle being handcuffed.Marcus refuses cargo to be searched due to risk of injury. He suspects Kylie of insanity due to loss of her husband. One flight attendant Stephanie is exceptionally unsympathetic. Because of her increasingly erratic, panicked behavior, air marshal Gene Carson is ordered by Marcus to guard and handcuff her.Captain Rich receives a message from a Berlin hospital that Julia died with her father, and is convinced that Kyle, unhinged by her husband's and daughter's deaths, imagined bringing Julia on board. The increasingly erratic Kyle is confined to her seat, where a therapist, Lisa (Greta Scacchi), consoles her. Kyle doubts her own sanity until she notices the heart Julia drew in the condensation on the window next to her seat.Kyle asks to use the bathroom, where she climbs into the overhead crawl space and sabotages the aircraft's electronics. In the ensuing chaos, she rides a dumbwaiter to the lower freight deck and unlocks David's casket, suspecting Julia to be inside, but finds only her husband's body. Carson escorts her to her seat in handcuffs, and explains that the flight is making an emergency stopover at Goose Bay Airport, in the Canadian province of Newfoundland and Labrador, where she will be taken into custody.Kyle makes a final plea to Carson that she needs to search the plane upon landing. Carson considers for a moment, then \"goes to speak to the captain,\" against flight attendant Stephanie's command (they are landing), leaving the audience to momentarily believe he is sympathetic. Instead, he sneaks back into the freight deck to remove two small explosives and a detonator concealed in David's casket. He then climbs down to a part of the avionics section, revealing Julia is sleeping (presumably drugged) with her coat and backpack that no one could find. He attaches the explosives to the side of the platform and arms them.At this point, it is revealed that Carson, Stephanie, and the coroner in Berlin (Christian Berkel) are the antagonists and part of a conspiracy. Carson tells the captain that Kyle is a hijacker and is threatening to blow up the aircraft with explosives hidden in the not X-Rayed casket unless the airline transfers $50,000,000 into a bank account. It is revealed that the conspirators killed Kyle's husband and abducted Julia in order to frame Kyle. They abducted Julia to cause Kyle to unlock the casket\nCarson tells an unnerved Stephanie that he intends to blow up the aircraft's avionics section, killing the unconscious Julia, and leave Kyle dead with the detonator in her hand.After making an emergency landing at Goose Bay Airport in Goose Bay, Labrador, the passengers exit the aircraft as the tarmac is surrounded by U.S. Federal Bureau of Investigation (FBI) agents. As the captain is leaving, Kyle runs to speak to him with Carson in tow. The captain demands she give up her charade, revealing Carson's deception. Quickly playing the role of hijacker, Kyle demands that Carson stay on board and the crew disembark.As soon as the plane's door closes, Kyle knocks Carson unconscious with a fire extinguisher, handcuffs him to a rail, and takes the detonator from his pocket. Stephanie comes out of hiding and Kyle screams \"she's in avionics, isn't she?\" Carson quickly regains consciousness and fires at Kyle with a concealed gun, sending her running. He chases after Kyle shooting, until she locks herself in the cockpit. He reveals his conspiracy to talk her out. She opens a hatch door to the upper level and throws out a binder to fool him. Carson hears the upstairs thud and leaves. Kyle exits and encounters a guilt-ridden Stephanie slapping her palm with a large flashlight. Kyle talks her down and punches her out. Stephanie panics and flees the plane, abandoning Carson who looks on.Kyle during this time searches avionics and finally finds the unconscious Julia. Kyle finds the unconscious Julia but Carson arrives, revealing that he murdered David in order to smuggle the explosives inside his casket and gagged and dumped Julia into the food bin, believing that neither the passengers nor the crew would care enough to notice. Kyle escapes with Julia into the aircraft's non-combustible hold as Carson shoots at her. She detonates the explosives, killing Carson and damaging the aircraft's landing gear, but she and Julia emerge unscathed as the crew realize she had been telling the truth all along.The next morning, in the passenger waiting section of the airport, Captain Rich apologizes to a seated Kyle holding Julia in her arms as Stephanie is led away by FBI agents for her crimes, while another agent informs them that the Berlin mortuary director has also been arrested, adding that they are tracking down another accomplice who erased Julia's record from the flight manifest. Kyle silently redeems herself by carrying Julia through the crowd of passengers who realize the truth. As one of the Arab passengers assists Kyle in loading her luggage onto a waiting van, Julia awakens and sleepily asks \"Are we there yet?\" as they drive away.",
	"links": [
		"https://www.amazon.com/Flightplan-Jodie-Foster/dp/B004IUET3C"
	]
}