{
	"title": "Borat: Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan",
	"release_year": "2006",
	"runtime": "84",
	"tags": [
		"Comedy",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Sacha Baron Cohen",
		"Ken Davitian",
		"Luenell",
		"Chester",
		"Charlie",
		"Ilham Aliyev",
		"Pamela Anderson",
		"Bob Barr",
		"Carole De Saram",
		"Mitchell Falk"
	],
	"staff": [
		"Larry Charles",
		"Sacha Baron Cohen",
		"Anthony Hines",
		"Peter Baynham",
		"Dan Mazer",
		"Sacha Baron Cohen",
		"Jay Roach",
		"Erran Baron Cohen",
		"Luke Geissbuhler",
		"Anthony Hardwick",
		"Craig Alpert",
		"Peter Teschner",
		"James Thomas",
		"Allison Jones"
	],
	"votes": 448785,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTk0MTQ3NDQ4Ml5BMl5BanBnXkFtZTcwOTQ3OTQzMw@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Borat Sagdiyev, a popular Kazakh television personality, leaves his homeland of Kazakhstan for the \"Greatest Country in the World,\" the \"US and A\" to make a documentary film at the behest of the fictitious Kazakh Ministry of Information. He leaves behind his mother, his wife Oksana, and other colorful characters of the town including \"the town sexual assaulter\", \"the town mechanic and abortionist\", and brings along his producer Azamat Bagatov, and his pet chicken, Buh-Kaw. Much of the movie features unscripted vignettes of Borat interviewing and interacting with Americans, who believe he is a foreigner with little or no understanding of American customs.While in New York, Borat sees an episode of Baywatch on television and immediately falls in love with Pamela Anderson. While interviewing a panel of feminists (and discreetly laughing at their beliefs), he learns her name and that she lives in California. Borat is informed by telegram that his wife has been violated and killed by a bear. Delighted by the news, he secretly resolves to go to California to make Anderson his new wife. Borat and Azamat were supposed to remain in New York, but Borat justifies the trip to California by telling his skeptical producer that \"Pearl Harbor is there. So is Texas.\" Because Azamat is afraid of a repetition of the September 11, 2001, attacks, which he believes were the work of the Hebrews, he will not fly there, so Borat takes driving lessons and buys a dilapidated ice-cream truck for the journey.During the cross-country trip, Borat acquires a Baywatch television show booklet at a yard sale and continues gathering footage for his documentary. He meets gay pride parade participants, politicians (including Alan Keyes and Bob Barr) and African American youths playing Cee-Lo. Borat is also interviewed on live television and disrupts the weather report. Visiting a rodeo, Borat, after first exciting the crowd with jingoistic, pro-U.S. remarks, sings a fictional Kazakhstani national anthem to the tune of \"The Star-Spangled Banner\", which receives a strong negative reaction. Staying at a bed-and-breakfast, Borat and his producer are stunned to learn their hosts are Hebrew. Fearful of death (\"or worse\") at the hands of their hosts, the two \"escape\" after throwing money toward cockroaches, believing they are their Hebrew hosts self-transformed. While Azamat advises a return to New York (where, he believes, \"at least there are no Hebrews\"), Borat attempts to buy a handgun to defend himself against Hebrews. When told he cannot buy a gun because he is not an American citizen, Borat purchases a bear (which he names after his late wife) for protection.Borat seeks advice from an etiquette coach whom he goes on to show nude photos of his allegedly teen-aged son. These photos actually show gay porn star Stonie, who was chosen because producers were seeking \"someone who would look 13 or 14 but was actually of legal age and would do frontal nudity\". At the suggestion of the coach, Borat attends a private dinner at an eating club in the South, at which he (unintentionally) insults or otherwise offends the other guests, and gets kicked out after he lets Luenell, an African American prostitute, into the house and shows her to the table. Borat befriends Luenell, and she invites him into a relationship with her, but he kindly tells her that he is in love with someone else. Borat then visits an antique shop with a display of Confederate heritage items, breaking glass and crockery.The journey is interrupted when Borat, just out of the bathtub, exits the bathroom of his hotel room and sees Azamat masturbating over a picture of Pamela Anderson in the Baywatch book. Borat becomes enraged and reveals his real motive for traveling to California. Azamat becomes livid at Borat's deception, and the situation escalates into a fully nude brawl with homoerotic undertones, which spills out into the hallway, a crowded elevator, and ultimately into a packed convention ballroom. The two are finally separated by security guards.As a result, Azamat abandons Borat, taking his passport, all of their money, and their bear, whose head is later seen inside Azamat's motel refrigerator. Borat begins to hitchhike to California but is soon picked up by drunken fraternity brothers from the University of South Carolina. On learning the reason for his trip, they show him the Pam and Tommy sex video, revealing that she is not the virgin he thought she was. After leaving the three students, Borat becomes despondent, burning the Baywatch booklet and, by mistake, his return ticket to Kazakhstan. He regains his faith after attending a United Pentecostal camp meeting, at which Republican U.S. Representative Chip Pickering and Mississippi Supreme Court Chief Justice James W. Smith, Jr. are present. Borat learns to forgive Azamat and Pamela. He accompanies church members on a bus to Los Angeles and disembarks to find Azamat dressed as Oliver Hardy (though Borat thinks that he is dressed as Adolf Hitler). The two reconcile and Azamat tells Borat where to find Pamela Anderson.Borat finally comes face-to-face with Anderson at a book signing at a Virgin Megastore. After showing Anderson his \"traditional marriage sack,\" Borat pursues her throughout the store in an attempt to abduct her until he is tackled and handcuffed by security guards. Afterwards, Borat marries Luenell, and returns to Kazakhstan with her. The final scene shows the changes that Borat's observations in America have brought to his village, including the apparent conversion of the people to Christianity (the Kazakh version of which includes crucifixion of Hebrews) and the introduction of computer-based technology, such as iPod, laptop computers and a high-definition, LCD television.The film plays out with a recapitulation of a mock 'Kazakhstan' national anthem glorifying the country's potassium resources and its prostitutes as being the \"cleanest in the region\".",
	"links": [
		"https://www.amazon.com/Borat-Cultural-Learnings-Glorious-Kazakhstan/dp/B000O14O8O"
	]
}