{
	"title": "Unstoppable",
	"release_year": "2010",
	"runtime": "98",
	"tags": [
		"Action",
		"Thriller",
		"max",
		"amazon"
	],
	"rating": 6.8,
	"actors": [
		"Denzel Washington",
		"Chris Pine",
		"Rosario Dawson",
		"Ethan Suplee",
		"Kevin Dunn",
		"Kevin Corrigan",
		"Kevin Chapman",
		"Lew Temple",
		"T.J. Miller",
		"Jessy Schram"
	],
	"staff": [
		"Tony Scott",
		"Mark Bomback",
		"Eric McLeod",
		"Mimi Rogers",
		"Tony Scott",
		"Julie Yorn",
		"Harry Gregson-Williams",
		"Ben Seresin",
		"Robert Duffy",
		"Chris Lebenzon",
		"Denise Chamian",
		"Chris Seagers"
	],
	"votes": 209741,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjI4NDQwMDM0N15BMl5BanBnXkFtZTcwMzY1ODMwNA@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Veteran Allegheny and West Virginia Railroad (AWVR) engineer Frank Barnes (Denzel Washington) oversees his co-worker, freshly hired conductor Will Colson (Chris Pine) as they use AWVR locomotive #1206 to pick up several train cars outside Stanton, Pennsylvania. Will picks up five cars too many, which they realize only after they have left the train yard. Although Will demands that they roll back and uncouple the extra cars, Frank continues north on the main line with the extras in tow.Meanwhile, in a rail yard within the northern town of Fuller, two AWVR hostlers, Dewey (Ethan Suplee) and Gilleece (T.J. Miller), are ordered by Fuller operations dispatcher Bunny (Kevin Chapman) to move a freight train led by locomotive #777 (nicknamed \"Triple Seven\") off its current track to clear the track for an excursion train carrying schoolchildren. Dewey attempts to take shortcuts, instructing Gilleece to leave the hoses for the air brakes disconnected for the short trip. Dewey later leaves the moving cab to throw a misaligned rail switch along the train's path, but is unable to climb back on, as the train's throttle jumps from idle, to full power. He is forced to report the train as a \"coaster\" to Fuller yardmaster Connie Hooper (Rosario Dawson). Connie orders Dewey, Gilleece, and lead welder Ned Oldham (Lew Temple), to intercept the train at a siding. With no sign of the train at the siding, they come to realize that the train's controls have defaulted to full throttle, and it is speeding out of control on the main line.Connie is able to successfully divert the excursion train to a sidetrack in the nick of time, and then reports the runaway to Oscar Galvin (Kevin Dunn), vice-president of train operations for AWVR. Connie works with local police and sheriff forces to ensure that each grade crossing along the main line is secured. As they evaluate their options, visiting Federal Railroad Administration safety inspector Scott Werner (Kevin Corrigan) alerts them to the hazard that the molten phenol carried by eight of the train's cars poses should it derail. Galvin rejects Connie's suggestion to derail the train in an area of Unpopulated farmland before it enters the towns ahead, believing they can stop the train safely before then. 777 enters the farmland, in which it collides with a horse trailer literally seconds after the horses and trainer are evacuated. As the train's odyssey becomes a media event, a lash-up of two engines driven ahead of the runaway manned by veteran engineer Judd Stewart (David Warshofsky) is used to try to slow down the train being directed by Groundman (Victor Gojcaj) while AWVR employee Ryan Scott (Ryan Ahern) is lowered to 777's cab from a helicopter. The plan goes awry, injuring Ryan, and the lash-up locomotives are subsequently derailed and explode, killing Judd. The train continues racing towards Stanton.Frank and Will are warned of the oncoming train. Due to the extra cars picked up by Will, they are forced to bypass a closer siding in favor of a longer Repair-In-Place track further north on the line. They make it into the track just as the runaway speeds past them, smashing through the rearmost car of their train. Frank sees that the last car of the runaway has an open Coupler (not fitted with a FRED). When Frank learns that Galvin is planning to use Derailers to stop the train, he asserts that this plan will not work and instead convinces Will to join him as he unhooks 1206 and runs it long hood forward down the line to catch 777 from behind. Galvin threatens to fire Frank and Will if they continue, but Frank reveals that he already was forced into early retirement weeks ago by AWVR. Despite Galvin's demands, Connie and Scott encourage Frank and Will to continue their pursuit.The police abort a plan of triggering a fuel cutoff switch on the side of 777 with close-range gun blasts at a grade crossing when they realize the switch's proximity to the fuel tank. As Frank foresaw, Galvin's plan to derail the train also fails, as 777 and its cars are too heavy and moving too fast. Fears arise that the runaway will derail on a sharp elevated curve in Stanton and crash into several fuel storage containers nearby, causing a major disaster; the city is evacuated as 777 approaches.Frank and Will manage to catch up to the runaway, but Will seriously injures his foot while trying to manually couple their engine to the rear car pulled by 777, though he does eventually succeed. Though 1206's dynamic brakes are helping to reduce the speed of 777, the train is still moving too fast for the curve. At Will's suggestion, Frank goes out onto the train and begins engaging each car's handbrakes individually, further helping to reduce the speed. Soon, however, 1206's dynamic brakes blow out, and the runaway 777 begins to pick up speed again, dragging 1206 with it. But with proper timing of 1206's independent air brakes, Will and Frank barely manage to keep the train on the rails as it speeds through the Stanton curve, severely tilting in the process. Though a major disaster is averted, the train is still out of control, Frank is unable to get to 777's cab due to a gap between cars too wide to jump.With a long stretch of parallel road next to the line, Ned appears in his pickup truck, pacing alongside 1206 to allow Will to jump into the back. Speeding to the front of the runaway, Will makes a successful jump to 777 and brings the runaway to a stop, ending the crisis. Frank, Will, and Ned are celebrated as heroes, and the two reunite with their worried families. As described in a Pre-credit montage, Frank was promoted and is now retired with full benefits, Will is expecting a second child with his wife, Connie takes over Galvin's job, Ryan Scott recovered fully from his injuries, and Dewey is now working in the fast-food industry.",
	"links": [
		"https://www.max.com/movies/unstoppable/cebcccb6-dde5-4ce2-bbe6-7c6d0d1720ee",
		"https://www.amazon.com/Unstoppable-Denzel-Washington/dp/B004JOCU2O"
	]
}