{
	"title": "Enchanted",
	"release_year": "2007",
	"runtime": "107",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Amy Adams",
		"Susan Sarandon",
		"James Marsden",
		"Patrick Dempsey",
		"Timothy Spall",
		"Idina Menzel",
		"Rachel Covey",
		"Julie Andrews",
		"Jeff Bennett",
		"Kevin Lima"
	],
	"staff": [
		"Kevin Lima",
		"Bill Kelly",
		"Barry Josephson",
		"Barry Sonnenfeld",
		"Alan Menken",
		"Don Burgess",
		"Gregory Perler",
		"Stephen A. Rotter",
		"John Papsidera",
		"Marcia Ross",
		"Stuart Wurtzel"
	],
	"votes": 219417,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjE4NDQ2Mjc0OF5BMl5BanBnXkFtZTcwNzQ2NDE1MQ@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "The movie begins with a narrator (Julie Andrews) about the animated fairytale land of Andalasia. It's ruled over by Narissa, (Susan Sarandon) a malevolent queen who wants to keep her throne as long as she can. To that end, she tried to keep her step-son, Prince Edward (James Marsden) away from the fair maidens so he will not get married.One such maiden in question is Giselle (Amy Adams), who lives in a treehouse cottage in the woods. At that moment, Giselle is making a statue of the true love she has dreamed of. Her animal friends, including her best friend chipmunk Pip, help her make the statue and find the perfect pair of lips, as lips and true love's kiss is the most important thing in the world.At the same time, we see Prince Edward (James Marsden) hunting trolls with servant Nathaniel (Timothy Spall). When he hears Giselle's song, he starts towards her. Nathaniel, fearing the wrath Narissa will show if Edward falls for Giselle, sets loose the troll that Edward just subdued. The troll chases Giselle out of her home and into the trees, but is saved by Pip, who uses his surprisingly heavy weight to offset the balance of the troll. Giselle tumbles from the trees right into Edward's lap. The two are smitten with each other and decide to wed the following day. Little do they know Narissa has been watching from her lair, and plans to stop the wedding for good.The next day, Giselle arrives at the castle. She is met by Nathaniel who locks her animal friends out of the wedding. Before she can get to the church, she is intercepted by Narissa, disguised as an old lady, who convinces her to go to what she calls a \"wishing well\". When Giselle closes her eyes, Narissa pushes her down the well. Shedding her disguise, she and tells Nathaniel she's sent Giselle to \"a place where there are no happily ever afters.\" Giselle falls for a long time, until she hits a manhole cover, at which point the movie suddenly changes to live action.Giselle pushes open the manhole cover she has ended up under, climbs out, and finds herself in the middle of Times Square at the height of evening rush hour. Disoriented by the hustle and bustle of urban life, Giselle tries to find the nearest castle in order to get home. After a series of misfortunes - first causing a minor car accident, getting caught up in a crowd heading into the subway, causing her to eventually end up at Bowery on the Lower East Side, and finally getting mugged of her tiara by a homeless man - she manages to find the castle she thinks she's looking for; specifically, a casino billboard.Divorce lawyer Robert Phillip (Patrick Dempsey) is working late in a somewhat heated divorce settlement meeting. The couple in question is fighting over a Hank Aaron baseball card when his secretary (Jodi Benson) interrupts to tell him it is time to pick up his six year old daughter, Morgan (Rachel Covey). She asks Robert if he has told Morgan about his plans to marry his girlfriend Nancy Tremaine (Idina Menzel), to which he says no.During the taxi ride home, Robert gives Morgan a present. It's not the fairy tale book Morgan wanted, but instead a book on inspirational women in history including Marie Curie and Rosa Parks. He uses the book to explain his plan to marry Nancy, to which Morgan is a little uncertain of. By coincidence, the taxi happens to stop by the corner where the billboard Giselle is knocking on is located, and Morgan happens to take notice of her. Robert follows her and ends up catching Giselle when she falls off the sign. Morgan instantly believes she is a princess and wants to help her, while Robert thinks she is absolutely crazy. They end up bringing her to their Upper West Side apartment where Giselle ends up falling asleep on the couch while Robert calls her a car. He lets her stay overnight when he sees she is sleeping, but tells Morgan to sleep in his room for the night.Back in the animated Andalasia, Pip tells Edward what has happened to Giselle. Edward and Pip dive down the well to New York, arriving in the height of morning rush hour as a Verizon utility crew are about to close the portal up. After a brief incident where Edward holds the crew's foreman at swordpoint thinking he's in league with the hag, he runs off into traffic. Meanwhile, Pip is shocked to discover that he no longer can communicate in English, but only through squeaks like a regular chipmunk.Giselle wakes up and sees the unkempt appearance of the apartment. She goes to the window and uses her call to summon creatures to come to her aid (\"Happy Working Song\"). In this case, it means cockroaches, flies, rats, and pigeons come to help her clean up the apartment. A one-legged pigeon drops a plate while trying to put it back in the cupboard, which wakes up Morgan and Robert. After evicting the remaining rats, Robert is dumbstruck when he walks in on Giselle humming to herself in the shower. While this is going on, Nancy arrives to pick up Morgan...right at the same time that Giselle tries to use her musical summons. As a result, Robert gets hit in the face by one of the pigeons and ends up falling out of the bathroom, with Giselle on top of him clad only in a bath towel. Thanks to Giselle's oblivious choice of words, Nancy is led to believe that she's some new girl Robert is cheating on her with and storms out. Robert follows her, but by the time he gets to the street, she's already climbed into a taxi. By the time Robert gets upstairs, he's further frustrated to find that Giselle has cut up his curtains to make a new dress for herself...yet at the same time he can't help but think she's someone right out of a Hallmark card when she suggests ways he could clear up the situation with Nancy.Narissa is upset about the developments, and so she flirts with Nathaniel to convince him that he must go as well to stop Edward from finding Giselle. Nathaniel immediately jumps down the portal to Times Square without hesitation. He's very quick to find Edward, for at that moment, he's riding on the roof of a bus and thinking that it is a great steel beast. He stabs his sword through the roof of the bus, ripping open an old lady's bag, and causing the concerned driver to stop the bus. After being yelled at by the driver (who then freaks out when Pip lands on her head, leading her to think he's a rat), Edward leaves with Pip.Robert brings Giselle to his office in Time Warner Center, and leaves her with the secretary while he meets with the same divorcing couple as the day before. Narissa sees Robert trying to help Giselle through the fish tank in the office (she pops up all over the place, wherever water is available) and is clearly not happy.As Edward and Nathaniel stop for lunch at Katz's Delicatessen, Nathaniel disguises himself as a short order cook to infiltrate the kitchen, and makes contact with Narissa through a boiling pot of soup. Narissa gives Nathaniel three poisoned apples, and tells him to make sure Giselle takes a bite of one to kill her. Pip hears this and tries to explain what he saw to Edward through the use of charades (involving ice cubes from Nathaniel's soda for the apples). Unfortunately, Edward is a little bit dense and does not get it. Nathaniel tells Edward they should split up to look for Giselle and they go their separate ways.At the close of his meeting, Robert comes to see Giselle and the secretary tells Robert about how crazy Giselle is. Meanwhile, Giselle begins talking to the divorcing couple and breaks down in tears over the fate of their marriage when she finds out they are separating.Robert sees she is ruining his case and brings her to Central Park where he plans to leave her. He gives her money to pay for a bus fare, but she gives the money away to the lady whose bag got damaged on the bus by Edward's sword. Having a change of heart, Robert reconsiders and decides to stick around.As Robert and Giselle walk through the park, he decides to try and get to know her better. He's surprised by her admission that she's only known Edward for a day, given that he's been with Nancy for five years. He explains the concept of dating to her, which she has never heard of before this. At that point, they run into Nathaniel, disguised as an apple cart vendor, and sells Giselle the first of his poisoned apples in the form of a free caramel apple on a stick. Unfortunately, Giselle inadvertently foils this first attempt when she throws it away while passionately talking about love, and it lodges in a passing biker's helmet - burning through his helmet and hair, leaving a bald spot on his scalp. Giselle, meanwhile, explains how she knows that she is in love and that true love's kiss is the most powerful thing in the world and she wouldn't want to wait any longer for that. This culminates in a blown up dance number where she gets joined by numerous other street performers and musicians (\"That's How You Know\"). Edward hears her singing again and tries to chase her down, but gets run over by the bicyclists, including the one who got the poisoned apple in his hair.Giselle helps Robert make up with Nancy by having some doves deliver flowers to her, and getting him to invite her to a ball she saw a flier for, which is far more romantic or spontaneous than he usually is. He explains to her that he only wants to help Giselle and a happy Nancy forgives him.Meanwhile, Edward and Nathaniel check into a motel in Brooklyn to rest. While Edward flips through channels on the TV (which he thinks is a magic mirror), Nathaniel traps Pip in the closet and goes after Giselle. Pip eventually frees himself and gives chase.That evening, Robert and Giselle go out to a pizzeria just down the street from Robert's apartment. Morgan is also there as well. Robert opens up to Giselle about his wife, who walked out on him when Morgan was just an infant, and how this badly influenced his view of the world. Giselle explains to him that his dreams still can come true and then Nathaniel appears, disguised as a waiter, to deliver Giselle the second poisoned apple, this time ground up into a martini. Robert jokes that those are poisonous. This attempt is thwarted thanks to the arrival of Pip. Pip's presence causes a panic in the restaurant, but he manages to communicate to Giselle that Edward is in New York. Nathaniel spots him, and a chase between the two ensues. Pip tries to hide under a pizza, but Nathaniel takes the pizza and flings it into the oven. Pip is swung free at the last second and goes flying into a nearby glass jar, but Giselle thinks he was just incinerated and is heartbroken.Back at the hotel room, Edward sees Giselle being interviewed about the incident on TV and leaves the hotel room to find her. Upon finding the correct building he knocks on every single door in the building, finding a bunch of interesting people at each door.That evening, Giselle tells Morgan a bedtime story while Robert watches and smiles. She leaves the room and Robert begins trying to tell her to face reality, that perhaps Edward will not come for her after all, which she gets angry about. In the moment, Giselle is excited about experiencing anger, and even a bit of sexual arousal. And Robert leaves, though both of them clearly feel a connection to one another.At the pizzeria's bar, Nathaniel talks to Narissa through his martini glass, and she is very disappointed in him. She tells him that she is now coming to New York to get Giselle herself, and in anger breaks all the glass at the bar including the one Pip is stuck in.The next morning Robert awakens to see that Giselle has made herself another dress and smiles at this. The three sit down to breakfast when Edward knocks on the door. He and Giselle are reunited, though it is not the same between them, not that Edward would notice. She tells him that she wants to go on a date with him before they leave for Andalasia and he agrees. She leaves Robert and Morgan, who are very sad to see her go.At work Robert meets with the divorce clients who were touched by Giselle's words and have decided to stay together. Meanwhile, Giselle and Edward are on their date, but Giselle seems to be having second thoughts. Edward offers to take her to the same ball that Giselle encouraged Robert to take Nancy to, but only if they can return to Andalasia after. Giselle goes back to Morgan and tells her that she is going to the ball, to which Morgan takes Robert's emergency credit card and the two go shopping. They stop for a haircut and pedicure, where the two bond over not having mothers, but enjoying their shopping time together.Night falls, and Narissa arrives and heads towards the ball, having decided that she'll deal with Giselle herself. Nancy and Robert have already arrived as Giselle and Edward make their entrance. Robert and Giselle see each other and the couples meet and greet. Edward introduces Giselle as the love of his life, to which an impressed Nancy says is so bold and romantic. A dance is announced where you dance with someone other than your date. Edward asks Nancy to dance, leaving Robert and Giselle together. The two engage in a very passionate and romantic dance that reaffirms their feelings for one another.At the end of this dance, Edward and Giselle plan to leave and he goes to get her wrap. Narissa, in her old hag disguise, shows up as Giselle is sadly watching Nancy and Robert and offers her the last poisoned apple, convincing her that it will make her forget all the bad memories. Terrified, but wanting to forget the pain she feels, Giselle bites the apple and promptly collapses, unconscious. Narissa tries to drag Giselle's unconscious body into the elevator, but is stopped by Edward just after having shed her disguise. She tries to feign ignorance, but is undercut when Nathaniel, who has started to reconsider his adoration of Narissa after a scene he saw in a soap opera a few days earlier, shows up and explains her plans. Narissa explains Giselle will die at midnight and Robert remembers what Giselle said about true love's kiss being powerful and tells Edward to kiss her.Edward attempts kissing her several times, but it does not wake her. It dawns on Robert that the reason it's not working is because he, and not Edward, is the one Giselle is actually in love with. Though dismayed by the realization that her relationship with Robert is over, Nancy encourages Robert to kiss her. He kisses Giselle just as the clock strikes midnight, and Giselle is soon revived. They embrace as the dancers applaud. Furious at how the tables have turned, Narissa refuses to give up the throne, and explodes into a fiery purple dragon. She threatens to end Giselle first, but when Robert stands in her way, she picks him up instead and carries him out the window and up the building. Giselle runs after them, leaving her shoe behind.Narissa climbs to the highest point of the building with Robert in hand. Giselle arrives and distracts Narissa with Edward's sword, but it does little damage. Pip, who had been stuck in a gerbil ball, is released by Edward and once again uses his weight to throw Narissa off balance. She drops Robert and tumbles to her death, exploding into sparkles. Robert manages to hold on to the building, but slips and drops into Giselle's arms. Once out of danger, the two reaffirm their love for each other and kiss.After the fact, Nancy is in the ballroom and sees Giselle's missing shoe. Edward comes and asks if she could try it on for him. In a homage to Cinderella, Nancy puts the shoe on and it fits perfectly. Edward and Nancy leave New York together and head home to Andalasia.Every character has their own happy ending. Nancy and Edward get married, Nathaniel writes a best-seller about his personal struggles (as does Pip back in Andalasia), and Giselle begins a clothing line. Robert, Giselle, and Morgan now live happily together as a perfect family.\"And so, they all lived happily ever after.\"",
	"links": [
		"https://www.amazon.com/Enchanted-Amy-Adams/dp/B003QSE26Q"
	]
}