{
	"title": "Sin City",
	"release_year": "2005",
	"runtime": "124",
	"tags": [
		"Crime",
		"Thriller",
		"amazon"
	],
	"rating": 8.0,
	"actors": [
		"Mickey Rourke",
		"Clive Owen",
		"Bruce Willis",
		"Jessica Alba",
		"Devon Aoki",
		"Alexis Bledel",
		"Powers Boothe",
		"Cara D. Briggs",
		"Jude Ciccolella",
		"Jeff Dashnaw"
	],
	"staff": [
		"Frank Miller",
		"Quentin Tarantino",
		"Robert Rodriguez",
		"Frank Miller",
		"Robert Rodriguez",
		"Elizabeth Avellan",
		"John Debney",
		"Graeme Revell",
		"Robert Rodriguez",
		"Robert Rodriguez",
		"Robert Rodriguez",
		"Mary Vernieu",
		"David Guido Pietroni"
	],
	"votes": 798231,
	"cover": "https://m.media-amazon.com/images/M/MV5BNWE2YmYyYzQtNGMwMi00Yzk0LTk3ZTYtYTcxNmFjMDE1MGExXkEyXkFqcGc@._V1_QL75_UY281_CR5,0,190,281_.jpg",
	"description": "The Customer Is Always Right (Part 1) -- The Salesman (Josh Hartnett) walks onto a penthouse balcony where The Customer (Marley Shelton) looks out over Basin City. He offers her a cigarette and says that she looks like someone who is tired of running and that he will save her. The two share a kiss and he shoots her; she dies in his arms. He says he'll never know what she was running from but that he'll cash her check in the morning.That Yellow Bastard (Part 1) -- On the docks of Sin City, aging police officer John Hartigan (Bruce Willis) tries to stop serial child-killer Roark Junior (Nick Stahl) from sexually assaulting and killing eleven-year-old Nancy Callahan (Makenzie Vega). Junior is the son of Senator Roark (Powers Boothe), who has bribed the police to cover up his son's crimes. Hartigan's partner, Bob (Michael Madsen) tries to convince Hartigan to walk away. Hartigan knocks him out.Hartigan heads into the warehouse where Junior is holding Nancy, fighting off the pain caused by his bad heart, as well as several henchmen. Junior shoots Hartigan in the shoulder and tries to escape. Hartigan catches up and shoots off Junior's ear, hand, and genitals. Bob, now recovered, shoots Hartigan in the back; he has been paid off by Roark Sr. As the sirens approach, Bob leaves and Nancy lies down in Hartigan's lap. Hartigan passes out, reasoning his death is a fair trade for the girl's life.The Hard Goodbye -- After a one-night stand, Marv (Mickey Rourke) awakens to find Goldie (Jaime King) has been killed while he slept. He flees the frame-up as the police arrive, vowing to avenge her death. His parole officer, Lucille (Carla Gugino), warns him to give up on this mission. Marv interrogates several informants, working up to a corrupt priest (Frank Miller), who reveals that the Roark family was behind the murder. Marv kills the priest after he insults Goldie but is attacked by a woman who looks like Goldie, which he dismisses as a hallucination.Marv goes to the Roark family farm and is subdued by the silent stalker who killed Goldie. He awakens in the basement to find Lucille has been captured after looking into his story. She tells Marv that the killer is a cannibal, and that Goldie was a prostitute. He learns that the killer's name is Kevin (Elijah Wood) and escapes. Lucille is gunned down by the leader of an arriving squad of cops, who, after the squad is killed, is interrogated by Marv. Marv finds out that Cardinal Patrick Henry Roark (Rutger Hauer) arranged for Goldie's murder.Marv goes to Old Town, Sin City's prostitute-run red-light district, to learn more about Goldie and is captured by her twin sister, Wendy, who had been stalking him and was the attacker Marv previously dismissed as a hallucination. He eventually convinces her that he is not the killer. She and Marv return to the farm where Marv kills Kevin. He confronts Cardinal Roark, who confesses his part in the murders. Kevin was the cardinal's ward; the two men ate the prostitutes to 'consume their souls'. Marv kills the cardinal but is then shot and captured by his guards.\nMarv is taken to a hospital where cops threaten to kill his mother to get him to confess to killing Roark, Kevin, and their victims. He is sentenced to death in the electric chair. Wendy visits him on death row and thanks him for avenging her sister. Marv is executed the next day.The Big Fat Kill -- Shellie (Brittany Murphy) is being harassed by her abusive ex-boyfriend Jackie Boy (Benicio Del Toro). Her current boyfriend, Dwight (Clive Owen) violently warns him to leave Shellie alone. Jackie Boy flees to Old Town. Dwight follows and sees them harass Becky (Alexis Bledel), a young prostitute. Gail (Rosario Dawson), the prostitutes' leader and Dwight's on-and-off lover, also witnesses the scene. When Jackie Boy threatens Becky with a gun, Miho (Devon Aoki), a martial arts expert, kills Jackie Boy and his friends. They realize Jackie Boy is actually Detective Lieutenant Jonathan \"Iron Jack\" Rafferty of the Basin City police, considered a \"hero cop\" by the press. If the cops learn how he died, their truce with the prostitutes would end and the mob would be free to wage war on Old Town.Dwight takes the bodies to a tar pit, where he is attacked by an ex-IRA mercenary hired by mob boss Wallenquist. He nearly drowns in the tar before Miho saves him. The mercenary runs away in the sewer with Jackie Boy's severed head, but Dwight and Miho are able to retrieve it and return to Old Town. Meanwhile, the head mercenary, Manute (Michael Clarke Duncan), kidnaps Gail. Becky has been threatened with the death of her mother by the mob and has betrayed the prostitutes. The mob is moving to invade with Manute leading. Dwight trades Jackie Boy's head in exchange for Gail but activates an explosive he placed inside the head, destroying it before it can be taken to the cops for evidence. The other prostitutes gun down the mercenaries while an injured Becky escapes.That Yellow Bastard (Part 2) -- Hartigan is recovering in a hospital when Senator Roark informs him that Junior is in a coma and the Roark legacy is in serious jeopardy. Hartigan will be framed for Junior's crimes; if he tells anyone the truth, they will die. A grateful Nancy promises to write letters every week while he is in prison. Hartigan goes to jail, though he refuses to confess. He receives a weekly letter from Nancy, as promised. After eight years, the letters stop, and he receives a severed finger instead. Hartigan confesses to all charges leading to his parole and searches for an adult Nancy (Jessica Alba), not knowing he is being followed by a deformed, yellow man. He eventually finds her at Kadie's Bar, where she has become an erotic dancer.He realizes he was set up to lead the yellow man to Nancy and the two escape in Nancy's car. Hiding at a hotel, the deformed man returns, revealing himself as Junior Roark, disfigured by years of surgery to regenerate his body parts. Junior attacks Hartigan and takes Nancy to the Roark farm to finish what he started eight years before. Hartigan follows and fakes a heart attack, giving him a chance to kill Junior. Knowing that Senator Roark will never stop hunting them, Hartigan commits suicide to ensure Nancy's safety. Again, he justifies his life for Nancy's as a fair trade.The Customer Is Always Right (Part 2) -- An injured Becky departs from a hospital, talking on a cell phone with her mother. In the elevator, she encounters The Salesman, dressed as a doctor. He offers her a cigarette, calling her by name, as she abruptly ends the call with her mother. Her fate is never revealed.",
	"links": [
		"https://www.amazon.com/Frank-Millers-Sin-City-Dame/dp/B0B8RVNLHT"
	]
}