{
	"title": "Gone Baby Gone",
	"release_year": "2007",
	"runtime": "114",
	"tags": [
		"Crime",
		"Drama",
		"Mystery",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Morgan Freeman",
		"Ed Harris",
		"Casey Affleck",
		"Michelle Monaghan",
		"John Ashton",
		"Amy Ryan",
		"Amy Madigan",
		"Titus Welliver",
		"Michael Kenneth Williams",
		"Edi Gathegi"
	],
	"staff": [
		"Ben Affleck",
		"Ben Affleck",
		"Aaron Stockard",
		"Dennis Lehane",
		"Sean Bailey",
		"Alan Ladd Jr.",
		"Danton Rissner",
		"Harry Gregson-Williams",
		"John Toll",
		"William Goldenberg",
		"Donna Morong",
		"Sharon Seymour"
	],
	"votes": 296844,
	"cover": "https://m.media-amazon.com/images/M/MV5BOTlmNmU2NDgtZDU1OS00OTFhLWJlNTgtMWE2OGQ1OTg1MGM4XkEyXkFqcGc@._V1_QL75_UY281_CR1,0,190,281_.jpg",
	"description": "In Dorchester, Boston, P.I. Patrick Kenzie (Casey Affleck) and his partner and girlfriend Angie Gennaro (Michelle Monaghan) witness a televised plea by Helene McCready (Amy Ryan) for the return of her abducted four-year-old daughter Amanda (Madeline O'Brien) and the girl's favorite doll, Mirabelle. Amid a media frenzy, Amanda's aunt Beatrice \"Bea\" McCready (Amy Madigan) and Uncle Lionel (Titus Welliver) hire them to find her. Dottie (Jill Quigg) is Helene's best friend. Helene is abusive towards Patrick and Angie, but Bea begs Patrick to take the case. The duo finds that Helene visits the local bar 5 nights a week to do coke lines.Using his connections with various criminals, Patrick discovers that Helene and her boyfriend Ray are addicts and drug mules for a local Haitian drug lord named Cheese (Edi Gathegi) and had recently stolen $130,000 from him. Helene admits that on one of the drug runs, when they delivered 4 kilos to a biker gang in Nashua, the cops hit the bikers just as they were walking away with the money. Ray and Helene thought they could blame the cops and told Cheese that the cops stole the money from the bikers.After discovering Ray has been murdered by Cheese's men, Patrick and Angie join police detectives Remy Bressant (Ed Harris) and Nick Poole (John Ashton) in a plan to find Amanda, who they assume has been taken by Cheese. Helene reveals she buried the money in the backyard and tearfully makes Patrick promise to her that he will bring Amanda home alive. Remy and Nick take the money with them with the promise to meet Cheese and exchange Amanda for the money.Patrick meets with Cheese (he says Cheese will never talk to a badge) and tries to negotiate the return of the stolen money in exchange for Amanda, but Cheese denies any involvement in the girl's disappearance. The following day, Captain Jack Doyle (Morgan Freeman) reads Patrick a telephone transcript of Cheese calling into the station to set up an exchange for Amanda. The exchange at a nearby quarry (Angie think it is odd that Cheese would ask for the exchange so far out of town) is botched after a gunfight breaks out (Patrick and Angie were stationed on the other side of the quarry lake to take possession of Amanda, while the cops were hand over the money to Cheese at the near side of the quarry lake), and Cheese is killed. It is believed that Amanda fell in the quarry's pond and drowned; her doll is retrieved from the water by Angie and returned to Helene. Doyle, whose own daughter was killed years before, goes into early retirement following public outcry over the mishap.Two months later, a seven-year-old boy is abducted in Everett, and Patrick receives information that he was taken by Corwin Earle (Matthew Maher), a known child molester, who is living with two married cocaine addicts. Patrick gains entry into the house and after observing evidence of the abducted boy, returns with Remy and Nick late at night to rescue him. Before they enter the house, the woman shoots her husband dead and fatally wounds Nick before chasing Patrick into Corwin's room. Patrick discovers the dead child, and he executes Corwin as Remy arrives and kills the woman. The following evening, an intoxicated Remy tries to alleviate Patrick's guilt and confides that he once planted evidence on an abusive husband to help the man's family escape with Ray's help (Ray had called Remy with the tip of a stash at the suspects house, but his raid revealed nothing). Patrick recalls that Remy had originally told him that he didn't know Ray.Following Nick's funeral, Patrick speaks to a police officer named Devin (Michael K. Williams) and tells him that Remy lied to him about knowing Ray. Devin tells him that Remy and Doyle knew about Cheese's stolen money before Cheese even knew it was missing. Patrick goads Lionel into meeting him in a bar and pieces together that Lionel and Remy had conspired to stage a fake kidnapping in order to take the drug money for themselves and to teach Helene a lesson, which Lionel finally admits. Lionel further reveals that Bea went nuts and involved the media and Patrick. when Patrick found the money, Lionel and Remy arranged the fake exchange at the quarry. Cheese figured out it was a set up and started shooting. Amanda ran and fell into the lake.Remy enters the bar wearing a mask, staging a robbery to interrupt their conversation. Patrick realizes that Remy plans to kill them, so he yells aloud that Remy kidnapped Amanda. The bartender shoots Remy twice in the back. Remy flees, pursued by Patrick to the rooftop of a nearby building, where he dies from his wounds.Patrick is questioned by the police and realizes Doyle is involved when he learns that the police don't use phone transcripts. Arriving at Doyle's home, Patrick and Angie find Amanda alive and well. Doyle admits he was part of the kidnapping and helped set up the fake exchange to frame Cheese. Patrick threatens to call the authorities, but Doyle tries to convince him that Amanda will have a better life with him instead of with her neglectful mother. Patrick discusses the choice with Angie who says she will hate Patrick if he returns Amanda to her mother. However, Patrick calls the police to collect Amanda, as he cannot bring himself to break his promise to Helene and believes she belongs with her mother, regardless of Helene's parenting. Doyle and Lionel are arrested, and Patrick and Angie break up.Patrick later visits Helene as she is preparing for a date. He learns that she has not made appropriate plans for a babysitter, so he volunteers to watch Amanda. After Helene leaves, Patrick sits down and asks Amanda about her doll Mirabelle, but Amanda says the doll's name is Anabelle. Patrick sits in silence, realizing Helene did not even know the name of her daughter's favorite doll.",
	"links": [
		"https://www.amazon.com/Gone-Baby-Casey-Affleck/dp/B006RXPUR2"
	]
}