{
	"title": "Charlie Wilson's War",
	"release_year": "2007",
	"runtime": "102",
	"tags": [
		"Biography",
		"Comedy",
		"Drama",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Tom Hanks",
		"Julia Roberts",
		"Philip Seymour Hoffman",
		"Amy Adams",
		"Terry Bozeman",
		"Brian Markinson",
		"Jud Tylor",
		"Hilary Angelo",
		"Cyia Batten",
		"Kirby Mitchell"
	],
	"staff": [
		"Mike Nichols",
		"Aaron Sorkin",
		"George Crile",
		"Gary Goetzman",
		"Tom Hanks",
		"James Newton Howard",
		"Stephen Goldblatt",
		"John Bloom",
		"Antonia Van Drimmelen",
		"Ellen Lewis",
		"Victor Kempster"
	],
	"votes": 125963,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTgwMDgwMDc4MF5BMl5BanBnXkFtZTYwOTU3MDM4._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1980, Congressman Charlie Wilson (Tom Hanks) is more interested in partying than legislating, frequently throwing huge galas and staffing his congressional office with young, attractive women. His social life eventually brings about a federal investigation into allegations of his cocaine use, conducted by then-federal prosecutor Rudy Giuliani as part of a larger investigation into congressional misconduct. The investigation results in no charge against Charlie.Back then, Charlie had seen a TV report that described the Soviet war in Afghanistan as a steppingstone a wider attack on the Arab nation states that controlled the oil supply of the world. The report concluded that if the Afghan Mujahideen are given arms support, they could win against the Soviets.\nCharlie at the time was involved in frivolous legislation like Department of Defense support to the Boy Scouts of America.\nAt office Charlie is surrounded by gorgeous looking women like his secretary Bonnie Bach (Amy Adams).Charlie finds that the CIA budget for covert operations against Soviets in Afghanistan is $5 million. He asks his staffer to double the budget.\nA friend and romantic interest, Joanne Herring (Julia Roberts), hears about Charlie doubling the budget for Afghanistan and encourages Charlie to do more to help the Afghan people, and persuades Charlie to visit the President of Pakistan Zia-Ul-Haq (Om Puri).\nCharlie sits on the Congressional committees for Defense, Pentagon, and the CIA, and oversees an unlimited budget for the 3 agencies needed to run a covert war. Joanne tells Charlie that the Soviets armor plated their gunships to resist the 12.7 mm rounds fired from guns supplied by America to Pakistan. America provided F-16s but no radar to help them aim accurately.\nJoanne wants Charlie to help run the war in Afghanistan properly by first calling it a war, and then deliver a crushing defeat to Soviets to eliminate Communism and end the cold war.The Pakistanis complain about the inadequate support of the U.S. to oppose the Soviet Union. The radars were not sold to Pakistan since they were already sold to Israel and American supported Israel more than Muslims. Zia also argues that all funding for the war should flow through Pakistan, as they have experience with this kind of war.\nThey insist that Charlie visit a major Pakistan-based Afghan refugee camp. (This and other Afghan scenes were filmed in Morocco.) Charlie is deeply moved by their misery and determination to fight but is frustrated by the regional CIA personnel's insistence on a low-key approach against the Soviet occupation of Afghanistan. Charlie returns home to lead an effort to substantially increase funding to the Mujahideen.\nCharlie sees that despite the atrocities, the Afghan people are determined to fight the Soviets.As part of this effort, Charlie befriends the maverick CIA operative Gust Avrakotos (Philip Seymour Hoffman).\nCIA director of European operations Henry Cravely (John Slattery) is Gust's boss. Gust has been with the agency for 24 years and is an expert of Europe, yet is assigned to Afghanistan, since he lacks the proper diplomatic skills. Henry is also against training foreign origin people as field agents, even though they can speak the local language a lot better, because their loyalty to American can be questionable. Henry and Gust do not see eye on eye on these topics.Gust tells Charlie that US is currently not trying to defeat the Soviets in Afghanistan, but only to bleed them out, much like what Vietnam did to the US. Gust says that US does not have a strategy.\nGust's understaffed Afghanistan group to find a better strategy, especially including a means to counter the Soviets' formidable Mi-24 helicopter gunship. This group was composed in part of members of the CIA's elite Special Activities Division, including a young paramilitary officer named Michael Vickers (Christopher Denham).Gust hires Israeli arms merchant Zvi Rafiah (Ken Stott) to supply arms to the Mujahideen and to make it look like that these are Soviet made weapons captured by the Afghans. Charlie manages to forge a covert partnership between Israel, Egypt, Pakistan, Saudi Arabia and Afghanistan to fight the Soviets. The largest stockpile of Soviet weapons, outside of the USSR is in Egypt.\nCharlie gets Joanne to use her Christian angle to convince Representative Doc Long (Ned Beatty), who is the head of the funding committee to commit US funds for the Afghan effort.As a result, Charlie's deft political bargaining for the necessary funding and Avrakotos' group's careful planning using those resources, such as supplying the guerrillas with FIM-92 Stinger missile launchers, turns the Soviet occupation into a deadly quagmire with their heavy fighting vehicles being destroyed at a crippling rate. The CIA's anti-communism budget evolves from $5 million to over $500 million (with the same amount matched by Saudi Arabia), startling several congressmen.This effort by Charlie ultimately evolves into a major portion of the U.S. foreign policy known as the Reagan Doctrine, under which the U.S. expanded assistance beyond just the Mujahideen and began also supporting other anti-communist resistance movements around the world. Charlie states that senior Pentagon official Michael Pillsbury persuaded President Ronald Reagan to provide the Stingers to the Afghans: \"Ironically, neither Gust nor Charlie was directly involved in the decision and claims any credit.\nThe Soviet eventually withdraw from Afghanistan.Charlie follows Gust's guidance to seek support for post-Soviet occupation Afghanistan but finds almost no enthusiasm in the U.S. government for even the modest measures he proposes.The film ends with Charlie receiving a major commendation for the support of the U.S. clandestine services, that led to the defeat of the Soviet army in Afghanistan. Just 13 years ago the Soviet army appeared to be invincible, and Charlie was commended for his efforts to win the cold war. Charlie helped make a dent into the formidable Soviet fighting machine.\nHis pride is tempered by his fears of what unintended consequences his secret efforts could yield in the future and the implications of U.S. disengagement from Afghanistan.",
	"links": [
		"https://www.amazon.com/Charlie-Wilsons-War-Tom-Hanks/dp/B001688V2E"
	]
}