{
	"title": "16 Blocks",
	"release_year": "2006",
	"runtime": "102",
	"tags": [
		"Action",
		"Drama",
		"Thriller",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Bruce Willis",
		"Yasiin Bey",
		"David Morse",
		"Jenna Stern",
		"Casey Sander",
		"Cylk Cozart",
		"David Zayas",
		"Robert Racki",
		"Patrick Garrow",
		"Sasha Roiz"
	],
	"staff": [
		"Richard Donner",
		"Richard Wenk",
		"Randall Emmett",
		"Avi Lerner",
		"Arnold Rifkin",
		"John Thompson",
		"Klaus Badelt",
		"Glen MacPherson",
		"Steve Mirkovich",
		"Robin D. Cook",
		"Louis DiGiaimo",
		"Sarah Finn",
		"Randi Hiller",
		"Arvinder Greywal",
		"Derrick Hinman"
	],
	"votes": 135445,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTQ1NDEwMzEwMl5BMl5BanBnXkFtZTcwNzM4MTEzMw@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Jack Mosley (Bruce Willis), a burnt-out detective, is assigned the task of transporting a fast-talking convict from jail to a courthouse 16 blocks away. However, along the way he learns that the man is supposed to testify against Mosley's colleagues, and the entire NYPD wants him dead. Mosley must choose between loyalty to his colleagues and protecting the witness. He chooses to protect the witness even though it is later revealed that he was going to testify against Mosley as well. To protect the witness, he does not allow him to testify, sending him away from NY and takes his place on the witness stand.Jack Mosley (Bruce Willis) is an alcoholic and burned-out NYPD detective. After working all night, his lieutenant orders him to escort Eddie Bunker (Mos Def) to testify in front of a grand jury before 10 a.m. Jack stops at a liquor store on the way; a gunman ambushes the car with Eddie inside. Jack kills the gunman and runs over his partner.They go to Jack's regular bar, and he kicks everybody out. His call for backup brings Jack's ex-partner, Frank Nugent, and several other cops. Frank explains that Eddie is about to testify against a cop, who will testify against others to save himself. Frank takes Jack's gun and gives it to Eddie. Forced, Eddie fires the gun but before his execution Jack uses the bar's shotgun and cripples the executioner. Jack and Eddie run out the back door.Jack retrieves his spare handgun from his sister's apartment and disables one of the cops searching for him. Continuing the escort Frank's men chase Jack and Eddie; they escape behind a barricaded steel door but find Frank waiting. Trapped, they try to flee using a broken elevator. Jack and Frank trade shots while discussing old memories. Frank tries to convince Jack it is not worth protecting Eddie. At the last second the elevator starts to work; Jack and Eddie ride it up and leave out the front door.Jack and Eddie enter an apartment building. Eddie knocks on random doors, finally an old Asian man lets them in. Frank's team searches the building floor to floor. In the apartment, Eddie changes clothes and describes his dream of opening a bakery. Jack calls the prosecuting attorney and tells her the address and room number; she sends more cops. Frank receives Jack's location from a mole but as his men break in, they realize it is the wrong apartment. Jack walks down the stairs but finds Frank waiting. Jack had Eddie take a different route and Eddie can sneak up behind Frank and hold him at gunpoint.They steal a bus with passengers; ESU shoots the tires immobilizing the bus and creating a hostage situation. Jack forces the passengers to cover the windows with newspaper. Before ESU storms the bus Jack releases all the passengers while Eddie sneaks off in the confusion. Jack remains on the bus, but the cops still believe that there are eight more hostages; the bus driver admits he was the last passenger. Eddie returns, yells for the cops not to shoot, and gets back on the bus. Jack drives the bus with ESU chasing them into an alley. ESU shoots Eddie but he and Jack escape into a building.\nJack calls his sister, a paramedic, to mend Eddie's wound. Jack has his sister call an ambulance; inside Jack reveals to Eddie that he is one of the cops that Eddie was testifying against. Jack asks Eddie to leave and leave the trial to him. Jack limps into the courthouse car park but runs into Frank. Jack confronts Frank about their crimes. Frank finally loses his cool and lets Jack get into an elevator but orders one of his men upstairs to kill him.Security surrounds Jack but he announces he is testifying instead of Eddie. Frank's man still tries to kill him, but a SWAT sniper shoots the assassin. Jack displays a tape recorder that recorded the conversation Frank and Jack had downstairs, and hands it to the prosecuting attorney. Frank stares miserably as the tape discloses his admission.\nTwo years later, Jack is celebrating his birthday with his sister. For his crimes he spent two years in prison before being released. Eddie sends a letter and photos along with a cake of him and his new bakery (named Eddie and Jack's Good Sign Bakery) listing the names of people who have changed on the cake, including them.",
	"links": [
		"https://www.amazon.com/16-Blocks-Bruce-Willis/dp/B000GOZSFM"
	]
}