{
	"title": "Transformers",
	"release_year": "2007",
	"runtime": "144",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Shia LaBeouf",
		"Megan Fox",
		"Josh Duhamel",
		"Tyrese Gibson",
		"Rachael Taylor",
		"Anthony Anderson",
		"Jon Voight",
		"John Turturro",
		"Michael O'Neill",
		"Kevin Dunn"
	],
	"staff": [
		"Michael Bay",
		"Roberto Orci",
		"Alex Kurtzman",
		"John Rogers",
		"Ian Bryce",
		"Tom DeSanto",
		"Lorenzo di Bonaventura",
		"Don Murphy",
		"Steve Jablonsky",
		"Mitchell Amundsen",
		"Tom Muldoon",
		"Paul Rubell",
		"Glen Scantlebury",
		"Janet Hirshenson",
		"Jane Jenkins",
		"Ruth Lambert",
		"Michelle Lewitt",
		"Jeff Mann"
	],
	"votes": 682213,
	"cover": "https://m.media-amazon.com/images/M/MV5BZjM3ZDA2YmItMzhiMi00ZGI3LTg3ZGQtOTk3Nzk0MDY0ZDZhXkEyXkFqcGc@._V1_QL75_UY281_CR5,0,190,281_.jpg",
	"description": "Several thousand years ago, the planet Cybertron was consumed by a civil war between the two Transformer factions, the Autobots led by Optimus Prime and the Decepticons led by Megatron. Optimus jettisoned the Allspark, a mystical artifact that brings life to the planet, into space, but Megatron pursued it. Megatron crashed onto Earth, landing in the Arctic Circle and froze, and was discovered in 1895 by explorer Captain Archibald Witwicky. Witwicky inadvertently activated Megatron's navigational system, which etched the Allspark's coordinates into his glasses. The glasses eventually end up in the possession of his great-great-grandson Sam Witwicky (Shia LaBeouf).In the present, Blackout attacks and destroys a United States military base in Qatar in a failed attempt to hack the military network to find information on Megatron and the AllSpark. A surviving team of Army Rangers led by Captain William Lennox (Josh Duhamel) escape across the desert, pursued by Blackout's drone Scorponok. They fight Scorponok off, aided by aerial reinforcements, and travel home with Scorponok's stinger, discovering sabot rounds damaged its armor. At the Pentagon, Secretary of Defense John Keller (Jon Voight) leads the investigation into the attack. Data analyst Maggie Madsen (Rachael Taylor) catches another Decepticon, Frenzy, hacking into the military network while on-board Air Force One.While the hack is thwarted, Frenzy downloads files on Archibald's glasses, tracking down Sam with Barricade, disguised as a police car. After Maggie proposes the possibility of the hacker not being human and gets told off by Secretary Keller, she makes a copy of the audio signal made during the hacking attempt and goes to her hacker friend Glen Whitmann (Anthony Anderson) to decode the signal. They discover fragments of a message mentioning \"Project Iceman\", \"Sector 7\", and Capt. Witwicky, but Maggie and Glen are promptly arrested for possessing classified information.Meanwhile, Sam buys his first car, a rusting Chevrolet Camaro, but discovers it has a life of its own. Sam and his high school crush Mikaela Banes (Megan Fox) are rescued from Barricade and Frenzy by the Camaro who turns out to be the Autobot scout Bumblebee, who has to communicate through his car radio due to being mute. Previously sending a beacon to his fellow Autobots, Bumblebee takes Sam and Mikaela to meet Optimus Prime, Jazz, Ironhide, and Ratchet. Optimus explains the details of the situation, revealing if Megatron gained the AllSpark he would transform Earth's machinery into a new army and exterminate mankind. Sam, Mikaela, and the Autobots travel to Sam's house to retrieve the glasses, but they are captured by agents of Sector Seven, a top-secret paramilitary government branch, led by Agent Seymour Simmons (John Turturro). The Autobots stop the agents, but they call for backup, who take Sam, Mikaela, and Bumblebee into custody, though Optimus obtains the glasses and uses them to locate the Allspark.The humans connected to the Transformers are gathered together at Hoover Dam by Sector Seven's director Tom Banachek (Michael O'Neill), who reveals Megatron, still frozen, and the Allspark. Frenzy, having smuggled away in Mikaela's bag, disables Megatron's cryonics system and contacts Starscream, Megatron's second-in-command and acting leader of the Decepticons, who in turn summons Blackout, Barricade, Brawl, and Bonecrusher, the latter being killed by Optimus on a highway. Bumblebee is released to protect the Allspark, shrinking it to a handheld size so it can be transported to safety. Megatron escapes the dam after thawing out. Frenzy attacks Secretary Keller, Maggie, Glen, and Agent Simmons in the Dam's radio room, trying to prevent them from summoning the Air Force, but is decapitated by his own ricocheting Shuriken and the group succeeds in calling for aerial support.A battle between the Autobots and Decepticons breaks out in Mission City. During the battle, Blackout is killed by an airstrike and Brawl is killed by the Autobots and military. However, Megatron arrives, killing Jazz and preventing Sam's attempted escape with the Allspark. Optimus arrives to protect Sam and engages in a battle against Megatron, with the latter getting the upper hand until the military arrives. Optimus tells Sam to push the cube into his chest to ensure their mutual destruction, but instead Sam rams it into Megatron's chest, overloading his spark and killing him.Optimus salvages a shard of the Allspark from Megatron's mangled corpse. The United States government shuts down Sector Seven and disposes of the dead Decepticons in the Laurentian Abyss. Sam and Mikaela then start a romantic relationship while the Autobots secretly hide out on Earth, and Optimus sends a transmission into space inviting any surviving Autobots to join them.A brief mid-credits scene shows Starscream escaping into space.",
	"links": [
		"https://www.amazon.com/Transformers-Shia-LaBeouf/dp/B0010DGZDW"
	]
}