{
	"title": "Tower Heist",
	"release_year": "2011",
	"runtime": "104",
	"tags": [
		"Action",
		"Comedy",
		"Crime",
		"amazon"
	],
	"rating": 6.2,
	"actors": [
		"Eddie Murphy",
		"Ben Stiller",
		"Casey Affleck",
		"Alan Alda",
		"Matthew Broderick",
		"Stephen McKinley Henderson",
		"Judd Hirsch",
		"Téa Leoni",
		"Michael Peña",
		"Gabourey Sidibe"
	],
	"staff": [
		"Brett Ratner",
		"Adam Cooper",
		"Bill Collage",
		"Ted Griffin",
		"Jeff Nathanson",
		"Brian Grazer",
		"Eddie Murphy",
		"Kim Roth",
		"Christophe Beck",
		"Dante Spinotti",
		"Mark Helfrich",
		"Kathleen Chopin",
		"Kristi Zea"
	],
	"votes": 152354,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTY1NDQxMTcwOV5BMl5BanBnXkFtZTcwNzMzNTExNg@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Josh Kovacs (Ben Stiller) is the building manager of The Tower, a high-rise luxury apartment complex on Central Park West in New York City whose employees include concierge Charlie (Casey Affleck), who is expecting a child with Josh's sister; Enrique (Michael Peña), a newly hired elevator operator; Lester (Stephen Henderson), the doorman nearing retirement; Odessa (Gabourey Sidibe), a Jamaican maid on a work visa; and receptionist Miss Iovenko (Nina Arianda), who furtively studies for her bar exam at work.One morning Josh sees what appears to be a kidnapping of Tower tenant and wealthy businessman Arthur Shaw (Alan Alda). Josh gives chase and almost catches him when he is clothes-lined by FBI agent Claire Denham (Téa Leoni). Denham explains that Shaw wasn't being kidnapped, he was attempting to flee arrest, accused of running a Ponzi scheme. Josh tells the Tower staff about Shaw's arrest and explains that he gave Shaw their pension fund to invest, and their money is gone. After learning that Lester attempted suicide by walking in front of a moving train after losing everything he had, Josh, Charlie and Enrique visit Shaw, under house arrest in his penthouse apartment, to tell him this. Shaw expresses condolences but appears insincere, and Josh responds by destroying the windows of a 1963 Ferrari 250 GT Lusso Shaw has on display in his apartment. The building's General Manager (Judd Hirsch) is furious at Josh's action and fires Josh, Charlie and Enrique.Josh meets Denham at a bar, and she invites him to get drunk. As they drink, she says Shaw must have had a cash safety net and suggests in jest that he find and steal it. Josh gathers Charlie, Enrique, and former Tower tenant Mr. Fitzhugh (Matthew Broderick) to draw up a plan to steal Shaw's money. Mr. Fitzhugh is ex-wall street who lost badly in the market, lost his job, & was forcibly evicted due to financial troubles, but Josh was nice & kind to him, so he offers to help.\nWhen Charlie brings up the obvious drawback that they are not thieves, Josh enlists his neighbor and childhood playmate, a petty criminal named Slide (Eddie Murphy), to help. Slide trains the team but realizes he cannot do the robbery because he doesn't know how to crack the safe in Shaw's apartment. They bring in Odessa, whose family ran a locksmith business.Later on, Charlie tells Josh he's been rehired as the Tower's new manager and warns Josh to stay away or he will have him arrested. Denham then tells Josh that a hearing for Shaw has been scheduled for Thanksgiving during the Macy's Thanksgiving Day Parade to avoid publicity, and Shaw will go free. Josh and his team decide to break into Shaw's apartment during the parade. Josh has Enrique steal his sister's mobile phone & uses that to text Charlie that her water just broke. Charlie thinks the baby is coming & leaves the building.Slide tries to go it alone by ditching the rest of the team after learning from Odessa how to open the safe. However, Josh traps him in the elevator.\nThe team reaches Shaw's apartment, breaks down a false wall and finds Shaw's safe behind it; Odessa opens the safe but finds it empty. Slide reaches the apartment after escaping the elevator & pulls out a gun & threatens Josh for the money. Slide and Fitzhugh struggle for Slide's gun; the gun goes off and a bullet hits the car, revealing gold underneath the Ferrari's paint.They realize Shaw invested his cash in gold, had the gold melted down and cast into car parts, and then assembled the car in his apartment where the gold would be hidden in plain sight. Josh finds a ledger of Shaw's illegal finances in the car's glove box. They lower the car out the window into Fitzhugh's old apartment six floors below, and then take it down to the lobby on top of an elevator. Just as they reach the lobby Agent Denham and Shaw return, the Thanksgiving court date being another set up, and take the same elevator back up. Denham sees Shaw's safe and informs him that he did not declare the safe on an inventory of items taken when he was arrested, which is a violation of the conditions of his bail. She has him remanded back into custody.Denham sees Lester using a stolen truck to try to escape from the building. She catches up to him, assuming he is fleeing with the Ferrari, but finds the truck empty. The FBI arrests him and Josh's other accomplices. She personally handcuffs Josh and privately congratulates him. As Josh is being questioned by the FBI, Miss Iovenko arrives, telling the FBI that she passed her bar exam three days ago and is acting as Josh's attorney. She shows them Shaw's ledger and tells them she will turn it over in exchange for everyone's freedom. The FBI accepts on the condition that Josh, being the primary conspirator, must serve a minimal two-year sentence.The team retrieves the car from its hiding place in Shaw's rooftop pool and send various parts of the car to Tower employees to compensate for their lost pensions. As the movie ends Shaw begins his life sentence and Josh is booked into jail, a satisfied smile slowly forming on his face.",
	"links": [
		"https://www.amazon.com/Tower-Heist-Eddie-Murphy/dp/B0071MUR26"
	]
}