{
	"title": "Next",
	"release_year": "2007",
	"runtime": "96",
	"tags": [
		"Action",
		"Sci-Fi",
		"Thriller",
		"netflix",
		"amazon"
	],
	"rating": 6.2,
	"actors": [
		"Nicolas Cage",
		"Julianne Moore",
		"Jessica Biel",
		"Thomas Kretschmann",
		"Tory Kittles",
		"José Zúñiga",
		"Jim Beaver",
		"Jason Butler Harner",
		"Michael Trucco",
		"Enzo Cilenti"
	],
	"staff": [
		"Lee Tamahori",
		"Gary Goldman",
		"Jonathan Hensleigh",
		"Paul Bernbaum",
		"Philip K. Dick",
		"Nicolas Cage",
		"Todd Garner",
		"Norman Golightly",
		"Graham King",
		"Mark Isham",
		"David Tattersall",
		"Christian Wagner",
		"Denise Chamian",
		"William Sandell"
	],
	"links": [
		"https://www.netflix.com/title/70066433",
		"https://www.amazon.com/Next-Nicolas-Cage/dp/B000YKFJ66"
	],
	"votes": 167830,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTg3MjgyNjE1Nl5BMl5BanBnXkFtZTcwNTY1NDU0MQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Cris Johnson (Nicolas Cage) can see into his future. He can only see two minutes ahead & only for himself (not others), with the exception of a vision he once had of a woman walking into a diner. Knowing no details other than the time, he goes to the diner twice each day at 8:09 to await her arrival. He works as a small-time magician in Las Vegas, where he supplements his income with gambling, using his powers to win medium amounts against the house.Cris draws the attention of NSA Agent Callie Ferris (Julianne Moore), who has figured out his ability and wants to stop Russian terrorists from detonating a nuclear weapon. Before she can approach Cris, his gambling draws the attention of casino security. Using his ability to forecast the actions of his pursuers, he eludes them and the Las Vegas police.NSA Director Wisdom (Jim Beaver) is not convinced of Ferris's plan to use Cris to find the nuclear device but gives her 5 days to track Cris down. Ferris works with NSA Agent Cavanaugh (Tory Kittles). Ferris tracks Cris to his location, but he escapes after foreseeing her arrival. Cris had foreseen the entire conversation with Ferris and knew exactly what she wanted him to do.\nLater that night, the casino's Security Chief Roybal (Jose Zuniga) is approached by two of the terrorists Mr. Smith (Thomas Kretschmann) & an oriental, is interrogated about Johnson and is then killed.The following morning, Cris is at the diner again when he sees Liz Cooper (Jessica Biel), the woman from his vision. It turns out that Cris can not only see the future, but also see how his actions can affect that future. When Liz's aggressive ex-boyfriend arrives, Johnson envisions all outcomes of his intervening, and then chooses the outcome that gets him \"in\" with Liz. Knowing that she is heading for Flagstaff, Arizona, Cris tricks her into giving him a ride. Ferris follows, while the terrorists (who were monitoring the FBI's movements), led by Mr. Jones (Enzo Cilenti), Mr. White (Sergej Trifunovic) & Mr. Smith, decide to kill him.With the weapon tracked to Los Angeles, Ferris persuades her superiors to let her bring Cris in, when there is confirmation that the nuke has been assembled inside the US borders and will be ready for detonation shortly. The terrorists follow in the hope that the agents will lead them to Cris.\nCris and Liz have to spend the night in a motel on their way to Flagstaff. Ferris confronts Liz near the hotel. Claiming Cris is a dangerous sociopath, Ferris asks Liz to drug Cris so that they can bring him in peacefully. Instead, Liz warns Cris, who tells her his secret. When she asks why he will not help the FBI stop the terrorists, he explains his limitations (Only 2 mins into the future and only when his own life is involved), noting the exception for events involving her (he can see further into the future with her). Cris tries to escape from the FBI but is captured after saving Ferris from logs tumbling down the side of a mountain. Unable to get to Cris, the terrorists kidnap Liz.The NSA strap Cris to a chair and force him to watch television until he has a vision that can help. They expect him to see a report about the detonation of the bomb, but instead he envisions a broadcast from several hours in the future in which Liz is killed with a bomb vest while strapped to a wheelchair as bait for him. Cris escapes and races to the parking garage where she will be killed. Catching up to him, Ferris promises to help save Liz as long as Cris will help stop the bomb; she also sets up a plan to draw out the terrorists. She puts Cris out in the open on the parking garage, which prompts Mr. White to take a shot at him. This exposes White and the FBI guns him down, while Cris was unhurt as he dodged the bullet and was only faking his death.Cris helps the NSA track the terrorists to the port where they are based (he \"sees\" the license plate number of the van which is used to drop Liz at the parking garage). When they arrive, Cris is able to walk right up to the terrorist leader while using his power to dodge bullets. After killing the terrorists and saving Liz, they find that the bomb has already been moved. Ferris shows Cris a seismograph, hoping that he will see any tremors caused by explosions before they happen. As he stares at the screen, he realizes that he has made a mistake and that he was too late: the bomb detonates out at sea and completely destroys the port, as well as the rest of the city.The time-line reverts a full day to Cris and Liz in bed at the hotel in Arizona, before Ferris arrived. Because of Liz's involvement in events, Cris has now been able to envision everything that could happen leading to the nuclear explosion. \"Every time you look into the future, it changes.\"\nCris calls Ferris and offers to help prevent the nuclear disaster, then asks Liz to wait for him.",
	"netflix": [
		"ireland",
		"japan",
		"new-zealand",
		"uk"
	]
}