{
	"title": "Wonder Woman",
	"release_year": "2017",
	"runtime": "141",
	"tags": [
		"Action",
		"Adventure",
		"Fantasy",
		"max",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"Gal Gadot",
		"Chris Pine",
		"Robin Wright",
		"Lucy Davis",
		"Connie Nielsen",
		"Danny Huston",
		"David Thewlis",
		"Saïd Taghmaoui",
		"Ewen Bremner",
		"Eugene Brave Rock"
	],
	"staff": [
		"Patty Jenkins",
		"Allan Heinberg",
		"Zack Snyder",
		"Jason Fuchs",
		"William Moulton Marston",
		"Charles Roven",
		"Deborah Snyder",
		"Zack Snyder",
		"Richard Suckle",
		"Rupert Gregson-Williams",
		"Matthew Jensen",
		"Martin Walsh",
		"Kristy Carlson",
		"Lora Kennedy",
		"Lucinda Syson",
		"Aline Bonetto"
	],
	"cover": "https://m.media-amazon.com/images/M/MV5BMjEzYmZkNjktODBmYi00NzNkLWIzMjItMjhkMWZiZTZlN2MwXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"links": [
		"https://www.max.com/movies/wonder-woman-2017/a618358a-a71d-44a2-8294-24da8fae8591",
		"https://www.amazon.com/Wonder-Woman-1984-Gal-Gadot/dp/B08V83JJBY"
	],
	"votes": 706479,
	"description": "In modern-day Paris, Diana Prince receives an old photograph from Wayne Enterprises depicting herself with four men from World War I. The image triggers a flood of memories, prompting Diana to recall her past.Diana is the daughter of Queen Hippolyta and was raised on Themyscira, a hidden island inhabited by the Amazons-warrior women created by the Olympian gods to safeguard humanity. Hippolyta tells Diana the story of Ares, the god of war, whose jealousy of humanity drove him to seek its destruction. When the other gods tried to stop him, Ares killed all but Zeus, who used his final strength to wound Ares and force him to retreat. Before dying, Zeus left behind a weapon, the \"god-killer,\" to aid the Amazons when Ares returned. Reluctantly, Hippolyta allows her sister Antiope to train Diana as a warrior.In 1918, Diana's life changes when she saves Captain Steve Trevor, a U.S. pilot whose plane crashes near Themyscira. The island is soon invaded by German soldiers pursuing him, and the Amazons defeat them, though Antiope sacrifices herself to protect Diana. Under the Lasso of Hestia's magic, Steve reveals that a massive war rages in the outside world and that he is an Allied spy. He has stolen a notebook from Dr. Isabel Maru, a German chemist developing a new, deadly form of mustard gas under General Erich Ludendorff's orders. Diana, convinced Ares is behind the war, prepares to confront him, arming herself with the \"god-killer\" sword, her lasso, and battle armor, and leaves Themyscira with Steve.Arriving in London, Diana and Steve present Maru's notebook to the Supreme War Council, where Sir Patrick Morgan is negotiating an armistice with Germany. Diana deciphers the notes and learns that the Germans plan to release the gas at the Western Front. Despite orders to the contrary, Steve, with funding from Morgan, assembles a team: Moroccan spy Sameer, Scottish marksman Charlie, and Native American smuggler Chief Napi. They set out to stop the release of the gas. Diana bravely crosses No Man's Land alone and defeats the enemy in their trenches, liberating the nearby village of Veld and winning the admiration of the Allied troops. The team celebrates their victory, and Diana and Steve share a tender moment, falling in love.The team learns of a gala at the German High Command, where the gas is being prepared for launch. Steve and Diana go undercover-he to find and destroy the gas, she to kill Ludendorff, whom she believes to be Ares. Steve's intervention prevents Diana from confronting Ludendorff in time, allowing him to release the gas, which devastates Veld. Heartbroken and angry, Diana pursues Ludendorff to his base. After a fierce battle, she kills him, but the war does not end, leaving her confused and disillusioned.Sir Patrick appears and reveals himself as Ares. He tells Diana that, while he has influenced humanity's darkest impulses, the ultimate choice to commit violence is theirs alone. Diana tries to defeat him with the \"god-killer\" sword, but he destroys it, revealing that she is the true \"god-killer\" because she is Zeus's daughter.In their ensuing battle, Diana's rage and grief threaten to overwhelm her. However, memories of Steve's sacrifice and her experiences with humanity's capacity for good remind her of who she is. Choosing hope over vengeance, she spares Dr. Maru and redirects Ares's lightning back at him, ultimately defeating him and ending his influence over mankind. The war comes to an end, and the team celebrates their hard-won victory.In the present day, Diana sends an email to Bruce Wayne, thanking him for the photograph of herself and Steve. As Wonder Woman, she continues to fight for justice and protect the world."
}