{
	"title": "Terminator Salvation",
	"release_year": "2009",
	"runtime": "115",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"max",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Christian Bale",
		"Sam Worthington",
		"Anton Yelchin",
		"Moon Bloodgood",
		"Helena Bonham Carter",
		"Jadagrace",
		"Bryce Dallas Howard",
		"Common",
		"Jane Alexander",
		"Michael Ironside"
	],
	"staff": [
		"McG",
		"John Brancato",
		"Michael Ferris",
		"Derek Anderson",
		"Moritz Borman",
		"Victor Kubicek",
		"Jeffrey Silver",
		"Danny Elfman",
		"Shane Hurlbut",
		"Conrad Buff IV",
		"Justine Arteta",
		"Kim Davis-Wagner",
		"Martin Laing"
	],
	"links": [
		"https://www.max.com/movies/terminator-salvation/21d9f5f7-2110-46a8-8eb0-d34756ddfc7d",
		"https://www.amazon.com/Terminator-4-Salvation-Christian-Bale/dp/B002RRN952"
	],
	"votes": 380613,
	"cover": "https://m.media-amazon.com/images/M/MV5BMWY1OWQ4ZWQtYzZkOS00ZTU0LWE3MDItOTg3YzdmODRkMDVjXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 2003, Doctor Serena Kogan (Helena Bonham Carter) of Cyberdyne Systems convinces death row inmate Marcus Wright (Sam Worthington) to sign his body over for medical research following his execution by lethal injection.\nOne year later the Skynet system is activated, perceives humans as a threat to its own existence Skynet decides to strike first, and eradicates much of humanity in the event known as \"Judgment Day\" (as depicted in Terminator 3: Rise of the Machines).\nThis started the war between the humans and the machines. To hunt down humans, Skynet built Terminators. Many believe that John Connor is the key to Salvation, while others believe that he is a false prophet.\nIn 2018, John Connor (Christian Bale) leads a Resistance attack on a Skynet base. John discovers human prisoners and schematics for a new type of Terminator incorporating living tissue, but he is the only apparent survivor of the attack after the base is destroyed in a nuclear explosion. However, Marcus later emerges from the wreckage of the base and proceeds on foot to Los Angeles.John returns to Resistance headquarters located aboard a nuclear submarine and tells General Ashdown (Michael Ironside), the current leader, of his discovery.\nMeanwhile, the Resistance has discovered a radio frequency believed to be capable of sending an order to shut down Skynet machines. They believe that since Skynet is also a machine, so this radio frequency is its off switch.\nThey plan to launch an offensive against the Skynet base in San Francisco in four days, in response to an intercepted \"kill list\" indicating that Skynet plans to kill the Resistance's command staff in a week's time.\nJohn learns that his own name is second on the list, following a civilian named Kyle Reese (Kyle Reese went back in time to impregnate Sarah Connor). The Resistance leaders are unaware of Kyle's importance, but John knows that it is because Kyle will later become his father (as depicted in The Terminator).\nJohn meets with his wife Kate (Bryce Dallas Howard) and his subordinate Barnes (Common).\nThey test the signal on smaller captured machines, and it works. They transmit a radio broadcast to Resistance members and surviving civilians around the world.John and Barnes test the signal on bigger machines using a short-wave radio in the field. Again, the signal manages to bring down a machine by shutting it down. Ashdown wants to attack Skynet core, but this would also cause human casualties as the core is surrounded by human prisoners. John wants to rescue the human prisoners before killing Skynet.Arriving in the ruins of Los Angeles, Marcus is saved from a T-600 Terminator by Kyle Reese (Anton Yelchin) and his mute child companion Star (Jadagrace Berry). It is clear that the Terminators are very difficult to eliminate.\nKyle informs Marcus about the war between humans and Skynet. Hearing John's radio broadcast, the three leave Los Angeles. Marcus wants to go North towards Skynet, but Kyle convinces him to go East and link up with the resistance. They survive an attack and a drone that identifies Kyle. Kyle, Star, and Marcus find human survivors hiding from the machines. But then the location comes under attack from the machines and Kyle, Star and several other humans are taken prisoner. Marcus tries to save Kyle and Star, but the machines are simply indestructible and only Marcus manages to escape.Two Resistance A-10 airplanes are shot down when they try to intercept the machine transport and its escorts. The transports are headed towards San Francisco, the known location of Skynet Core.\nMarcus locates downed pilot Blair Williams (Moon Bloodgood) and they make their way to John's base. On their way Blair is attacked by other human survivors who rob fellow humans. Marcus helps Blair to fight the looters, but Marcus is wounded by a magnetic land mine (which is designed to kill machines), just as they reach John's base. Attempting to save his life, the Resistance fighters discover that Marcus is a cyborg, with a mechanical Endoskeleton, circuitry, and a partially artificial cerebral cortex.Marcus believes himself to be human, but John shows Marcus's hybrid Bio-mechanical body (which mixed human organs and machine body parts, overlaid by human skin) to him. John thinks that Marcus has been sent to kill him and orders his destruction. Marcus learns that John is looking for Kyle, and tells John that Klye is on a transport headed for Skynet.\nHowever, Blair helps Marcus escape from the base. During the pursuit, Marcus saves John's life from Skynet Hydrobots, and the two make a bargain: Marcus will enter Skynet's headquarters and attempt to help John rescue Kyle and the other prisoners.John pleads with Ashdown to delay the attack, but Ashdown refuses and relieves John of his command. However, the Resistance forces disobey Ashdown's orders and await John's signal. Marcus enters the base, interfaces with the computer, and disables the perimeter defenses so that John can infiltrate the cell block and release the human prisoners.Marcus learns that Skynet engineered him to serve as bait, aiming to draw John to the base where he will be eliminated. As the Resistance initiates its assault, Skynet plans to execute John, finally achieving what it had repeatedly failed to do. Moreover, the radio transmission vital to the Resistance's strategy is a deception; Skynet exploits it to locate and eliminate the command submarine carrying the Resistance leaders.Marcus rips out the hardware connecting him to Skynet and joins forces with John to combat a new T-800 model 101 Terminator (Arnold Schwarzenegger). In the intense showdown, John sustains fatal injuries but manages to obliterate the Skynet base by setting multiple Terminator fuel cells to detonate. As they are airlifted out, John, Marcus, Kyle, and Star narrowly escape the explosion.\nKate desperately tries to revive John, but his heart is too damaged. In a selfless act, Marcus offers his own heart for transplant, sacrificing himself to save John. Despite the loss, John survives. He contacts the other Resistance fighters, reminding them that while this battle is won, the war against Skynet is far from finished."
}