{
	"title": "Juno",
	"release_year": "2007",
	"runtime": "96",
	"tags": [
		"Comedy",
		"Drama",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Elliot Page",
		"Michael Cera",
		"Jennifer Garner",
		"Jason Bateman",
		"Allison Janney",
		"J.K. Simmons",
		"Olivia Thirlby",
		"Eileen Pedde",
		"Rainn Wilson",
		"Daniel Clark"
	],
	"staff": [
		"Jason Reitman",
		"Diablo Cody",
		"Lianne Halfon",
		"John Malkovich",
		"Mason Novick",
		"Russell Smith",
		"Mateo Messina",
		"Eric Steelberg",
		"Dana E. Glauberman",
		"Kara Lipson",
		"Mindy Marin",
		"Steve Saklad"
	],
	"votes": 554044,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTIwMDgwODc5Nl5BMl5BanBnXkFtZTYwMjQzMDM4._V1_QL75_UX190_CR0,7,190,281_.jpg",
	"description": "Sixteen-year-old Minnesota high-school student Juno MacGuff (Ellen Page) discovers she is pregnant with a child fathered by her friend and longtime admirer, Paulie Bleeker (Michael Cera). One day they both gave in to their passion to discover each other's bodies and had sex in her chair.Rollo (Rainn Wilson) is the convenience store clerk where Juno buys a pregnancy test and uses the store's bathroom to confirm her pregnancy. Leah (Olivia Thirlby) is Juno's best friend. With the help of Leah, Juno takes the chair and sets it outside Paulie's home. When Paulie comes out for his morning run, she tells him that she is pregnant. Paulie is shocked and asks what Juno wants to do.She initially considers an abortion. Going to a local clinic run by a women's group, she encounters outside a school mate Su-Chin (Valerie Tian) who is holding a rather pathetic one-person Pro-Life vigil. Once inside, however, Juno is alienated by the clinic staff's authoritarian and bureaucratic attitudes. She is given a long form to list down each and every one of her sexual encounters. It smelled like a dentist's office, and they had these horrible magazines with water stains.She is particularly offended by their calling her \"sexually active\", a term which she feels demeans the highly emotional event by which she became pregnant. All of this decides her against abortion, and she decides to give the baby up for adoption.\nWith the help of her friend Leah, Juno searches the ads in the Pennysaver and finds a couple she feels will provide a suitable home. The couple agrees to pay her medical expenses and seem perfect and beautiful to Juno. They have been trying to have a kid for 5 years.\nShe tells her parents, Mac (J.K. Simmons) and stepmother, Bren (Allison Janney), who offer their support. Mac is divorced from Juno's mother, who lives in Texas with her husband and his 3 kids. Mac used to be in the army, but now works for H-Vac. Bren owns a nail salon and is obsessed with dogs.\nBren is incredibly supportive and puts Juno on Pre-natal medications and takes accountability for her and her baby's health.\nWith Mac, Juno meets the couple, Mark (Jason Bateman) and Vanessa Loring (Jennifer Garner), in their expensive home and agrees to a closed adoption. Juno agrees to give up all rights to the baby once she hands it over to Mark and Vanessa. She refuses any additional compensation and says that she wants the baby to be with people who will love and care for it. Vanessa comes across as very sincere and very desperate for the baby.Juno visits Mark a few times, with whom she shares tastes in punk rock and horror films. Mark, who has set aside his rock band youth (now confined to memorabilia displayed in the one room of the house that Vanessa has designated for Mark's personal belongings), works at home composing commercial jingles.\nVanessa tells Juno that they went through a situation before where the birth mother got cold feet at the last minute and backed out of the whole process. Juno promises not to do that.\nBren warns Juno that Mark is a married man and that she should not visit him without prior intimation, so Vanessa can be around.Juno and Leah happen to see Vanessa in a shopping mall being completely at ease with a child, and Juno encourages Vanessa to talk to her baby in the womb, where it obligingly kicks for her. Juno can see that Vanessa is totally invested in the baby and cannot wait for it to be born.As the pregnancy progresses, Juno struggles with the emotions she feels for the baby's father, Paulie, who is clearly in love with Juno. Juno maintains an outwardly indifferent attitude toward Paulie, but when she learns he has asked another girl to the upcoming prom, she angrily confronts him. The guys had planned to go from Benihana, to the prom, to Vijay's parents' cabin. Leah says that boys have endured more to have sex with a girl.\nPaulie reminds Juno that it is at her request they remain distant and tells her that she broke his heart.Not long before her baby is due, Juno is again visiting Mark when their interaction becomes emotional. Mark then tells her he will be leaving Vanessa. Juno is horrified by this revelation, with Mark asking Juno \"how do you think of me\". Now, Juno thought of Mark only as her friend, so this question from Mark comes to her as a total shock.\nVanessa arrives home, and Mark tells her he does not feel ready to be a father and there are still things he wants to do first. Juno watches the Loring marriage fall apart, then drives away and breaks down in tears by the side of the road. Returning to the Lorings' home, she leaves a note and disappears as they answer the door.After a heartfelt discussion with Mac, Juno accepts that she loves Paulie. Juno then tells Paulie she loves him, and Paulie's actions make it clear her feelings are very much reciprocated. Not long after, Juno goes into labor and is rushed to the hospital, where she gives birth to a baby boy.She had deliberately not told Paulie because of his track meet. Seeing her missing from the stands, Paulie rushes to the hospital, finds Juno has given birth to their son, and comforts Juno as she cries. Vanessa comes to the hospital where she joyfully claims the newborn boy as a single adoptive mother.\nOn the wall in the baby's new nursery, Vanessa has framed Juno's note, which reads: \"Vanessa: If you're still in, I'm still in. -Juno.\" The film ends in the summertime with Juno and Paulie playing guitar and singing together, followed by a kiss.",
	"links": [
		"https://www.amazon.com/Reitman-Autographed-Entertainment-Magazine-II59843/dp/B08DCCJGW3"
	]
}