{
	"title": "9",
	"release_year": "2009",
	"runtime": "79",
	"tags": [
		"Action",
		"Adventure",
		"Animation",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Elijah Wood",
		"Jennifer Connelly",
		"Crispin Glover",
		"Christopher Plummer",
		"Martin Landau",
		"John C. Reilly",
		"Fred Tatasciore",
		"Fred Tatasciore",
		"Alan Oppenheimer",
		"Tom Kane",
		"Helen Wilson"
	],
	"staff": [
		"Shane Acker",
		"Pamela Pettler",
		"Shane Acker",
		"Ben Gluck",
		"Timur Bekmambetov",
		"Tim Burton",
		"Dana Ginsburg",
		"Jim Lemley",
		"Deborah Lurie",
		"Kevin R. Adams",
		"Nick Kenway",
		"Mindy Marin",
		"Richard Chen",
		"Robert St. Pierre",
		"Fred Warter"
	],
	"links": [
		"https://www.amazon.com/9-Christopher-Plummer/dp/B002VP8ZOA"
	],
	"votes": 149483,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTY2ODE1MTgxMV5BMl5BanBnXkFtZTcwNTM1NTM2Mg@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In an alternate 1930s world, an unnamed scientist (Alan Oppenheimer) is ordered by his dictator (Tom Kane) to create a robot in the apparent name of progress. Following these orders, the scientist creates the B.R.A.I.N., a robot with high intelligence the scientist literally created from his own intellect, allowing it to be able to create other robots and machines. Upon its completion, however, the dictator quickly seizes the machine from the scientist before he can give it any human characteristics, such as a soul, and makes it into the Fabrication Machine, an armature that can construct an army of war machines that will destroy the dictator's enemies.Lacking a soul, however, the Fabrication Machine decides to exterminate all of Earth's population, and it programs the created army of war machines to attack humanity, wiping out all plant, animal and microbial life with waves of toxic gas and chemical weapons. With the entire planet's life on the verge of destruction, the scientist uses alchemy to create nine Homunculus-like rag dolls known as \"Stitchpunks\", giving them portions of his own soul, via a talisman that he created (The scientist creates 9 humanoid robots to kill the brain before giving his soul to the robots with its Transmorgifier), to bring them to life. He dies upon completion of the final doll.Some time later, the final Stitchpunk, 9 (Elijah Wood), awakens in the scientist's home workshop. He finds the scientist's house to be in a devastated city. Taking the talisman with him, 9 ventures into the city and meets 2 (Martin Landau), a frail inventor who fixes his inability to speak by giving him a working voice box and is surprised to see the talisman. The last active machine, the Cat-Beast, attacks the pair, and 9 is unable to prevent it from abducting 2 and the talisman. 9 collapses, but awakens in Sanctuary, the tower of a dilapidated cathedral that is home to other Stitchpunks: the dogmatic leader 1 (Christopher Plummer), his large bodyguard 8 (Fred Tatasciore), the Cycloptic engineer 5 (John C. Reilly), and the mentally unstable oracle 6 (Crispin Glover).1 immediately declares 2 as dead, but 9, having seen the condemned factory where the Cat-Beast took him, decides to rescue him. 9 and 5 venture to the factory where they find 2. The Cat-Beast attacks the trio, but are saved by the warrior 7 (Jennifer Connelly) who kills the Cat-Beast. 9, drawn by curiosity, connects the talisman to the derelict Fabrication Machine, reviving it (the Robots inadvertently awaken the giant by inserting the Transmorgifier in it, but eventually defeat it & freeing the \"souls\" of their friends), and it subsequently kills 2 by sucking out his soul. 9, 5, and 7 manage to escape the factory.7 takes 9 and 5 to an abandoned library, where the mute scholar twins, 3 and 4, show 9 a film showing the Fabrication Machine's origins, and how it is the cause of the world's current state. 5 realizes the talisman's symbols match the clairvoyant drawings of 6. 9 and 5 returns to Sanctuary to investigate, but 1 intervenes and reprimands them for disobeying his orders, especially due to the consequences of their actions. Meanwhile, the Fabrication Machine has begun assembling new robotic creatures to send after the Stitchpunks; one of them, the bird-like Winged Beast, attacks Sanctuary, leading to a battle between it and the Stitchpunks. The Stitchpunks win, destroying the Winged Beast, but lose their safe-house due to a fire caused during the battle.As the group retreats to the library, 6, 3, and 4 cryptically explain the talisman's origins. Meanwhile, the Fabrication Machine takes 2's corpse and turns it into a hypnotic lure on another of its robot creatures, the snake-like Seamstress. The Seamstress attacks the library and captures both 7 and 8, but 2's body is recovered and given a funeral by the others. The Stitchpunks then run to the factory to destroy the machines. As part of their plan, 9 goes in alone, kills the Seamstress, and rescues 7, but not before 8's soul is absorbed by the Fabrication Machine. 9 and 7 then escape while the others destroy the factory.The Stitchpunks celebrate the destruction of the factory, but the Fabrication Machine, which survived, suddenly emerges from the ruins of the factory and absorbs 5's soul. The Fabrication Machine attacks the group as they run away, and finally captures 6, who is absorbed, but not before telling 9 to go to the scientist's workshop to find answers. 9 follows 6's instructions, finding a previously-overlooked holographic recorded message to him from the scientist, explaining the origins and backstory of the B.R.A.I.N. and that the Stitchpunks have his soul, making them the only hope for humanity. Following this revelation, 9 returns to his friends.9 reunites with the other Stitchpunks and decides to sacrifice himself so the others can retrieve the talisman. Having had a change of heart, 1 redeems himself by saving 9, pushing him out of the way and allowing himself to be absorbed while 9 removes the talisman. 9 activates the talisman and uses it to reabsorb the souls taken by the Machine, resulting in its final destruction. Afterwards, 9, 7, 3, and 4 release the souls of 5, 1, 6, 2, and 8 from inside the talisman. Bidding farewell to their friends, they fly up into the sky. Rain then falls from the sky, the raindrops containing small flecks of glowing bacteria, bringing life back into the world."
}