{
	"title": "Zodiac",
	"release_year": "2007",
	"runtime": "157",
	"tags": [
		"Crime",
		"Drama",
		"Mystery",
		"amazon"
	],
	"rating": 7.7,
	"actors": [
		"Jake Gyllenhaal",
		"Robert Downey Jr.",
		"Mark Ruffalo",
		"Anthony Edwards",
		"Brian Cox",
		"John Carroll Lynch",
		"Richmond Arquette",
		"Richmond Arquette",
		"Bob Stephenson",
		"John Lacy",
		"Chloë Sevigny"
	],
	"staff": [
		"David Fincher",
		"James Vanderbilt",
		"Robert Graysmith",
		"Ceán Chaffin",
		"Bradley J. Fischer",
		"Mike Medavoy",
		"Arnold Messer",
		"David Shire",
		"Harris Savides",
		"Angus Wall",
		"Laray Mayfield",
		"Donald Graham Burt"
	],
	"votes": 610734,
	"cover": "https://m.media-amazon.com/images/M/MV5BNDFkMTRkZmQtM2I0NC00NjJjLWJlMDctNTNiZWYxYzhjZDZiXkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "The film opens on July 4, 1969, with the Zodiac killer's second attack, the shooting of Darlene Ferrin (Ciara Hughes) and Mike Mageau (Lee Norris) at a lovers' lane in Vallejo, California. Mageau survives while Ferrin dies from her injuries.One month later, a letter written by the Zodiac arrives at the San Francisco Chronicle. Paul Avery (Robert Downey, Jr.) is a Chronicle crime reporter. Robert Graysmith (Jake Gyllenhaal) is a political cartoonist there. The newspaper receives encrypted letters that the killer sends, taunting the police. Because of Graysmith's status as a cartoonist, he is not taken seriously by Avery and the editors and is excluded from the initial details about the killings despite his interest in the case. In particular, he is drawn to the encrypted code that is included with the letters and is given access to one. When he is able to crack one of the codes and makes several correct guesses about the killer's actions, Avery begins sharing information with him. While at a bar together drinking Aqua Velvas, which Avery initially makes fun of Graysmith for, they discuss the coded letters.The Zodiac killer attacks again, stabbing Bryan Hartnell (Patrick Scott Lewis) and Cecelia Shepard (Pell James) at Lake Berryessa in Napa County. Shepard dies as a result of the attack, while Hartnell survives. Soon afterward, San Francisco taxicab driver Paul Stine is shot and killed in the city's Presidio Heights district. San Francisco police detectives Dave Toschi (Mark Ruffalo) and his partner Bill Armstrong (Anthony Edwards) are assigned to the case, liaising with other detectives such as Jack Mulanax (Elias Koteas) in Vallejo and Ken Narlow (Donal Logue) in Napa. The killer, or someone posing as him, continues to toy with authorities by speaking on the TV when he makes an appearance on a television talk show. Avery and Graysmith form an alliance, delving deeper into the case.Paul Avery & Robert work together & uncover additional evidence, such as evidence of Zodiac's first murder in 1966. Throughout they share a love hate relationship with the police department.\nIn 1971, Toschi, Armstrong and Mulanax question Arthur Leigh Allen (John Carroll Lynch), a potential suspect in the case. However, a handwriting expert (Philip Baker Hall) insists that Allen did not write the Zodiac letters. However, there is a lot of circumstantial evidence linking Allen to each of the murders claimed by the Zodiac (Allen is ambidextrous, was fired from a school for molesting students where one murder took place, visits a lake very often where another murder took place, had a bloodied knife in his boot the day his neighbor saw him returning from the lake). Avery receives a new letter threatening his life. He becomes increasingly paranoid and turns to drugs and alcohol. At one point, he shares information with a rival police force, angering Toschi and Armstrong.By 1978, Avery leaves the Chronicle. Armstrong quits the homicide division, and Toschi is demoted for supposedly forging a Zodiac letter. Graysmith, meanwhile, continues his own in-depth investigation, interviewing witnesses and police detectives involved in the case. His investigation is profiled in the Chronicle, which the prime suspect is known to read, and he allows himself to be interviewed on television about his book-in-progress concerning the case. Obsessing over the unsolved case, he begins receiving anonymous phone calls with heavy breathing (on the night of Ferrin's death, Graysmith discovered that someone prank-called the victim's family and did the same thing). Because of his submersion in the case, Graysmith loses his job and his wife Melanie (Chloë Sevigny) leaves him, taking their children with her.Graysmith persistently contacts Toschi about the Zodiac murders and eventually impresses the veteran detective with his knowledge of the case. While Toschi cannot directly give Graysmith access to the information he discovered over the years, he provides contacts of other police departments in counties where the other murders occurred. The cartoonist acquires more information that points to Allen as the Zodiac, and although circumstantial evidence seems to indicate his guilt, the hard evidence, such as fingerprints and handwriting samples, exonerate him. One of the sources mentions that one murder victim was stalked by Zodiac before her murder. A weird guy attended her party 2 weeks before she was killed. Says his nickname was Lee.In December 1983, a full 14 years after the original slayings, Graysmith tracks Allen down to a Vallejo hardware store, where he is employed as a sales clerk. After Allen asks if he can help Graysmith with anything, they stare at each other for a moment with blank expressions, during which time Allen's name tag can be seen with \"Lee\" written on it, before Graysmith simply replies with a \"No\", and leaves the hardware store.Eight years later, in 1991, Mageau (Jimmi Simpson) meets with authorities and identifies Allen from a police mugshot. Shortly before, as the authorities walk by a bookshelf, copies of Robert Graysmith's book Zodiac is spotted in the shelf for bestsellers.\nFinal title cards, however, inform the audience that Allen died in 1992 before he could be questioned further by police, and DNA tests performed in 2002 did not match samples gathered from the Zodiac letters.",
	"links": [
		"https://www.amazon.com/Zodiac-Directors-Cut-Jake-Gyllenhaal/dp/B0788YVQ6J"
	]
}