{
	"title": "Michael Clayton",
	"release_year": "2007",
	"runtime": "119",
	"tags": [
		"Crime",
		"Drama",
		"Mystery",
		"amazon"
	],
	"rating": 7.2,
	"actors": [
		"George Clooney",
		"Tilda Swinton",
		"Tom Wilkinson",
		"Michael O'Keefe",
		"Sydney Pollack",
		"Danielle Skraastad",
		"Wai Chan",
		"Alberto Vazquez",
		"Brian Koppelman",
		"Tom McCarthy"
	],
	"staff": [
		"Tony Gilroy",
		"Tony Gilroy",
		"Jennifer Fox",
		"Kerry Orent",
		"Sydney Pollack",
		"Steve Samuels",
		"James Newton Howard",
		"Robert Elswit",
		"John Gilroy",
		"Ellen Chenoweth",
		"Kevin Thompson"
	],
	"votes": 175348,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTc0NTU5MjI2MV5BMl5BanBnXkFtZTcwMTg5NTQzMw@@._V1_QL75_UY281_CR1,0,190,281_.jpg",
	"description": "Michael Clayton (George Clooney) is a \"fixer\" from the prestigious New York City law firm Kenner, Bach, and Ledeen, using his connections and his knowledge of legal loopholes for his clients' benefit.\nMeanwhile Michael's firm Kenner, Bach, and Ledeen is on the verge of settling their case with U-North and the media gets a whiff of it. The CEO of the firm, Marty, calls Karen to take care of the situation.After leaving an underground poker game, Michael deals with a wealthy client's Mr. Greer (Denis O'Hare) hit and run, who struck a pedestrian with his vehicle in Westchester County. Michael suggests that Greer hire a local trial lawyer, but Greer is offended that Michael is not offering to take care of the case himself. Greer says that he has been a client with Kenner, Bach, and Ledeen for 12 years and wants preferential treatment. Michael retorts that Greer will have to face trial, and all he is trying to do is to ensure that the mess doesn't get bigger than it already is.Driving home, Michael sees three horses atop a hill with barren trees. He stops, gets out of his car and approaches them. Behind him, a bomb detonates in his car.Four days earlier, one of the firm's leading attorneys, Arthur Edens (Tom Wilkinson), has a bizarre outburst in the middle of a deposition in Milwaukee involving in a six-year multi-billion-dollar class action lawsuit against U-North, an agricultural products conglomerate. Arthur's episode came in the middle of a deposition in the lawsuit, threatening the firm's reputation. Michael bails Arthur out of jail in Milwaukee after learning Arthur is no longer taking his medication. Arthur escapes from his hotel room during the night and returns to New York.Michael approaches Marty Bach (Sydney Pollack), the firm's managing partner, requesting a loan to cover a failed investment in a restaurant Michael made with his never-do-well brother Timmy (David Lansbury). Marty suggests Michael will be rewarded if he fixes the situation with Arthur and warns the firm will be finished if he fails.Meanwhile, Karen Crowder (Tilda Swinton), U-North's general counsel, discovers that Arthur had come into possession of a confidential U-North document detailing the company's decision to manufacture a weed killer that it knew to be carcinogenic and caused the hundreds of deaths that sparked the lawsuit.\nShe brings this to the attention of the CEO, Don Jeffries, whose signature is on the memo. Don puts her in contact with two hit men.\nKaren asks the 2 men Verne (Robert Prescott) & Iker (Terry Serpico) to follow Arthur and plant bugs in his apartment and phone.Michael finds Arthur on a Manhattan Street and confronts him about calls he made to Anna Kaiserson (Merritt Wever), the plaintiff being deposed during his episode. Arthur realizes his calls are being monitored. Over the phone, Arthur is enthralled by Michael's son Henry (Austin Williams) describing his favorite fantasy book, Realm & Conquest, in which themes of fate, alienation and treachery are prominent. Arthur calls his own voicemail at the firm and says he will go public with the memo.When Karen realizes that Arthur is building a case against his own client, Karen asks that he be permanently incapacitated. They assassinate Arthur in a manner designed to resemble natural causes.Michael is saddened by the news of Arthur's death but becomes suspicious upon learning that U-North was planning a settlement just a few days before and that Arthur had booked a flight for one of the plaintiffs, Anna.\nHe finds Anna and learns that she told no one of her conversations with Arthur, yet the firm somehow did know. With help from his brother Gene (Sean Cullen), a police officer, Michael breaks into Arthur's apartment, which is sealed as a crime scene. Michael finds Arthur's dogeared copy of Realm & Conquest, pausing to consider an illustration of a horse on a hill with barren trees, and several pages highlighted and annotated by Arthur.A receipt from a photocopy shop is stuck in the book. Two police officers arrive on a tip from the hit men, who have been trailing Michael. Michael is arrested, but Gene bails him out.Upon investigation, he discovers that Arthur had ordered three thousand copies of the confidential U-North document. Michael takes a copy with him, but the two hit men are tailing him and inform Karen of the situation. Michael is about to show his boss, Marty Bach (Sydney Pollack), what he has discovered, only to be offered a renewal of his employment contract as well as an $80,000 bonus he had requested to cover his debt, although it comes with a confidentiality agreement to prevent him from ever shaking down the firm.On the night of the poker game, the hit men rig Michael's car with a bomb. Michael receives a phone call summoning him to the meeting with the client in Westchester County who had committed a hit-and-run, as seen at the start of the movie. He is being followed by the two men, but they have trouble tailing him. The surveillance team, still off but near Michael's trail, detonates the remote bomb while he is out of the car; to view the horses on the hill just as in the book his son wanted him to read. An unharmed but surprised Michael runs back to his car and throws his personal effects inside, faking his own death.Later, at a U-North board meeting, Karen proposes approval of a new settlement agreement. Michael is waiting for her when she exits the conference and informs her that he has access to copies of the U-North memo and that he knows about her role in Arthur's murder. He goads Karen into offering him $10 million for his silence. Karen reluctantly agrees, prompting Michael to reveal the phone in his pocket that has conveyed their conversation to the police. As he walks away, Karen falls to her knees in shock while detectives rush forward to arrest her. Michael leaves the building and hails a cab; he passes the driver 50 dollars and tells him to \"just drive.\"",
	"links": [
		"https://www.amazon.com/Michael-Clayton-George-Clooney/dp/B00149KENO"
	]
}