{
	"title": "Monster",
	"release_year": "2004",
	"runtime": "24",
	"tags": [
		"Animation",
		"Crime",
		"Drama",
		"netflix"
	],
	"rating": 8.7,
	"votes": 48518,
	"actors": [
		"Hidenobu Kiuchi",
		"Hidenobu Kiuchi",
		"Hidenobu Kiuchi",
		"Liam O'Brien",
		"Liam O'Brien",
		"Eiji Hanawa",
		"Eiji Hanawa",
		"Eiji Hanawa",
		"Mamiko Noto",
		"Mamiko Noto",
		"Mamiko Noto",
		"Nozomu Sasaki",
		"Nozomu Sasaki",
		"Nozomu Sasaki",
		"Yasushi Miyabayashi",
		"Yasushi Miyabayashi",
		"Yasushi Miyabayashi",
		"Karen Strassman",
		"Karen Strassman",
		"Tsutomu Isobe",
		"Richard Epcar",
		"Shiho Kawaragi",
		"Shiho Kawaragi",
		"Shiho Kawaragi"
	],
	"staff": [
		"Naoki Urasawa"
	],
	"cover": "https://m.media-amazon.com/images/M/MV5BOWY4NDkyNzktNjViNy00NmMxLTliYmMtZWJkNDM4YzEzNzA4XkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "Dr. Kenzo Tenma has it all. He is by far the most skilled surgeon at Isler memorial, a well respected doctor amongst his peers and is even engaged to the directors daughter, Eva. But all this changes one fateful day when a young boy and his twin are brought in with a severe head injury. With a very delicate operation on his hands Tenma faces the dilemma of choosing to operate on the young boy or operating on the mayor. Going against his orders Tenma saves the young boys life. This however comes at the cost of losing the mayor and along with it his status at the hospital, relationship with Eva and everything he's worked for. Drunk and depressed one night Tenma angrily approves of his decision believing that \"all life is equal\". The following morning the twins have mysteriously disappeared whilst 3 doctors including the director have been found dead. 9 years later a BKA agent is hot on Tenma's heels believing him to be the lead suspect in the murders. However Tenma is about to be reunited with someone from his past who proves to be the reason behind all the events. Regretting his past decisions Tenma sets off on a quest across Germany to put an end to the consequences his actions have caused whilst along the way meeting characters who give him the courage and motivation to continue down this personal journey to redemption.",
	"links": [
		"https://www.netflix.com/title/81409869"
	]
}