{
	"title": "42",
	"release_year": "2013",
	"runtime": "128",
	"tags": [
		"Biography",
		"Drama",
		"Sport"
	],
	"rating": 7.5,
	"actors": [
		"Chadwick Boseman",
		"T.R. Knight",
		"Harrison Ford",
		"Nicole Beharie",
		"Christopher Meloni",
		"Ryan Merriman",
		"Lucas Black",
		"André Holland",
		"Alan Tudyk",
		"Hamish Linklater"
	],
	"staff": [
		"Brian Helgeland",
		"Brian Helgeland",
		"Thomas Tull",
		"Mark Isham",
		"Don Burgess",
		"Peter McNulty",
		"Kevin Stitt",
		"Victoria Thomas",
		"Richard Hoover"
	],
	"votes": 103983,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTQwMDU4MDI3MV5BMl5BanBnXkFtZTcwMjU1NDgyOQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The story of Jackie Robinson (Chadwick Boseman) and, under the guidance of team executive Branch Rickey (Harrison Ford), Robinson's signing with the Brooklyn Dodgers to become the first African American player to break the baseball color barrier. The story focuses mostly on the 1947 Brooklyn Dodgers season and on Robinson's 1946 season with the Montreal Royals.In 1945, US and the Allied forces have just liberated Europe from Nazi threat. 3 months later, Imperial Japan surrendered as well. African Americans served their country gallantly, but returned home to racism, segregation and Jim Crow law. Organized baseball had no African American players in their professional leagues. African Americans had their own league, which could not compete with the major league teams in terms of money or talent.Brooklyn Dodgers owner Branch Rickey (Harrison Ford) meets with sportswriter Wendell Smith (Andre Holland) regarding wanting to recruit a African American baseball player for his team; Wendell suggests Jackie Robinson of the Kansas City Monarchs. Rickey says that there is no law against it, and he wants to leave his legacy on the game that he loves dearly. Harold Parrott (T. R. Knight) and Clyde Sukeforth (Toby Huss) (The Dodger's coach), both warn Rickey against breaking the game's unwritten code. Rickey argues that New York is full of African American baseball fans and he wants to bring them into the stadiums, as dollars are not black or white.\nJackie Robinson has the reputation of having a temper. He was a commissioned army officer, but was Court Martialed for refusing sit at the back of the bus. Clyde fears that he would argue with the umpires in the league and will be a trouble maker.In 1945, Jackie Robinson and his team, the Kansas City Monarchs (In the African American League), stop by a gas station on I-24 in Missouri. When the attendant refuses Robinson entry to the washroom, Robinson says they will find another station at which to fill up the team bus, and the attendant relents.\nAs Robinson comes out, Clyde approaches him and sends him to Brooklyn for a meeting with Rickey. He is offered a $600/month contract and $3,500 signing bonus, which Robinson accepts after being warned by Rickey he must control his temper if he wants to play. Rickey says that people will not like Robinson and will do anything to provoke a reaction out of him. Rickey says that he wants a ball player with the gut not to fight back. Only react on the field, with the skill of a fine baseball player.\nRobinson proposes to his girlfriend, Rachel (Nicole Beharie), by phone and she accepts.Rachel & Jackie are invited by Rickey to attend the Dodger spring training in Florida. They have to board a plane in New York, but are removed from the flight after Rachel, in a show of defiance, uses a restroom exclusive to white people.Wendell Smith is assigned to Robinson as his chronicler.\nRickey has to play hardball with his coaches (Leo Duroche) and managers (Clay Hopper (Brett Cullen)) to get them to judge Jackie fairly and correctly. During training in Sanford, Robinson stays with Mr Brock (James Pickens Jr.) who says that Robinson is giving hope to all African American ball players in the country.\nFrom the beginning Robinson shows an unique skill in stealing bases and scoring runs.During the spring training in Florida, Jackie & Rachel barely escape a mob attack after receiving advance warning from a white old man, who doesn't want trouble in his town.\nAt a game in Daytona, Florida, he is asked by the local sheriff to leave the game field as he doesn't want African Americans to be playing with white folks in his town. During Dodgers spring training, Robinson earns a spot with the Montreal Royals, the AAA affiliate of the Brooklyn farm system.After a great season there and spring training in Panama, he advances to the Dodgers and is trained as a first baseman. Most of the team soon signs a petition stating they refuse to play with Robinson, but manager Leo Durocher (Christopher Meloni) insists Robinson will play. Durocher is then suspended (for having a mistress on the side, which was reported in the press & then picked up by the Baseball commissioner Happy Chandler (Peter MacKenzie), who is also a staunch catholic), leaving the Dodgers without a manager. Rickey gets Burt Shotton (Max Gail), the retired manager from another baseball club, to come out of retirement to manage the Brooklyn Dodgers.In a game against the Philadelphia Phillies, manager Ben Chapman (Alan Tudyk) taunts Robinson, causing him to go back to the dugout and smash his bat to vent his anger. With encouragement from Rickey, Robinson then returns to the field and hits a single, steals second and third base, and scores the winning run.\nWhen Chapman's behavior toward Robinson generates bad press for the team, the Phillies' owner requires him to pose with Robinson for newspapers and magazine photos.\nLater, Robinson's teammate, Pee Wee Reese (Lucas Black), comes to understand the pressure Robinson is facing, and makes a public show of solidarity, standing with his arm around Robinson's shoulders before a hostile crowd in Cincinnati.In a game against the St. Louis Cardinals, Enos Slaughter spikes Robinson on the back of the leg with his cleats. The Dodgers want revenge, but Robinson calms them and insists they focus on winning the game.Robinson's home run against Pittsburgh Pirates pitcher Fritz Ostermueller (Linc Hand), who had earlier hit him in the head, helps clinch the National League pennant for the Dodgers, sending them to the World Series, which they would lose in seven games to the New York Yankees.A concluding postscript describes how Rickey, Robinson, and many of his teammates went on to have distinguished careers, including inductions into the Baseball Hall of Fame. The notes also describe the entrance of other African Americans into the Major Leagues, beginning with the season after Robinson's debut.",
	"links": []
}