{
	"title": "Flags of Our Fathers",
	"release_year": "2006",
	"runtime": "135",
	"tags": [
		"Action",
		"Adventure",
		"Drama",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Ryan Phillippe",
		"Barry Pepper",
		"Joseph Cross",
		"Jesse Bradford",
		"Adam Beach",
		"John Benjamin Hickey",
		"John Slattery",
		"Jamie Bell",
		"Paul Walker",
		"Robert Patrick"
	],
	"staff": [
		"Clint Eastwood",
		"William Broyles Jr.",
		"Paul Haggis",
		"James Bradley",
		"Ron Powers",
		"Clint Eastwood",
		"Robert Lorenz",
		"Steven Spielberg",
		"Clint Eastwood",
		"Tom Stern",
		"Joel Cox",
		"Phyllis Huffman",
		"Henry Bumstead"
	],
	"votes": 130195,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTU2MjYxMjMyMF5BMl5BanBnXkFtZTYwMzAwMDc3._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "As three US servicemen - Marine Private First Class Ira Hayes, Private First-Class Rene Gagnon, and Navy Corpsman John \"Doc\" Bradley are feted as heroes in a war bond drive, they reflect on their experiences via flashback.After training at Camp Tarawa in Hawaii, the 28th Marine Regiment 5th Marine Division sails to the small island of Iwo Jima as part of an invading armada. Tough Japanese resistance is expected, and the Navy bombards suspected Japanese positions for three days. Sergeant Mike Strank is put in charge of Second Platoon.The next day, February 19, 1945, the Marines land in Higgins boats. The beaches are silent and Private First Class Ralph \"Iggy\" Ignatowski wonders if the defenders are all dead, before Japanese heavy artillery and machine guns open fire on the advancing Marines and the Navy ships. Casualties are heavy but the beaches are secured.Two days later the Marines attack Mount Suribachi under a rain of Japanese artillery and machine gun fire, as the Navy bombards the mountain. Doc saves the lives of several Marines under fire, which later earns him the Navy Cross. Finally, the mountain is secured.On February 23, the platoon under command of Sergeant Hank Hansen is ordered to climb Mount Suribachi. They reach the top and hoist the United States flag atop the mountain to cheers from the beaches and the ships. Secretary of the Navy James Forrestal, who witnesses the flag raising as he lands on the beach, requests the flag for himself. Colonel Chandler Johnson decides his 2nd Battalion deserves the flag more. Rene is sent up with Second Platoon to replace the first flag with a second one for Forrestal to take. Mike, Doc, Rene and three other marines (Corporal Harlon Block, Private First-Class Franklin Sousley and Private First Class Ira Hayes), are photographed by Joe Rosenthal as they raise the second flag.On March 1, Second Platoon are ambushed from a Japanese machine gun nest. During the fight over the nest Mike is hit by a U.S. Navy shell and dies from his wounds. Later that day Hank is shot in the chest and dies almost instantly, and Harlon is killed by machine gun fire.Two nights later while Doc is helping a wounded Marine, Iggy is abducted by Japanese troops and dragged into a tunnel. Doc finds his viciously mangled body a few days later. On March 21 Franklin is killed by machine gun fire and dies in Ira's arms. Of the eight men in the squad only three are left: Doc, Ira and Rene. A few days after Franklin's death, Doc is wounded by artillery fire while trying to save a fellow corpsman. He survives and is sent back home. On March 26, the battle ends and the U.S. Marines are victorious.After the battle the press gets hold of Rosenthal's photograph. It is a huge morale booster, and newspapers all over the country ask for prints. Rene is asked to name the six men in the photo: he identifies himself, Mike, Doc and Franklin, but misidentifies Harlon as Hank. Rene believes that Ira is the sixth man in the photograph; when he tells Ira this, Ira furiously denies it, insisting that it was Harlon in the photograph, not him. Rene pleads with Ira that as flag raisers they will both be sent home, but Ira reacts by holding a bayonet to Rene's throat, telling Rene he will kill him if he names Ira as the man in the photograph. Rene initially refuses to identify the sixth man but when he is threatened with being sent back to the fighting, he names Ira.Doc, Ira and Rene are sent home as part of the seventh bond tour drive to raise money for the war effort. When they arrive to a hero's welcome in Washington, Doc notices that Hank's mother is on the list of mothers of the dead flag raisers. Ira angrily denounces the bond drive as a farce. The men are reprimanded by Bud Gerber of the Treasury Department, who tells them that the country cannot afford the war and if the bond drive fails the U.S. will abandon the Pacific and their sacrifices will be for nothing. The three agree not to tell anyone that Hank was not in the photograph.As the three are sent around the country to raise money and make speeches, Ira is guilt-ridden, facing discrimination as a Native American and haunted by memories of the battle. He descends into alcoholism and throws up one night in front of General Alexander Vandegrift, commandant of the Marine Corps. A furious Vandegrift orders to have Ira sent back to his unit and the bond drive continues without him.After the war, the three survivors return to their homes. Ira still struggles with alcoholism and is never able to escape his unwanted fame. One day after being released from jail, he hitchhikes over 1,300 miles to Texas to see Harlon Block's family. He tells Harlon's father that his son was indeed at the base of the flag in the famous photograph. In 1954, the USMC War Memorial is dedicated and the three flag raisers see each other one last time. In 1955 Ira dies of exposure after a night of drinking. That same year Doc drives to the town where Iggy's mother lives to tell her how Iggy died, though it is implied that he does not tell her the truth. Rene attempts a business career but finds that the opportunities and offers he received during the bond drive are rescinded. He spends the rest of his life as a janitor. Doc, by contrast, is successful. He buys a funeral home and runs it for the rest of his life. In 1994, on his deathbed, he tells his story to his son James and in a final flashback to 1945, the men swim in the ocean after raising the flags.",
	"links": [
		"https://www.amazon.com/Flags-Our-Fathers-Ryan-Phillippe/dp/B000QUTK6Y"
	]
}