{
	"title": "300",
	"release_year": "2006",
	"runtime": "117",
	"tags": [
		"Action",
		"Drama",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Gerard Butler",
		"Lena Headey",
		"David Wenham",
		"Dominic West",
		"Vincent Regan",
		"Michael Fassbender",
		"Tom Wisdom",
		"Andrew Pleavin",
		"Andrew Tiernan",
		"Rodrigo Santoro"
	],
	"staff": [
		"Zack Snyder",
		"Zack Snyder",
		"Kurt Johnstad",
		"Michael B. Gordon",
		"Frank Miller",
		"Mark Canton",
		"Bernie Goldmann",
		"Gianni Nunnari",
		"Jeffrey Silver",
		"Tyler Bates",
		"Larry Fong",
		"William Hoy",
		"Carrie Hilton",
		"Jim Bissell"
	],
	"votes": 873396,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjc4OTc0ODgwNV5BMl5BanBnXkFtZTcwNjM1ODE0MQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "300 starts with a voice over explaining how Spartan boys turn into real Spartan men. When the child is born, he is observed thoroughly by a Spartan baby inspector over a cliff where hundreds of feet below lay the bones of dead babies who did not make the cut. If there are any signs of weakness, sickness, or problems with the baby, he will be killed. The boys learn how to fight and train at an early age and when they turn seven, they are separated from their mothers where they train some more and go through an initiation of rights before they can return home.Life is moving along in Sparta when a Persian messenger rides through the city and asks to speak to King Leonidas (Gerard Butler). The messenger and his guards are led to the King where he explains that he is here on behalf of Xerxes, the Persian god/ king who wants the people of Sparta to bow down to him. When Queen Gorgo (Lena Headey) makes a comment, the messenger gets upset and asks how a woman can talk like that among men. The messenger warns King Leonidas to carefully think before he replies to what Xerxes has asked of Sparta, but the King turns on the messenger and points his spear in his face, making the Persian back up to the edge of the black pit. Leonidas roars back \"this is Sparta\" before he shoves the Persian (and his guards) into the pit.There is a law among Sparta where if the King wants to go to war, he has to consult the Oracle and the Ephors, who are \"more creature than man\". The Oracle is the most beautiful young girl of Sparta, and her beauty is also her curse as she is forced to stay up in the mountains with these ugly Ephors, most of the time drugged or drunk, to be able to tell these truths or futures.Leonidas climbs the mountains and after giving the Ephors gold and explaining his plan to go North to corner Xerxes's army, he asks what the Oracle says. The Ephors say that he cannot go to war when there is a celebration coming up anyways. The King is upset as he cannot just sit and do nothing.\nCouncilmen, Theron (Dominic West), paying the Ephors with gold (from the Persians) for telling the King that he cannot go to war. King and Queen do not trust Theron, and rightly so as he turns out to be a traitor to Sparta.The next morning, Leonidas and his Captain (Vincent Regan) are looking through his \"army\" of 300. He notices that one of the men is the captain's son and the King comments that he is too young and has not fully enjoy the \"warmth of a woman\", but the Captain insists that he fight. Theron and the other councilmen join the King and ask what he is doing.The King says he's merely out for a stroll and that these 300 men are just his personal bodyguards. Theron sarcastically asks where the King will be walking to and he replies to the North. The Persians are coming from the sea. On the beach there is a narrow opening, the sides surrounded by huge rocks. There is no other way for the enemy to get through except via the narrow opening. That's where the King and his 300 Spartans will be.While they are marching out they meet with another group - the Arcadians. The leader of the Arcadians says they heard that Sparta was going out to fight against Xerxes and they are here to join. Meanwhile the Queen wants to talk to the councilmen to ask if they will send an army to help Leonidas fight against the Persian army. She has one of the councilmen try to set up the meeting and he says that she will be able to speak in two days. She says that the King may not have two days.When the group finally get to the beach area the Arcadians are starting to doubt themselves when they see how many Persian boats are in the ocean. That night, a huge storm turns over and destroy some of those boats, but the number of boats seemed to have not diminish. As they are setting up a wall of stone, someone from Xerxes's army comes up to demand, once again that Sparta bow on their knees. Xerxes admires their arrogance and strength and promise that Sparta will be the wealthiest city and that he will leave the city's women and children alone if only they lay down their weapons and look to him as leader. One of the Spartans cuts off the messenger's arm and orders him to tell Xerxes that the fight is on! Some of the Spartans notice that someone is following them. It turns out to be Ephialtes, a hunched back monster who wants to help fight.He warns the King that there is another opening that the Persians can get through. He has a strong thrust with his spear but cannot raise up the heavy shield he carries. The King says he cannot fight with the Spartans, because the Spartans use their shields to cover not only themselves, but also cover the man to their left and since Ephialtes cannot raise his shield, he is of no use. Ephialtes gets extremely upset.In the first battle, In the narrow opening they stand and wait while the first group of Persian armies come out to fight. They easily beat that army killing all and losing no one. While they catch their breath, the rest of the Persian army shoots out so many arrows that they block the sunlight. In unity, the Spartans fend off the arrows with their shields. Xerxes comes out to meet with Leonidas. Xerxes is a seven-foot bald and pierced god/ king. He again offers Leonidas a chance to bow down to him. Xerxes is angry and says that he can wipe out Sparta and no one on earth will ever know about them, will never know who they are.The next battle is against the Immortals. The Spartans easily defeat these enemies, though they do lose some of their men. As Xerxes watches on, the narrator says that this god-like deity feels a human chill go up his spine. The next fights have the Persians bringing on as much power as they can using rhinos, magic, elephants from halfway around the world, monsters. When Xerxes sees the army losing, he \"disciplines\" his generals by chopping off their heads. During one of these battles, the Captain's son's head gets chopped off and he cries out as his heart is broken. While both sides retreat once again, King Leonidas calls out to one of his men, Dilios, who got hurt in one of the fights. He asks how Dilios is, which he replies, \"it's just an eye\". The King asks him to return home to tell the tale of Sparta, to tell everyone, all the Greeks his story and his 300 men. He knows that they are going to die and though he is sad he will not see his wife, he is happy to be doing what he is doing, for Sparta. He gives back the necklace his wife gave him to Dilios to return to her.Meanwhile the Queen is meeting with Theron. She offers him something to drink to which he asks if it's poison. He says that the councilmen will never allow an army to go to the King and he insinuates that he can persuade them to if she sleeps with him. She allows it and he roughly starts to have sex with her.Ephialtes has gone to Xerxes. In the tent there are belly dancers, concubines, contortionists, transsexuals, slaves, etc. He is in awe of everything Xerxes has to offer, wealth, women, a chance to fight if only he bows down to him. Ephialtes, mesmerized by everything, agrees and tells him about the second opening where the Persian army can easily overpower the Spartans.The next day the Queen gets to meet with the councilmen. She gives a great speech to why they should allow the army to go and help the King. When she ends her speech Theron sarcastically applauds her. He turns against her by saying that why should anyone listen to her as she is an adulteress. He tells everyone that she came on to him and offered herself to him but that he is an honest man and turned her down. She grabs one of their swords and stabs Theron in the stomach. When she pulls out the sword his money pouch also comes free and as he falls, so do the Persian coins that he's been bribed with. The other councilmen pick one of the coins up and realize he's a traitor and word spreads quickly.The Persian army is surrounding the 300. Once again Xerxes comes out to watch and one of his minions asks Leonidas to bow down to Xerxes. But this time Leonidas actually takes off his head gear and puts down his shield and spear and kneels down. But only to compose himself as his huddled group of Spartan men break way and one member runs up and jumps on Leonidas's back to spear that minion to death. As everyone starts fighting again, the King picks up his spear and throws it where it slices through Xerxes' cheek (but does not kill him). Xerxes is surprised and holds his hand up to his bleeding face. One by one the Spartans fall, even the King. One of them tells him that it is an honor to die at his side to which the King replies that it was an honor to live at his side. After facing the sun and saying his last words (\"my love\"), the rest of the Persian army kills him, and they make sure all the Spartans are dead by shooting a gazillion arrows into the air again.Dilios returns home to give the Queen the necklace and he spreads the word about their \"victory\". It ends one year later where Dilios looks like he's the leader of the Spartan army now and they are getting ready to fight the Persians again. But this time there are thousands and thousands of Spartans and on command they run for battle.",
	"links": [
		"https://www.amazon.com/300-Gerard-Butler/dp/B000TYWAUA"
	]
}