{
	"title": "Ocean's Thirteen",
	"release_year": "2007",
	"runtime": "122",
	"tags": [
		"Crime",
		"Thriller",
		"amazon"
	],
	"rating": 6.9,
	"actors": [
		"George Clooney",
		"Brad Pitt",
		"Matt Damon",
		"Matt Damon",
		"Michael Mantell",
		"Elliott Gould",
		"Ray Xifo",
		"Al Pacino",
		"Adam Lazarre-White",
		"Eddie Jemison",
		"Don Cheadle"
	],
	"staff": [
		"Steven Soderbergh",
		"Brian Koppelman",
		"David Levien",
		"George Clayton Johnson",
		"Jack Golden Russell",
		"Jerry Weintraub",
		"David Holmes",
		"Steven Soderbergh",
		"Stephen Mirrione",
		"Debra Zane",
		"Philip Messina"
	],
	"votes": 371022,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTMyNTc1NzY5MV5BMl5BanBnXkFtZTcwNDM4NTQzMw@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Reuben Tishkoff (Elliott Gould), in an attempt to legitimize himself in his later years, is conned by Willy Bank (Al Pacino), his former business partner. When Bank forces Reuben to sign over the ownership rights of the new hotel-casino they were building together, Reuben suffers a heart attack and becomes bedridden. Daniel Ocean (George Clooney), after attempting to negotiate with Bank, gathers his partners-in-crime and plans to ruin Bank on the opening night of his hotel-casino, \"The Bank\", to get revenge for Reuben.The first of two plans are to prevent \"The Bank\" from winning the prestigious Five Diamond Award, which all of Bank's previous hotels have won. Saul Bloom (Carl Reiner) poses as the reviewer of the board, while the real reviewer (David Paymer) is treated horribly during his stay through Ocean's associates and the staff on their payroll.The second plan is to rig the casino's slot machines and other games to force a payout more than $500 million in winnings across the casino; this will force Bank to cede control of the casino to his board. Rigging of the games would require the group to defeat \"The Greco Player Tracker,\" a state-of-the-art artificial intelligence system that monitors the games and ensures that all winnings are legitimate by measuring the players' bio-metric responses, such as pupil dilation and body temperature, for authenticity. They plan to trick Bank into carrying a cell phone with a Magnetron, created by technical expert Roman Nagel (Eddie Izzard), to disrupt the Greco. To ensure that the Greco shuts down and players cash out, Ocean's team acquires one of the giant drills used to bore the Channel Tunnel to simulate an earthquake under the hotel on opening night.While the group prepares the rigged games, the drill breaks, forcing them to approach Terry Benedict (Andy García), the antagonist of Ocean's Eleven, to fund the purchase of the second drill. As Benedict has a grudge against Bank and is willing to help, he offers Ocean the funds only if they also steal the four necklaces Bank bought for his wife in representation of the four Five Diamond Awards, now on display in a secured case at the top of the hotel. Linus Caldwell (Matt Damon) offers to seduce Bank's assistant, Abigail Sponder (Ellen Barkin), to gain access to the display and switch the diamonds with fakes, and the group accepts.As Ocean's plan proceeds on opening night, agents from the FBI have been informed that machines have been rigged by Livingston Dell (Eddie Jemison) and have identified him, which may reveal the rest of Ocean's gang to Bank. In reality this allows Livingston to have the card-shuffling machines replaced by Roman Nagel (Eddie Izzard), as he himself was unable to effectively rig them. Basher (Don Cheadle) distracts Bank long enough to allow Virgil (Casey Affleck) and Turk Malloy (Scott Caan) to change the group's FBI records, including their names and appearances.Linus, in the process of seducing Sponder in the secure room with the diamonds, is interrupted by the lead FBI agent. The agent explains the diamond theft plan to Sponder, and Linus is arrested, but as they exit in the elevator, the lead agent is revealed to be his father, Robert 'Bobby' Caldwell (Bob Einstein), once a master robber and con artist, who is in on Ocean's plan and there to help Linus swap the diamonds. As they exit to the roof of the hotel for extraction of the diamonds via helicopter, they are caught by François \"The Night Fox\" Toulour (Vincent Cassel), whom Benedict had ordered to intercept the diamonds. Linus gives the diamonds to Toulour, who leaves but after departing discovers that he holds only the fakes; Ocean, who had been aware of Toulour's presence, had arranged to extract the entire display case from the hotel.The remainder of Ocean's plan continues as expected, with \"The Greco\" disrupted, and guests leaving the hotel with their massive winnings. As Bank realizes his ruin, Ocean lets him know that they did everything for Reuben, taunting him about the fact that Bank cannot even arrange for revenge as he cannot prove that Ocean did anything illegal. The group uses the money they made off with to buy property north of the Las Vegas Strip for Reuben. As punishment for Benedict's treachery, Ocean donates his portion of the take to charity, all $72 million, forcing Benedict to publicly admit his philanthropy via television appearances.As the group disperses on their own and considers settling down, Rusty (Brad Pitt) ensures that the real Five Diamond reviewer, who suffered numerous discomforts during his stay at the hotel, is compensated by allowing him to win the jackpot on a rigged slot machine at the airport.",
	"links": [
		"https://www.amazon.com/Oceans-Thirteen-George-Clooney/dp/B000Z8KAUM"
	]
}