{
	"title": "There Will Be Blood",
	"release_year": "2007",
	"runtime": "158",
	"tags": [
		"Drama",
		"amazon"
	],
	"rating": 8.2,
	"actors": [
		"Daniel Day-Lewis",
		"Paul Dano",
		"Paul Dano",
		"Ciarán Hinds",
		"Martin Stringer",
		"Matthew Braden Stringer",
		"Jacob Stringer",
		"Joseph Mussey",
		"Barry Del Sherman",
		"Harrison Taylor",
		"Stockton Taylor"
	],
	"staff": [
		"Paul Thomas Anderson",
		"Paul Thomas Anderson",
		"Upton Sinclair",
		"Paul Thomas Anderson",
		"Daniel Lupi",
		"JoAnne Sellar",
		"Jonny Greenwood",
		"Robert Elswit",
		"Dylan Tichenor",
		"Cassandra Kulukundis",
		"Jack Fisk"
	],
	"votes": 650184,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjAxODQ4MDU5NV5BMl5BanBnXkFtZTcwMDU4MjU1MQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1898, Daniel Plainview (Daniel Day-Lewis), a prospector in New Mexico, mines a potentially precious ore vein from a pit mine hole. In the process of dynamiting the lode, he falls and breaks his leg. With the silver sample, he climbs out of the mine, drags himself to an assay office, and receives a silver and gold certificate claim. In 1902, he discovers oil near Los Angeles and establishes a drilling company. Following the death of a worker in an accident, Daniel adopts the man's orphaned son. He refers to the child, H. W. (Dillon Freasier), as his business partner, which allows him to present himself to potential investors as a family man.In 1911, Daniel is approached by Paul Sunday (Paul Dano), who tells him of an oil deposit under his family's property in Little Boston, California. Daniel attempts to buy the farm at a bargain price. However, Paul's twin brother (Paul Dano), Eli, demands $10,000 for the church, of which he is pastor. An agreement is made for $5,000 after the well begins producing, and Daniel acquires all the available surrounding land, except for one holdout: William Bandy (Hans Howes). Oil production begins, but an accident kills a worker and a gas blowout deafens H. W (Russell Harvard). Eli blames the disasters on the well not being properly blessed (Daniel refused Eli's offer to bless the well at its inauguration in front of the whole town). When Eli demands the $5,000 that Daniel still owes, Daniel beats and humiliates him. At the dinner table, Eli berates his father for trusting Daniel.A man arrives at Daniel's doorstep claiming to be his half-brother, Henry (Kevin J. O'Connor). Daniel hires Henry and the two grow close. H. W. sets fire to their house, intending to kill Henry. Angry, Daniel sends him away to a school for the deaf in San Francisco. A representative from Standard Oil offers to buy out Daniel's local interests, but Daniel strikes a deal with Union Oil and constructs a pipeline to the California coast, though the Bandy ranch remains an impediment.While reminiscing about his childhood, Daniel becomes suspicious about Henry's story and one night quizzes him about it at gunpoint. \"Henry\" confesses that he was a friend of the real Henry's, who died from tuberculosis, and that he learned the details of Henry's life by reading his personal journal. In a fit of rage, Daniel murders the impostor and buries his body. The next morning, Daniel is awakened by Bandy, who knows of the previous night's events and wants Daniel to repent. He also wants Daniel to baptize and that's the only way he will allow Daniel to build the pipeline. At the church, as part of Daniel's baptism, Eli humiliates him, strikes him, and makes him confess to having abandoned his son, before announcing to the congregation that Daniel will be making a large donation to the church. With the pipeline underway, Daniel arranges for the still angry H. W. to return, while Eli leaves town for missionary work.In 1927, H. W. marries Mary (Colleen Foy), Eli and Paul's sister. Daniel, now extremely wealthy but suffering from alcoholism, lives as a recluse in a large mansion. Through a sign language interpreter, H. W. asks Daniel to dissolve their partnership so that H. W. can establish his own oil company in Mexico. Daniel reacts brutally, mocks H. W.'s deafness, and reveals H. W.'s true origins as an orphan. H. W. thanks God he has \"none of Daniel in him\" and leaves.Eli visits Daniel, who is drunk, in Daniel's private bowling alley. Eli, now a radio preacher, offers to sell Daniel drilling rights on the land of William Bandy, who has recently died. Daniel agrees on the condition that Eli denounce his faith and his own credibility. Eli reluctantly does so. Daniel reveals that the property is now worthless because he has already drained its oil by slant drilling from surrounding wells. Shaken, Eli confesses to being in dire financial straits and to having strayed morally. Daniel taunts him, chases him around the bowling alley, and beats him to death with a bowling pin. When his butler enters the room, he finds Daniel sitting on the floor as he mutters \"I'm finished!\"",
	"links": [
		"https://www.amazon.com/There-Will-Blood-Paul-Dano/dp/B0017I91LI"
	]
}