{
	"title": "Spider-Man 3",
	"release_year": "2007",
	"runtime": "139",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Tobey Maguire",
		"Tobey Maguire",
		"Kirsten Dunst",
		"Topher Grace",
		"Topher Grace",
		"Thomas Haden Church",
		"Thomas Haden Church",
		"James Franco",
		"James Franco",
		"Bryce Dallas Howard",
		"Rosemary Harris",
		"J.K. Simmons",
		"James Cromwell",
		"Theresa Russell"
	],
	"staff": [
		"Sam Raimi",
		"Sam Raimi",
		"Ivan Raimi",
		"Alvin Sargent",
		"Stan Lee",
		"Avi Arad",
		"Grant Curtis",
		"Laura Ziskin",
		"Christopher Young",
		"Bill Pope",
		"Bob Murawski",
		"Kathy Driscoll",
		"Francine Maisler",
		"J. Michael Riva",
		"Neil Spisak"
	],
	"votes": 648640,
	"cover": "https://m.media-amazon.com/images/M/MV5BODE2NzNhMDctYjUzMC00Y2M5LWI2Y2EtODJkZTFjN2Y5ODlmXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Peter Parker (Tobey Maguire) has finally begun to feel secure in his life and plans to propose to Mary Jane Watson (Kirsten Dunst), who has just recently made her Broadway musical debut. While Peter and Mary Jane are on a date, a small meteorite crashes nearby, and an extraterrestrial Symbiote attaches itself to Peter's moped. Meanwhile, while being pursued by the police, escaped convict Flint Marko (Thomas Haden Church) falls into a particle accelerator, which fuses his body with the surrounding sand. The result allows him to shape-shift at will, becoming the Sandman.\nPeter's best friend, Harry Osborn (James Franco), who seeks vengeance for his father's death, which he believes Peter caused, attacks him using new weapons adapted from the Green Goblin technology his father had left behind. During the scuffle, Harry injures his head and suffers from partial amnesia, making him forget his feud and the fact that Peter is Spider-Man.Later, during a festival honoring Spider-Man for saving Gwen Stacy's (Bryce Dallas Howard) life, Sandman attempts to rob an armored car, and overpowers Spider-Man. NYPD Captain George Stacy (Gwen's father) (James Cromwell) later informs Peter and Aunt May (Rosemary Harris) that Ben Parker's killer was actually Flint Marko, and that the now-deceased Dennis Carradine (Michael Papajohn) was merely an accomplice.\nA vengeful Peter waits for Marko to strike again as the Symbiote bonds with his costume while he is asleep. Peter wakes up hanging from a skyscraper in central Manhattan and discovers that not only has his costume changed, but his powers have been enhanced as well. The symbiotic black suit brings out the more vengeful, selfish and arrogant side of Peter's personality. Wearing the new suit, Spider-Man locates Marko, fights him in a cavernous underground subway tunnel and, upon discovering that water can dissolve Marko's body, rips open a large water pipe to deliver what he believes to be a lethal torrent of water, reducing the Sandman to mud.The shift in Peter's personality alienates Mary Jane, whose career is floundering, and she finds solace with Harry. Harry recovers from his amnesia and, urged on by an apparition of his dead father, forces Mary Jane to break up with Peter. After Mary Jane leaves Peter, stating she is in love with another guy, Harry meets him at a restaurant and claims to be the other guy. Later, Peter confronts him at the Osborn mansion.With the help of the black suit, Peter is victorious in a brutal fight, which leaves Harry's face disfigured due to an explosion from one of his own pumpkin bombs. Influenced by the suit, Peter exposes and humiliates Eddie Brock (Topher Grace), a rival freelance photographer, who has just gained overnight star status at the Daily Bugle by submitting doctored photographs from one of Marko's heists supposedly exposing Spider-Man as a criminal; furious at now having to print a retraction, J. Jonah Jameson (J. K. Simmons) fires Eddie. Peter changes how he dresses and alters his hairstyle and begins to behave arrogantly. Meanwhile, the Sandman recovers from his injuries, having survived Spider-Man's attack.In an effort to make Mary Jane jealous, Peter brings Gwen to the nightclub where Mary Jane works. Gwen catches on to the ploy and storms out leaving Peter to confront Mary Jane. During this, he gets into a fight with the club's bouncers and accidentally slaps Mary Jane, knocking her to the floor. Peter realizes the Symbiote is changing him for the worse. He walks out of the nightclub and goes to a church bell tower to dispose of it. Initially, he is unable to remove the suit, but the alien eventually weakens due to the loud sounds of the bell, enabling Peter to break free. Eddie Brock, by chance, is at the same church praying for Peter's death when the Symbiote falls from the tower and takes over his body. Eddie, now reincarnated as Venom, finds the Sandman and suggests joining forces to destroy Spider-Man, to which the Sandman agrees.The pair put Mary Jane in a taxicab and hang it from a gigantic web above a construction site filled with sand. Peter approaches Harry for help but is turned down. However, Harry learns the truth about his father's death from his butler Bernard and arrives in time to rescue Peter; they form an alliance against the two villains. As the fight progresses, Harry temporarily subdues a gigantic, monstrous incarnation of the Sandman, and Venom attempts to impale Peter with Harry's glider, but Harry jumps in the way and is mortally wounded, suffering the same fate as his father. During his fight with Venom, Peter notices that the resonance made by falling pipes to distress the Symbiote, and recalling how the church bell's toll weakened it, creates a ring of pipes around Venom to make a fence of sonic vibrations. The alien succumbs to so much pain that it releases Brock, and Peter pulls Eddie away from it with a string of web. Peter throws one of Harry's pumpkin bombs at the Symbiote, but Eddie jumps into the ring in an attempt to bond again with it, and they are both killed in the resulting explosion.After the battle, Flint Marko recovers and tells Peter that he had no intention of killing Ben Parker, but rather, shot him by accident when Dennis grabbed his arm, and that it was an accident born out of a desperate attempt to save his dying daughter's life. He claims that Ben Parker's death has haunted him ever since then. Peter forgives Marko, who dissipates and floats away. Peter and Harry forgive each other before Harry dies with Mary Jane and Peter at his side.They attend Harry's funeral along with Aunt May, Bernard, and the Stacys. A few days later, Peter walks into the jazz bar where Mary Jane is singing. They embrace, begin to dance and begin to reconcile their relationship.",
	"links": [
		"https://www.amazon.com/Spider-Man-Set-4K-UHD/dp/B09MDGXW8F"
	]
}