{
	"title": "Reign Over Me",
	"release_year": "2007",
	"runtime": "124",
	"tags": [
		"Drama",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Adam Sandler",
		"Don Cheadle",
		"Jada Pinkett Smith",
		"Liv Tyler",
		"Saffron Burrows",
		"Donald Sutherland",
		"Robert Klein",
		"Melinda Dillon",
		"Mike Binder",
		"Jonathan Banks"
	],
	"staff": [
		"Mike Binder",
		"Mike Binder",
		"Jack Binder",
		"Michael Rotenberg",
		"Rolfe Kent",
		"Russ T. Alsobrook",
		"Steve Edwards",
		"Jeremy Roush",
		"Sharon Bialy",
		"Christian Wintter"
	],
	"votes": 100079,
	"cover": "https://m.media-amazon.com/images/M/MV5BOTYyMTExNTgwNF5BMl5BanBnXkFtZTcwMDY4MTEzMw@@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "When the Twin Towers went down in 2001, Charlie Fineman (Adam Sandler) lost everything important in his life. Five years have passed since Charlie's wife and daughters died (They were on the plane that crashed into the twin towers), and now the once successful and sociable man has become a withdrawn shadow of his former self. He does not discuss his loss, causing his in-laws (Jonathan Timpleman (Robert Klein), Charlie's father in-law & Ginger Timpleman (Melinda Dillon), Charlie's mother in-law) to worry for his sanity, believing that he has struck the tragedy from his mind.When fate brings Charlie and his former college roommate Alan Johnson (Don Cheadle) together once again on a Manhattan Street corner, Alan is shocked to see just how far his old friend has fallen. Charlie's hair is long, and he wears a headset constantly to let music drown out any mentions of his wife and children. Charlie doesn't remember Alan and is not practicing dentistry anymore. He talks about other dimensions, and journeys and so on. He keeps changing the colors of his walls & remodels the house, to keep himself busy. Has a vinyl record collection of 5500 records. He plays drums at a bar band.\nAdell Modell (Rae Allen), Charlie's protective landlady keeps Charlie away from meeting strangers.Though on the surface it would appear that Alan, a successful dentist, has it all, the pressures of a family and career have been weighing heavily on him.\nDonna Remar (Saffron Burrows) is Alan's \"stalker\" patient. Melanie (Paula Newsome) is Alan's protective dental practice receptionist, who tries to keep him away from Donna. Donna offers to give him a blow job during one of his sessions. Alan asks Donna to leave & ask her to find another dentist. Donna sues Alan's practice for sexual harassment and claims Alan abused her. Stelter (Jonathan Banks) is Alan's abrasive dental practice partner and wants Alan to take care of Donna.Alan sees therapist Dr. Angela Oakhurst (Liv Tyler). he wants her treatment but doesn't actually make any appointment. He feels stifled by his wife Janeane Johnson (Jada Pinkett Smith), who wants him to take photography classes with her, while he wants guy hobbies like poker.\nGinger meets Alan and says that Charlie won't meet her or her husband. She fears Adell and Bryan Sugarman (Mike Binder), Charlie's protective best friend prior to the tragedy are taking advantage of Charlie (he is rich, from the insurance money and the Govt handouts to 9/11 survivors)\nAlan spends a lot of time with Charlie (Charlie teaches him how to play video-games, they do all night movie binges), and Janeane objects to this.At a pivotal moment (Alan's father dies all of a sudden) when Charlie and Alan both need a trusted friend, the restorative power of a rekindled friendship provides a lifeline needed to move forward. Peter Saravino (Ted Raimi) is Charlie's lawyer, and he approaches Alan to say that Charlie wants to give him $ 1 MM, but Alan politely refuses. Peter tells Alan that Charlie is friends with Alan, since Alan knows nothing about his family and so he thinks Alan will not ask any questions and just let him be.Charlie comes to Alan's office and feels that Alan has been sent by his in-laws to get Charlie to start his practice again. Charlie goes berserk and rampages Alan's office. Alan is forced to see Donna again, who wants to blow job him again. Alan politely refuses, and Donna breaks down about how she is divorced and her husband of 10 years, cheated on her for 5 of those years together.Alan endeavors to bring Charlie out of his shell by convincing him to see a therapist (Alan arranges for Nigel Pennington (John De Lancie), a \"covert\" therapist to meet Charlie). Charlie sees through Nigel and walks out. But later Charlie agrees to meet a shrink and Alan arranges a meeting with Angela.\nJaneane 's anger grows, and she also insinuates that Alan had sex with Donna to \"make her go away\".Charlie is barely communicative, ending every session after only a couple of minutes. Angela says he needs to tell the story about his family to someone eventually. Charlie soon tells Alan his tragic story, but afterwards tries to commit suicide (He pulls a gun in front of cops to threaten a cabby, hoping that the cops would kill him) and ends up in a psychiatric ward.Charlie tells Alan the last time he spoke to his wife (before she boarded the plane), they argued about remodeling the kitchen and how Charlie complained that he had no time for that. So, Charlie has been remodeling the kitchen ever since. Alan decides to stand up to Stelter and tells him that Alan built the practice and that he is going to take control going forward. He indicates that he might fire a few doctors.Legal proceedings commence, and Judge David Raines (Donald Sutherland) must determine whether to commit Charlie to psychiatric care against his will. Fallon (B. J. Novak), the DA's committal hearing lawyer, repeated shows pics of the dead family to the court and to Charlie. Charlie tries to ignore it, but eventually goes nut in the courtroom. The judge leaves the decision to Charlie's in-laws, asking them to think of what their daughter would want for Charlie.He approaches his in-laws in the lobby of the courthouse, stating that he does not carry pictures nor discuss his family because he sees them every day, in the faces of people walking down the street. They decide that he should not be committed; instead, Charlie moves to a new apartment, leaving behind the painful memories associated with his former home. At the end of the film, Alan visits Charlie for the day and his wife calls and tells him \"I love you and just want you to come home.\"The apartment's doorman brings out Charlie's scooter and tells Alan not to leave stuff lying around. Alan tells the doorman to take it back upstairs, but the doorman does not respond. Not knowing what to do, Alan decides to ride home on the scooter.",
	"links": [
		"https://www.amazon.com/Reign-Over-Me-Adam-Sandler/dp/B000WZ4YCI"
	]
}