{
	"title": "Red Eye",
	"release_year": "2005",
	"runtime": "85",
	"tags": [
		"Thriller",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Rachel McAdams",
		"Cillian Murphy",
		"Brian Cox",
		"Laura Johnson",
		"Max Kasch",
		"Jayma Mays",
		"Angela Paton",
		"Suzie Plakson",
		"Jack Scalia",
		"Terry Press"
	],
	"staff": [
		"Wes Craven",
		"Carl Ellsworth",
		"Dan Foos",
		"Chris Bender",
		"Marianne Maddalena",
		"Marco Beltrami",
		"Robert D. Yeoman",
		"Stuart Levy",
		"Patrick Lussier",
		"Lisa Beach",
		"Sarah Katzman",
		"Bruce Alan Miller"
	],
	"votes": 148927,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzAxNjc1ODczOF5BMl5BanBnXkFtZTcwMjE3MjEzMw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "An elaborate plan is underway with sophisticated components being smuggled through the US disguised as fish shipment, surveillance of a particular suite at a renowned city hotel, and theft of a wallet labeled as \"JR\" with a photo of a daughter and credit cards and other IDs inside.\nLisa works at a prominent city hotel the Lux Atlantic in Miami with colleague Cynthia. Lisa is on leave and Cynthia calls her frequently to get her input with critical guests and customer complaints. Cynthia tells Lisa that the group of Deputy Secretary of Homeland Security Charles Keefe will be arriving the following day at 5 30 am. Charles Keefe has been on record to be tough on domestic terrorism, which he attributes to high influx of illegal immigrants in the Southern states.After attending her grandmother's funeral, Lisa Reisert (Rachel McAdams) arrives at Dallas Love Field to take a red-eye flight back to Miami, Florida. Lisa's father Joe Reisert lives in Miami while her mother moved to Texas when they separated 3 years ago.\nShe meets a handsome young man named Jackson Rippner (Cillian Murphy), also traveling to Miami. While waiting to board, they share a drink at the airport bar and engage in small talk.On the plane is Rebecca (Brittany Oaks), a girl travelling alone, elderly lady (Angela Paton), blonde woman (Laura Johnson), headphone kid (Max Kasch) and his brother (Kyle Gallner).\nCrew is senior flight attendant (Suzie Plakson) and junior attendant (Monica McSwain).\nLisa shares her self-help book with the elderly lady who seemed to be a big fan of the author.To her surprise, Lisa finds Jackson seated beside her. Jackson is in 18F, aisle seat, while Lisa is in 18G, window seat.\nAfter takeoff, his charming demeanor quickly turns sinister as he informs her that he works for a domestic terrorist organization planning to assassinate Charles Keefe (Jack Scalia), the current United States Deputy Secretary of Homeland Security. Lisa's managerial position at the Lux Atlantic Hotel in Miami, where Keefe and his family are staying, is crucial to their plot.Rippner orders Lisa to make a call to move the Keefe family to a suite (from suite 3825 to suite 4080) where a missile launched from a boat in the harbor will strike. Otherwise, her father Joe (Brian Cox) will be killed. As evidence, Jackson presents the stolen wallet of Joe to Lisa. If she screams or tells anyone anything, her dad dies.\nLisa makes several attempts to delay making the call. Lisa tells Jackson that she won't make the call unless she knows that her dad is OK. Jackson allows the call but cuts it after Lisa has spoken a few sentences to Joe.Jackson is then called by the blonde woman to help with her luggage, which is when the elderly lady approaches Lisa for small talk. Lisa takes the book and scribbles a note on it before Jackson can return. But Jackson saw it and headbutts Lisa after he returns to his seat. Jackson then goes to the elderly lady in her seat and retrieves the book, while she is sleeping.The plane hits turbulence and even though Lisa connects to Cynthia, she is not able to complete her instructions as the service is disrupted. Lisa tries to fake completing the call, but Jackson notices that calls have been disrupted throughout the plane.\nLisa goes to the rest room, where she tries to leave a hidden message on the bathroom mirror that says \"18F has bomb\". But Jackson was waiting just outside and erases the message. Jackson tells Lisa to stop gambling with her father's life.Eventually, Lisa calls her co-worker, Cynthia (Jayma Mays) and has her move the Keefe family to the targeted suite. Jackson refuses to call off the hit-man waiting outside Joe's house until the assassination is confirmed. Jackson lets it slip that Jackson's family is travelling with him.As the plane lands at Miami International Airport, Lisa reveals being a victim of a violent sexual assault at knife-point two years earlier, which had resulted in a scar over her breast. After expressing her determination to fight to the end, she stabs Jackson in the throat with a ballpoint pen, grabs his mobile phone, and flees the plane just as it pulls up to the gate.\nJackson gathers himself, pulls the pen out of his throat and follows Lisa out of the plane, shoving the passengers and the attendants out of his way.\nOnce outside, Lisa makes her way to the airport exit and steals an unattended SUV. She calls and tells Cynthia to evacuate the hotel suite. Cynthia, the Keefes, and U.S. Secret Service agents leave the room seconds before a missile destroys it.The cell phone's battery dies as Lisa is calling her father. She hits and kills the hit-man with the car when he shoots at her. Joe is unharmed and has called 9-1-1.Jackson arrives and incapacitates Joe. He pursues Lisa throughout the house. As they struggle, he throws her down the staircase. Lisa retrieves the dead hit-man's gun and shoots Jackson. Wounded, he disarms her and is about to kill her when a revived Joe shoots Jackson with the gun. Lisa returns to the hotel to provide assistance, where Keefe praises both women and thanks them for what they did to save his life with the rest of his family.",
	"links": [
		"https://www.amazon.com/Red-Eye-Rachel-McAdams/dp/B00GD53TKO"
	]
}