{
	"title": "Mamma Mia!",
	"release_year": "2008",
	"runtime": "108",
	"tags": [
		"Comedy",
		"Musical",
		"Romance",
		"max",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Meryl Streep",
		"Pierce Brosnan",
		"Amanda Seyfried",
		"Stellan Skarsgård",
		"Nancy Baldwin",
		"Colin Firth",
		"Heather Emmanuel",
		"Colin Davis",
		"Rachel McDowall",
		"Ashley Lilley"
	],
	"staff": [
		"Phyllida Lloyd",
		"Catherine Johnson",
		"Judy Craymer",
		"Gary Goetzman",
		"Benny Andersson",
		"Björn Ulvaeus",
		"Haris Zambarloukos",
		"Lesley Walker",
		"Priscilla John",
		"Ellen Lewis",
		"Maria Djurkovic"
	],
	"links": [
		"https://www.max.com/movies/mamma-mia/b4aecca5-6559-4755-942b-e95d7d6fce27",
		"https://www.amazon.com/Mamma-Mia-Movie-Meryl-Streep/dp/B001N4RORE"
	],
	"votes": 280931,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTA2MDU0MjM0MzReQTJeQWpwZ15BbWU3MDYwNzgwNzE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "On a Greek island called Kalokairi, 20-year-old bride-to-be Sophie Sheridan (Amanda Seyfried) posts three wedding invitations (\"I Have a Dream\") to different men, who set off for the wedding.Sophie's bridesmaids and best friends, Ali and Lisa (Ashley Lilley and Rachel McDowall), arrive before the wedding. Sophie reveals that she found her mother's diary and learned she has three possible fathers: New York-based Irish architect Sam Carmichael (Pierce Brosnan), Swedish adventurer and writer Bill Anderson (Stellan Skarsgård), and British banker Harry Bright (Colin Firth). She invited them without telling her mother, believing that after she spends time with them she will know who her father is (\"Honey, Honey\"). Villa owner Donna Sheridan (Meryl Streep) is ecstatic to reunite with her former band-mates, wisecracking author Rosie (Julie Walters) and wealthy multiple divorcee Tanya (Christine Baranski), and reveals her bafflement at her daughter's desire to get married. Donna shows off the villa, rumored to be built on the legendary fountain of Aphrodite, and explains her precarious finances to Rosie and Tanya (\"Money, Money, Money\").The three men arrive, and Sophie smuggles them to their room and explains that she, not her mother, sent the invitations. She begs them to hide so Donna will have a surprise at the wedding: seeing the old friends of whom she \"so often\" favorably speaks. They overhear Donna working (humming \"Fernando\") and swear to Sophie they will not reveal her secret.Donna spies them and is dumbfounded to find herself facing former lovers she could never forget (\"Mamma Mia\"), and is adamant that they leave. She confides in Tanya and Rosie (\"Chiquitita\") a secret she has kept from everyone - she is uncertain which of the three men is Sophie's father. Tanya and Rosie rally her spirits by getting Donna to dance with the female staff and islanders (\"Dancing Queen\"). Sophie finds the men aboard Bill's yacht, and they sail around Kalokairi (\"Our Last Summer\") and tell stories of Donna as a carefree girl. Sophie musters up the courage to speak with her fiance Sky (Dominic Cooper) about her ploy, but loses her nerve. Sky and Sophie sing to each other (\"Lay All Your Love on Me\"), but are interrupted when Sky is snatched for his bachelor party.At Sophie's hen party, Donna, Tanya and Rosie perform as Donna and The Dynamos (\"Super Trouper\"). Sophie is delighted to see her mother rock out, but becomes nervous when the festivities are interrupted by the arrival of Sam, Bill and Harry. She decides to talk with each of her three prospective dads alone. While her girlfriends dance with the men (\"Gimme! Gimme! Gimme! (A Man After Midnight)\"), Sophie learns from Bill that Donna received the money to invest in her villa from his great aunt Sofia. Sophie guesses she must be Sofia's namesake and Bill is her father. She asks him to give her away and to keep their secret from Donna until the wedding. Sophie's happiness is short-lived as Sam and Harry each tell her they must be her dad and will give her away (\"Voulez-Vous\"). A shocked Sophie cannot tell them the truth and, overwhelmed by the consequences of her actions, faints.In the morning, Rosie and Tanya reassure Donna they will take care of the men. On Bill's boat, Bill and Harry are about to confide in each other, but are interrupted by Rosie. Donna confronts Sophie in the courtyard, believing Sophie wants the wedding stopped. Sophie says that all she wants is to avoid her mother's mistakes and storms off. An upset Donna is accosted by Sam, concerned about Sophie getting married so young. Donna confronts him and both realize they still have feelings for each other (\"SOS\").Down on the beach, Tanya and young Pepper (Philip Michael) continue their flirtations from the previous night (\"Does Your Mother Know\"). Sophie confesses to Sky and asks for his help. He reacts angrily to his fiance's deception and Sophie turns to her mother for support. As Donna helps her daughter dress for the wedding, their rift is healed and Donna reminisces about Sophie's childhood and how quickly she has grown (\"Slipping Through My Fingers\"). Sophie asks Donna to give her away. As the bridal party walks to the chapel, Sam intercepts Donna and begs her to talk. She reveals the pain she felt over losing him (\"The Winner Takes It All\").When Sophie and Donna are walking down the aisle, the band plays the tune of \"Knowing Me, Knowing You\". Donna tells Sophie that her father is present but he could be any of the three men, whom Sophie admits to inviting. Sam reveals that although he left to get married, he did not go through with it, and returned only to find Donna with another man. Harry confesses that Donna was the first and last woman he loved, and reveals he has begun a relationship with a waiter from the Taverna. The three men concur that they would be happy to be one-third of a father for Sophie. She tells Sky that they should postpone their wedding and travel the world as they have wanted. Sam proposes to Donna (\"I Do, I Do, I Do, I Do, I Do\"). She accepts and they are married. At the wedding reception, Sam sings to Donna (\"When All Is Said and Done\"), which prompts Rosie to make a play for Bill (\"Take a Chance on Me\").All the couples present proclaim their love (\"Mamma Mia\" reprise), as their raucous dancing causes the ground to crack and erupt with water from the fountain of Aphrodite. Sophie and Sky bid farewell to Kalokairi and sail away (\"I Have a Dream\" reprise)."
}