{
	"title": "Man of Steel",
	"release_year": "2013",
	"runtime": "143",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"max",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Henry Cavill",
		"Henry Cavill",
		"Amy Adams",
		"Michael Shannon",
		"Diane Lane",
		"Russell Crowe",
		"Antje Traue",
		"Harry Lennix",
		"Richard Schiff",
		"Christopher Meloni",
		"Kevin Costner"
	],
	"staff": [
		"Zack Snyder",
		"David S. Goyer",
		"Christopher Nolan",
		"Jerry Siegel",
		"Joe Shuster",
		"Christopher Nolan",
		"Charles Roven",
		"Deborah Snyder",
		"Emma Thomas",
		"Hans Zimmer",
		"Amir Mokri",
		"David Brenner",
		"Kristy Carlson",
		"Lora Kennedy",
		"Alex McDowell"
	],
	"links": [
		"https://www.max.com/movies/man-of-steel/73b6c63e-5eb5-4c0d-86f5-c3f398114a15",
		"https://www.amazon.com/Man-Steel-Henry-Cavill/dp/B00G91WB3S"
	],
	"votes": 819223,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTk5ODk1NDkxMF5BMl5BanBnXkFtZTcwNTA5OTY0OQ@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "The planet Krypton faces imminent destruction due to its unstable core, resulting from years of exploiting Krypton's natural resources. The ruling council is deposed by the rebel military leader, General Zod (Michael Shannon), and his followers. Scientist Jor-El (Russel Crowe) and his wife Lara launch their newborn son Kal-El on a spacecraft to Earth, infusing his cells with a genetic codex to preserve the Kryptonian race. After Zod murders Jor-El, he and his followers are captured and banished to the Phantom Zone. However, Krypton explodes some time afterwards, freeing them.The infant Kal-El is raised as the adoptive son of Jonathan (Kevin Costner) and Martha Kent (Diane Lane), who name him Clark. Clark's (Henry Cavill) Kryptonian physiology affords him superhuman abilities on Earth, which initially cause him confusion and ostracizing, but he gradually learns to harness his powers to help others. Jonathan reveals to a teenage Clark that he is an alien and advises him not to use his powers publicly, fearing that society will reject him. After Jonathan's death, an adult Clark spends several years living a nomadic lifestyle, working different jobs under false names, while saving people in secret as well as struggling with the loss of his adoptive father.He eventually infiltrates a scientific discovery of a Kryptonian scout spaceship in the Arctic. Clark enters the alien ship, and it allows him to communicate with the preserved consciousness of Jor-El in the form of a hologram. Lois Lane (Amy Adams), a journalist from the Daily Planet who was sent to write a story on the discovery, sneaks inside the ship while following Clark and is rescued by him when she is injured. Lois's editor Perry White rejects her story of a \"superhuman\" rescuer, so she traces Clark back to Kansas with the intention of writing an expose. After hearing his story, she decides not to reveal his secret.Zod and his crew seek out other colony worlds, and eventually follow a Kryptonian distress signal sent from the ship Clark discovered on Earth. Zod demands that humans surrender Kal-El, who he believes has the codex, in return for peace. Clark agrees, and the U.S. military hand him and Lois over to Zod's second-in-command, Faora. Zod reveals that he intends to use a Terraforming \"world engine\" to transform Earth into a new Krypton, eradicating the human population in the process, and use the codex to repopulate the planet with genetically-engineered Kryptonians. After Clark and Lois escape Zod's ship, Clark defeats Faora, convincing the military that he is an ally. Zod deploys the world engine and initiates the process in Metropolis and over the Indian Ocean.Clark, now dubbed \"Superman\", stops the world engine in the Indian Ocean and also destroys the ship which carries the pivotal technology, the Genesis Chamber, to restore the Krytonian race with the codex. The military use the spacecraft that brought Clark to Earth in an aerial strike on Zod's ship over Metropolis, returning Zod's crew to the Phantom Zone, completely thwarting Zod's plans. Only Zod remains, and he engages Superman in an aerial battle across Metropolis. When Zod attempts to murder civilians in revenge for his defeat, Superman is forced to kill him. Some time later, Superman continues to earn the U.S. government's trust, although evading their efforts to uncover his secret identity. To create an alias that gives him access to dangerous situations without arousing suspicion, Clark takes a job as a reporter at the Daily Planet."
}