{
	"title": "Jack Reacher",
	"release_year": "2012",
	"runtime": "130",
	"tags": [
		"Action",
		"Mystery",
		"Thriller",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Tom Cruise",
		"Rosamund Pike",
		"Richard Jenkins",
		"Werner Herzog",
		"David Oyelowo",
		"Jai Courtney",
		"Vladimir Sizov",
		"Joseph Sikora",
		"Michael Raymond-James",
		"Alexia Fast"
	],
	"staff": [
		"Christopher McQuarrie",
		"Lee Child",
		"Christopher McQuarrie",
		"Tom Cruise",
		"Don Granger",
		"Gary Levinsohn",
		"Paula Wagner",
		"Joe Kraemer",
		"Caleb Deschanel",
		"Kevin Stitt",
		"Mindy Marin",
		"Jim Bissell"
	],
	"votes": 371089,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTM1NjUxMDI3OV5BMl5BanBnXkFtZTcwNjg1ODM3OA@@._V1_QL75_UY281_CR3,0,190,281_.jpg",
	"description": "In Pittsburgh, Pennsylvania, a man drives a van into a parking garage across the Allegheny River from PNC Park and, after paying for parking, readies a sniper rifle. He takes aim and appears to randomly kill five people around the stadium and on the river's North Shore Trail before fleeing in the van.\nThe police soon arrive, headed by Detective Emerson, and they discover a shell casing as well as the coin used to pay for parking. A fingerprint taken from the coin points to James Barr, a former U.S. Army sniper. When the police raid his house, they find the van, equipment for making bullets, the rifle in question, and Barr who they arrest.During an interrogation by Emerson and the District Attorney, Alex Rodin (Richard Jenkins), Barr writes \"Get Jack Reacher\" on a notepad. Reacher (Tom Cruise) is a drifter and former U.S. Army Military Police Corps officer. Reacher later arrives in Pittsburgh after seeing a news report about Barr and the shooting. Emerson and Robin deny Reacher's request to view the evidence, but agree to let him see Barr, who was brutally attacked by fellow inmates while being transported and is now in a coma. While there, he meets Barr's defense attorney, counselor Helen Rodin (Rosamund Pike), the DA's daughter, who is trying to save Barr from the death penalty.Helen says she can arrange for Reacher to see the evidence if he will become her lead investigator. Reacher retorts that he is not interested in clearing Barr. He confidentially reveals that Barr previously had gone on a killing spree during his tour in Iraq but was not prosecuted because the victims were under investigation for major crimes (sexual assault rally of 28 Iraqi women in 4 days) -and the U.S. Army wants them forgotten. Reacher then vowed that if Barr tried anything like this again, he would take him down. Jack is sure that James is guilty but is puzzled that instead of confessing James asked for Jack Reacher to be called, fully knowing that Jack Reacher would kill James if he again found him to be guilty.Reacher agrees to investigate if Helen visits the victims' families to learn about the people murdered that day. Reacher goes to the crime scene and finds inconsistencies with this location, and thinking a trained shooter would have committed the killings from the cover of the van on the nearby Fort Duquesne Bridge. After Helen reports her findings about the victims to Reacher, he suggests that the owner of a local construction company was the intended victim, with the killing of other random victims intended to cover up that fact.After a seemingly random bar fight, Reacher realizes that someone is attempting to strong-arm him into dropping his investigation. Reacher is later framed for the murder of the young woman who was paid to instigate that bar fight, but this only motivates him further. Before her death, Jack had traced her & found that the man paying her was only known as the Zec. Jack gets Zec's address from the girl & goes there. He is attacked by Russians, but escapes.Jack speaks to Helen & theorizes that maybe James was framed. The only evidence that puts James on the scene of the crime is a coin, with his fingerprint, that James allegedly used to pay for parking. Jack thinks that James asked for him because James believed that Jack would find the truth, no matter how much Jack believed James to be the criminal. Jack thinks that somehow the Russian mafia took James's fingerprint & DNA & planted it at the shooting site to frame James for the killing.Jack had noticed a car following him since he joined the investigation. A number check reveals that the car is registered to a front company owned by the Russian mafia who wanted to buy a construction company to increase their legit presence. The owner of the company wasn't willing to sell & had sued the Russian front company. Jack theorizes that the mafia got the owner of the company murdered & killed 4 random people in the vicinity to cover up the intended victim.Reacher eventually follows a lead at a shooting range in the neighboring state of Ohio, owned by former U.S. Marine Corps Gunnery Sergeant Cash, who will only talk if Reacher proves his sniping skills, which he does. Cash tells Jack that James was his best shooter & always hit bulls' eye at 700 yards. But Jack contests this theory by saying that James was never this good a shooter in the army. Jack thinks that James was accompanied by a friend, who switched the target sheets to make James look like an expert. Video recording tapes show that James was always with a guy whom Jack saw as part of the mafia team attacking him.The real perpetrators are members of a Russian gang masquerading as legitimate businessmen. The gang's elderly leader spent much of his life in a Soviet Gulag and is known only as the Zec (prisoner). The gang kidnaps Helen with the aid of their accomplice police detective Emerson and holds her hostage at a construction site or mine. Reacher outwits the mob guards, killing them with Cash's help.\nJack tells Emerson before killing him that nobody would have checked the parking meter, not even him, & that's how he knew Emerson was involved. He then confronts the Zec about the conspiracy. The Zec is killed by Reacher after the Zec asserts that the other conspirators who were killed by Reacher were the only witnesses against the Zec, and that Reacher would more likely be the one to go to prison as a drifter accused of murdering a young woman.Reacher and Cash flee the scene, making Reacher a wanted man, but with confidence that Helen will clear his name. When Barr awakens from his coma, he tells Helen that he has no recent memory but believes that he must be guilty of the shooting. Barr's mental reconstruction of how he would have committed the shootings confirms Reacher's theory was correct from the beginning to Helen's father. Still unknowing of all this, Barr is willing to confess and accept punishment, fearing that Reacher will mete out justice if the law does not.",
	"links": [
		"https://www.amazon.com/Jack-Reacher-Christopher-McQuarrie/dp/B0DD2JBTFC"
	]
}