{
	"title": "Music and Lyrics",
	"release_year": "2007",
	"runtime": "104",
	"tags": [
		"Comedy",
		"Music",
		"Romance",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Hugh Grant",
		"Drew Barrymore",
		"Scott Porter",
		"Nick Bacon",
		"Andrew Wyatt",
		"Dan McMillan",
		"Tom Foligno",
		"Zak Orth",
		"Brooke Tansley",
		"Daniel Stewart Sherman"
	],
	"staff": [
		"Marc Lawrence",
		"Marc Lawrence",
		"Liz Glotzer",
		"Martin Shafer",
		"Can Yesilyurt",
		"Adam Schlesinger",
		"Xavier Grobet",
		"Susan E. Morse",
		"Ilene Starger",
		"Jane Musky"
	],
	"votes": 107940,
	"cover": "https://m.media-amazon.com/images/M/MV5BNDY5MTQwODI3OV5BMl5BanBnXkFtZTcwODM2MjEzMw@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Alex Fletcher (Hugh Grant) is a washed-up former pop star (from the British group 'PoP!') who seems happy in his \"has-been\" status (He has been invited to star in a show called \"Battle of the 80's Has-Beens\" where forgotten stars box each other in the ring), performing for 80s-loving fans at reunions and random locations, when his manager Chris Riley (Brad Garrett) tells him Cora Corman (Haley Bennett), a young megastar, wants him to write a song for her, titled \"A Way Back Into Love\" (which she wants to perform with Alex at Madison Sq Garden in 2 weeks).Cora is a big fan of Alex as his songs got her through her parents' divorce when she was 7 years old. Ray (Matthew Morrison), Cora's manager informs Alex that they have 7 other retro artists working on the same title, so they really need the song by the end of the current week (by Friday)\nAlex is reluctant to compose again after two decades, because his strength was always the tune, his ex-partner Colin (Scott Porter) always wrote the words. However, his caring but professional manager tells him that his music career is completely doomed if he doesn't switch gears-interest in his nostalgia concerts is dwindling.During an unsuccessful attempt to compose the song in collaboration with a \"very hip, very edgy\" lyricist Greg Antonsky (Jason Antoon), Alex discovers that the woman who is temporarily watering his plants, Sophie Fisher (Drew Barrymore), has a talent for writing lyrics. Alex, on a 48-hour deadline to write the song, asks her to help him, but she refuses multiple times (She brings Rhonda to a High school reunion gig. Later Alex comes to the shop where Sophie works and says that he can't take no for an answer), to the chagrin of her older sister Rhonda (Kristen Johnston), who happens to be a huge fan of Alex. It's not until Alex composes a lovely song with some of Sophie's lyrics and plays it for her that she realizes they could do it. Over the next few days, they grow closer while writing the words and music together.Sophie reveals she had lost confidence in herself and abandoned writing after a disastrous romance with her English professor Sloan Cates (Campbell Scott). Sloan got close to Sophie and never revealed that he was engaged. When she found out, they had a messy break up. A yr later Sloan released his book, on a leading character based on Sophie's life, which went on to become a national bestseller. Sloan characterizes Sophie as a brilliant imitator, but an empty writer, with no original thoughts.Alex reveals that Colin stole their last 3 songs, which he published in his own solo album and sold 8 million copies. While Alex's solo album sold 50K copies. One particular copy at the local music store has been on the shelf for over 6 yrs.Working for 2 straight days, and barely meeting the deadline Cora has set for the song's delivery, Alex and Sophie are thrilled when she accepts it; however, at a celebratory dinner with Alex's manager Chris (Brad Garrett) and his wife, Sophie is mortified to encounter Sloan. Sophie hides in the bathroom, but Alex encourages her to confront Sloan. Sophie practices her entire speech with Alex in the bathroom. She confronts him but finds herself tongue-tied in his presence (Sloan tells her that he has signed the rights for a film based on his book), and Alex's own attempts to defend her result in a scuffle. Nursing their wounds back at Alex's apartment, Alex and Sophie fall into an unplanned romantic encounter.Over the next couple of days, Sophie goes with Alex to his gigs and encourages him when Alex has doubts about his ability to entertain crowds. Alex goes with Sophie to a dinner with Rhonda.\nWhen Cora invites Alex and Sophie to hear her interpretation of \"A Way Back into Love,\" Sophie is horrified by her Indian-vibe, sexually confident interpretation of their earnest song. Alex rushes Sophie out of the room before she can say anything, and tells her he agrees it's awful but says they need to accept it as the cost of doing business. Later at Cora's party, despite Alex's best efforts to block her, Sophie finally tells Cora that she feels the new arrangement clashes with the insecurity expressed in the song's lyrics. Cora says she's still going to perform it her way but expresses appreciation for Sophie's honesty.Cora has tasked Alex and Sophie to write another verse within the next 24 hours. But Sophie says she can't write when she is not inspired. Sophie leaves Alex when she gets upset by his willingness to demean his talent and his claim that Sloan was right about her personality.\nThe next morning, Alex meets Cora, only to learn that Sophie faxed her the lyrics based on her conversation with Alex the night before.Sophie, intending to start a new life in Florida, reluctantly attends the opening of Cora's new tour at Madison Square Garden, at which Alex and Cora will debut \"Way Back into Love\". Upon hearing that Alex is singing a new song \"written by Alex Fletcher\", Sophie, believing that Alex is stealing credit for her work; attempts to leave; but however, the song Alex sings is called \"Don't Write Me Off\", his plea for Sophie to give him another chance. A touched Sophie finds Alex backstage and he confesses to having successfully convinced Cora to drop the risque version of \"A Way Back into Love\" in an attempt to win Sophie back. He and Cora perform the tune as he and Sophie intended it to be sung.The end of the movie (an homage to VH1's Pop-Up Video) reveals that the song becomes a hit for Cora and Alex, the film version of Sloan's novel flops with critics and moviegoers (destroying his career), PoP! reunites for their induction into the Rock and Roll Hall of Fame, after which their lead singer Colin Thompson (who left the band with some of Alex's songs to start a solo career) winds up having his hip replaced after years of dancing, and Alex and Sophie go on to become successful partners, both in songwriting and romance, with five more new pop hits.",
	"links": [
		"https://www.amazon.com/Music-Lyrics-Hugh-Grant/dp/B000QDRHM0"
	]
}