{
	"title": "Star Trek",
	"release_year": "2009",
	"runtime": "127",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.9,
	"actors": [
		"Chris Pine",
		"Zachary Quinto",
		"Simon Pegg",
		"Leonard Nimoy",
		"Eric Bana",
		"Bruce Greenwood",
		"Karl Urban",
		"Zoe Saldana",
		"John Cho",
		"Anton Yelchin"
	],
	"staff": [
		"J.J. Abrams",
		"Roberto Orci",
		"Alex Kurtzman",
		"Gene Roddenberry",
		"J.J. Abrams",
		"Damon Lindelof",
		"Michael Giacchino",
		"Dan Mindel",
		"Maryann Brandon",
		"Mary Jo Markey",
		"April Webster",
		"Alyssa Weisberg",
		"Scott Chambliss"
	],
	"votes": 623536,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjE5NDQ5OTE4Ml5BMl5BanBnXkFtZTcwOTE3NDIzMw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 2233, the Federation star ship USS Kelvin is investigating a \"lightning storm\" in space. A Romulan ship, Narada, emerges from the storm and attacks the Kelvin leaving it defenseless. Narada's first officer, Ayel (Clifton Collins, Jr.), demands that Kelvin's Captain Robau (Faran Tahir) come aboard to negotiate a truce. Robau is questioned about the current star date and an \"Ambassador Spock\", whom he does not recognize. Narada's commander, Nero (Eric Bana), kills him, and resumes attacking the Kelvin. George Kirk (Chris Hemsworth), Kelvin's first officer, orders the ship's personnel, including his pregnant wife Winona (Jennifer Morrison), to abandon ship while he pilots the Kelvin on a collision course with Narada. Kirk sacrifices his life to ensure Winona's survival as she gives birth to James Tiberius Kirk (Chris Pine).Seventeen years later on the planet Vulcan, a young Spock (Zachary Quinto) is accepted to join the Vulcan Science Academy. He has always been taunted as a half human, half Vulcan by his peers and dislikes references to his human mother in anyway. Realizing that the Academy views his human mother, Amanda (Winona Ryder), as a \"disadvantage\", he joins Starfleet instead. On Earth, Kirk becomes a reckless but intelligent young adult. Following a bar fight with Starfleet cadets accompanying Nyota Uhura (Zoe Saldana), Kirk meets Captain Christopher Pike (Bruce Greenwood), who encourages him to enlist in Starfleet Academy (\"Your dad was the captain of a star ship for 12 mins and saved 800 lives. I dare you to do better\"), where Kirk meets and befriends Doctor Leonard \"Bones\" McCoy (Karl Urban) (He lost everything in the divorce, except the bones in his body)Three years later, Commander Spock accuses Kirk of cheating during the Kobayashi Maru simulation. The simulation required cadet captains to face death and protect the crew in a no win scenario, but Kirk cheats and inserts a sub routine to change the scenario and beat it.\nKirk argues that cheating was acceptable because the simulation was designed to be unbeatable. Spock argues that Kirk not only cheated but failed to get the most important learning of the simulation that a captain cannot cheat death.The disciplinary hearing is interrupted by a distress signal from Vulcan. With the primary fleet out of range, the cadets are mobilized, with McCoy and Kirk boarding Pike's ship (Kirk is grounded on account of his academic suspension, but McCoy argues that Kirk is his patient and he wont leave for the mission unless he is allowed to bring Kirk along), the Enterprise. Spock considers Uhura as his favorite student and assigns her to the Enterprise.\nThe enterprise is a few minutes late in departing as the new helmsman Pavel Chekov (Anton Yelchin) & Hikaru Sulu had not released the external inertial dampener and hence the warp drive did not engage.Realizing that the \"lightning storm\" observed near Vulcan (shortly after which Vulcan was attacked by a Romulan ship and sent a distress signal to Earth) is similar to the one that occurred when he was born, Kirk breaks protocol to convince Pike that the distress signal is a trap. When the Enterprise arrives, they find the fleet destroyed and Narada drilling into Vulcan's core. Narada attacks Enterprise and Pike surrenders, delegating command of the ship to Spock and promoting Kirk to first officer.\nKirk, Hikaru Sulu (John Cho), and Chief Engineer Olson (Greg Ellis) perform a space jump onto the drilling platform. While Olson is killed mid-jump, Kirk and Sulu successfully reach and disable the drill, but are unable to stop Nero launching \"red matter\" into Vulcan's core, forming an artificial black hole that destroys Vulcan. The Enterprise manages to rescue Spock's father, Sarek (Ben Cross), and the high council before the planet's destruction, but not his mother Amanda, who falls to her death before the transporter can properly lock onto her. Out of 6 Bn Vulcans only 10,000 are saved.\nAs Narada moves toward Earth, Nero tortures Pike to gain access to Earth's defense codes. Nero declares his intention to destroy all federation planets, starting from Earth.\nUhura is shown to have romantic feelings towards Spock. Spock deduces that the Narada is from the future and has used the black hole technology to create a passage through space time. Nero's presence, beginning with the attack on USS Kelvin has altered the flow of history and created an alternate reality.While in pursuit, Spock maroons Kirk on Delta Vega after he attempts mutiny (Kirk wanted to go after Nero and the Narada, while Spock wants to hook up with the rest of Starfleet in the Laurentian system, as per orders from Captain Pike). On the planet, Kirk encounters an older Spock (from the original time line) (Leonard Nimoy), who explains that he and Nero are from 2387. In the future, Romulus was threatened by a supernova, which Spock attempted to stop with an artificial black hole made of \"red matter\". However, his plan failed, resulting in Nero's family perishing along with Romulus, while both the Narada and Spock's vessel were caught in the black hole and sent back in time. Spock quickly found they were sent back 25 years apart, during which time Nero attacked the Kelvin, thus changing history and creating a parallel universe.\nAfter Spock's arrival, Nero stranded him on Delta Vega to watch Vulcan's destruction as revenge. Reaching a Starfleet outpost on Delta Vega, Kirk and the elder Spock meet Montgomery \"Scotty\" Scott (Simon Pegg), who helps them by devising a trans-warp beam system, allowing both him and Kirk to beam onto Enterprise while it is travelling at warp speed.Following the elder Spock's advice, Kirk provokes younger Spock into attacking him, forcing Spock to recognize himself as emotionally compromised and relinquish command to Kirk. After talking with Sarek, Spock decides to help Kirk. While Enterprise hides itself within the gas clouds of Titan, Kirk and Spock beam aboard Narada (Uhura reveals her first name is Nyota to Spock). Kirk fights with Nero and Ayel, killing the latter and rescuing Pike, while Spock uses the elder Spock's ship to destroy the drill. Spock leads Narada away from Earth and sets his ship to collide with Nero's ship. Enterprise beams Kirk, Pike, and Spock aboard. The older Spock's ship and Narada collide, igniting the \"red matter\". Kirk offers Nero help to escape, but Nero refuses, prompting Kirk to give the order to fire, dooming Narada to be consumed in a black hole that Enterprise is only barely able to escape.Kirk is promoted to captain and given command of Enterprise, while Pike is promoted to rear admiral. Spock encounters his older self, who persuades his younger self to continue serving in Starfleet, encouraging him to do, for once, what feels right instead of what is logical. Spock remains in Starfleet, becoming first officer under Kirk's command. Enterprise goes to warp as the elder Spock speaks the \"where no one has gone before\" monologue.",
	"links": [
		"https://www.amazon.com/Wooden-Stool-Nonslip-Bathroom-Training/dp/B01LT80TN4"
	],
	"netflix": [
		"belgium",
		"brazil",
		"canada",
		"denmark",
		"france",
		"germany",
		"greece",
		"hong-kong",
		"india",
		"israel",
		"italy",
		"japan",
		"malaysia",
		"mexico",
		"netherlands",
		"new-zealand",
		"norway",
		"philippines",
		"saudi-arabia",
		"singapore",
		"south-africa",
		"sweden",
		"switzerland",
		"thailand",
		"turkey",
		"uae",
		"usa"
	]
}