{
	"title": "Drive",
	"release_year": "2011",
	"runtime": "100",
	"tags": [
		"Action",
		"Drama",
		"amazon"
	],
	"rating": 7.8,
	"actors": [
		"Ryan Gosling",
		"Carey Mulligan",
		"Bryan Cranston",
		"Albert Brooks",
		"Oscar Isaac",
		"Christina Hendricks",
		"Ron Perlman",
		"Kaden Leos",
		"Jeff Wolfe",
		"James Biberi"
	],
	"staff": [
		"Nicolas Winding Refn",
		"Hossein Amini",
		"James Sallis",
		"Michel Litvak",
		"John Palermo",
		"Marc Platt",
		"Gigi Pritzker",
		"Cliff Martinez",
		"Newton Thomas Sigel",
		"Matthew Newman",
		"Mindy Marin",
		"Beth Mickle"
	],
	"links": [
		"https://www.amazon.com/Drive-Ryan-Gosling/dp/B006W0QOF2"
	],
	"votes": 715824,
	"cover": "https://m.media-amazon.com/images/M/MV5BYTFmNTFlOTAtNzEyNi00MWU2LTg3MGEtYjA2NWY3MDliNjlkXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The unnamed Driver (Ryan Gosling) lives in a low-rent apartment building and works as a mechanic in a chop shop owned by Shannon (Bryan Cranston), and as a part-time movie stuntman. He also has a secret job as a getaway driver, organized by Shannon, where his rule is that he never works for the same people twice and only gives the criminals a five-minute window to complete their robbery, after which he will leave them behind. One day, he meets his new neighbor Irene (Carey Mulligan) in the apartment building elevator and later helps her and her young son Benicio (Kaden Leos) when Irene has car trouble at a local supermarket.Shannon persuades the Jewish mobster Bernie Rose (Albert Brooks) to purchase a stock car for the Driver to race after seeing the Driver's skill. Rose's friend and business partner is Nino, an aging Jewish mobster (Ron Perlman). Nino's friends once had Shannon's pelvis broken when Shannon overcharged him for a past job, leaving him with a permanent limp and braces on his hips. Bernie sees the Driver race & agrees to fund $ 300 K for 70% of the stake.Irene has her car towed to Shannon's garage and the Driver gives her and Benicio a ride home. The Driver takes a great interest in Irene and Benicio by driving them around (down the LA river) and playing dad or \"big-brother\" to Benicio; most notably by playing the \"blinking\" game with him. The Driver begins spending more and more time with Irene and Benicio, and later meets Irene's husband, Standard (Oscar Isaac), when he comes home from prison. The Driver is devastated when he finds out Standard was coming home as it ended his dream life he had recently created with Irene and Benicio. The night he finds out he goes for a drive alone to a cheap diner and threatens a former client who attempts to use his driving services again. Standard owes protection money to an Albanian gangster, Cook (James Biberi), from his time in prison. Cook beats up Standard and threatens to go after Irene and Benicio if Standard does not agree to rob a pawn shop to pay the debt.The Driver agrees to help Standard pay off the debt by driving him to and from the pawn shop. Blanche (Christina Hendricks), Cook's moll, also participates in the heist. The driver uses a slim-Jim to open and steal a new model Mustang for the job. While waiting in the parking lot for Standard and Blanche to complete the heist, the Driver sees another car pull into the lot and park (Chrysler 300). Blanche returns to the car with a large bag. But when Standard leaves the pawn shop, he is shot in the neck by the owner, unseen from inside the shop, and falls to the ground.The Pawn owner then proceeds to come outside and finish the injured Standard off with multiple shots to the back. The Driver flees with Blanche and the money, but the car that pulled into the parking lot minutes earlier gives chase, trying to run them off the road. The Driver eludes the other vehicle, and they hide out in a motel room. The Driver discovers that the amount of money is much more than was expected (1,000,000 instead of the expected 40,000). After the Driver threatens Blanche, she tells him that the chasing car belongs to Cook and that she and Cook planned to double-cross the Driver and Standard, taking the money for themselves. Two of Cook's men attack them in the motel room, killing Blanche and injuring the Driver before he kills them both.The Driver confronts Cook in his strip club and learns that Nino was behind the heist. He offers to give Nino his money back, but Nino declines and instead sends a hit-man (Jeff Wolfe) to the Driver's apartment building, with whom the Driver and Irene unknowingly ride the elevator. The Driver gives Irene a kiss before killing the hit-man by repeatedly stomping on his head, to her horror. Nino explains to Bernie that the money from the pawn shop belonged to the East Coast mafia. Fearing retaliation, Bernie and Nino agree to kill those with knowledge, starting with Cook. Bernie confronts Shannon in his garage and reluctantly kills him with a straight razor, after Shannon refuses to divulge information on the whereabouts of the Driver. \"He's in Mexico, or was it Belize?\"The Driver, wearing a silicone mask disguise, follows Nino to the Pacific Coast Highway in his car and T-Bones Nino's car onto a beach. With Nino wounded and weakened, the Driver drowns him in the Pacific Ocean. The Driver speaks to Bernie on Nino's phone, and they arrange to meet at a Chinese restaurant. The Driver makes a final phone call to Irene to tell her he is leaving and says that meeting her and Benicio was the best thing that has ever happened to him.At the restaurant, Bernie promises only Irene and Benicio's safety, in exchange for the money. \"That's the best you're going to get\" In the parking lot, Bernie stabs the Driver in the abdomen as he pulls the money from the trunk of his car. The Driver fatally stabs Bernie in the neck, leaving his corpse and the satchel of money behind. Before he pulls out the audience is in the dark as to whether the Driver is dead or not. It turns out the Driver is playing the \"blinking game\" with himself and after he blinks, he drives away. That evening, Irene knocks on the Driver's apartment door, with no response. The Driver drives off into the night.",
	"netflix": [
		"italy",
		"japan",
		"malaysia",
		"philippines",
		"saudi-arabia",
		"uae"
	]
}