{
	"title": "Eastern Promises",
	"release_year": "2007",
	"runtime": "100",
	"tags": [
		"Crime",
		"Drama",
		"Thriller",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Naomi Watts",
		"Viggo Mortensen",
		"Armin Mueller-Stahl",
		"Josef Altin",
		"Mina E. Mina",
		"Aleksandar Mikic",
		"Sarah-Jeanne Labrosse",
		"Lalita Ahmed",
		"Badi Uzzaman",
		"Doña Croll"
	],
	"staff": [
		"David Cronenberg",
		"Steven Knight",
		"Robert Lantos",
		"Paul Webster",
		"Howard Shore",
		"Peter Suschitzky",
		"Ronald Sanders",
		"Deirdre Bowen",
		"Nina Gold",
		"Carol Spier"
	],
	"votes": 264561,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTcwMzU0OTY3NF5BMl5BanBnXkFtZTYwNzkwNjg2._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "A teenage, pregnant Russian girl enters a London pharmacy wearing a trench coat. She is bleeding profusely under the trench coat and falls unconscious. She is taken to the Trafalgar hospital on December 20th.Anna Khitrova (Naomi Watts), a Russian-British midwife at a London hospital, finds a Russian-language diary on the body of Tatiana (Sarah-Jeanne Labrosse), a teenage girl who dies in childbirth. Tatiana's body had bruises all over her. A baby girl was born alive, by emergency Cesarean section.Anna finds calling card for the Trans-Siberian Restaurant owned by Semyon (Armin Mueller-Stahl), an old boss in the Russian mafia.\nAnna sets out to track down Tatiana's family so that she can find a home for the baby. Though Anna's mother, Helen (Sinéad Cusack), is open to the idea, Anna's Russian uncle, Stepan (Jerzy Skolimowski), a former KGB functionary, urges caution, saying that Tatiana was a prostitute. Stephan could read Russian and had read Tatiana's diary. He tells Anna to bury the diary in the girl's coffin.\nStefan has outrageous views and says that Anna's own baby died before childbirth as it was of a mixed race, as her boyfriend Oliver was African. Stefan is against inter race relations.Anna meets Semyon and asks him about Tatiana. Semyon says that Tatiana didn't work at his restaurant and speculates that she might have eaten there once. Anna reveals that she has Tatiana's diary. Now Semyon offers to help translate Tatiana's diary and wants Anna to bring it to him. He says that if he finds the names of any relatives, he will call them himself. He ignores all suggestions that her uncle could translate the diary.\nAnna gives Semyon a photocopy of the diary for the translation. She says that she is going to keep the original to give to Tatiana's daughter someday.Semyon's driver, Nikolai Luzhin (Viggo Mortensen), serves as the family \"cleaner\" and bodyguard of Kirill (Vincent Cassel), Semyon's son. Kirill, a drunk who repeatedly disappoints Semyon, authorizes an ill-advised hit on a rival Chechen leader Soyka (Aleksandar Mikic) with the help of a Kurdish associate, Azim (Mina E. Mina), and without Semyon's approval. Azim's mentally challenged nephew Ekrem (Josef Altin) carried out the hit in Azim's barbershop where the Chechen was a customer.\nAzim brings Kirill and Nikolai to the barbershop later, where he had stored the body of the Chechen in an ice box. Kirill spits on the dead Chechen's body, calling him a Pederast. Nikolai removes identifying evidence from the Chechen's body (removing his wallet, file his teeth and cut off his fingers) and dumps it in the Thames.\nNikolai later tells Semyon that the Chechen had been spreading rumors that Kirill is gay. Semyon is livid that Kirill conducted an unauthorized hit but is happy that Nikolai protected him and disposed of the body safely.Nikolai likes Anna's bike, a Ural, which are not made anymore. He offers to buy it from her, but she refuses to sell.When Stepan finishes translating the diary, Anna learns that Tatiana was a simple Russian girl with dreams of coming to the Western World. She had heard that girls made more money in a week by singing in bars than her father made in a whole year. She came to Semyon's restaurant for a singing job, without knowing that she is falling into the hands of the Russian Mafia, who pushed her into prostitution. Tatiana resisted and she did not allow herself to be used, which infuriated Semyon.\nSemyon sexually assaulted Tatiana after Kirill failed to do so, explaining that he would show Kirill how to \"break\" her. The diary also states that Semyon gave her pills to induce an abortion, and Anna realizes that the baby was fathered by Semyon.Meanwhile, Semyon realizes that Anna knows the truth and visits her in hospital. They reach an agreement that he will give the location of the girl's family to Anna if she returns the diary to him. Later, Anna, Helen, and Stepan meet Nikolai in a fast-food restaurant, where he takes the diary but denies knowing anything about the deal. Later, Nikolai reads Tatiana's diary himself. Semyon burns the diary when he gets it from Nikolai.\nSemyon then orders Nikolai to kill Stepan, who soon goes missing.As Nikolai rises in rank, Semyon sponsors him as a full member, due in part to his protection of Kirill. Meanwhile, the dead Chechen's brothers arrive in London seeking vengeance and kill Azim's mentally handicapped nephew, whom Azim had forced to kill the Chechen.\nAzim confesses his role in the hit to Semyon; he forgives him in exchange for participating in a plan to fool the Chechens. Under this, Azim will lure Nikolai into a meeting at a public bath, where he will be ambushed by the Chechens, who are to be deceived into believing that he is Kirill. Though the Chechens seriously wound him, Nikolai manages to kill them both before being taken to Anna's hospital.Yuri (Donald Sumpter), a high-ranking Scotland Yard officer investigating the Russian mafia, meets Nikolai in the hospital, revealing that Nikolai is actually an undercover FSB agent working under license from the British government. Nikolai tells Yuri to have Semyon arrested on a charge of sexual assault, with a paternity test of Tatiana's baby as evidence, which will also allow Nikolai to take over the mafia. When Anna confronts Nikolai in his hospital bed, he tells her that Stepan is being kept in Edinburgh for his own protection.Anna spots Kirill entering a lift and finds that Tatiana's baby is gone, replaced with a bouquet of roses. She and Nikolai then rush to the spot on the Thames where Nikolai had previously disposed of the Chechen's body and find Kirill sitting by the river, working up the courage to throw in his baby sister.\nNikolai and Anna persuade him to give the baby back and Nikolai embraces Kirill, telling him that Semyon is finished, and that they will now be bosses together. Soon after, Nikolai succeeds Semyon as head of the organization, and Anna gains custody of Tatiana's baby, whom she names Christine.",
	"links": [
		"https://www.amazon.com/Eastern-Promises-Josef-Altin/dp/B000ZHXUG4"
	]
}