{
	"title": "Quantum of Solace",
	"release_year": "2008",
	"runtime": "106",
	"tags": [
		"Action",
		"Adventure",
		"Mystery",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Daniel Craig",
		"Olga Kurylenko",
		"Mathieu Amalric",
		"Judi Dench",
		"Giancarlo Giannini",
		"Gemma Arterton",
		"Jeffrey Wright",
		"David Harbour",
		"Jesper Christensen",
		"Anatole Taubman"
	],
	"staff": [
		"Marc Forster",
		"Paul Haggis",
		"Neal Purvis",
		"Robert Wade",
		"Barbara Broccoli",
		"Michael G. Wilson",
		"David Arnold",
		"Roberto Schaefer",
		"Matt Chesse",
		"Richard Pearson",
		"Debbie McWilliams",
		"Dennis Gassner"
	],
	"votes": 474811,
	"cover": "https://m.media-amazon.com/images/M/MV5BYmMwZTA3MTAtNWU0Yy00NGZmLTg0YmItZTVkZGFjZTI1ZWJiXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Following the events of the previous film Casino Royale, James Bond (Daniel Craig) is driving from Lake Garda to Siena, Italy, with the captured Mr. White (Jesper Christensen) in the trunk of his Aston Martin DBS V12. After evading pursuers, Bond delivers White to M (Judi Dench), who interrogates him regarding the mysterious organization, Quantum. M Thinks Bond is on a personal vendetta mission and warns him against going overboard.When White responds that their operatives are everywhere, M's bodyguard Craig Mitchell suddenly shoots one of the guards and attacks M. Bond chases Mitchell and eventually kills him and returns to the interrogation to find that White has escaped.\nAfter returning to London, and searching Mitchell's flat, Bond and M discover Mitchell had a contact in Haiti, Edmund Slate. Bond learns Slate is a hit-man sent to kill Camille Montes (Olga Kurylenko) at the behest of her lover, environmentalist entrepreneur Dominic Greene (Mathieu Amalric). Camille was instructed to pick up Slate from his hotel, but Bond got to Slate first and killed him and walked out with his briefcase. So Camille mistook Bond for Slate. Camille thinks Slate is a geologist hired by Greene, but Bond finds a gun in slate's briefcase which makes him an assassin. Camille drops Bond out of her car, who follows him on a bike. Camille goes straight to confront Greene.Greene takes Camille back, but says that he suspected Camille was using him to get to General Medrano. and he found that she was investigating his dealings behind his back.\nObserving her subsequent meeting with Greene, Bond learns Greene is helping exiled Bolivian General Medrano (Joaquín Cosío), who murdered Camille's family when she was a little girl, to overthrow the government and become the new president, in exchange for a seemingly barren piece of desert. Greene reveals Camille's past to Medrano and offers her to him, as part of the deal. Medrano takes Camille on his yacht with an intention to rape her.After rescuing Camille from Medrano (Camille was about to kill Medrano, but Bond's intervention lets him escape), Bond follows Greene to a performance of Tosca in Bregenz, Austria. Meanwhile, the head of the CIA's South American section, Gregg Beam (David Harbour), along with agent Felix Leiter (Jeffrey Wright), strike a noninterference deal with Greene for access to putative stocks of Bolivian oil, which the CIA believes to be the reason for Greene's interest in the land. Greene wants Beam to get rid of Bond for him..Bond infiltrates Quantum's meeting at the opera, identifying members of Quantum's executive board, and a gunfight ensues. A Special Branch bodyguard working for Quantum member Guy Haines, an advisor to the British PM is killed by one of Greene's men after Bond throws him off a roof (when the bodyguard started shooting at Bond, he acted in self defense). As M assumes Bond killed him, she has his passports and credit cards revoked. Bond heads to Italy and convinces his old ally René Mathis (Giancarlo Giannini) (whose innocence was confirmed after the events of Casino Royale) to accompany him to Bolivia. They are greeted by Fields (Gemma Arterton), a consular employee who demands Bond return to the UK immediately. Bond seduces her, and they attend a fund-raising party Greene holds that night (Mathis got them in using his contacts). At the party, Bond again rescues Camille from Greene (Camille had infiltrated the party to confront Greene again and he was about to throw her off from the balcony, when Bond intervened) and they leave.The Bolivian police (who are on Greene's payroll) pull Bond and Camille over but discover Mathis unconscious in the car's boot. One of the policemen shoots Mathis before Bond kills both of them. Mathis dies in Bond's arms, urging him to forgive Vesper and himself.The following day, Bond and Camille survey Quantum's intended land acquisition by air; their plane is shot down by a Bolivian fighter aircraft, before being crushed in the mountains and ignited. They skydive into a sinkhole and discover Quantum has been secretly damming Bolivia's supply of fresh water to create a monopoly. Back in La Paz, Bond meets M and learns Quantum killed Fields by drowning her in crude oil.\nBond meets Leiter and convinces him that he is fighting for the wrong side. Leiter discloses Greene and Medrano will meet in the Atacama Desert to finalize their agreement. Warned by Leiter, he evades the CIA's Special Activities Division.At a facility in the desert, Greene has Medrano sign a contract that will make Medrano the leader of Bolivia in exchange for the land rights. When Medrano realizes that the land rights make Greene Bolivia's sole provider of water at significantly higher rates, he refuses, but is forced to sign when Greene threatens him. Bond and Camille infiltrate the complex. Bond kills the police chief for betraying Mathis, and after killing the security detail, he confronts Greene. Meanwhile, Camille kills Medrano, avenging the murders of her family. The struggle leaves the facility destroyed by fire. Bond captures Greene and interrogates him about Quantum. Bond leaves him stranded in the desert with only a can of engine oil. Bond and Camille share a kiss, and she wishes him luck in conquering his demons.Bond travels to Kazan, Russia, where he finds Vesper Lynd's former lover, Yusef Kabira, a member of Quantum who seduces women agents with valuable connections and is indirectly responsible for her death. After saving Kabira's latest target (Katic), Bond allows MI6 to arrest Kabira, unharmed. Outside, M tells Bond that Greene was found dead in the middle of the desert, shot twice in the neck and some engine oil found in his stomach. M tells Bond she needs him back; he responds that he never left. As he walks away, Bond drops Vesper's necklace behind him in the snow.",
	"links": [
		"https://www.amazon.com/DANIEL-CRAIG-FILM-COLLECTION/dp/B0D58J6CWX"
	]
}