{
	"title": "Frost/Nixon",
	"release_year": "2008",
	"runtime": "122",
	"tags": [
		"Biography",
		"Drama",
		"History",
		"max",
		"amazon"
	],
	"rating": 7.7,
	"actors": [
		"Frank Langella",
		"Michael Sheen",
		"Kevin Bacon",
		"Sam Rockwell",
		"Matthew Macfadyen",
		"Oliver Platt",
		"Rebecca Hall",
		"Toby Jones",
		"Andy Milder",
		"Kate Jennings Grant"
	],
	"staff": [
		"Ron Howard",
		"Peter Morgan",
		"Tim Bevan",
		"Eric Fellner",
		"Brian Grazer",
		"Ron Howard",
		"Hans Zimmer",
		"Salvatore Totino",
		"Daniel P. Hanley",
		"Mike Hill",
		"Robert Komatsu",
		"Janet Hirshenson",
		"Jane Jenkins",
		"Michael Corenblith"
	],
	"links": [
		"https://www.max.com/movies/frostnixon/0d85ada7-d81a-492a-bd9b-94c8c6cb8721",
		"https://www.amazon.com/Frost-Nixon-Toby-Jones/dp/B001U418C4"
	],
	"votes": 113111,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTU2NDU2NDQtMTlhNC00ZGI3LWIzOGItNzQ3OTk0MjgyMGYzXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "After the Watergate scandal of 1972 (a man from Nixon's campaign committee was caught in the Watergate hotel, trying to bug the rooms of the Democrats National Party. 5 other people were arrested trying to break into the Democratic National party HQ) (The supreme court orders the President to turn over the tapes from the Oval office, which has evidence of his ordering these actions. Nixon is about to be impeached and so he agrees to resign) and his subsequent resignation in 1974, 400 million people worldwide watched on television as Nixon (Frank Langella) left the White House aboard Marine One. There was no admission of guilt or any apology. Among those watching was British journalist David Frost (Michael Sheen), who was recording a talk show in Australia at the time, and who decided that day to interview Nixon.Nixon is granted a full pardon by Gerald Ford. Nixon would never stand trial. Diane Sawyer (Kate Jennings Grant) & Frank Gannon (Andy Milder) is helping Nixon to write his book.\nNixon's literary agent, Irving Lazar (Toby Jones), believes the interviews would be an opportunity for Nixon to salvage his reputation and profit financially. Lazar demands $500,000 and ultimately secures $600,000 (equivalent to $2,500,000 in 2020) after Frost accepts. Lazar also thinks that Frost is show boy and will be easier to deal with than Mike Wallace from CBS, who offered $350K. Plus Lazar is able to secure better terms with Frost.After persuading his friend and producer John Birt (Matthew Macfadyen) that the interviews could be a success, Frost travels with Birt to California to meet with Nixon. Onboard the plane, Frost flirts with a young woman named Caroline Cushing (Rebecca Hall), and the pair begin a relationship as she tags along for the trip.\nFrost struggles to sell the interviews to American networks and decides to finance the project with private money. He brokers his own deals with advertisers and local TV stations to syndicate the broadcast of the interviews. Frost has to invest all his time into selling the interviews and to secure the funds to pay to Nixon.\nHe and Birt hire two investigators - Bob Zelnick (Oliver Platt) and James Reston Jr. (Sam Rockwell) - to help Frost prepare. Reston only signs up since he wants Nixon to be answerable for all the wrongs to the US people. He does not want Nixon to use these 12 interviews (3 per week for 4 weeks, a total of 28 hours and 45 mins) to exonerate himself. Frost is unsure as to what he wants from the interviews; Reston encourages him to aim for a confession from Nixon. Frost meets Nixon prior to the interviews and Nixon says that he looks forward to their duel.Under scrutiny by Nixon's post-presidential chief of staff, Jack Brennan (Kevin Bacon) (Brennan had called Frost and explicitly told him to cover the positive aspects of Nixon's presidency for 75% of the interview taping time as per the contract), Frost and Nixon embark on the first three recording sessions (March 23rd, 1977). Nixon wants to use the interviews to highlight his accomplishments as the President, other than Watergate. Brennan is committed to helping him achieve this goal.Frost is restricted by an agreed-upon time-frame and, under pressure from his own team, attempts to ask tough questions (like \"why didn't you burn the tapes\"). Nixon comments on Frost's shoes, that are without laces. However, Nixon dominates the sessions regarding the Vietnam War and his achievements in foreign policy. Behind the scenes, Frost's editorial team is nervous about Frost's capacity as a journalist and angry that Nixon appears to be exonerating himself.Meanwhile Frost has invested close to $ 2 million on the tapes and has only secured advertising deals for roughly 30% of that amount. He continues to spend more time on selling the interviews. The advertisers keep backing out, as news trickles in that the taping is not going well for Frost.\nNixon continues to toy with Frost, even asking him about his sexual relations with Caroline just before one of the taping start. Frost almost corners Nixon on Vietnam and Cambodia, but Nixon is able to control the narrative. He is so confident that Frost seems lost & beaten by the 2nd interview itself. 11 interviews finish, with Nixon having won each and every one of them. It's a shutout.Four days before the final interview, which will focus on Watergate, Frost receives a phone call from an inebriated Nixon. In a drunken rant, Nixon declares that they both know the final interview will make or break their careers. He compares himself to Frost, insisting that they both came from humble backgrounds and had to struggle to make it to the top of their fields, only to be knocked back down again. Frost gains new insight into his subject, while Nixon assures Frost that he will do everything in his power to emerge the victor of the final interview.\nThe conversation spurs Frost into action. For the next three days, he works relentlessly to prepare as Reston pursues a lead at the Federal Courthouse library in Washington.As the final interview begins, Frost ambushes Nixon with damning transcripts of a conversation between Nixon and Charles Colson that Reston dug up in Washington. As his own team watches in horror from an adjoining room, Nixon admits that he did unethical things, adding, \"When the President does it, that means it's not illegal.\" A stunned Frost is on the verge of inducing a confession when Brennan bursts in and stops the recording. After Nixon and Brennan confer, the interview resumes. Frost aggressively pursues his original line of questioning; Nixon admits that he participated in a cover-up and that he \"let the American people down.\"Sometime after the interviews have aired, Frost and Cushing pay a farewell visit to Nixon at his villa. Frost thanks Nixon for the interviews and Nixon, graciously admitting defeat, thanks Frost in return and wishes him well. Frost gifts Nixon a pair of Italian shoes identical to the ones Frost wore during the interviews. In a private moment, Nixon asks about the night he drunkenly called Frost, implying that he has no recollection of the event. For the first time, Nixon addresses Frost by his first name. Nixon watches Frost and Cushing leave before placing the shoes on the villa's stone railing and solemnly looking out at the sunset.A textual epilogue states that the interviews were wildly successful, and that Nixon never escaped controversy until his death from a stroke in 1994."
}