{
	"title": "The Incredible Hulk",
	"release_year": "2008",
	"runtime": "112",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Edward Norton",
		"Liv Tyler",
		"Tim Roth",
		"William Hurt",
		"Tim Blake Nelson",
		"Ty Burrell",
		"Christina Cabot",
		"Peter Mensah",
		"Lou Ferrigno",
		"Lou Ferrigno",
		"Paul Soles"
	],
	"staff": [
		"Louis Leterrier",
		"Zak Penn",
		"Stan Lee",
		"Jack Kirby",
		"Avi Arad",
		"Kevin Feige",
		"Gale Anne Hurd",
		"Craig Armstrong",
		"Peter Menzies Jr.",
		"Rick Shaine",
		"Vincent Tabaillon",
		"John Wright",
		"Laray Mayfield",
		"Kirk M. Petruccelli"
	],
	"votes": 530409,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTUyNzk3MjA1OF5BMl5BanBnXkFtZTcwMTE1Njg2MQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "At Culver University in Virginia, Gen. Thunderbolt (William Hurt) Ross meets with Dr. Bruce Banner (Edward Norton), the colleague and lover of his daughter Betty (Liv Tyler), regarding an experiment that is meant, Ross claims, to make humans immune to gamma radiation. The experiment-part of a World War II era \"super soldier\" program that Ross hopes to recreate-fails and exposes Banner to huge amounts of gamma radiation. This has the effect of causing Banner to transform into the Hulk for brief periods of time, whenever his heart rate rises above 200. The Hulk destroys the lab and injures or kills the people inside. Banner becomes a fugitive from the U.S. military and Ross in particular, who wants to convert the Hulk process into a weapon.Five years later, Banner works at a bottling factory in Rocinha, Rio De Janeiro in Brazil, while searching for a cure for his condition. On the Internet, he collaborates with a colleague he knows only as \"Mr. Blue\", and to whom he is \"Mr. Green\". He is also learning meditative breathing techniques from a martial arts expert to help keep control, and has not transformed in 158 days.After Banner cuts his finger, a drop of his blood falls into a bottle, and is eventually ingested by an elderly consumer in Milwaukee, Wisconsin, creating medical complications and eventually killing him. Using the bottle to discover Banner's location, Ross sends a SWAT team, led by Russian-born British Royal Marine Emil Blonsky (Tim Roth) to capture him. Banner transforms into the Hulk and defeats Blonsky's team. After Ross explains how Banner became the Hulk, Blonsky agrees to be injected with a small amount of a serum developed as part of the same operation, which gives him enhanced speed, strength, agility, and healing, but also begins to deform his skeleton and impair his judgment.Banner returns to Culver University and reunites with Betty, who is dating psychiatrist Leonard Samson. Banner is attacked by Ross and Blonsky's forces, tipped off by the suspicious Samson, causing his transformation into the Hulk. The ensuing battle in a courtyard outside the university proves to be futile for Ross' forces and they eventually retreat. But Blonsky, whose sanity is starting to falter, boldly attacks and mocks the Hulk. The Hulk dispatches Blonsky and flees with Betty. After the Hulk reverts to Banner, he and Betty go on the run and stay in a motel for the night and plan to make love but give up at last because his heart rate monitor is beeping frequently. Banner contacts Mr. Blue, who urges them to meet him in New York City.Mr Blue is actually cellular biologist Dr. Samuel Sterns, who tells Banner he has developed a possible antidote to Banner's condition. After a successful test, he warns Banner that the antidote may only reverse each individual transformation. Sterns reveals he has synthesized Banner's blood samples, which Banner sent from Brazil, into a large supply, with the intention of applying its \"limitless potential\" to medicine. Fearful of the Hulk's power falling into the military's hands, Banner attempts to convince Sterns to destroy the blood supply. Blonsky is revealed to have survived his injuries from the previous battle and has completely healed. He joins Ross' forces for a third attempt take Banner into custody. They succeed and Banner, along with Betty, are taken away in Ross' helicopter.Blonsky stays behind and forces Sterns to inject him with Banner's blood, as he covets the Hulk's power. Sterns warns that the combination of the super-soldier formula and Banner's blood may cause him to become an \"abomination\". Unconcerned, Blonsky forces Sterns to administer the blood and a gamma charge. The experiment mutates Blonsky into a creature with size and strength surpassing that of the Hulk, but drives him to become angry like the Hulk. Abomination then attacks Sterns, who gets some of Banner's blood into a cut on his forehead causing it to mutate him. Abomination then rampages through Harlem. Unlike Hulk, Abomination cannot revert back to normal Blonsky state.Realizing that the Hulk is the only one who can stop Abomination, Banner convinces Ross to release him. He jumps from Ross' helicopter and transforms after hitting the ground. After a long and brutal battle through Harlem, the Hulk defeats and nearly kills Abomination by choking him with a huge chain, relenting only after Betty's plea to spare him. After having a small, peaceful moment with Betty, the Hulk flees from the scene, and escapes from New York.\nA month later, Banner is in Bella Coola, British Columbia. Instead of trying to suppress his transformation, he is attempting to transform in a controlled manner. As his eyes turn green, a smile appears on his face.In a post-credits scene at a local bar, General Ross is approached by Tony Stark, who reveals that a \"team\" is being formed.",
	"links": [
		"https://www.amazon.com/Incredible-Hulk-Edward-Norton/dp/B0B8NV8RHM"
	]
}