{
	"title": "Dracula Untold",
	"release_year": "2014",
	"runtime": "92",
	"tags": [
		"Action",
		"Drama",
		"Fantasy",
		"amazon"
	],
	"rating": 6.2,
	"actors": [
		"Luke Evans",
		"Dominic Cooper",
		"Sarah Gadon",
		"Art Parkinson",
		"Charles Dance",
		"Diarmaid Murtagh",
		"Paul Kaye",
		"William Houston",
		"Noah Huntley",
		"Ronan Vibert"
	],
	"staff": [
		"Gary Shore",
		"Matt Sazama",
		"Burk Sharpless",
		"Bram Stoker",
		"Michael De Luca",
		"Ramin Djawadi",
		"John Schwartzman",
		"Richard Pearson",
		"John Hubbard",
		"Ros Hubbard",
		"Chris Keitel",
		"François Audouy"
	],
	"votes": 211329,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTkzNzI1OTI4N15BMl5BanBnXkFtZTgwNTQ2NzEwMjE@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "In the Middle Ages, Vlad the Impaler (Luke Evans) is the prince of Transylvania. As a child, he was enslaved by the Turkish Empire and trained to be a soldier in the Sultan's elite Janissary corp, where he became their most feared warrior, nicknamed the Impaler, after slaughtering thousands. Eventually sickened by his acts, he put aside his past and returned to rule Transylvania in peace. One day in the forest, Vlad and his soldiers discover a Turkish helmet in a stream, and fear that a Turkish scouting party is preparing the way for invasion. They follow the stream to a high mountain cave. Inside, the ground is carpeted in crushed bone, and they are attacked in the dark by an unknown creature. While his men are killed, Vlad escapes the cave into the sunlight, and the creature does not follow. Returning to his castle, Vlad finds out from a local monk that the creature is a vampire, once a man who made a pact with a demon in return for special powers.The next day, as Vlad celebrates Easter with his wife Mirena, his son Ingeras (Art Parkinson), and his subjects, a Turkish contingent arrives unexpectedly at the castle. Vlad offers them the usual tribute payment of silver coins, but the emissary notes that a battalion of Turkish scouts has gone missing, implying that Vlad has had them killed, and demands an additional tribute of 1,000 boys for the Janissaries. Vlad refuses, but his army is small and no match for the Turks. He approaches the Turkish Sultan, Mehmed (Dominic Cooper) the Conqueror, offering himself in place of the boys, but the Sultan refuses, and demands Vlad's son in addition.In desperation, Vlad returns to the vampire's cave to seek help. The vampire offers him some of his blood, which will temporarily give Vlad the powers of a vampire. If he resists the intense urge to drink blood, after three days, he will turn back into a human. Otherwise, he will remain a vampire forever, and will one day be called upon to help his maker. Vlad accepts the offer and drinks the vampire's blood.Waking up in the forest afterwards, Vlad discovers he has been granted heightened senses, increased strength, and the ability to transform into a flock of bats, but his skin slowly burns in direct sunlight. When he returns to Castle Dracula, the Turkish army attack, but Vlad kills them all by himself. He then sends most of the castle's subjects to Cozia Monastery, which is situated on the edge of a mountain. During the journey, Mirena (Sarah Gadon) learns of Vlad's curse, but accepts that he will regain his mortality once the Turks are defeated.A gypsy named Shkelgim, who knows Vlad is a vampire, proclaims himself as his servant and offers his own blood, but Vlad resists. As they near the monastery, the Transylvanians are ambushed by Turkish soldiers, and while Vlad and his men successfully repel them, Vlad's sudden increased strength arouses suspicion among his subjects. The next day at the monastery, a monk learns of the curse and leads the Transylvanians to turn on Vlad, trapping him in a burning building. Black smoke blocks out the sun, allowing an outraged Vlad to escape the fire, and he angrily reveals that he became a vampire for the sole purpose of protecting his people from the Turks.That night, the Turkish army marches on the monastery. Vlad commands an enormous swarm of bats to repel them; however, the soldiers are actually a decoy force, allowing a handful of Turks to infiltrate the monastery and kidnap Ingeras. Mirena tries to defend her son and falls from the edge of the monastery wall. Dying, Mirena pleads with Vlad to drink her blood before the sun rises to give him the strength to save their son. Vlad reluctantly drinks her blood, triggering his final transformation into a full-blooded vampire and granting him even greater powers. Vlad returns to the monastery and turns a small group of survivors into vampires as well. At the Turkish camp, Mehmed prepares for a massive invasion of Europe. Vlad's vampires arrive and massacre the soldiers, while Vlad himself goes after Mehmed, who is holding Ingeras captive.Aware that vampires are weakened by silver, Mehmed has lined the floor of his tent with silver coins and fights Vlad with a silver sword. He overpowers Vlad and prepares to impale his heart with a wooden stake, but Vlad turns into a flock of bats and evades him. Taking the name \"Dracula, Son of the Devil\", he kills Mehmed and drinks his blood.As they leave Mehmed's tent, Dracula and Ingeras are confronted by the other vampires, who demand that his son be killed because he is human. The monk who had previously led the Transylvanians against Vlad appears and keeps the vampires at bay with the Christian Cross. Dracula orders the monk to take Ingeras away, then uses his power to clear the black clouds in the sky. The sunlight burns the vampires into dust, while Dracula collapses into a charred corpse. With Europe saved from invasion, Ingeras is crowned the new Prince of Transylvania, and Vlad the Impaler is presumed dead. However, Shkelgim secretly takes Dracula into the shadows and revives him with his blood.In the present day, Vlad meets a woman named Mina, who strikingly resembles Mirena, in the streets of a modern city, and they have a conversation about a line of poetry they have in common. The vampire who cursed Vlad watches them from afar and anticipates what he has planned for Dracula in the future, saying, \"Let the games begin\".",
	"links": [
		"https://www.amazon.com/Dracula-Untold-Luke-Evans/dp/B00RW1J72C"
	]
}