{
	"title": "Step Brothers",
	"release_year": "2008",
	"runtime": "98",
	"tags": [
		"Comedy",
		"amazon"
	],
	"rating": 6.9,
	"actors": [
		"Will Ferrell",
		"John C. Reilly",
		"Mary Steenburgen",
		"Richard Jenkins",
		"Adam Scott",
		"Kathryn Hahn",
		"Andrea Savage",
		"Lurie Poston",
		"Elizabeth Yozamp",
		"Logan Manus"
	],
	"staff": [
		"Adam McKay",
		"Will Ferrell",
		"Adam McKay",
		"John C. Reilly",
		"Judd Apatow",
		"Jimmy Miller",
		"Jon Brion",
		"Oliver Wood",
		"Brent White",
		"Allison Jones",
		"Clayton Hartley"
	],
	"votes": 323423,
	"cover": "https://m.media-amazon.com/images/M/MV5BYWNiOGZkOTgtNGMzMC00MDg5LTliM2UtN2VjMDI3N2ViOWE5XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Brennan Huff (Will Ferrell) and Dale Doback (John C. Reilly) are immature adults still living at home. Brennan lives with his divorced mother, Nancy (Mary Steenburgen), and Dale lives with his widowed father, Robert (Richard Jenkins). Robert and Nancy meet, fall in love, and get married (where both Brennan and Dale are angry and sour), forcing Brennan and Dale to live with each other as stepbrothers.Brennan and Dale despise each other for interfering with their lifestyles. Dale warns Brennan not to touch his drum kit, which Brennan later does anyway and is confronted by Dale. The argument over the drum kit erupts into a violent brawl between them. They are grounded with no television for a week following the incident and told they must find jobs within a month, or they will be evicted from the house.Nancy tells Robert about the time when Brennan was 17 and Derek 14. Both entered a talent contest. Brennan sang, but Derek bribed the choir to sing \"Brennan has a Mangina\" and Brennan was so embarrassed that he never sang again. Meanwhile Derek lip synced Ice Ice baby and won.When Brennan's younger and more successful brother Derek (Adam Scott), a helicopter leasing agent, comes to visit with his family, he openly ridicules them for their lack of ambition (Robert takes an immediate liking to Derek, when he offers to sell their house so they (Robert and Nancy) can realize their dream of owning a sailboat. Nancy doesn't like this as Dale and Brennan don't have a place to live yet), enticing Dale to punch him in the face. Brennan is awed that Dale stood up to Derek, while Derek's wife Alice (Kathryn Hahn) finds Dale's courage attractive, attempting to begin a sexual affair between the two. Brennan and Dale discover their shared interests and develop a brotherly friendship (they both have the same favorite dinosaur, the same non porno magazine to masturbate to, the same guy they would sleep with if they were chicks and so on).Robert schedules several job interviews for Brennan and Dale, in which they perform poorly. Robert and Nancy reveal their plans, with help from Derek, to sell the house, retire and sail the world on Robert's boat. They also demand that Brennan and Dale attend therapy and find other living arrangements. Brennan and Dale start by sabotaging all attempts by Derek to sell the house by scaring off all potential buyers.Dale and Brennan decide to start an entertainment company (As Brennan is a singer and Dale is a marketing whiz plus knows drums), \"Prestige Worldwide\". They present their first music video, which they filmed on Robert's boat, at Derek's birthday party. The presentation backfires when the video shows the boat crashing, shattering Robert and Nancy's sailing dreams. Robert is furious and refuses to make an investment (the accident cost $80K of damages and delayed his dream of sailing around the world by 4 years), prompting Brennan to berate Robert as Nancy attempts to calm him down. On Christmas Day, Robert announces he wants to divorce Nancy (the previous night Dale and Brennan are sleepwalking again and throwing things around the house, so Robert decides to wake them up, and they pick up Robert and throw him down a flight of stairs), causing Brennan and Dale to break down.Blaming each other for the divorce, Brennan and Dale fight, then decide to go their separate ways. Brennan works for Derek's helicopter leasing firm and Dale works for a catering company. Weeks later, Brennan and Dale are living independently as functioning adults and are doing well at their new jobs.Wanting to reunite the family, Brennan volunteers to oversee a prestigious event at his company, the Catalina Wine Mixer, for Derek's company and invites Robert and Nancy in an attempt to bring them back together. They hire the catering company that employs Dale. The party is a success until the lead singer of the hired band loses his temper and is ejected. With the stage empty, Derek fires Brennan, blaming him for the debacle, and Robert ultimately encourages Brennan and Dale to be their eccentric child-at-heart selves again. Brennan and Dale take the stage and perform \"Por Ti Volare\". Derek is so moved by the performance that he and Brennan make amends. Dale ends his relationship with Alice to her dismay.Six months later, Robert and Nancy are back together living in their old house, while Brennan and Dale have turned \"Prestige Worldwide\" into a successful entertainment company that hosts karaoke events. Robert has his boat turned into a tree-house in the backyard.",
	"links": [
		"https://www.amazon.com/Step-Brothers-Will-Ferrell/dp/B001MT9T3M"
	]
}