{
	"title": "The Hurt Locker",
	"release_year": "2008",
	"runtime": "131",
	"tags": [
		"Drama",
		"Thriller",
		"War",
		"amazon"
	],
	"rating": 7.5,
	"actors": [
		"Jeremy Renner",
		"Anthony Mackie",
		"Brian Geraghty",
		"Guy Pearce",
		"Ralph Fiennes",
		"David Morse",
		"Evangeline Lilly",
		"Christian Camargo",
		"Suhail Dabbach",
		"Christopher Sayegh"
	],
	"staff": [
		"Kathryn Bigelow",
		"Mark Boal",
		"Kathryn Bigelow",
		"Mark Boal",
		"Nicolas Chartier",
		"Greg Shapiro",
		"Marco Beltrami",
		"Buck Sanders",
		"Barry Ackroyd",
		"Chris Innis",
		"Bob Murawski",
		"Mark Bennett",
		"Karl Júlíusson"
	],
	"votes": 477533,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzgyMGM2YTItYzY2Yi00NDQ0LWE0M2EtMGUzYjFlMDgyY2M3XkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "In 2004, Sergeant First Class William James (Jeremy Renner) arrives as the new team leader of a U.S. Army Explosive Ordnance Disposal (EOD) unit in the Iraq War. He replaces Staff Sergeant Matthew Thompson (Guy Pearce), who was killed by an improvised explosive device (IED) in Baghdad.\nThompson's team was called in after there were reports of an IED in a Baghdadi neighborhood. Thompson inspected the IED via a remote-controlled robot. Thompson decided that he will trigger a controlled explosion of the IED with C4 to eliminate the threat. The wagon carrying the C4 to the IED malfunctions and hence Thompson has to carry the C4 himself. Thompson is decked in blast proof gear. While Thompson is returning after placing the C4, Sanborn notices a local with a phone near the IED. Before the man can be stopped, he triggers the IED, thereby killing Thompson (who was 25 meters away from the IED and still in the kill zone).James's team includes Sergeant J. T. Sanborn (Anthony Mackie) and Specialist Owen Eldridge (Brian Geraghty). When James arrives on the scene, Bravo Company has 39 days left on its current deployment.James is often approached by an Iraqi youth nicknamed \"Beckham\" (Christopher Sayegh), attempting to sell DVDs. James challenges him to a game of soccer and takes a liking to him.\nJames is a renegade for who the thrill of the dismantlement seems to be the ultimate goal regardless of the safety of his fellow team members, others on the scene or himself.\nJames removes the protective layers on his windows at barracks as they block the sunshine, and he argues that they will not stop a mortar round coming from the roof.On his first day out in the streets, James decides to approach a suspected IED directly with his blast proof gear, without deploying the robot first. James detonates a smoke bomb to protect himself, without giving any warning to his colleagues. As James approaches the IED, a taxi breaks through the cordon and barrels towards James. James pulls out his own pistol and stops the taxi. After a protracted face-off, James forces the Taxi to reverse, where the driver is apprehended by US forces. James then finds the IED and dismantles it. He then finds several secondaries linked to the primary IED, and proceeds to dismantle all of them, before they can be triggered by an onlooking local.On the other hand, Sanborn is by the books. And Eldridge is an insecure soldier who is constantly worried that an error or misjudgment on his part will lead to the death of an innocent civilian or a military colleague.Next day, the team is assigned to a school, where a car has been parked illegally and is carrying something heavy in the back (as its suspension is sagging). As James approaches the car, it is fired upon by a sniper, and the car bursts into flames. James uses a fire extinguisher to extinguish the flames, while Sanborn is sent to the roof to suppress the sniper fire. James finds heavy IEDs in the trunk. He removes his blast gear, as anyways he won't survive if the IEDs go off. As James works on locating the triggering mechanism, Sanborn keeps shouting in his earpiece to hurry up, prompting James to remove his earpiece.\nMeanwhile, Sanborn and Eldridge find a local filming them on a camera and 3 locals giving instructions to him from a minaret. James manages to find the well concealed triggering mechanism. Sanborn hits James and warns him not to remove his headset again.\nColonel Reed (David Morse) congratulates James for his bravery. James has dismantled 873 bombs so far.Sanborn and Eldridge consider James' maverick disposal methods and attitude reckless, raising tensions. When they are assigned to destroy captured explosives, James returns to the detonation site to pick up his gloves. Sanborn openly contemplates killing him by \"accidentally\" triggering the explosives, making Eldridge uncomfortable. Nothing is done, and tensions continue to increase.Returning to Camp Victory in their Humvee, the team encounters five armed men in traditional Arab garb and casual attire standing near a Ford Excursion, which has a flat tire. James' team has a tense encounter with their leader, who reveals they are private military contractors and British mercenaries. They have captured two prisoners featured on the most-wanted Iraqi playing cards.The group comes under fire; when the prisoners attempt to escape in the confusion, the leader of the mercenaries shoots them, as they are valuable (worth $500,000) dead or alive. Enemy snipers kill three of the mercenaries, including their leader (Ralph Fiennes). Sanborn and James (as spotter) take over the sniper gun to dispatch three attackers (who were attacking with their own sniper rifle from a distance), while Eldridge kills a fourth who tries the flank their position.\nSanborn and James finally start to bond and enjoy their time together.During a raid on a warehouse (where they find several components of IEDs and a large amount of ammunition), James discovers a body he believes is Beckham, in which a bomb has been surgically implanted. During the evacuation, Lieutenant Colonel John Cambridge (Christian Camargo), the camp's psychiatrist and a friend of Eldridge, is killed in an explosion. Eldridge blames himself for his death as Elridge had goaded Cambridge to see the operations in the field and not pass judgments on people sitting in his cubicle inside the base.\nReturning to base, James approaches the stall where Beckham used to sell his DVDs and inquires the elderly man about him. The elderly man pretends not to know English. But at night, when the man packs up his stuff in his truck, James corners him with a pistol and asks to be taken to the people responsible for Beckham's death. James is dropped outside a home in a residential neighborhood.\nJames breaks into the house of an Iraqi professor, seeking revenge for Beckham, but his search reveals nothing.Called to a petrol tanker detonation, James decides to hunt for the insurgents responsible, guessing they are still nearby. Sanborn protests, but when James begins a pursuit, he and Eldridge reluctantly follow. After they split up, insurgents capture Eldridge. James and Sanborn rescue him, but one of James' rounds hits Eldridge in the leg.\nThe following morning, James is approached by Beckham, whom James believed was dead, and James walks by silently. Before being airlifted for surgery, Eldridge angrily blames James for his injury.James and Sanborn's unit is called to another mission in their last two days of their rotation. An innocent Iraqi civilian (Suhail Dabbach) has had a bomb vest strapped to his chest. James tries to cut off the locks to remove the vest, but there are too many of them. He abandons the man who is then killed when the bomb explodes. Sanborn is distraught by the man's death. He confesses to James he can no longer cope with the pressure and wants to return home and have a son.After Bravo Company's rotation ends, James returns to his ex-wife Connie (Evangeline Lilly) and their infant son, who still lives with him in his house. However, he is bored by routine civilian life. James confesses to his son there is only one thing he knows he loves. He starts another tour of duty, serving with Delta Company, a U.S. Army EOD unit on its 365-day rotation.",
	"links": [
		"https://www.amazon.com/Hurt-Locker-Kathryn-Bigelow/dp/B0DMHHNHC5"
	]
}