{
	"title": "Monsters vs Aliens",
	"release_year": "2009",
	"runtime": "94",
	"tags": [
		"Action",
		"Adventure",
		"Animation",
		"amazon"
	],
	"rating": 6.4,
	"actors": [
		"Reese Witherspoon",
		"Reese Witherspoon",
		"Rainn Wilson",
		"Stephen Colbert",
		"Seth Rogen",
		"Hugh Laurie",
		"Will Arnett",
		"Kiefer Sutherland",
		"Paul Rudd",
		"Julie White",
		"Jeffrey Tambor"
	],
	"staff": [
		"Rob Letterman",
		"Conrad Vernon",
		"Maya Forbes",
		"Wallace Wolodarsky",
		"Rob Letterman",
		"Jonathan Aibel",
		"Lisa Stewart",
		"Henry Jackman",
		"Joyce Arrastia",
		"Erika Dapkewicz",
		"Leslee Feldman",
		"David James"
	],
	"votes": 178503,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTY0OTQ3MzE3MV5BMl5BanBnXkFtZTcwMDQyMzMzMg@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Bride-to-be Susan Murphy (Reese Witherspoon) is about to get married to weather reporter Derek Dietl (Paul Rudd). Susan has parents Carl (Jeffrey Tambor) and Wendy (Julie White). Susan is looking forward to her honeymoon in Paris, and believes that one day Derek will become a foreign correspondent and together they will see the world.\nBefore the ceremony, Derek tells Susan that instead of going to Paris, they will be going to Fresno, as he has a job interview for an anchor position at a much bigger news channel. Susan tries to be supportive to Derek and his career.Just before the ceremony, a meteorite from a destroyed planet strikes in Modesto, California (the venue of Susan's wedding).\nInstead of killing her the meteorite exposes her to the substance Quantonium. Though she initially appears unharmed, during the ceremony, the energy causes Susan's hair to turn white, her whole body starts glowing green with energy, and she rapidly grows to over 50 feet tall. Susan breaks through the roof of the chapel and scares away all the wedding guests who run for their lives.Alerted to the meteorite, first by an Antarctic base (The US outpost FAB220) and then the priest at Susan's wedding, the military arrives and captures Susan. She is given the code name \"Ginormica\" and sent to a top-secret secure facility headed by General W.R. Monger (Kiefer Sutherland).There she meets her fellow monster inmates: B.O.B. (Benzoate Ostylezene Bicarbonate) (Seth Rogen), a brainless and living indestructible mass of blue goo that is a result of a food flavoring mutation; Dr. Cockroach, PhD (Hugh Laurie), a scientist who became half-human, half-cockroach after an experiment gone wrong; the Missing Link (Will Arnett), a prehistoric 20,000-year-old fish-ape hybrid who was thawed from deep ice by scientists; and Insectosaurus, a massive bug mutated by nuclear radiation standing 350 feet in height that attacked Tokyo, Japan.\nGinormica is the first new monster to join the gang in several years and the certainly the first female monster ever recorded.Monger tells Ginormica that the facility was created in 1950 to hide the presence of monsters from the general public. Monger says that Ginormica will be at the facility indefinitely, she cannot contact her family or Derek and they would never know where she is either.Meanwhile, on a mysterious spaceship, a squid-like extraterrestrial overlord named Gallaxhar (Rainn Wilson) is alerted to the presence of a powerful substance known as \"Quantonium\" on Planet Earth, and sends a gigantic robotic probe to retrieve it. Gallaxhar wants every drop of Quantonium to be in his possession to power the next phase of his plans.\nAfter the robot lands the President of the United States (Stephen Colbert) attempts to make first contact with it by playing Axel F on a keyboard, but the attempt fails, and the impervious robot begins destroying everything in sight. The robot heads straight for San Francisco, despite unsuccessful attempts by the U.S. Armed Forces to destroy it. The robot simply stomps the US military hardware into oblivion and continuous unimpeded. The robot has a force field around it, and the missiles and rockets fired at it, explode harmlessly, without causing any damage.The President convenes his advisory council, which has ideas like giving the alien a Green Card, or shifting the USA off the planet, or convening the top scientific minds to solve the problem (which all reside in India). The council warns the President against launching the nukes against the alien.\nGeneral Monger convinces the President to use his monsters to fight the robot instead. The monsters accept the mission when they are promised their freedom if they succeed. In San Francisco, the robot detects the Quantonium within Ginormica's body and targets her.\nAt the Golden Gate Bridge, the monsters manage to destroy the giant robot by using parts of the bridge itself; ergo, the government honors their deal with the monsters and sets them free.Gallaxhar sets a course for Earth to obtain the Quantonium himself.\nNow free, Susan returns home and introduces her family to the monsters. They are quickly rejected, though, after innocently causing a neighborhood panic. Derek breaks up with Susan, claiming that he cannot be married to a freak since she would overshadow his career. Heartbroken, Ginormica soon realizes that her life was better as a monster, and she swears to the other monsters to never go back to her original self again.Suddenly, she is abducted by Gallaxhar, who appears to kill Insectosaurus in the process. On Gallaxhar's spaceship, Susan escapes and chases Gallaxhar down, only to be lured into a machine that extracts the Quantonium from her body, allowing her to shrink back down to her normal size. Gallaxhar then uses the extracted Quantonium to power a machine that creates an army of his clones to invade the Earth.With General Monger's help, B.O.B., Dr. Cockroach, and the Missing Link infiltrate Gallaxhar's spaceship, rescue Susan, and hot-wire the spaceship's power core, activating the self-destruct sequence. During their escape, Susan is cut off from her friends who are trapped in the power core. They tell her to save herself, but Susan instead finds Gallaxhar, who is trying to escape with the Quantonium. She tries to force him into releasing her friends, but when he admits he cannot reverse the sequence, Susan instead takes the Quantonium, restoring herself to giant size and saving her friends.\nAfter rescuing her friends, they flee the ship and are rescued by Monger and Insectosaurus, who was actually metamorphosing into a giant butterfly the whole time. The ship then self-destructs, killing Gallaxhar and his army.Returning to Modesto, Ginormica, B.O.B, Dr. Cockroach, Link, and Butterflyosaurus receive a hero's welcome. Derek returns to Susan and tries to interview her and tells her to get back and work together to get their dream jobs, but she rejects and humiliates him live on camera in retaliation for breaking up with her. Monger then arrives to inform the monsters that a monstrous snail named \"Escargantua\" is slowly making its way to Paris, France after falling into a nuclear reactor, resulting in the heroes taking off to confront the new menace.",
	"links": [
		"https://www.amazon.com/Monsters-vs-Aliens-Conrad-Vernon/dp/B079J5KB28"
	]
}