{
	"title": "Seven Pounds",
	"release_year": "2008",
	"runtime": "123",
	"tags": [
		"Drama",
		"Mystery",
		"Thriller",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Will Smith",
		"Rosario Dawson",
		"Woody Harrelson",
		"Michael Ealy",
		"Barry Pepper",
		"Elpidia Carrillo",
		"Robinne Lee",
		"Joe Nunez",
		"Joe Nunez",
		"Bill Smitrovich",
		"Tim Kelleher"
	],
	"staff": [
		"Gabriele Muccino",
		"Grant Nieporte",
		"Todd Black",
		"Jason Blumenthal",
		"James Lassiter",
		"Will Smith",
		"Angelo Milli",
		"Philippe Le Sourd",
		"Hughes Winborne",
		"Denise Chamian",
		"Angela Demo",
		"J. Michael Riva"
	],
	"votes": 317323,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTU0NzY0MTY5OF5BMl5BanBnXkFtZTcwODY3MDEwMg@@._V1_QL75_UY281_CR11,0,190,281_.jpg",
	"description": "The movie starts with Tim calling 911 to report his own suicide.Two years ago, Tim Thomas (Will Smith), sending a text message while driving, caused a car crash in which seven people died: six strangers (Ken Anderson, Nicole Anderson, Ally Anderson, Ed Wright, Steven Philips, Monica Freeman) and his fiance, Sarah Jenson (Robinne Lee).\nIn a bid for redemption, Tim sets out to save the lives of seven good people, although this goal only becomes clear near the end of the film. Throughout his journey, Tim keeps repeating the names of the 7 people he killed, to remind himself why he is doing what he is doing.A year after the crash, having quit his job as an aeronautical engineer, Tim donates a lung lobe to his brother, Ben (Michael Ealy), an IRS employee. Six months later he donates part of his liver to a social services worker named Holly (Judyann Elder). After that, he begins searching for more candidates to receive donations. He finds George (Bill Smitrovich), a junior hockey coach, and donates a kidney to him, and donates bone marrow to a young boy named Nicholas (Quintin Kelley).Tim has stolen his brother's IRS credentials & uses that to get information on all potential recipient candidates. He also visits them at their place of work & at home to figure out whether they deserve his gift of life to them.\nHe visits Stewart Goodman (Tim Kelleher) who runs an old age home and needs a bone marrow transplant. He finds that Stewart has bought a new Beemer but has reduced operating costs at the center by 17%, causing untold misery to the old people.\nTim rejects Stewart when an old patient tells Tim that Stewart punishes her and bursts into tears.Two weeks before he dies, he contacts Holly and asks if she knows anyone who deserves help. She suggests Connie Tepos (Elpidia Carrillo), who lives with an abusive boyfriend who broke her ribs just a month ago. Tim tells Connie that he can help her and leaves his number. But Connie asks Tim to leave. Tim moves out of his house and into a local motel, taking with him his pet box jellyfish.\nOne night, after being beaten, Connie contacts Tim and he gives her the keys and deed to his beach house. She takes her two children, and they move into their new home.Having stolen his brother's credentials, and making himself known by his brother's name Ben, he checks out candidates for his two final donations.\nThe first is Ezra Turner (Woody Harrelson), a blind meat salesman who plays the piano. Tim calls Ezra Turner and harasses him at work to check if he is quick to anger. Tim tries to provoke Ezra by saying that he wants to return the meat he bought from the company, as it is no good and, in the process, personally insults Ezra. Tim taunts Ezra as a blind meat salesman who doesn't eat meat. Tim calls Ezra a virgin and says that the world is surrounded by beauty and yet Ezra cannot see anything.\nEzra remains calm and Tim decides he is worthy.He then contacts Emily Posa (Rosario Dawson), a self-employed greeting card printer who has a heart condition and a rare blood type. Tim visits Emily at the hospital secretly. Tim approaches Emily and says that he is from the IRS, and she is being audited for not paying taxes of $56,240.19.\nTim knows that Emily has congenital heart failure, and that she is considered sick, but not sick enough to be on a donor recipient list. So, if her heart fails suddenly, she will most probably die. Emily considers that she does not deserve a heart as her life is unremarkable in every way. Tim gives her some respite by marking her accounts as noncollectable, penalty free, for the next 6 months.He spends time with her, weeding her garden and fixing her rare Heidelberg Windmill press. He begins to fall in love with her and decides that, as her condition has worsened and she is admitted to the hospital, he needs to make his donation. Emily is put on the donor list as she only has 4-6 weeks left with her current heart.Tim's brother Ben tracks him down at Emily's house, demanding that Tim return Ben's IRS credentials. After an interlude with Emily, Tim leaves her sleeping and returns to the motel. He fills the bathtub with ice water to preserve his vital organs, climbs in, and commits suicide by pulling his box jellyfish into the water with him.His friend Dan (Barry Pepper) acts as executor to ensure that his organs are donated to Emily and Ezra. Ezra Turner receives his corneas and Emily receives his heart. Afterward, Emily meets Ezra at his concert at a park, and they begin to talk.",
	"links": [
		"https://www.amazon.com/Will-Smith-Pounds-Elpidia-Carrillo/dp/B001QERPAC",
		"https://www.amazon.com/Seven-Pounds-Blu-ray-Will-Smith/dp/B001PMR2GM"
	]
}