{
	"title": "Superbad",
	"release_year": "2007",
	"runtime": "113",
	"tags": [
		"Comedy",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Michael Cera",
		"Jonah Hill",
		"Christopher Mintz-Plasse",
		"Bill Hader",
		"Seth Rogen",
		"Martha MacIsaac",
		"Emma Stone",
		"Aviva Baumann",
		"Joe Lo Truglio",
		"Kevin Corrigan"
	],
	"staff": [
		"Greg Mottola",
		"Seth Rogen",
		"Evan Goldberg",
		"Judd Apatow",
		"Shauna Robertson",
		"Lyle Workman",
		"Russ T. Alsobrook",
		"William Kerr",
		"Allison Jones",
		"Chris L. Spellman"
	],
	"cover": "https://m.media-amazon.com/images/M/MV5BNjk0MzdlZGEtNTRkOC00ZDRiLWJkYjAtMzUzYTRiNzk1YTViXkEyXkFqcGc@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"links": [
		"https://www.amazon.com/Superbad-4K-UHD-Jonah-Hill/dp/B08FF86NDD"
	],
	"votes": 643339,
	"description": "Two weeks before their high school graduation, long-time best friends Evan (Michael Cera) and Seth (Jonah Hill) are about to leave for different colleges. Their mutual friend, Fogell (Christopher Mintz-Plasse), has plans to acquire a fake ID, so Seth agrees to buy alcohol for a party that his crush, Jules (Emma Stone), is hosting. Evan also offers to buy Goldslick vodka for his long-time crush Becca (Martha MacIsaac). There is some tension between Seth and Evan because Evan and Fogell will both be going to Dartmouth while Seth will be going to a state college.While purchasing the alcohol Fogell is assaulted by a hooded robber, and the police soon arrive. The two officers, Michaels (Seth Rogen) and Slater (Bill Hader), appear to be fooled by Fogell's fake ID (which has the single name \"McLovin\" as his identity) and offer Fogell a lift to the party. On the way, however, they make numerous stops and display many instances of inappropriate use of police powers, including stealing beers, drinking on the job, unnecessary use of police lights, and improper use of their firearms.While the police officers are talking to Fogell at the liquor store, Evan and Seth make the assumption that Fogell has been arrested. Seth is suddenly hit by a car but seems uninjured. To avoid being reported, the driver, Francis (Joe Lo Truglio), agrees to take them to a party, where they reason they can steal the alcohol they need. However, Francis is not welcome at the party and is subsequently assaulted by the host, Mark (Kevin Corrigan), and Seth and Evan are forced to leave, but not before smuggling out beer in laundry detergent bottles.Once at a safe distance, the two stop to catch their breath and Seth accuses Evan of bailing on him. Evan defends himself saying that the whole thing was Seth's idea. Seth retorts saying that not only did Evan bail on him at the party but also at earlier that morning when a bully spat on Seth and will again be bailing on him when he goes to Dartmouth that Fall. Evan then angrily confesses that he feels Seth has been holding him back for the last three years and that while he could have been out making friends and chasing girls, he sat around talking \"bulls**t.\" The two then get into a shoving match. During the fight, Seth is again hit by a car, this time the police cruiser occupied by Slater, Michaels, and Fogell. Officer Slater prepares to arrest the teens, but Evan runs off and the two officers chase him while the reunited Seth and Fogell make off with the rest of the alcohol. The trio eventually make it to the party.At the party, a drunken Becca offers to perform fellatio on Evan in a secluded upstairs room, but Evan declines with the excuse that she is too drunk, and a heavily intoxicated Becca ends up vomiting on the bed comforter. A drunken Seth tries to kiss Jules, who explains that she does not drink and does not want to do anything while he is intoxicated. Seth attempts to express his feelings for Jules but passes out from the alcohol and accidentally head-butts her, giving her a black eye. Fogell successfully seduces his crush, Nicola (Aviva Farber), and gets her into bed, only to have officers Slater and Michaels break up the party after only a few seconds of sex.Officers Slater and Michaels reveal to Fogell that they were aware of his fake ID all along and decided to ignore it since they saw a bit of themselves as teenagers in Fogell. Fogell in turn asks them a favor in return for their intrusion upon his love making: the officers pretend to haul him off to jail in front of the entire party to boost his popularity. In return, Fogell signs an affidavit to a concocted story to explain the condition of the wrecked police car, which they proceed to have fun destroying. Meanwhile, Evan, having passed out from intoxication, is carried off by Seth to avoid arrest from the police officers who have spent the remainder of the night searching for them. At Evan's house Seth reveals his brotherly love for Evan, who then reveals the feelings are mutual.The following morning, Evan and Seth run into Becca and Jules at the mall. After an awkward conversation about the mistakes of the previous night, Seth takes Jules to get cover up for her eye, while Evan and Becca go off to look for some comforters."
}