{
	"title": "Thor",
	"release_year": "2011",
	"runtime": "115",
	"tags": [
		"Action",
		"Fantasy",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Chris Hemsworth",
		"Anthony Hopkins",
		"Natalie Portman",
		"Tom Hiddleston",
		"Stellan Skarsgård",
		"Kat Dennings",
		"Clark Gregg",
		"Colm Feore",
		"Idris Elba",
		"Ray Stevenson"
	],
	"staff": [
		"Kenneth Branagh",
		"Ashley E. Miller",
		"Zack Stentz",
		"Don Payne",
		"J. Michael Straczynski",
		"Kevin Feige",
		"Patrick Doyle",
		"Haris Zambarloukos",
		"Paul Rubell",
		"Sarah Finn",
		"Randi Hiller",
		"Bo Welch"
	],
	"votes": 911702,
	"cover": "https://m.media-amazon.com/images/M/MV5BNjRhNGZjZjEtYTQzYS00OWUxLThjNGEtMTIwMTE2ZDFlZTZkXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Three scientists, Jane Foster (Natalie Portman), Erik Selvig (Stellan Skarsgard) and Darcy Lewis (Kat Dennings) are in a 4WD van in New Mexico & see a lightning storm develop and they drive toward it. Jane is convinced that she has the ability to predict the appearance of Einstein Rosen Bridge, or wormholes in other words.\nThe van hits a man inside the maelstrom, and they stop, it is a well-built blond-haired man, semi-conscious.In 965 AD, on Earth, the Frost Giants visited Norway. They used the Tesseract and its limitless power to try and convert Earth into a frozen wasteland. Asgardians followed with their armies and joined humans in fighting the Frost Giants.\nA battle in 965 AD between Frost Giants and Asgardians starts on Earth. The Asgardians force the Frost Giants to retreat to their own home world. The Asgard win and take over the Casket of Ancient Winters (which contained the Tesseract) and return to their realm. The speaker is Odin (Anthony Hopkins) talking to his 2 sons, one blonde, the other a more thoughtful dark-haired boy. Odin says both of them are worthy but only one can be king. Odin says that a wise King never seeks war but is always ready for it.\nFrigga (Rene Russo) is the mother to Thor and Loki.Years later Asgard is celebrating, the blonde is now the adult Thor (Chris Hemsworth) and he's becoming crown prince. His brother Loki (Tom Hiddleston) is jealous. Before Odin can announce, there are intruders in the secure rooms that hold the Frost Giant power casket. A large Destroyer robot kills the intruders and saves the day. Examining the remains Odin seems unperturbed, yet Thor is angry and wants to attack the Frost Giants. Odin orders Thor to stand down and says that he is not the King yet.Thor gathers Loki and his friends, Volstag (Ray Stevenson), Fandral (Josh Dallas), Hogun (Tadanobu Asano) and Sif (Jaimie Alexander) and are transported to the frost giant planet, Jotunheim. Heimdall allows Thor and his friends to pass as even he wants to know how the Frost Giants got past him to enter Asgard.\nKing Laufey (Colm Feore) taunts the Asgardian heroes, and a battle starts. Loki survives as Frost can't touch him and his skin turns blue just as the skin color of the other Frost Giants. Laufey releases a huge beast and the Asgard run for their lives. Odin arrives to save the day, he apologizes to Laufey and takes the group home.Odin is angry at Thor & banishes him to Earth & strips him of his power. He also sends his hammer Mjolnir saying only worthy can use it.\nBack in desert Thor is aggressive & Darcy tasers him & takes him to hospital. Jane is attracted to him. Thor escapes from the hospital, but Jane again catches up with him & take him with her. Thor is looking for his hammer & follows the reports of a satellite crash 50 miles away.\nJane had all the data that suggests Thor traveled through a wormhole to arrive on Earth, but Agent Colsen arrives and takes all her equipment away.The Hammer is already under Government protection who also take Janes research notes. Thor attacks at night but is subdued when he can't lift the hammer.\nBack in Asgard the 3 friends suspect Loki had something to do with Thor's banishment. Loki realizes he is not a pure Asgard and Odin had admitted he was taken from Jotunheim as an infant and raised as his own. Loki is confused and angry as Odin falls into a coma (\"Odinsleep\") upon being confronted. Loki becomes acting King.Agent Coulson (Clark Gregg) questions Thor. Loki appears & tells Thor that Odin is dead & he can't be brought back to Asgard. Erik tells Coulson that Thor is Jane's ex-husband & he is let go. Thor & Erik have a drink & Erik passes out. Thor explains his background to Jane.\nLoki freezes the portal guard Heimdall (Idris Elba) (The all-seeing, all-hearing Asgardian sentry of the Bifrost bridge) then goes and meets Laufey. It was Loki that allowed the Frost Giants into Asgard to go for the power casket earlier. He makes a deal with Laufey that he will let them into Asgard again to kill Odin and have their casket, in return they will go home in peace.Loki commands the Destroyer to go to earth and kill Thor. The giant robot arrives in the NM desert and starts blasting everything with a heat ray. Thor and the three scientists attempt to get everyone away safely.\nThor confronts the Destroyer and asks Loki to leave the humans alone in return for himself. Loki can see and hear what is going on from Asgard. The Destroyer gives Thor a vicious backhand slap and sends him tumbling, apparently dead. Jane runs to the body in tears.\nHowever, Thor's selfless act in protecting his friends proves him worthy to once again wield Mjolnir, which frees itself from the crater and returns to Thor's hand. He is transformed to full life and vigor and once again fitted in his red cape and armor. He easily defeats the Destroyer and tries to return to Asgard, promising Jane he will return.In Asgard the frost giants invade through the portal, walking past the frozen guard. Laufey goes to Odin's bed chamber and, as he prepares to kill the Norse god, Loki kills Laufey to appear to be the hero. Although frozen Heimdall is conscious and manages to break free. He brings Thor back to Asgard. Thor flies quickly to fight the Frost giants.Loki goes to the Bifrost Portal and sets it up to destroy the ice planet realm. Thor tries to stop him and the two engage in combat. Thor immobilizes Loki with Mjolnir and starts to destroy the portal to stop the process. As everything crumbles the two brothers fall into space but Odin is there to hold Thor who holds Loki's staff. Loki admits defeat and allows himself to fall into the disappearing Bifrost Bridge.All seems back to normal on Asgard, Odin is sad how it all turned out, Thor pines for Jane but Heimdall assures him she is looking for him. Back on Earth Jane is in a new lab with new equipment.In a post-credits scene, Selvig is taken to a S.H.I.E.L.D. facility, where Nick Fury opens a briefcase and asks him to study a mysterious cube-shaped object, which Fury says may hold untold power. An invisible Loki prompts Selvig to agree.",
	"links": [
		"https://www.amazon.com/Thor-Natalie-Portman/dp/B005H9B2CE"
	]
}