{
	"title": "Marley & Me",
	"release_year": "2008",
	"runtime": "115",
	"tags": [
		"Drama",
		"Family",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Owen Wilson",
		"Jennifer Aniston",
		"Eric Dane",
		"Kathleen Turner",
		"Alan Arkin",
		"Nathan Gamble",
		"Haley Bennett",
		"Ann Dowd",
		"Clarke Peters",
		"Finley Jacobsen"
	],
	"staff": [
		"David Frankel",
		"Scott Frank",
		"Don Roos",
		"John Grogan",
		"Gil Netter",
		"Karen Rosenfelt",
		"Theodore Shapiro",
		"Florian Ballhaus",
		"Mark Livolsi",
		"Margery Simkin",
		"Stuart Wurtzel"
	],
	"votes": 169454,
	"cover": "https://m.media-amazon.com/images/M/MV5BYjAzOGQ1NjYtNWZmMi00ZDcwLThiMGEtZTdkZjkzMDU5ZjE2XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Soon after their wedding, John (Owen Wilson) and Jenny Grogan (Jennifer Aniston) escape the brutal Michigan winters and relocate to a cottage in South Florida, where they are hired as reporters for competing newspapers. At The Palm Beach Post, Jenny immediately receives prominent front-page assignments, while at the South Florida Sun-Sentinel, John finds himself writing obituaries and two-paragraph articles about mundane news like a fire at the local garbage dump.When John senses Jenny is contemplating motherhood, his friend and co-worker Sebastian Tunney (Eric Dane) suggests the couple adopt a dog to see if they're ready to raise a family. From a litter of newborn yellow Labrador retrievers, they select Marley (named after reggae singer Bob Marley), who immediately proves to be incorrigible. The couple picks Marley as the girls were $300, the boys were $275, and Marley was available at $200.\nJenny has to travel for a work-related assignment, leaving John to look after Marley, right after he is brought home. Marley eats a lot and refuses to stay in garage, making a loud racket all night, so John brings him into the bedroom. Marley rips open the pillows and the mattress on the very first night. The next day John goes to pick up Jenny from the airport and Marley destroys the home while he is alone.\nAs Marley grows in size, he becomes more and more difficult to control.This forces John and Jenny to enroll him in a dog obedience program run by a woman named Ms. Kornblut (Kathleen Turner). Unfortunately, Marley refuses to obey commands and when she blows her whistle, he tackles her and humps her leg, prompting her to kick him out of her class. When they tried to take Marley to get neutered, he tried to escape the car onto a busy road, almost getting him road killed.Editor Arnie Klein (Alan Arkin) offers John a twice-weekly column in which he can discuss the fun and foibles of everyday living. At first stumped for material, John realizes the misadventures of Marley might be the perfect topic for his first piece. Arnie agrees and loves the material, and John settles into his new position.\nMarley continues to wreak havoc on the household, providing John with a wealth of material for his column (Like rescuing the mailman and the UPS guy from Marley, chasing him 15 blocks and writing a column on gas prices, sat in the dark for 3 days with Marley when a hurricane hit South Florida, chased Marley at a restaurant when he was chained to a table and he ran away with it, chased him into a baseball field when they went to watch a game together and so on), which becomes a hit with readers and helps increase the newspaper's circulation. Jenny becomes pregnant but loses the baby early in her first trimester (the doctor finds no heartbeat at the 10-week sonogram). Jenny is distraught and finds comfort with Marley, who weighs a 100 pounds by now.She and John travel to Ireland for a belated honeymoon, leaving the rambunctious dog in the care of a young woman who finds him impossible to control, especially during the frequent thunderstorms that plague the area (Thunder are Marley's weak spot and he howls whenever there is a thunderstorm in the area). John and Jenny return to a damaged house, The sitter calls Marley an Evil incarnate, with a dog face on.\nSoon after returning from their vacation, Jenny discovers she is pregnant again, and this time she delivers a healthy boy, Patrick. Marley is introduced to Patrick. Patrick grows up playing with Marley.\nWhen she has a second son, Connor, she opts to give up her job and become a stay-at-home mom, prompting John to take on a daily column for a pay increase (Arnie offers to double the salary if John agrees to daily column). John was hesitant as he wanted to see himself as a reporter.\nDue to the crime rate (a neighborhood girl is stabbed), the couple decides to move to a larger house in the safer neighborhood of Boca Raton, where Marley delights in swimming in the backyard pool.Although she denies she is experiencing postpartum depression, Jenny exhibits all the symptoms, including a growing impatience with Marley and John, who asks Sebastian to care for the dog when Jenny insists that they give him away. Jenny claims that she is only exhausted, and she is not depressed. John resists as he considers Marley as a member of the family,\nJenny quickly comes to realize he has become an indispensable part of the family and agrees he can stay. Sebastian accepts a job for The New York Times and moves away, which depresses John as that is the life, he wanted for himself.John celebrates his 40th birthday. Increasingly disenchanted with his job, he decides to accept a position as a reporter with The Philadelphia Inquirer with Jenny's blessing, and the family moves to a farm in rural Pennsylvania. John soon realizes that he is a better columnist than reporter and pitches the column idea to his editor. Life is idyllic until the aging Marley begins to show signs of arthritis and deafness. An attack of gastric dilatation Volvulus almost kills him, but he recovers.When a second attack occurs, it becomes clear surgery will not help him, and Marley is Euthanized with John at his side. The family pay their last respects to their beloved pet as they bury him beneath a tree in their front yard.",
	"links": [
		"https://www.amazon.com/Marley-Me-Owen-Wilson/dp/B001TGLKB2"
	]
}