{
	"title": "Definitely, Maybe",
	"release_year": "2008",
	"runtime": "112",
	"tags": [
		"Comedy",
		"Drama",
		"Romance",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Ryan Reynolds",
		"Rachel Weisz",
		"Abigail Breslin",
		"An Nguyen",
		"Matthew Mason",
		"Rick Derby",
		"Sakina Jaffrey",
		"Bob Wiltfong",
		"Ryder Chasin",
		"Fiona Lane"
	],
	"staff": [
		"Adam Brooks",
		"Adam Brooks",
		"Tim Bevan",
		"Eric Fellner",
		"Clint Mansell",
		"Florian Ballhaus",
		"Peter Teschner",
		"Ali Farrell",
		"Laura Rosenthal",
		"Stephanie Carroll"
	],
	"links": [
		"https://www.amazon.com/Definitely-Maybe-Ryan-Reynolds/dp/B0018T9JW2"
	],
	"votes": 174633,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTc1Mzc1ODMxMF5BMl5BanBnXkFtZTcwNDY1MzU1MQ@@._V1_QL75_UY281_CR6,0,190,281_.jpg",
	"description": "Will Hayes (Ryan Reynolds) works at an advertising agency in New York City and is in the middle of a divorce from wife Sarah (Elizabeth Banks). After her first sex education class, his 10-year-old daughter Maya (Abigail Breslin) insists on hearing the story of how her parents met. Will gives in, but changes the names and some of the facts, leaving Maya to guess which of the women from his past is Sarah, her mother.Will begins his \"mystery love story\" in 1992, when he moves away from Madison, Wisconsin and his college sweetheart, \"Emily Jones\" (Elizabeth Banks), to work on the Clinton campaign in New York City. There, he meets \"April Hoffman\" (Isla Fisher), a fellow campaign staffer, and delivers a package from Emily to her college friend, \"Summer Hartley\" (Rachel Weisz). The package is revealed to be Summer's diary, which Will had read, learning she had a brief affair with Emily in college.Arthur Robredo (Nestor Serrano) is the campaign manager in NYC and Will is employed as a coffee boy in the campaign office. He was very frustrated with his life at this time. April is fun and refuses to be type cast as a democrat or a republican. she even makes fun of Will who believes politicians believe in anything other than their own blind ambition.\nSummer is dating her professor, Hampton Roth (Kevin Kline), but spontaneously kisses Will. Will admits that he has read her diary, but Summer is only amused at him and looks at him with lust. Will is confused and backs away.At work Will graduates from toilet paper and bagels to campaign stickers. then one day he is asked to make phone calls to donors for $10K per seat dinners and he finds that he is really good at it. Will is on his way.Will tells April his plan to propose to Emily, and rehearses his proposal; April replies, \"Definitely, maybe\". They go to her apartment, where Will notices her many copies of Jane Eyre. She explains that her father gave her a copy with a personal inscription shortly before he died, but the book was later lost. She has spent years searching secondhand bookstores to find it and collects any copy with an inscription. April and Will kiss, but he abruptly leaves. The next day, Emily arrives in New York City. Will tries to propose, but Emily confesses that she slept with his roommate, and urges him to move on and pursue his ambitions.After Clinton is elected, Will opens a political consulting firm, and stays in close touch with April as she travels the world. He encounters Summer, now a journalist and single (They meet at Hampton's new book release party), and they begin a relationship. April returns from abroad, planning to tell Will that she loves him, but discovers he is planning to propose to Summer. Will learns that Summer has written an article that will ruin his candidate's campaign. He asks her not to publish it, but she refuses, and Will ends their relationship. The article derails the campaign, losing Will his political career and friends.Few Years later, April reaches out to Will, who has fallen into depression in his new job, while she has a new boyfriend named Kevin. She throws Will a birthday party, reuniting him with his old colleagues. He drunkenly confesses to April that he loves her, leading to an argument about the state of their lives.Passing a bookstore, he finds the inscribed copy of Jane Eyre April's father gave her. He goes to April's apartment to give her the book, but decides against it when he meets Kevin, who is living with her. Will runs into Summer who tells him she's pregnant and invites him to a party where he reunites with Emily, who has recently moved to New York City.In the present, Maya deduces that \"Emily\" is her mother. Maya hopes her parents will reunite, but when the divorce is finalized, Will assures Maya that she is the story's happy ending.Unpacking in his new apartment, Will discovers April's book. He brings it to her, apologizing for waiting so long, but she asks him to leave (when she learns that Will has had the book for years). At Maya's urging, Will realizes he is miserable without April, whose name he didn't change in the story like he did to \"Emily\"/Sarah and to \"Summer\", whose real name is Natasha.\nWill and Maya go to April's apartment, and he tries to explain his reasoning to her, but she does not let them inside. As Will and Maya walk away, April runs after them. Will explains that he kept the book as the only thing he had left of her. April invites them in to tell her the story, and she and Will kiss."
}