{
	"title": "Godzilla",
	"release_year": "2014",
	"runtime": "123",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.4,
	"actors": [
		"Aaron Taylor-Johnson",
		"Elizabeth Olsen",
		"Bryan Cranston",
		"Ken Watanabe",
		"CJ Adams",
		"Carson Bolde",
		"Sally Hawkins",
		"Juliette Binoche",
		"David Strathairn",
		"Richard T. Jones"
	],
	"staff": [
		"Gareth Edwards",
		"Dave Callaham",
		"Max Borenstein",
		"Jon Jashni",
		"Mary Parent",
		"Brian Rogers",
		"Thomas Tull",
		"Alexandre Desplat",
		"Seamus McGarvey",
		"Bob Ducsay",
		"Sarah Finn",
		"Owen Paterson"
	],
	"links": [
		"https://www.amazon.com/Godzilla-Aaron-Taylor-Johnson/dp/B00NM7K7NI"
	],
	"votes": 447241,
	"cover": "https://m.media-amazon.com/images/M/MV5BODE2NTdmMmYtY2U1OS00MjExLWIwNjQtYjQ5NTA0ZDZmZjZiXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "In 1954, the United States military witnesses a nuclear test. A hydrogen bomb is detonated at the moment a giant creature emerges from the ocean. In 1999, Project Monarch scientists Ishiro Serizawa (Ken Watanabe) and Vivienne Graham (Sally Hawkins) investigate a colossal skeleton unearthed in a collapsed mine in the Philippines. They find two chrysalises; one dormant, one broken open and a recently made trail to the sea (This trail triggers an earthquake which is followed all the way to Japan). In Japan, the Janjira Nuclear Power Plant experiences unusual seismic activity. Supervisor Joe Brody sends (Bryan Cranston) his wife Sandra and a team of technicians into the reactor. While the team is inside, the reactor is breached, releasing radioactive steam. Sandra and her team are unable to escape and the plant collapses into ruin.Fifteen years later, Joe's son Ford (Aaron Taylor-Johnson), a US Navy explosive ordnance disposal officer (including nuclear bombs), returns from a tour of duty to his family in San Francisco but has to immediately depart for Japan after Joe is detained for trespassing in the Janjira quarantine zone. Joe, determined to reveal the disaster's true cause (he believes that the new seismic readings being measured in Janjira are very similar to the ones measured on the day of the nuclear disaster 15 years ago), persuades Ford to accompany him to their old home within the zone to retrieve vital data.\nThey successfully retrieve the data but are captured and taken to a secret facility within the plant's ruins. Here Serizawa & Graham meet Jeo as Jeo used to manage the plant, the day it was ruined & also because he does not believe that it was a natural disaster.Inside, a giant winged creature emerges from containment and escapes, destroying the facility. The creature was under a massive concrete containment structure but was generating increasing electromagnetic pulses at subsequently shorter intervals, pulsing towards a giant EMP outburst. The creature is known to feed on nuclear material (hence the attack on Janjira 15 years ago, to find an energy source to sustain itself till it grew stringer. Serizawa decides to kill the creature by electrifying it, but that does not work & the creature escapes. Joe is severely wounded and later dies. The incident is reported as an earthquake.Serizawa, Graham and Ford join a US Navy task force led by Admiral William Stenz on the aircraft carrier USS Saratoga to search for the creature, dubbed \"Massive Unidentified Terrestrial Organism,\" (\"MUTO\"). To Ford, the scientists reveal how a 1954 US Submarine based deep sea expedition triggered the awakening & appearance of Godzilla, a prehistoric alpha predator, predating mankind by millions of years when radiation levels on our planet's surface were much higher. The Godzilla & others like him, use radiation as a food source & as the surface levels decreased, they retreated closer to the planet's core to get their radiation. Early nuclear tests were really attempts to kill it; that Project Monarch was formed secretly to study Godzilla; and that the MUTO (which hatched 15 years ago in the collapsed mine in the Philippines & headed straight for the nearest source of radiation, the Janjira nuclear plant & cocooned itself for 15 yrs until it emerged like a butterfly) caused the Janjira destruction. Ford reveals that Joe had monitored echolocation signals that indicated the MUTO was communicating with something.Post this Ford is deposited in Honolulu to catch a commercial flight to SFO.\nThe MUTO is found feeding off the wreckage of a Russian nuclear submarine (as any nuclear source is food for NUTO) it deposited in a forest in Hawaii. The military attacks and the battle shifts to Honolulu International Airport where Ford is waiting for a flight home. The MUTO keeps generating EMPs to deactivate all weapons unleashed against him.Godzilla arrives (Serizawa had predicted that Godzilla would battle MUTO as it is an Alpha predator & will not accept any challenge to his authority. Godzilla figured MUTO's location by the Echolocation pulses that the MUTO had be generating to communicate with something else), causing a tsunami that devastates Waikiki. After briefly fighting Godzilla, the MUTO flies away, and Honolulu is left in ruin. Stenz's carrier battle group follows the Godzilla as it approaches the US Pacific coast. Serizawa reckons that Godzilla is hunting & will be following MUTO.Meanwhile, at a Nevada nuclear waste facility, a second, larger and wingless MUTO, emerges and devastates Las Vegas. The scientists deduce that the second MUTO is female, the two were communicating and will meet to breed. Serizawa also concludes that the 2nd MUTO came from the dormant spore found in the Philippine mine & was trashed in Nevada where US disposes all its nuclear waste.The task force follows Godzilla, projecting that the monsters will meet near San Francisco. Over the scientists' objections, Stenz approves a plan to use nuclear warheads to lure the monsters to a safe distance from the city and then detonated to destroy the monsters. Ford returns with the military to California and joins a team delivering the warheads by train to Stenz's team waiting in SFO (He persuades the team lead to let him join as he has activated & deactivated nuclear arsenal in real combat situations). All digital stuff on the warheads is replaced with analog stuff, including the remote detonators as MUTO's can mess with them with their EMPs. The female MUTO destroys the train and devours one of the warheads. The remaining warhead is airlifted to the city and is activated, but the MUTOs capture it and take it to a nest in the downtown area, where the female deposits her eggs.After the military fails to stop Godzilla when it arrives at the Golden Gate Bridge, Stenz accepts Serizawa's advice and orders the military to withdraw to allow the three monsters to fight. While they battle, soldiers, including Ford, enter the city by HALO jump to find and disarm the warhead. Unable to disarm the warhead at the nest, they put it on a boat for disposal at sea. Ford destroys the nest, causing the female to leave the battle. Godzilla then kills the male, using its tail to crush the MUTO against a building. The female finds and kills the team on the boat, but Ford is saved when Godzilla kills the female by firing atomic breath down her throat and decapitating her. Godzilla then collapses from injury and exhaustion. Ford pilots the boat out to sea and is rescued before the warhead detonates.The next day, Ford finds his family at an emergency shelter. In the city ruins, Godzilla, thought to be dead, suddenly awakens and returns to the ocean after a final roar."
}