{
	"title": "Salt",
	"release_year": "2010",
	"runtime": "100",
	"tags": [
		"Action",
		"Thriller",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Angelina Jolie",
		"Liev Schreiber",
		"Chiwetel Ejiofor",
		"Daniel Olbrychski",
		"August Diehl",
		"Daniel Pearce",
		"Hunt Block",
		"Andre Braugher",
		"Olek Krupa",
		"Cassidy Hinkle"
	],
	"staff": [
		"Phillip Noyce",
		"Kurt Wimmer",
		"Lorenzo di Bonaventura",
		"Sunil Perkash",
		"James Newton Howard",
		"Robert Elswit",
		"Stuart Baird",
		"John Gilroy",
		"Avy Kaufman",
		"Scott Chambliss"
	],
	"votes": 332556,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjIyODA2NDg4NV5BMl5BanBnXkFtZTcwMjg4NDAwMw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Evelyn Salt (Angelina Jolie) is tortured in a prison in North Korea on suspicion of being a U.S. spy. Her boyfriend, Arachnologist Mike Krause (August Diehl), generates so much publicity about Salt's imprisonment that the CIA is forced to arrange a prisoner exchange despite the agency's policy against it. Salt's CIA colleague Ted Winter (Liev Schreiber) greets Salt at the border. As they drive away, Mike proposes marriage, despite Salt's admission to Mike that she is, in fact, a CIA operative. Mike is acknowledged as the world's top Arachnologist.Two years later, on Salt and Krause's wedding anniversary, a Russian defector named Oleg Vasilyevich Orlov (Daniel Olbrychski) walks into Salt's office. Salt interrogates him with Winter and CIA counter-intelligence officer Darryl Peabody (Chiwetel Ejiofor) observing. Orlov claims that on \"Day X\", highly trained Russian sleeper agents known as \"KAs\" will destroy the U.S. Orlov tells a story of how KAs were recruited by the KGB when they were practically babies and trained to be Russian spies to infiltrate the highest levels of the US government. He claims that the program started with Lee Harvey Oswald who defected to Russia in 1959. But the man who returned to US was not Oswald but a Russian spy named Alek, who killed JFK. Similarly, many Russian agents (trained from childhood up) were substituted for US citizens when they visited the USSR.Orlov tells them that Agent \"KA-12\" will assassinate Russian president Boris Matveyev (Olek Krupa) at the funeral of the American Vice President. Orlov reveals that KA-12 is named Evelyn Salt, and lie detectors confirm his entire story. Peabody orders Salt be detained, while Orlov kills two agents and escapes. In the confusion, Salt is able to escape from the building, running barefoot through the street. While the CIA is searching for her, Salt returns home and discovers that her husband, Mike, was kidnapped. Salt searches the apartment with her dog, and gathers survival supplies, weapons, and one of her husband's spiders in a jar. She leaves her dog with a child from a neighboring apartment and resumes her escape.A day later at the funeral of the US Vice President, Salt enters the church despite heavy security (she had dyed her hair black), Salt shoots President Matveyev (by caving the floor and dropping him a level below, where she gets a few seconds alone with him before the security arrives) and then surrenders herself to Peabody instead of killing him. Matveyev is pronounced dead. Salt escapes again and heads to a barge where Orlov is hiding with other sleeper agents. In a series of flashbacks, Salt recalls growing up in the Soviet Union and being trained with other children. She recalls being switched with an American girl, the real Evelyn Salt, after the girl and her parents died in a car crash in the Soviet Union. This gains her access to America by assuming the deceased Evelyn's identity.\nOn the barge, Orlov welcomes her back and has her husband killed in front of her. When Salt shows no reaction, Orlov is convinced she is loyal and begins briefing her on her next assignment. She is to rendezvous with another KA who will help her assassinate the American president. Salt then turns and kills Orlov and the other agents before leaving.\nShe then meets with the unaware KA Shnaider (Corey Stoll), who uses his cover as a Czech NATO liaison to get Salt into the White House by disguising her as a man. Once inside, Shnaider launches a suicide attack to force agents to move the President (Hunt Block) to an underground bunker, accompanied by Winter. Salt follows them and manages to enter the bunker before it is sealed.The U.S. president learns that Russia has mobilized its nuclear arsenal in response to their president's murder. He orders U.S. nuclear weapons readied in response. After seeing Evelyn has entered the bunker, Winter surprisingly kills everyone except the President. He introduces himself as Nikolai Tarkovsky, another member of the KA. Winter incapacitates the President and begins aiming nuclear missiles at Mecca and Tehran to incite a billion Muslims against the United States. Salt tries to persuade Winter to let her inside the sealed room, but then he sees a television report saying President Matveyev is alive and well; Salt had laced spider venom into the bullet she used to shoot Matveyev, simulating death. Winter refuses her entry and reveals that Mike's kidnapping and murder and her blown cover were all his ideas. Winter plans to place full blame for the nuclear attacks on Salt. Salt breaks into the room before he can launch the missiles. The two wrestle for control of the nuclear football, with Salt aborting the missile strikes before being captured.As Salt is being led out in chains, Winter grabs a pair of scissors planning to kill her as she is led past him. She unexpectedly hooks her handcuff chain around Winter's neck and jumps over the stair railing, strangling him to death. On the helicopter ride to be interrogated, Peabody questions her. Salt explains that she killed Winter because he orchestrated the death of her husband, and promises to hunt down the remaining KA agents if freed, offering the fact she earlier let Peabody live as proof, as well as the fact she did not actually kill the Russian President. Peabody is convinced after receiving a text that Salt's fingerprints were found on the barge where the sleeper agents were killed, supporting her story. Salt is allowed to escape, jumping out of the helicopter into the Potomac River below and escaping into the woods.",
	"links": [
		"https://www.amazon.com/Salt-Andre-Braugher/dp/B004BEMC6G"
	]
}