{
	"title": "Sucker Punch",
	"release_year": "2011",
	"runtime": "110",
	"tags": [
		"Action",
		"Adventure",
		"Fantasy",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Emily Browning",
		"Vanessa Hudgens",
		"Abbie Cornish",
		"Jena Malone",
		"Jamie Chung",
		"Carla Gugino",
		"Oscar Isaac",
		"Jon Hamm",
		"Jon Hamm",
		"Scott Glenn",
		"Richard Cetrone"
	],
	"staff": [
		"Zack Snyder",
		"Zack Snyder",
		"Steve Shibuya",
		"Deborah Snyder",
		"Zack Snyder",
		"Tyler Bates",
		"Marius De Vries",
		"Larry Fong",
		"William Hoy",
		"Michelle Allen",
		"Kristy Carlson",
		"Lora Kennedy",
		"Rick Carter"
	],
	"votes": 254345,
	"cover": "https://m.media-amazon.com/images/M/MV5BZDE1YWZiMzItZGEzOC00MTYyLWFiYWYtNGNlMmM0ZjAxM2RmXkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "After the sudden death of her mother, 16-year-old Baby Doll (Emily Browning) and her 11-year-old younger sister are almost killed by their greedy stepfather (Gerard Plunkett) for inheritance. Baby Doll gets a gun to kill him -- but accidentally kills her sister instead. Stepfather proves Babydoll is mad & has her committed.At the Lennox Institution, Baby Doll has Polish therapist, Dr. Vera Gorski (Carla Gugino). Baby Doll overhears her stepfather discussing an arrangement with the Asylum's director, Dr. Blue Jones (Oscar Isaac) to forge Gorski's signature to approve a lobotomy on Baby Doll in 5 days to ensure Babydoll stays. Blue will get his cut of the money.Baby Doll also overhears Dr. Gorski telling the girls that they have power within their minds; through her imagination, Baby Doll then visualizes the Institution as a dance hall, with her stepfather as a corrupt priest and Blue as the owner of the dance hall. Dr. Gorski is seen as the dance instructor for the girls in the hall. Another girl, Rocket (Jena Malone) quickly befriends Baby Doll, but Rocket's older sister, Sweet Pea (Abbie Cornish), scoffs at her. A bond forms soon after when Baby Doll saves Rocket from being attacked by the Institution's cook.During the dance rehearsal, Dr. Gorski tries to get Baby Doll to dance and, finally, Baby does. When she dances, Baby Doll finds herself transported to a Japanese Dojo. Inside the Dojo, Baby Doll finds an old man (Scott Glenn) who claims to know that the High-Roller (Jon Hamm) (outside Baby Doll's imagination, he is the person performing the lobotomy) will come for Baby Doll in 5 days, and he gives Baby Doll weapons for her survival: a Katana sword and a handgun, which can be used in her dream world. If Baby Doll is to live, she must collect five objects: a map, fire, a knife, a key, and a fifth object... which she'll need to discover for herself. Upon leaving the Dojo, Baby Doll is set upon by three giant samurai warriors. Baby Doll slays the giants after a fierce battle, and her \"dance\" ends.The other girls in the dance troupe are impressed: except Sweet Pea. Rocket and two other girls, Blondie (Vanessa Hudgens) and Amber (Jamie Chung), are willing to help, but Sweet Pea takes some coaxing.\nThe girls put a plan into effect to get the map in Blue's office. Sweet Pea coaxes Blue to watch Baby Doll dance. After he leaves his office, she uses a copying machine to make a copy of the facility's map.\nMeanwhile, Baby Doll dances for Blue and goes into her dream-state. In a World War I setting, the old man appears, giving the girls orders to retrieve a map being held by steam-punk, reanimated German infantrymen. Amber pilots a giant mechanical-suit while the girls make their way into the enemy trenches. After a surreal firefight with the Zombie German troops, they manage to retrieve the map, and Baby Doll's dance for Blue ends.Blue tells Gorski that he wants to have Baby Doll perform for the Mayor. Gorski protests. Blue realizes that the map has been copied, and Amber is chosen to retrieve the Mayor's cigar lighter. It will give them the fire that they need.When the Mayor visits for the performance, Amber retrieves the lighter while Baby Doll distracts him with a dance. Her imagination gives way, and she finds herself in a medieval setting with the old man and the other girls, aboard a World War II bomber. The old man outlines the plan: to make their way into the castle below, slit the throat of a baby dragon, and retrieve two stones in its throat that will produce fire.... without awaking the mother of the dragon. Amber and Blondie stay on the plane; Baby Doll, Sweet Pea, and Rocket land and enter the castle. Fighting off a horde of evil creatures, Baby Doll manages to find the baby dragon. She kills it and retrieves the stones, but not before the baby cries out -- and its enormous mother hears. The enormous dragon pursues the girls, until Baby Doll at last kills it, driving her Kitana into its brain.In the club, the dance ends. The girls gather in their dressing room, ecstatic that Amber has retrieved the second thing on the list. Blue declares that he knows something is going on. After he leaves, Sweet Pea demands that they call the plan off.\nThe girls (except Blondie) soon are working in the kitchen, with the intent to get a knife from the cook. They shock him when they suddenly set up Baby Doll to 'perform,' with Rocket attempting to placate him, while Sweet Pea retrieves the knife from one of his holsters.Baby Doll then goes into her dance, and in her mind's eye, the girls find themselves on a strange planet in a helicopter piloted by Amber. The old man is with them again, giving orders that there is a bomb on a speeding train headed for a futuristic city. The girls are to disable the bomb and get away with it. Baby Doll, Sweet Pea, and Rocket make their way through an army of cyborg guards and disable the bomb. However, one of the cyborgs is not completely destroyed, and he ends up reactivating it. With little time to spare, Rocket sacrifices herself to save Baby Doll and Sweet Pea.This is reflected back in reality in the kitchen when the cook catches Sweet Pea attempting to steal his knife. He then attempts to stab her, but instead stabs Rocket, killing her. Blue soon finds out, and has Sweet Pea locked away, when the cook tells what she was doing.Amber manages to hide the knife, 'The High-Roller' arrives to see Baby Doll. The girls are still without their 4th and 5th elements. Blue arrives and explains that Blondie told him everything. Blue then threatens Gorski, before shooting and killing both Amber and Blondie. Blue attempts to have his way with Baby Doll. However, she manages to find the knife Amber hid, and stabs him in the shoulder. In his dazed state, she claims, \"you'll never have me!\" and takes his key.\nBaby Doll then retrieves the other items and frees Sweet Pea from her isolation cell. She then uses the lighter and a bottle of liquor to start a fire in a closet. They then use the map to make their way to the security doors, before the fire is found, and the alarms are pulled, which unlocks all the security doors. The two then sneak out to the front entrance, but find the way blocked by several large men.It is then that Baby Doll realizes what the fifth item need to escape is: her. She then tells Sweet Pea that she was never meant to escape, but to help Sweet Pea. Sweet Pea doesn't want to abandon Baby Doll, but escapes through the front gates of the facility, as Baby Doll creates a distraction, before being brought back into the facility, and into the confines with the High-Roller.\nAfter Baby Doll's beat-down, Sweet Pea has already escaped, and Baby Doll meets the infamous High Roller in a room from the brothel. They have sex, but the High Roller requests for her to have sex with him if she desires it in her heart, but she refuses. Quite disillusioned, the High Roller offers Baby Doll freedom from the brothel, if she desired it. She accepts and they start to kiss.In the Extended version on the movie, they actually show why the Lobotomist was so surprised. In that scene baby dolls tries to come over the fear of getting lobotomized by imagining that the Lobotomist will get her rid her of all her pain and the guilt that because of her plan she got rest of the three girls killed.The scene then transitions to the aftermath of the lobotomy. As the doctor cleans up, he is shaken by the look on Baby Doll's face, feeling that she showed almost no fear about what was to befall her. Dr. Gorski soon talks to him, claiming that Baby Doll caused numerous problems at the facility, including setting fire to a closet, and even stabbing the head of the facility, Blue. The Lobotomist still questions the speed of the request that Gorski signed regarding Baby Doll, but the Doctor shockingly explains that she did not make any such request!Meanwhile, the lobotomized Baby Doll is led away, but to a private room where Blue is waiting. Once alone, he claims that the lobotomized girl has no way to stop him from doing what he wants. Before the door bursts open, and Gorski, the Lobotomist and several police officers are seen. The officers drag Blue out, as he wails that Baby Doll's Stepfather was the person behind the whole idea. Baby Doll continues sitting motionless in her chair as a smile builds on her face as she realizes that what the old man told her in her dreams was true; her ultimate sacrifice has become her ultimate victory which that despite the fact that Baby Doll is now a human vegetable, the people responsible for her semi-death will be brought to justice and her friend Sweet Pea is now free.In the epilogue, we see Sweet Pea at a local bus depot about to depart on a bus for Fort Wayne, Indiana. As she is about to get on, some policemen approach her and want to ask her some questions. Before she can respond, the bus driver (who is the same old man from Baby Doll's imaginative dreams!) tells the officers that the girl just stepped off the bus to use the restrooms, and that he has a schedule to keep. The officers believe him, and Sweet Pea boards the bus. She tells the driver she doesn't have a ticket, but he simply tells her to take a seat in the back and have a rest. As the bus takes off, we see it going down an old dirt road, passing a billboard with the words 'Paradise Diner' on it, a sign that almost hints to us that Sweet Pea is heading towards a new life.",
	"links": [
		"https://www.amazon.com/Sucker-Punch-Extended-Emily-Browning/dp/B076B48JWP"
	]
}