{
	"title": "Robin Hood",
	"release_year": "2010",
	"runtime": "140",
	"tags": [
		"Action",
		"Adventure",
		"Drama",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Russell Crowe",
		"Cate Blanchett",
		"Matthew Macfadyen",
		"Max von Sydow",
		"William Hurt",
		"Mark Strong",
		"Oscar Isaac",
		"Danny Huston",
		"Eileen Atkins",
		"Mark Addy"
	],
	"staff": [
		"Ridley Scott",
		"Brian Helgeland",
		"Ethan Reiff",
		"Cyrus Voris",
		"Russell Crowe",
		"Brian Grazer",
		"Ridley Scott",
		"Marc Streitenfeld",
		"John Mathieson",
		"Pietro Scalia",
		"Jina Jay",
		"Arthur Max"
	],
	"links": [
		"https://www.amazon.com/Robin-Hood-Russell-Crowe/dp/B003XQ9BXU"
	],
	"votes": 285817,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTM5NzcwMzEwOF5BMl5BanBnXkFtZTcwNjg5MTgwMw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "It is 1199 and Robin Longstride (Russell Crowe) is a common archer in Richard the Lionheart's (Danny Huston) army. A veteran of the Third Crusade and Richard's war against Phillip II of France, he now takes part in the siege against Chalus Castle. Robin is well respected by his fellow soldiers. he always proves himself in battle, takes care to save fellow soldiers from enemy arrows even at the cost to himself. Disillusioned and war-weary, he believes the King when he invites him to give an honest view of the war and the King's conduct. After Robin gives a frank but unflattering appraisal, Richard breaks his promise and has Robin and comrades taken prisoner to be judged after ending the siege.Loxley serves as a general in Richard's army. His wife, Lady Marian (Cate Blanchett) runs his estate in his prolonged absence. Her estate is subjected to frequent bouts of theft. Between that & high taxes, Lady Marian has no seeds left to plant in the planting season & turns to the church for help. The Bishop & Friar Tuck both refuse to relent to help Lady Marian or any other people in Nottingham. High taxes are needed to keep the wars going.The betrayed men decide to free themselves and desert. Following Richard's death by a feral arrow shot by a French cook, Robin and two other common archers, Allan A'Dayle (Alan Doyle), Will Scarlett (Scott Grimes), as well as soldier Little John (Kevin Durand), attempt to secretly return to their homeland after fighting abroad for the past 10 years.Along the way they come across an ambush of the Royal guard by Sir Godfrey (Mark Strong), an English knight collaborating with the French. Philip II had ordered Sir Godfrey to assassinate Richard on Richard's way back to England. Philip's plan was to invade England when Richard is dead & Godfrey has stirred unrest to turn the population against the young & naive John. The ambush was laid by Godfrey for Richard, but it trapped Loxley instead. Godfrey learns from Loxley that Richard is dead & then mortally wounds him. Godfrey knows the identity of Loxley. Having discovered the King is already slain, Sir Godfrey is chased off by the arrival of Robin and his companions. In the chase, Robin manages to fire an arrow & injure Godfrey.Aiming to return to England safely and richer in pocket than when they left it, Robin and his men steal the armor of the slain knights and, under the guise of noblemen, head for the English ships on the coast. Before leaving the scene of slaughter, Robin promises Robert Loxley (Douglas Hodge), to return a sword to his father in Nottingham.Meanwhile the Sheriff of Nottingham threatens Marian to pay up the taxes, which she cannot do unless the land is sowed, for which there are no seeds. Sheriff demands sexual favors from Marian in exchange for mercy, which she refuses. The Sheriff also threatens that the Loxley estate will be absorbed by the crown in the event that Sir Robert Loxley fails to return & put his tax affairs in order.Upon arriving in England, Robin (who has assumed the identity of Loxley) is brought to London and chosen to inform the Royal family of the King's death. He witnesses the coronation of King John (Oscar Isaac), the younger brother of Richard. John orders harsh taxes to be collected, sending Sir Godfrey off to the North to do so. He has no idea that Godfrey is a French agent who, using French troops (who have been landed in stealth on English coast to replace the English battalion given to Godfrey by John), will use this Royal Decree to stir up enough unrest to cause civil war in England. John fires the current chancellor Marshall who was in charge of tax affairs.Robin and his companions head to Nottingham, where Loxley's elderly, blind father Sir Walter (Max Von Sydow) asks him to continue impersonating his son, in order to prevent the family lands being taken by the crown. Loxley's widow, Lady Marian (Cate Blanchett), is initially distrustful of Robin, but soon warms to him when he recovers taxed grain for the townsfolk to plant. He does that by threatening Friar Tuck of the revelation that he is illegally keeping bees in the county & not paying taxes on it. Friar Tuck agrees to make sure that the church grain reaches the Loxley household, instead of London.Marshall keeps an eye on Godfrey & intercepts his message to King of France to prepare for invasion. Marshall reaches out to Walter Loxley to invoke the charter of rights to bind the barons to the King in repelling the invasion of France. Walter reveals to Robin that his father was a baron himself who had helped create the charter of rights & was executed by the King because of it.Godfrey meanwhile gets word that the man who injured him is now hiding in Nottingham as Sir Robert Loxley himself. Godfrey decides to invade & plunder Nottingham next.\nMeanwhile, Godfrey's actions have stirred up the northern barons, who march to meet King John and demand the signing of a charter of liberties that do not enslave the population to the Crown of England. Robin represents Loxley at the meeting & makes a passionate plea for the charter himself. Having realized Godfrey's deception, and knowing he must reunite his people in order to meet an imminent French invasion, the King agrees to write such a charter, once the French invasion is squashed. A battle follows in which Robin and the northern barons attack Godfrey's men while the latter are ransacking Nottingham, but not before Godfrey has slain the blind Sir Walter.The film climaxes with a French invasion on England's Cliffs of Dover, opposed by an English army. In title the army is led by John himself, but John himself looked to Robin to make all the strategies & decisions. In the midst of the chaos, Marian joins the battle to avenge Walter's death & attempts to kill Godfrey, but he gains the upper hand over her and prepares to kill her. However, Robin intervenes and duels Godfrey himself. The English are victorious, and Godfrey attempts to flee on horseback, but Robin shoots an arrow, from long distance, which pierces straight through Godfrey's neck.When King John sees the French surrendering to Robin rather than to himself, he senses a major threat to his power. Therefore, in the final scenes, King John not only reneges on his promise to sign the Charter of the Forest, but also declares Robin to be an outlaw. In response to this, Robin moves to Sherwood Forest with Lady Marian and his friends to form what will become the Merry Men of Sherwood Forest. \"So,\" as the concluding scroll says, \"the legend begins.\""
}