{
	"title": "The International",
	"release_year": "2009",
	"runtime": "118",
	"tags": [
		"Action",
		"Crime",
		"Drama",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Clive Owen",
		"Naomi Watts",
		"Armin Mueller-Stahl",
		"Ulrich Thomsen",
		"Brían F. O'Byrne",
		"Michel Voletti",
		"Patrick Baladi",
		"Jay Villiers",
		"Fabrice Scott",
		"Haluk Bilginer"
	],
	"staff": [
		"Tom Tykwer",
		"Eric Warren Singer",
		"Lloyd Phillips",
		"Charles Roven",
		"Richard Suckle",
		"Reinhold Heil",
		"Johnny Klimek",
		"Tom Tykwer",
		"Frank Griebe",
		"Mathilde Bonnefoy",
		"Francine Maisler",
		"Uli Hanisch"
	],
	"votes": 100833,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjE3Njg5NzY2OV5BMl5BanBnXkFtZTcwMDMxNjEwMg@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Louis Salinger (Clive Owen), of Interpol, and Eleanor Whitman (Naomi Watts), an Assistant District Attorney from Manhattan, are investigating the International Bank of Business and Credit (IBBC), which funds activities such as money laundering, terrorism, arms trading, and the destabilization of governments. Eleanor has an agent Thomas Schumer working in Berlin along with Salinger. Schumer makes contact with an IBBC insider who is willing to trade info on the bank's illicit activities. Schumer drops dead immediately after the meeting, apparently from a heart attack, but Salinger is convinced that Schumer was murdered by an unseen assassin, working for IBBC.Hours later, the informant, Andre Clement is also killed in an auto accident. Salinger finds inconsistencies in IBBC chairman Skarssen's statement that Andre was with him on the morning of the accident in Luxemburg (when clearly, he was in Berlin meeting Schumer). Salinger's efforts to meet Skarssen are resisted by Skarssen's lawyer who manages to get the police report changed to erase the inconsistency of statements.Eleanor contacts Clement's wife & finds out that the IBBC arms deal was being conducted via Umberto Calvini in Milan.Salinger's and Whitman's investigation takes them from Berlin to Milan, where the IBBC assassinates Umberto Calvini, an arms manufacturer who is an Italian prime ministerial candidate. This was done as Calvini was moving away from a deal with the IBBC to supply them with $ 200 MM worth of missile guidance parts. Before his assassination, Calvini meets Eleanor and Salinger & reveals that IBBC has purchased missiles from China & Pre-sold them to Middle East, contingent upon them having the guidance systems, which Calvini's company is the one of 2 firms in the world that manufacture. The IBBC's objective is to control the debt created by the conflict that is fueled by the missiles.The bank's assassin diverts suspicion to a local assassin with political connections, who is promptly killed by a corrupt policeman. Salinger and Whitman get a lead on the second assassin, but the corrupt policeman shows up again and orders them out of the country. But before this Salinger & Eleanor establish that the IBBC assassin is wearing a leg brace & would have to show it to airport security. At the airport they are able to check the security camera footage for clues and follow a suspect to New York.In New York, Salinger and Whitman are met by two New York Police Department (NYPD) detectives, Iggy Ornelas and Bernie Ward, who have a photograph of the assassin's face when he arrived in New York airport. Salinger, Ornelas, and Ward locate Dr. Isaacson to whose practice the assassin's leg brace has been traced. They find the assassin and follow him to the Solomon R. Guggenheim Museum.Jonas Skarssen, the chairman of the IBBC, reveals to his senior men White and Wexler that the bank had Calvini killed so that they could deal with his sons to buy guidance systems for missiles in which the bank has invested. Since the bank knows that Salinger and Whitman are close to finding their assassin, they send a hit team to kill him at a meeting between him and his handler, Wexler. Wexler leaves and is arrested by Ornelas. As Salinger speaks to the assassin, a spectacular gunfight at the Guggenheim erupts when a number of gunmen attempt to kill them with automatic weapons. They escape, but the assassin is mortally wounded.In interrogation, Wexler, a former Stasi colonel, explains to Salinger that the IBBC is practically untouchable because of its utility to terrorist organizations, drug cartels, governments, and powerful corporations of all complexions. Even if he succeeds in bringing the IBBC down there are hundreds of other banks which will replace them. If Salinger wants justice, he needs to go outside the system, and Wexler indicates a willingness to help. In Italy, Salinger tells the Calvini brothers of the IBBC's responsibility for their father's murder, prompting them to cancel the deal with the bank and have White killed.Salinger then accompanies Wexler to Istanbul, where Skarssen is buying the crucial components from their only other manufacturer. Salinger attempts to record the conversation so that he can obstruct the deal by proving to the buyers that the missiles will be useless, but he ultimately fails. Both Wexler and Skarssen are then killed by a hit-man contracted by Enzo and Mario Calvini to avenge their father's murder by the bank. Salinger is left stunned, his investigation, pursuit, and determination to bring down the IBBC, have led him to nothing. During the closing credits, it is indicated that the bank is successfully continuing with its operations despite the death of its Chairman-as Skarssen had predicted to Salinger before he was killed.However, with the new and more aggressive chairman, it is hinted that the IBBC's increased expansion and aggression will ultimately lead to its downfall, as shown by the last panel, revealing the beginnings of a United States Senate investigation, headed by Whitman.",
	"links": [
		"https://www.amazon.com/International-Clive-Owen/dp/B0024R6VIW"
	]
}