{
	"title": "The Amazing Spider-Man",
	"release_year": "2012",
	"runtime": "136",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.9,
	"actors": [
		"Andrew Garfield",
		"Andrew Garfield",
		"Emma Stone",
		"Rhys Ifans",
		"Rhys Ifans",
		"Irrfan Khan",
		"Denis Leary",
		"Martin Sheen",
		"Sally Field",
		"Campbell Scott",
		"Embeth Davidtz",
		"Chris Zylka"
	],
	"staff": [
		"Marc Webb",
		"James Vanderbilt",
		"Alvin Sargent",
		"Steve Kloves",
		"Stan Lee",
		"Avi Arad",
		"Matt Tolmach",
		"Laura Ziskin",
		"James Horner",
		"John Schwartzman",
		"Alan Edward Bell",
		"Pietro Scalia",
		"Francine Maisler",
		"J. Michael Riva"
	],
	"votes": 713020,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjMyOTM4MDMxNV5BMl5BanBnXkFtZTcwNjIyNzExOA@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Young Peter Parker discovers his father's home office has been ransacked. His parents, Richard and Mary Parker, hurriedly gather secret documents, leave Peter with his Aunt May and Uncle Ben, and disappear under mysterious circumstances.Years later, teenage Peter attends Midtown Science High School, where he struggles with social awkwardness and bullying. Despite this, he harbors a crush on Gwen Stacy, who reciprocates his feelings. While searching through his father's old briefcase, Peter discovers clues linking his father to Dr. Curt Connors, a scientist at Oscorp specializing in cross-species genetics.Peter sneaks into Oscorp, where he encounters a lab housing genetically engineered spiders. One of the spiders bites him, granting him spider-like abilities, including enhanced strength, agility, speed, sharp senses, and the ability to cling to walls. Meanwhile, Connors, whose right arm is amputated, is working on experiments to regenerate limbs using lizard DNA.Peter finds the missing element in his father's research-the \"decay rate algorithm\"-and shares it with Connors, revealing his connection to Richard Parker. As Peter begins to explore his powers, tensions rise at home. After a heated argument with his Uncle Ben, Peter storms out. While searching for Peter, Ben intervenes in a robbery attempt, is shot by the thief, and dies in Peter's arms. Consumed by guilt, Peter dedicates himself to tracking down criminals matching the killer's description. To conceal his identity, he designs a suit, dons a mask, and constructs mechanical web-shooters.During a dinner with Gwen's family, Peter learns that her father, police captain George Stacy, views the masked vigilante Spider-Man as a dangerous menace. Peter later reveals his secret identity to Gwen, deepening their bond.Connors, pressured by Oscorp executive Rajit Ratha to begin human trials, refuses to endanger innocent lives. Fired from Oscorp, Connors tests the serum on himself. The serum regenerates his missing arm but mutates him into a monstrous humanoid reptile, the Lizard. Connors, now fully transformed, attacks Ratha on the Williamsburg Bridge, putting civilians at risk. Peter, as Spider-Man, intervenes, saving the bystanders but drawing the attention of the police, who begin a manhunt for both Spider-Man and the Lizard.Peter tracks the Lizard to the sewers, where Connors discovers Peter's identity from a camera left behind with Peter's name on it. Connors retaliates by attacking Peter at his school, leading to a chaotic battle. Peter learns that Connors plans to release a biochemical agent from Oscorp Tower to transform New York's population into reptilian hybrids, aiming to eliminate humanity's weaknesses.Captain Stacy and his officers corner Spider-Man, but Stacy uncovers Peter's identity and releases him to stop Connors. Gwen creates an antidote to reverse the mutation, which Peter disperses through Oscorp's ventilation system. The city's residents, including Connors, are cured, but not before the Lizard fatally wounds Captain Stacy.In his dying moments, Captain Stacy asks Peter to keep Gwen safe by staying away from her. Heartbroken, Peter agrees. However, both Peter and Gwen struggle with their separation, and Peter hints that he may not keep his promise.In a post-credits scene, an imprisoned Connors is confronted by a shadowy figure who inquires whether Peter knows the truth about his father. Connors insists that Peter remains unaware and demands that he be left alone. The mysterious figure disappears, leaving Connors unsettled.",
	"links": [
		"https://www.amazon.com/pamphlet-Amazing-Spiderman-Director-Garfield/dp/B008EEBYG8"
	]
}