{
	"title": "Taken",
	"release_year": "2008",
	"runtime": "90",
	"tags": [
		"Action",
		"Crime",
		"Thriller",
		"amazon"
	],
	"rating": 7.7,
	"actors": [
		"Liam Neeson",
		"Maggie Grace",
		"Famke Janssen",
		"Leland Orser",
		"Jon Gries",
		"David Warshofsky",
		"Holly Valance",
		"Katie Cassidy",
		"Xander Berkeley",
		"Olivier Rabourdin"
	],
	"staff": [
		"Pierre Morel",
		"Luc Besson",
		"Robert Mark Kamen",
		"Nathaniel Méchaly",
		"Michel Abramowicz",
		"Frédéric Thoraval",
		"Ferne Cassel",
		"Nathalie Cheron",
		"Hugues Tissandier"
	],
	"links": [
		"https://www.amazon.com/Taken-Liam-Neeson/dp/B0026145WK"
	],
	"votes": 642007,
	"cover": "https://m.media-amazon.com/images/M/MV5BYTAxNTY2NjMtYjk5Yy00Nzg4LTkyMmItYmMzMDM2OWQ1ZGQ3XkEyXkFqcGc@._V1_QL75_UY281_CR1,0,190,281_.jpg",
	"description": "Bryan (Liam Neeson) is retired CIA. he loves his 17 yr old girl Kim (Maggie Grace), who now lives with ex-wife Lennore (Famke Janssen) & her new husband Stuart\n(Xander Berkeley). Kim wants to be a singer. Bryan is protecting a pop singer Sheerah (Holly Valance) as a private consultant with friends (Sam (Leland Orser) & others) & saves her life. She shares her vocal coach & manager's numbers with Bryan. Kim wants to go to Paris with her friend Amanda (Katie Cassidy) & Bryan is skeptical but signs the consent form when Kim is upset with his refusal. Kim says the trip is an art tour of Paris, but they actually intend to follow U2. Lennore knew but didn't say anything.At Paris airport airport, they meet a young Parisian named Peter (Nicolas Giraud). He wants to share a Taxi. Kim reluctantly agrees. They have Peter take their picture with Kim's phone. Peter drops them off & invites them to a party. Peter makes a quick phone call \"Two girls about 18,\" and the address of the apartment. Kim asks Amanda about the cousins & Amanda says that they are vacationing in Spain.As Bryan calls Kim, 2 men attack & subdue Amanda in their apartment. Bryan asks Kim to hide under the bed. She tells Bryan about Peter. Bryan tells her that she will be \"Taken\" but asks her to keep her phone on & shout as much description as possible.\nFollowing Bryan's instructions, she screams out, \"Beard! Six Feet! Tattoo, right hand, moon and star!\". The kidnapper takes the phone & Bryan tells him to let Kim go, else he will find & kill them. The kidnapper says \"Good luck.\"Bryan calls in Sam & he finds the language from a town in Albania (the voice conversation of kidnappers recorded via Kim's phone). Their leader Marko (Arben Bajraktaraj) runs a prostitution business & Bryan has 4 days to save Kim. Bryan finds KIm's phone in her apartment in Paris & traces Peter through a photo Kim took at the airport. Peter runs as Bryan pursues & gets killed. Bryan meets French intelligence Jean-Claude (Olivier Rabourdin) who gives him an address where the Albanian gang operates out of. There he finds Kim's jacket on another girl (Héléna Soubeyrand). He takes her, escaping the Albanians.Jean-Claude wants to meet Bryan, but Bryan doesn't trust him & escapes a trap set by Jean to capture Bryan. The girl he rescued gives him an address in Paris where Kim is. Bryan gets there & finds Marko via his particular accent of \"Good Luck.\" He shoots everybody but Marko. Then he finds Amanda's dead body in an upstairs room.\nBryan tortures Marko who says that Kim has been sold to St-Clair (Gérard Watkins).\nBryan enters Jean's house & finds that Jean is in cahoots with the Albanians for the money. Bryan shoots Jean's wife & tortures him to reveal St-Clair's address.St-Clair is auctioning off the new meat, Kim, who goes for $500,000. Bryan forces one bidder at gunpoint to outbid all. St-Clair captures Bryan & restrains him & says \"It's only business.\" Bryan escapes & kills St-Clair, before which he reveals Kim will be at the pier. At the pier, the boat has left & Bryan follows it & boards it from a bridge. He finds & shoots an Arab sheik who has Kim & other girls as prostitutes.\nBack home, Bryan takes Kim to meet Sheerah."
}