{
	"title": "Tropic Thunder",
	"release_year": "2008",
	"runtime": "107",
	"tags": [
		"Action",
		"Comedy",
		"War",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Ben Stiller",
		"Jack Black",
		"Robert Downey Jr.",
		"Jeff Kahn",
		"Anthony Ruivivar",
		"Jay Baruchel",
		"Brandon T. Jackson",
		"Eric Winzenried",
		"Steve Coogan",
		"Valerie Azlynn"
	],
	"staff": [
		"Ben Stiller",
		"Justin Theroux",
		"Ben Stiller",
		"Etan Cohen",
		"Stuart Cornfeld",
		"Eric McLeod",
		"Ben Stiller",
		"Theodore Shapiro",
		"John Toll",
		"Greg Hayden",
		"Kathy Driscoll",
		"Francine Maisler",
		"Jeff Mann"
	],
	"votes": 454753,
	"cover": "https://m.media-amazon.com/images/M/MV5BNDE5NjQzMDkzOF5BMl5BanBnXkFtZTcwODI3ODI3MQ@@._V1_QL75_UY281_CR5,0,190,281_.jpg",
	"description": "Hook-handed Vietnam veteran Staff Sergeant John \"Four Leaf\" Tayback's (Nick Nolte) (The author of Tropic Thunder, a fake memoir of his war experiences on which the film-within-a-film is based. He suggests the idea of dropping the actors in the middle of the jungle to get them looking and feeling like soldiers lost in a foreign land) memoir, Tropic Thunder, is being made into a film. With the exception of newcomer supporting actor Kevin Sandusky, the cast-fading action hero Tugg Speedman (Ben Stiller) (Once the highest-paid, highest-grossing action film star ever due to his Scorcher franchise, his career has stalled, and he now has a reputation for appearing in nothing but box office bombs.After drawing negative coverage for his portrayal in Simple Jack, in which he plays a mentally-challenged farm boy, he takes the role of Four Leaf Tayback in an attempt to save his career), five-time Academy Award-winning Australian method actor Kirk Lazarus (Robert Downey Jr.) (five-time Academy Award winner, Lazarus had a controversial \"pigmentation alteration\" surgery to darken his skin for his portrayal of the African American character, Staff Sergeant Lincoln Osiris), rapper Alpa Chino (Brandon T. Jackson) (A closeted homosexual rapper who is attempting to cross over into acting, portraying a soldier named Motown, while promoting his \"Bust-A-Nut\" candy bar and \"Booty Sweat\" energy drink), and drug-addicted comedian Jeff Portnoy (Jack Black) (A drug-addicted comedian-actor well known for portraying multiple parts in films that rely on toilet humor, particularly jokes about flatulence and fart jokes)-all cause problems for director Damien Cockburn (Steve Coogan) (he inexperienced British film director who is unable to control the actors in the film), who cannot control them, resulting in a million-dollar pyrotechnics scene being wasted.The project is months behind schedule. Studio executive Les Grossman (Tom Cruise) (The profane, ill-tempered studio executive producing Tropic Thunder) orders Damien to get the cast under control or risk the project's cancellation.On Four Leaf's advice, Damien drops the actors into the middle of the jungle, with hidden cameras and rigged special effects explosions to film \"guerrilla-style\". The actors have guns that fire blanks, along with a map and scene listing that will lead to a helicopter waiting at the end of the route. Unknown to the actors and production, the group have been dropped in the middle of the Golden Triangle, the home of the heroin-producing Flaming Dragon gang. Just as the group is about to set off, Damien inadvertently steps on an old land mine and is blown up, stunning the actors. Tugg, believing Damien faked his death to encourage the cast to give better performances, assures the others that Damien is alive, and that they are still shooting the film. Kirk is unconvinced but joins them in their trek through the jungle.As they exit the drop zone, they are attacked by Flaming Dragon militia who are dumbfounded by the crazy tactics of their opponents. Carefully placed C4 charges by Cody go off at the right time to save their asses.\nOn the trek Kirk berates Tugg for going full retarded on \"simple Jack\" as per him retard is a good category, but you \"never go full retard\".When Four Leaf and pyrotechnics operator Cody Underwood (Danny McBride) try to locate the deceased director, they are captured by Flaming Dragon. Four Leaf is revealed to have hands; he confesses to Underwood that he actually served in the Coast Guard, has never left the United States, and that he wrote his \"memoir\" as a tribute.Tugg and Kirk both try to get rookie actor Kevin Sandusky (Jay Baruchel) on their side. A novice actor, he is the only cast member to have read the script and book and attended the assigned boot camp prior to the film. Kirk says Tugg is leading them in the wrong direction and Tugg alleges that Kirk is trying to torpedo the film.As the actors continue through the jungle, Kirk and Kevin discover that Tugg is leading them in the wrong direction. The resulting argument results in Kirk leading the rest of the cast back toward the resort they are staying at as an increasingly delirious Tugg is captured by Flaming Dragon. Just prior to that Rick calls Tugg on his satellite phone (which Tugg had hidden when Damien had confiscated all phones) and Rick got the impression that Tugg was firing him as his agent as he didn't deliver the TiVo, as was specified in his contract with Les.Taken to their base, Tugg sees CCTV cameras in the base and believes it is a POW camp from the script. The gang discovers he is the star of their favorite film, the box-office bomb Simple Jack, and force him to reenact it several times a day.Meanwhile, in Los Angeles, Tugg's agent Rick 'Pecker' Peck (Matthew McConaughey) confronts Les over an unfulfilled term in Tugg's contract that entitles him to a TiVo. Flaming Dragon calls during the discussion and demands a ransom for Tugg, but Les instead delivers a profanity-laden death threat not knowing that Tugg has been kidnapped. Despite the threats, Les expresses no interest in rescuing Tugg and is instead happy at the insurance payout that would happen if Tugg dies. He attempts to convince Pecker to play along by promising a Gulfstream V jet and \"lots of money\".Kirk, Alpa, Jeff, and Kevin discover Flaming Dragon's heroin factory. Kevin reckons they aren't even in Vietnam anymore and may have crossed into Myanmar or Laos, as that's on the Golden Triangle. After witnessing Tugg being tortured, they plan a rescue attempt based on the film's script. Kirk impersonates a farmer towing a \"captured\" Jeff on the back of a water buffalo, distracting the armed guards so Alpa and Kevin can infiltrate and find the prisoners, but a combination of broken Chinese and inconsistencies in his story sets off the gang's boss. The actors, knowing their cover has been blown, begin firing, fooling gang members into surrender. Their control of the gang falls apart when Jeff (who has been a deprived addict for the last 2 days) grabs the leader and heads for the drugs, and the gang, realizing the guns fire blanks, recover their guns and fight back.Meanwhile Tugg doesn't want to leave as he is performing 5 shows a day to standing room only audience. Kirk is insecure as his hair and eyes are blonde and blue and he realizes that he is African American in name only. Jeff is insecure as he thinks people only laugh at his farts and is reluctant to re-enter that world. Tugg comes to his senses after the leader of Flaming Dragon stops their truck with a grenade launcher. He leads his \"men\" again.The four actors locate Four Leaf, Cody, and Tugg and cross a bridge rigged to explode to get to Underwood's helicopter. Tugg initially remains behind, believing Flaming Dragon to be his \"family\", but runs back screaming, chased by an angry horde. Four Leaf destroys the bridge, rescuing Tugg, but as the helicopter takes off, the gang boss fires a rocket-propelled grenade at the helicopter. Rick unexpectedly stumbles out of the jungle carrying a TiVo box and throws it in the path of the grenade, saving them. The crew return to Hollywood, where footage from the hidden cameras is compiled into a feature film, Tropic Blunder, which becomes a major critical and commercial success. The film wins Tugg his first Academy Award, which Kirk presents to him at the ceremony.\nLes celebrates 8 academy awards and $400MM at the box office for the movie.",
	"links": [
		"https://www.amazon.com/Tropic-Thunder-Ben-Stiller/dp/B0DLJCSDWM"
	]
}