{
	"title": "The Hobbit: An Unexpected Journey",
	"release_year": "2012",
	"runtime": "169",
	"tags": [
		"Adventure",
		"Fantasy",
		"max",
		"amazon"
	],
	"rating": 7.8,
	"actors": [
		"Martin Freeman",
		"Ian McKellen",
		"Richard Armitage",
		"Andy Serkis",
		"Ken Stott",
		"Graham McTavish",
		"William Kircher",
		"William Kircher",
		"James Nesbitt",
		"Stephen Hunter",
		"Dean O'Gorman"
	],
	"staff": [
		"Peter Jackson",
		"Fran Walsh",
		"Philippa Boyens",
		"Peter Jackson",
		"Guillermo del Toro",
		"Carolynne Cunningham",
		"Peter Jackson",
		"Fran Walsh",
		"Zane Weiner",
		"Howard Shore",
		"Andrew Lesnie",
		"Jabez Olssen",
		"Scot Boland",
		"Victoria Burrows",
		"Amy Hubbard",
		"John Hubbard",
		"Dan Hennah"
	],
	"links": [
		"https://www.max.com/movies/hobbit-an-unexpected-journey/20084529-4f8d-4859-905d-c76a2b71f883",
		"https://www.amazon.com/Hobbit-Unexpected-Sir-Ian-McKellen/dp/B00BWJ6JO4"
	],
	"votes": 883499,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTcwNTE4MTUxMl5BMl5BanBnXkFtZTcwMDIyODM4OA@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Approaching his 111th birthday, the hobbit Bilbo Baggins (Martin Freeman) begins writing down the full story of his adventure 60 years earlier for the benefit of his nephew Frodo. Long before Bilbo's involvement, the Dwarf king Thror (Jeffrey Thomas) brings an era of prosperity to his kin under the Lonely Mountain until the arrival of the dragon Smaug. Thror had a precious diamond (the heart of the mountain) and untold riches of gold that had led his city to prosperity. This drew the dragon Smaug to it, as dragons covet gold with a deep desire. Destroying the nearby town of Dale, Smaug drives the Dwarves out of their mountain and takes their hoard of gold. The dragon then sets base in the Lonely Mountain & drives all the dwarfs out.\nThror's grandson Thorin (Richard Armitage) sees King Thranduil and his Wood-elves on a nearby hillside and is dismayed when they take their leave rather than aid his people, resulting in Thorin's everlasting hatred of Elves.The dwarfs were scattered all over the Middle Earth. Prince Thranduil took work wherever he could find it, mostly in the city of men.\nIn the Shire, young Bilbo is tricked by the wizard Gandalf the Grey (Ian McKellen) into hosting a party for Thorin and his company of dwarfs: Balin (Ken Stott), Dwalin (Graham McTavish), Fili (Dean O'Gorman), Kili (Aidan Turner), Dori (Mark Hadlow), Nori (Jed Brophy), Ori (Adam Brown), Oin (John Callen), Gloin (Peter Hambleton), Bifur (William Kircher), Bofur (James Nesbitt), and Bombur (Stephen Hunter).\nGandalf's aim is to recruit Bilbo as the company's \"burglar\" to aid them in their quest to enter the Lonely Mountain. Thorin believes that the time is right for Smaug's reign to end. He knows that others have read the signs too. So, he has assembled the company of Dwarfs along with Gandalf to recover the lost treasure of Erebor for his people.Bilbo is unwilling to accept at first but has a change of heart after they leave without him. On their journey, Balin tells Bilbo that once Erebor was lost to Smaug, Thror tried to reclaim the dwarf city of Moria, but it had already been taken over by a legion of Orcs. The Orcs were led by the vilest of Orc, Azog the defiler (Manu Bennett). Azog killed Thror & had sworn to kill Thorin, making Orcs the sworn enemy of dwarfs for all eternity. Thorin cuts offs Azog arm in the same battle & rallies his troops to a famous victory over the Orcs.Traveling onward, the company is captured by three trolls. Bilbo stalls the trolls from eating them until dawn, when Gandalf exposes the trolls to sunlight, which turns them to stone. They search the trolls' cave and find treasure and Elven blades. Thorin and Gandalf each take an Elf-made blade-Orcrist and Glamdring, respectively-with the latter finding an Elven short sword, which he gives to Bilbo.The company encounters the wizard Radagast the Brown (Sylvester McCoy) (Radagast & Gandalf are 2 of the 5 wizards in Middle earth, led by Saruman the white), who tells them of an encounter at Dol Guldur with a Necromancer that has been corrupting Greenwood with dark magic. A Necromancer is an evil spirit with powers to interact with the underworld. The Necromancer had attacked Radagast at Dol Guldur, but Radagast escaped. While escaping, he picks a strange blade from Dol Guldur that is not from the land of the living.The company is then chased by orcs on Wargs. Radagast covers the company's escape as Gandalf leads the company through a stone passage to Rivendell. There the company is rescued by Elves who chase the Orgs away. Thorin is dead against asking for any help from Elves, but Gandalf convinces him. There, Elf Lord Elrond (Hugo Weaving) discloses a hidden indication of a secret door on the company's map of the Lonely Mountain, which will be visible only on Durin's Day, which is fast approaching.Gandalf later tells the White Council-consisting of Elrond, Galadriel (Cate Blanchett) and Saruman the White (Christopher Lee) about his involvement with the Dwarves. He presents a Morgul-blade Radagast obtained from Dol Guldur as a sign that the Necromancer is linked to the Witch-king of Angmar and may attempt to use Smaug for his evil purposes.\nSaruman is skeptical, not believing the Necromancer to be a true threat. Galadriel knows that Angmar used to serve the evil lord Sauron. Sauron & his armies were defeated 400 years ago & there has been peace in middle earth. She believes that the riddle of the Necromancer must be resolved as it is hiding an evil that has not yet revealed itself. Galadriel thinks that the council should assemble an army to counter the impending threat, but Gandalf re-iterates his faith in the deeds of everyday ordinary folk to keep evil at bay.The leader of the Orc pack returns to his base & it is revealed that Azog is still alive & is baying for Thorin's blood.\nWithout Gandalf, the company journeys into the Misty Mountains, where they find themselves amid a colossal battle between stone giants. They take refuge in a cave and are captured by Goblins, who take them to their leader, the Great Goblin (Barry Humphries).Bilbo becomes separated from the dwarfs and falls into a cave where he encounters Gollum (Andy Serkis), who accidentally drops a golden ring while killing a stray goblin to eat. Pocketing the ring, Bilbo finds himself confronted by Gollum. They play a riddle game, wagering that Bilbo will be shown the way out if he wins or eaten by Gollum if he loses. Bilbo eventually wins by asking Gollum what he has in his pocket. Noticing his ring is lost, Gollum suspects that Bilbo possesses it and attacks the hobbit. Bilbo discovers that the ring grants him invisibility and evades a furious Gollum. Bilbo finds his way out into the sunlight where the Gollum can't follow. Gollum curses Baggins & vows to hate all Baggins forever.Meanwhile, the Great Goblin reveals to the dwarfs that Azog, an Orc war-chief who beheaded Thror and lost his forearm to Thorin in battle outside the Dwarven kingdom of Moria, has placed a bounty on Thorin's head. Gandalf arrives and leads the dwarfs in an escape, killing the Great Goblin. Bilbo, sparing the pursuing Gollum, exits the mountain and rejoins the company, keeping secret his newly obtained ring.The company is ambushed by Azog and his hunting party and takes refuge in trees. Thorin charges Azog but is knocked to the ground. Bilbo saves Thorin from the orcs just as the company is rescued by eagles, who fly them to the safety of the Carrock. In the distance, the company sees the Lonely Mountain, where the sleeping Smaug is awakened by the knocking sound of a thrush."
}