{
	"title": "Pineapple Express",
	"release_year": "2008",
	"runtime": "111",
	"tags": [
		"Action",
		"Comedy",
		"Crime",
		"amazon"
	],
	"rating": 6.9,
	"actors": [
		"Seth Rogen",
		"James Franco",
		"Gary Cole",
		"Danny McBride",
		"Kevin Corrigan",
		"Craig Robinson",
		"Rosie Perez",
		"Rosie Perez",
		"Ed Begley Jr.",
		"Nora Dunn",
		"Amber Heard"
	],
	"staff": [
		"David Gordon Green",
		"Seth Rogen",
		"Evan Goldberg",
		"Judd Apatow",
		"Judd Apatow",
		"Shauna Robertson",
		"Graeme Revell",
		"Tim Orr",
		"Craig Alpert",
		"Kerry Barden",
		"Suzanne Crowley",
		"Billy Hopkins",
		"Chris L. Spellman"
	],
	"votes": 360576,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTY1MTE4NzAwM15BMl5BanBnXkFtZTcwNzg3Mjg2MQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1937, a soldier (Bill Hader) in a military facility (which is underground and hidden in the middle of nowhere) is being observed through a two-way mirror smoking marijuana and revealing in his euphoria what he hates about the army. The soldier complains that the army has all men, not enough women, is too secretive, and wants to share \"item 9\" (code for marijuana) with the whole world.\nA high-ranking officer closes the project, disposes of the soldier and deems marijuana illegal.Seventy years later in 2007, Dale Denton (Seth Rogen), a subpoena server wants marijuana to be made legal as he argues that everyone loves smoking weed. Dale says that marijuana makes everything better like food, music, sex and even bad movies. Dale believes that the current system is putting money in hands of the criminals and is forcing ordinary people to deal with the criminals.\nDale is 25 and is dating an 18-year-old high school girl named Angela. Angela wants Dale to visit her parents, but he keeps making excuses about work. Meanwhile Angela's lab partner Clark (Arthur Napiontek) is hitting on Angela.\nDale promises Angela that he will drop by for dinner with her parents that night.Dale visits his drug dealer, Saul Silver (James Franco), to buy marijuana. Saul sells Dale a Pac of the Pineapple express blend, a rare kind of strain that recently hit the market. Saul brags that he is the only dealer in town to have this strain of weed. Saul lures Dale to smoke a joint with him. While talking, Saul learns that Dale is a process server and has to wear disguises to serve legal papers to their intended recipients in person. Saul says he may know Dale's next customer, to whom Dale is serving some court papers, Ted Jones (Gary Cole).Saul buys his supply from Red, who buys it from Ted. At Ted's house, Dale is waiting outside to finish his joint when a police car pulls up. Dale witnesses Ted and a police officer, Carol Brazier (Rosie Perez), shoot and kill a rival Korean gangster.\nWhile fleeing, Dale leaves behind his roach (joint) containing Pineapple Express, the rare strain of marijuana he just purchased from Saul. Ted identifies the strain and sends his henchmen Budlofsky (Kevin Corrigan) and Matheson (Craig Robinson) to Red (Danny McBride), a dealer who tells them about Saul.Dale rushes back to Saul & at his apartment, Dale learns Ted is a drug lord and could trace the roach (as only Red and Saul have the Pineapple Express strain).\nDale and Saul decide they must flee the city. They attempt to hide in the woods where Dale's car battery dies.\nDale and Saul visit Red, who was already working with Budlofsky and had ratted Saul out. Red reveals that Ted knows who they are and intends to kill them.Dale and Saul escape, as Budlofsky comes in. Budlofsky and Matheson torture Red for information and both shoot him in the abdomen.\nTed orders Budlovsky to kill Red. Meanwhile the Korean gang members are outside Ted's house and listening to all his conversations.Believing Dale's high-school girlfriend Angie to be in danger, he and Saul travel to her home.\nDale shows up for dinner at his girlfriend's Angie (Amber Heard) parents' house and obviously it goes bad as Dale is bleeding and he stinks. Angie's dad pulls out his shotgun and starts shooting at Dale & Saul, but Dale manages to convince him to calm down. As Budlofsky reaches Angie's house (tracking Dale's car), Dale and Saul leave. Angie's family goes to a hotel.Meanwhile Ted and Carol talk to the Korean mob boss Cheung (Dana Lee) and tell him that his assassin is dead. Ted promises retaliation if Cheung does not withdraw Dale. Ted thinks Dale is another assassin sent by Cheung. Cheng decides to attack Ted.Dale and Saul decide they must leave the city. They sell Pineapple Express to raise bus fare, but Dale is arrested by Police Liaison Officer Bobbra (Cleo King). Dale tells Bobbra that he witnessed Brazier and Ted murder a man. Bobbra has long been suspicious of Brazier's corruption and says she will investigate. However, Saul, thinking that it is Brazier driving, hijacks the police car. Brazier hears on police radio of Dale's arrest and pursues Dale and Saul in a high-speed chase, but they escape.After Dale and Saul argue, they call each other stupid and the main reason of why they both are in this mess. Dale and Saul split up, and Saul is kidnapped.\nBudlofsky was waiting at Saul's grandmother's retirement home, when Saul visited her. Saul is held in Ted's lair beneath the same military facility from 1937.Dale enlists Red's help to rescue Saul. Red had miraculously survived 2 gunshots to his body and arms himself and Dale and drives Dale to the lair where Saul has been kept. Red backs out at the last minute and Dale is captured by Budlofsky. While Dale and Saul are waiting to be killed, they reconcile and plan an escape.Korean mobsters attack the barn to avenge their fellow gangster's death, the murder that Dale witnessed. Dale and Saul free themselves but are caught by Matheson (Craig Robinson). Matheson is Budlofsky's assistant and has been working with this entire time.\nA brawl ensues between the attacking Asians and Ted's forces who retaliate. There are heavy casualties on both sides. Saul takes on Brazier, while Dale combats Ted. Both manage to come out on top, but Matheson has the gun on Saul.Red reappears and drives his car through the barn, killing Matheson and saving Saul, but is shot by Brazier. A mobster sets off a bomb killing Ted and setting fire to the barn. Red's car explodes and lands on Brazier, killing her. Dale carries Saul from the burning barn and Red, wounded but still alive, also escapes and reconciles with them. They talk about their adventure over breakfast at a diner before Saul's grandmother picks them up and takes them to the hospital.",
	"links": [
		"https://www.amazon.com/Pineapple-Express-Seth-Rogen/dp/B001N4TBLG"
	]
}