{
	"title": "Mary and Max.",
	"release_year": "2009",
	"runtime": "92",
	"tags": [
		"Animation",
		"Comedy",
		"Drama",
		"amazon"
	],
	"rating": 8.1,
	"actors": [
		"Toni Collette",
		"Philip Seymour Hoffman",
		"Eric Bana",
		"Barry Humphries",
		"Christopher Massey",
		"Christopher Massey",
		"Christopher Massey",
		"Oliver Marks",
		"Daisy Kocher",
		"Daisy Kocher",
		"Daisy Kocher",
		"Daniel Marks",
		"Hamish Hughes",
		"Hamish Hughes",
		"Hamish Hughes",
		"Dan Doherty"
	],
	"staff": [
		"Adam Elliot",
		"Adam Elliot",
		"Melanie Coombs",
		"Dale Cornelius",
		"Gerald Thompson",
		"Bill Murphy",
		"Brooke Howden",
		"Adam Elliot"
	],
	"votes": 188674,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzY2Mjc4NjMtNGY4Mi00NzM5LTk3ZTQtN2VkNzVkMzRmM2Y2XkEyXkFqcGc@._V1_QL75_UY281_CR4,0,190,281_.jpg",
	"description": "In 1976, eight-year-old Mary Daisy Dinkle lives a lonely life in Mount Waverley, Australia. Teased by classmates for the birthmark on her forehead, Mary finds little solace in her home. Her father, Noel, is distant, and her mother, Vera, is an alcoholic kleptomaniac. Mary's only comforts are her pet rooster, Ethel; sweetened condensed milk; and a cartoon show called The Noblets. During a trip to the post office with her mother, Mary spots a New York City phone book. Curious about Americans, she randomly selects a name-Max Jerry Horowitz-and writes him a letter about herself.Max, a 44-year-old Jewish atheist living in New York City, struggles with obesity and severe social and mental health issues, including anxiety. Receiving Mary's letter gives Max a panic attack, but he eventually responds, sparking an unlikely friendship. Both share a love for chocolate and The Noblets. Vera disapproves of Max's correspondence, so Mary has his letters sent to her agoraphobic neighbor, Len. When Mary asks Max about love, he suffers another anxiety attack and is hospitalized for eight months.After recovering, Max wins the lottery, using the money to buy a lifetime supply of chocolate and a complete collection of Noblet figurines. He gives the rest of his winnings to an elderly neighbor, Ivy, who treats herself before dying in an accident. Meanwhile, Mary, thinking Max has abandoned her, grows despondent. Max eventually writes back, explaining his Asperger syndrome diagnosis, and the two resume their letters, maintaining their friendship for years.As Mary grows older, her life changes. After Noel dies in a freak accident during a metal-detecting trip, Mary removes her birthmark and falls in love with her neighbor, Damien Popodopoulos. Vera dies after mistakenly drinking embalming fluid instead of cooking sherry, and Mary marries Damien.At university, Mary studies psychology and writes her dissertation on Asperger syndrome, using Max as her case study. She sends Max a copy of her work, but he is deeply offended, feeling exploited. Cutting off contact, he removes the letter \"M\" from his typewriter and ceases writing to her. Mary, devastated, has all copies of her dissertation destroyed, which ruins her academic career. She turns to alcohol to cope. Her despair worsens when Damien leaves her for his pen pal, Desmond.After finding a can of condensed milk, Mary sends it to Max as an apology. One day, Max has a moment of clarity while angrily confronting a homeless man for littering. He realizes everyone, including himself, is flawed. In a gesture of forgiveness, Max sends Mary his beloved Noblet figurine collection. Len, now overcoming his agoraphobia, alerts Mary to the package on her doorstep. Inside, Max includes a heartfelt letter explaining how much their friendship means to him.Pregnant and unaware of her condition, Mary contemplates suicide but finds new hope through Max's letter. Inspired by his words, she decides to visit him in New York with her infant child. When Mary arrives, she discovers Max has passed away, sitting peacefully on his couch with a smile on his face. Looking around his apartment, she sees all the letters she sent him lovingly taped to the ceiling. Overwhelmed by the profound impact of their friendship, Mary sits beside Max and cries tears of both sadness and gratitude.",
	"links": [
		"https://www.amazon.com/Mary-Max-Toni-Collette/dp/B0036V2ZXA"
	]
}