{
	"title": "Dear John",
	"release_year": "2010",
	"runtime": "108",
	"tags": [
		"Drama",
		"Romance",
		"War",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Channing Tatum",
		"Amanda Seyfried",
		"Richard Jenkins",
		"Henry Thomas",
		"D.J. Cotrona",
		"Cullen Moss",
		"Gavin McCulley",
		"Jose Lucena Jr.",
		"Keith D. Robinson",
		"Scott Porter"
	],
	"staff": [
		"Lasse Hallström",
		"Jamie Linden",
		"Nicholas Sparks",
		"Marty Bowen",
		"Wyck Godfrey",
		"Ryan Kavanaugh",
		"Deborah Lurie",
		"Terry Stacey",
		"Kristina Boden",
		"Joanna Colbert",
		"Mark Fincannon",
		"Rich Mento",
		"Kara Lindstrom"
	],
	"votes": 158980,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTk1NDEzMTU5NV5BMl5BanBnXkFtZTcwNTI3MTk5Mg@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 2003, John Tyree (Channing Tatum), a Staff Sergeant in the United States Army Special Forces is lying on the ground in Afghanistan, in combat gear with multiple gunshot wounds to his body. Coins begin to fall over him as, in a voiceover, he recalls a childhood trip to the U.S. Mint with his father, who is a coin collector. He compares himself to a coin in the United States Military, and states that the last thing he thought about before he blacked out was \"you\".In 2001, in Charleston, South Carolina, John is on vacation. He meets Savannah (Amanda Seyfried), a college student on spring break, when he rescues her purse from the water. Savannah was at the pier with friends, when her purse fell into the water by accident. John jumps into the water to retrieve it and he meets Savannah when he returns the purse to her. Savannah invites John to her home to dry up.Savannah is a college student building homes with a group of students for Habitat for Humanity while on spring break. The home she is rebuilding were damaged in the hurricane.\nOver the course of two weeks, Savannah and John fall in love. John meets Savannah's family, her neighbor, Tim Wheddon (Henry Thomas), and Tim's son Alan (Luke Benward) who has autism.\nSavannah meets John's father Bill (Richard Jenkins), a reclusive man who seems to be obsessed with his coin collection (specifically mules) (A mule coin is a coin that is struck using dies that were not intended to be paired together, resulting in a mismatched design. This error is also known as a mule error), but his genuine interest draws her, to John's surprise.Soon, it is time for both of them to return to their lives. Savannah has to go back to college, and John has to go to Germany to complete his tour of duty. John tells Savannah that he just needs to do 12 months and after that he will be done.\nSavannah mentions to John that his father, like Alan, may have high functioning autism. This upsets John, who storms off, and then gets into a fight with Savannah's friend Randy (Scott Porter) and, in the process, accidentally punches Tim. John apologizes to Tim, and leaves Savannah a note at her home.\nShe later visits John to spend one last day together. Before John leaves, they make a promise to continue their relationship via letters, and vow to tell each other everything.\nJohn parts with, \"I'll see you soon, then,\" rather than goodbye.John and Savannah continue their relationship through letters, expecting to build a life together when he leaves the army. But the recent September 11 attacks make him reconsider the army, and he ultimately chooses to re-enlist.During one of the exchanges, John narrates the story of how he found a mule penny coin, when he was given change by an ice cream vendor. He and Bill took the coin to a pawn shop, who tried to swindle them by asking them to sell the coin for $20. They then take the coin to an appraiser, who tells them that the coin is worth $4000, and advises them not to sell the coin as it will only appreciate in value over time. But then Bill got obsessed with coins and started his coin collection. He and Bill spoke less and less from that point on.As a result of John's re-enlistment their time apart from each other ultimately turns into years. Back in Charleston, Savannah begins to spend more time with Tim and decides that she wants to work with Autistic children; she plans to build a farm and horse stables where they can enjoy the outdoors and animals.\nOver the next two years, the romance goes on, through their letters. After a time, John finds himself anxiously awaiting the next letter, but when it arrives it is a Dear John letter, informing him that she has become engaged to someone else, John burns all of Savannah's letters.In 2003 after being shot in Afghanistan, John is encouraged to return home but he re-enlists for a second time. After four more years and many missions, while waiting to receive orders on his unit's next deployment, John is informed that his father had a stroke. When John arrives at the hospital, he learns that his father is still alive but in grave condition. John writes a letter to his father, which he reads to him at the hospital; John's voiceover at the beginning of the film was from this letter, in which he told his father that the first thing to cross his mind after he was shot was coins, and the last thing to cross his mind before he lost consciousness was his dad, ultimately the most important person in his life. Soon afterwards, his father dies.John goes to visit Savannah and is shocked to find that she has married Tim and is living with him. He learns that she had to abandon her dream of a riding camp for kids with autism because of Tim's fight against lymphoma, and John goes with her to visit him in the hospital. Tim tells John that Savannah still loves him and she has never forgotten him.\nThat night, Savannah asks John to stay for dinner. At the table, John asks Savannah why she did not even call him, and she says it was because just hearing his voice would make her change her mind. As John goes towards the door, Savannah says \"I'll see you soon then\". She asks him to reply the same (like they always do) but there is silence. He replies \"Goodbye, Savannah\" and leaves.John makes a decision to sell all of his father's coin collection except the mule that John found, to raise money which could help Tim in his treatment. Back in the army, it shows John using the mule as a charm. He receives a final letter from Savannah telling him that they received an anonymous donation but Tim died from his illness after only two months of treatment and ending with \"I'll see you soon, then.\"Months later, John, now a civilian, eventually returns home; while in town one day while parking his bike, he sees Savannah at a coffee shop. They reunite and embrace.",
	"links": [
		"https://www.amazon.com/Dear-John-Military-Movies-Advisors/dp/B003LPRRR0"
	]
}