{
	"title": "The Hunger Games: The Ballad of Songbirds & Snakes",
	"release_year": "2023",
	"runtime": "157",
	"tags": [
		"Action",
		"Adventure",
		"Drama",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Rachel Zegler",
		"Tom Blyth",
		"Viola Davis",
		"Dexter Sol Ansell",
		"Rosa Gotzler",
		"Clemens Schick",
		"Fionnula Flanagan",
		"Hunter Schafer",
		"Ashley Liao",
		"Athena Strates"
	],
	"staff": [
		"Francis Lawrence",
		"Michael Lesslie",
		"Michael Arndt",
		"Suzanne Collins",
		"Nina Jacobson",
		"Francis Lawrence",
		"Brad Simpson",
		"James Newton Howard",
		"Jo Willems",
		"Mark Yoshikawa",
		"Dylan Jury",
		"Debra Zane",
		"Uli Hanisch"
	],
	"votes": 140702,
	"cover": "https://m.media-amazon.com/images/M/MV5BZDk2YjNhYzEtYzg2ZC00OWEwLWJhYzgtMGUzMWVjNDFmYzI5XkEyXkFqcGc@._V1_QL75_UX190_CR0,6,190,281_.jpg",
	"description": "3 years before the First Hunger Games were the dark days. Coriolanus's father is killed after being declared a rebel. There is widespread hunger in the districts as people resort to cannibalism.In war-ravaged Panem, Coriolanus Snow (Tom Blyth) is one of twenty-four Academy students selected to mentor a 10th Annual Hunger Games tribute. Coriolanus hopes for the Plinth Prize scholarship to restore his family's prosperity, which was damaged after his father's death.\nSejanus Plinth (whose father sponsors the Plinth Scholarship), a fellow Academy student tells Coriolanus that the criteria for the Plinth Prize have been changed. Volumnia Gaul is the head Game-maker and in charge of the War Department. Dean Casca Highbottom is the creator of the Hunger Games. Highbottom announces that the Plinth Prize will now go to the best scholar in the Hunger Games. He says that the Capitol is no longer watching the games, and he wants the mentors to come up with innovative ideas to make the games interesting and re-engage audiences. This is the first-time mentors have been introduced and their role is to convince the tributes to perform for the cameras.Lucretius \"Lucky\" Flickerman (Jason Schwartzman) is the first television host for the 10th Hunger Games. Tigris Snow (Hunter Schafer) is Coriolanus's older cousin and confidante.Coriolanus is assigned District 12's female tribute, Lucy Gray Baird (Rachel Zegler). During the reaping ceremony, she engages Capitol viewers by slipping a snake down the dress of Mayor Lipp's daughter, Mayfair (Isobel Jesper Jones), then singing for the crowd.Tributes are Jessup (Nick Benson) District 12, Coral (Mackenzie Lansing) & Mizzen (Cooper Dillon) District 4, Treech (Hiroki Berrecloth) & Lamina (Irene Boehm) District 7, Tanner (Kjell Brutscheidt) & Brady (Luna Kuse) District 10, Reaper (Dimitri Abold) & Dill (Luna Steeples) District 11, Wovey (Sofia Sanchez) & Bobbin (Sofia Sanchez) District 8 and Marcus (Jerome Lance) District 2.\nMentors are Clemensia Dovecote (Ashley Liao) & Felix (who is also the son of the President) 11, Festus Creed (Max Raphael) 4, Lysistrata Vickers (Zoe Renee) 12, Arachne Crane (Lilly Cooper) 10, Pup Harrington (Ayomide Adegun) & Vipsania Sickle (Amélie Hoeferle) 7.Coriolanus is really nervous about his tribute as district 12 tributes have been killed in the first 5 minutes in last 2 Hunger Games 8 and 9. Tigris tells Coriolanus that he will need a tribute to trust him. She asks him to look for commonalities between them.Coriolanus earns Lucy Gray's trust while accompanying her to the Capitol Zoo, where tributes are publicly caged. Highbottom wants to disqualify Coriolanus for his stunt, but Sejanus stands up for him. He says that winning a war 10 years ago does not justify treating the districts like animals and this is why people do not watch the Games.\nBut Volumnia is intrigued by Coriolanus's stunt. Coriolanus says that people will watch the games if they have a stake in it. He suggests allowing bets to be placed on tributes and allowing people to get closer to the tributes before the Games.\nCoriolanus smuggles food to Lucy Gray at the zoo cage. While a few of the mentors are visiting the tributes at the zoo, a Capitol student is killed by her tribute, who is then shot.Highbottom allows the tributes and the mentors to tour the arena before the games. He also allows for tributes to be \"presented\" to the audience and asks the mentors to prepare them. Coriolanus asks Lucy Gray to sing for the audience to gain their support. He says that way the audience can provide money and he can then send gifts and supplies to her during the games.\nVolumnia reveals to Coriolanus and Clemensia that she has bred a new species of snakes who is harmless to scents that they are familiar with, but lethal to any new scents. Volumnia then kills Clemensia when she tries to take credit for Coriolanus's ideas in front of Volumnia.While touring the arena (which is itself a simple domed structure, without any technology inside it), rebel bombs explode, killing several tributes and mentors, including the President's son Felix (Aamer Husain). After Lucy Gray saves Coriolanus from the falling debris (and gives up her chance of escaping), he gives her rat poison as a weapon and says she can hide in a bombed hole in the arena floor.\nLucy Gray tells Coriolanus that her boyfriend Billy Taupe was cheating on her with Mayfair. This is why Mayfair conspired with her father to announce her as the tribute from their district. This is also why Lucy Gray tried to kill Mayfair with a snake.As the Games begin, Lucy Gray ignores Coriolanus's advise and tries to look for Jessup, the fellow tribute from 12. Lucy Gray avoids attacks from all other tributes who had taken control of arms from the central cache. Lucy Gray finds Jessup and jumps with him into the bombed hole in the middle of the arena.\nOne mentor tries to send supplies to his tribute inside the arena using drones, but the drones turn out to be just another way to eliminate the tribute.Sejanus is livid when his tribute Marcus is crucified in the arena for escaping from it during the bombing. At night, Sejanus enters the arena to offer last rites to Marcus. Volumnia asks Coriolanus to enter the arena and bring Sejanus back alive as she cannot afford to lose a mentor on live TV and invite the districts to revolt. She promises the scholarship to Coriolanus if he completes the task.\nCoriolanus convinces Sejanus that Volumnia has cut the feed to the arena, so Sejanus's sacrifice will be in vain. He tells Sejanus that he can do better from the outside rather than dying in the arena which will be classified as a flu death. As they escape, they are attacked, and Coriolanus is forced to defend himself and kill a tribute. Plinth's family thank Coriolanus for saving his life.The next morning, Jessup gets rabies and attacks Lucy Gray. Coriolanus sends in a drone to help Lucy Gray, but this ends up killing Jessup. Coral and her \"pack\" attack Lucy as she was forced into the open by Jessup. Coriolanus again sends 8 drones to attack the \"pack\" and protect Lucy.\nThe pack collects the water bottles delivered by the drones. Lucy mixes rat poison in one bottle and throws away the water from the rest.Volumnia interrupts the games to announce on TV that Felix has died from his wounds in the rebel bombing. She vows to teach a lesson to the districts, even if it means that there would be no victor from the games that year.\nCoriolanus guesses that Volumnia will use her snakes. He has a handkerchief with which he had swiped Lucy's brow. The cloth had Lucy's smell on it, and he drops it in Volumnia's snake tank.During the last round of the Games, genetically modified snakes are dropped into the arena as revenge for Felix's death. With Coriolanus's help, Lucy Gray avoids being bitten and wins the Games. It seems like the snakes were calmed by Lucy's singing, but Volumnia suspected something was wrong.\nAfterwards, Dean Casca Highbottom (Peter Dinklage) accuses Coriolanus of cheating and shows him evidence proving so (the rat poison in his mother's compact and his handkerchief with his father's initials on it recovered from the snake tank). Dean Highbottom sentences Coriolanus to 20 years' Peacekeeper service. Coriolanus bribes an officer to transfer him to District 12, and fellow Academy student Sejanus Plinth (Josh Andres Rivera), who has grown disillusioned with the Capitol's ideals after seeing his tribute die, volunteers to join him.\nCoriolanus is assigned to Commander Hoff's (Burn Gorman) unit at District 12.In District 12, Coriolanus and Lucy Gray reunite and kiss each other. Lucy assures Coriolanus that he can trust her. Lucy takes Coriolanus to a secret cabin by the lake. Shortly after witnessing an execution of a rebel, Coriolanus is to transfer for officer training in District 2. Coriolanus later finds Sejanus meeting with rebels Spruce (George Somner), Billy Taupe (Dakota Shapiro) (Lucy Gray's former love interest), and Mayfair.\nIn the ensuing confrontation, Coriolanus fatally shoots Mayfair and Spruce kills Billy. Coriolanus records Sejanus's plans in a device and leaves it in a Jabberjay cage. Spruce hides the guns, but he and Sejanus are later hanged for treason when the peacekeepers find the recording device left by Coriolanus in the Jabberjay cage.Lucy Gray and Coriolanus flee north. At a small cabin, Coriolanus finds the hidden weapons tying him to Mayfair's murder. Lucy Gray, distrusting Coriolanus, disappears into the woods. After he is bitten by a snake and unsuccessfully tries to shoot Lucy Gray, Coriolanus dumps the guns into the lake near the cabin. With no remaining witnesses, he returns to District 12.Coriolanus is sent to the Capitol, where Gamemaster Dr. Volumnia Gaul (Viola Davis) reveals she procured him a pardon and scholarship to the Capitol University. Sejanus' parents, unaware Coriolanus caused their son's death, make him their heir.\nDean Highbottom tells Coriolanus that the Hunger Games was an idea he came up with while drunk and has since been traumatized by. Coriolanus poisons Dean Highbottom's drug stash, killing the latter and beginning his rise to power, while Lucy Gray's fate is left unknown.",
	"links": [
		"https://www.amazon.com/Hunger-Games-Ballad-Songbirds-Snakes/dp/B0CMXXPTNS"
	]
}