{
	"title": "The Little Things",
	"release_year": "2021",
	"runtime": "128",
	"tags": [
		"Crime",
		"Drama",
		"Mystery",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Denzel Washington",
		"Rami Malek",
		"Jared Leto",
		"Chris Bauer",
		"Michael Hyatt",
		"Terry Kinney",
		"Natalie Morales",
		"Isabel Arraiza",
		"Joris Jarsky",
		"Glenn Morshower"
	],
	"staff": [
		"John Lee Hancock",
		"John Lee Hancock",
		"John Lee Hancock",
		"Mark Johnson",
		"Thomas Newman",
		"John Schwartzman",
		"Robert Frazen",
		"Denise Chamian",
		"Michael Corenblith"
	],
	"links": [
		"https://www.amazon.com/Little-Things-Denzel-Washington/dp/B091BDQ9G1"
	],
	"votes": 130303,
	"cover": "https://m.media-amazon.com/images/M/MV5BZmRjYmQ5Y2YtYTUyMy00OTg0LWE1YmEtZTI2NDYxYTBhYTYxXkEyXkFqcGc@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "One night in 1990, a girl Tina Salvatore (Sofia Vassilieva) drives on a highway, stalked by a motorist. After stopping at an abandoned gas station, she catches the attention of a passing truck driver and escapes her pursuer.Sometime later in Bakersfield, Kern County deputy sheriff Joe \"Deke\" Deacon (Denzel Washington) is called to the Los Angeles County Sheriff's Department to collect evidence pertaining to a recent murder. deacon is told to get authorization from homicide to release the evidence, extending his stay in LA county sheriff's office.Deacon, a former L.A. Sheriff's detective (His colleagues didn't like him in LA county and are not happy to see him back), accompanies recently appointed lead detective Jimmy Baxter (Rami Malek) to the scene of a new murder (of Julie Brock (Tiffany Gonzalez)) in L.A. Baxter doesn't like Deacon, but is forced to tag him along as Baxter doesn't have a suspect after 4 deaths and there is pressure to involve the FBI.Baxter picks up a suspect Stan Peters (Frederick Koehler), who was observed peeping into Julie's apartment frequently.\nDeacon notices similarities between the M.O. of the killing and the M.O. of an old serial murder case he was unable to solve. Bite marks on the body, no saliva samples, depth of knife stabs, angles etc etc. The dead victims appear to Deacon in his dreams.That night, a woman named Ronda Rathbun (Maya Kazan) is followed by a car while jogging and is reported missing the following morning. Baxter learns from the precinct's captain Carl Farris (Terry Kinney) that Deacon got divorced and suffered a heart attack due to his obsession with the unsolved case (he was a complete meltdown). Also, Stan Peters killed himself the previous night. Baxter is advised not to involve Deacon any further, but Deacon takes vacation leave (as he was supposed to return to Kern County the following day) to assist in solving Baxter's case.The next night, the police discover the body of another victim washed up beneath a bridge. Baxter learns the M.O. is consistent with that of the earlier murder and others: the victims were all sex workers who were stabbed to death. Deacon begins investigating Albert Sparma (Jared Leto), a suspect working at a repair store in proximity to the murders (The landlady of Julie's apartment remembers calling for a repairman to fix some issues with Julie's apartment before her murder). Baxter finds from the autopsy that Julie had been dead a few days. The killer returned to her apartment to shave her legs, move her body. He brought milk and food for himself and had a little party with the corpse. He made Julie eat roast beef even though she was a vegetarian (roast beef was found in her digestive tract).Deacon admits to Baxter that he sees the dead victims in his nightmares and solving those old crimes are his responsibility. They both agree that Stan Peters was not their guy.\nDeacon tails Sparma (His teeth marks are close to the ones on the victims, he eats roast beef, and is interested in strippers) but is thwarted (Sparma spots Deacon tailing him and taunts him), so he takes Sparma in for questioning. While under interrogation, Sparma taunts the detectives (he is cool as a cucumber and knows that the police has nothing on him) and is released after provoking Deacon into an angry outburst.The young woman, Tina Salvatore, pursued in the desert is interviewed, but sees Sparma in handcuffs at the police station which effectively compromises her eligibility as an objective witness for identifying him as a suspect.The FBI is called in to take charge of the investigation within the week, giving Deacon and Baxter less time to resolve it. Farris informs Baxter that eight years prior, Sparma confessed to a murder which he couldn't possibly have committed and is thus an unlikely suspect. Sparma's fingerprint is similar to the killer's but not a definitive match (11 out of 18 identifiers match). Baxter and Deacon go to Sparma's apartment and conduct an illegal search but find nothing incriminating. As Deacon searches the apartment (he finds the news clippings of all murders being tracked), his portable police scanner goes off and he narrowly escapes from Sparma's home after Sparma calls in an \"officer down\" report at that address. Police arrive and Deacon escapes while Baxter (who was waiting in the car outside) sees Sparma watching the ordeal.While monitoring Sparma, Baxter corners the suspect alone and demands to know Rathbun's location. Sparma offers to drive him to where he supposedly hid Rathbun's body. Baxter cautiously agrees while Deacon secretly follows. Sparma takes Baxter to a remote area in the desert and has him dig several holes before telling Baxter that he never killed anyone. Skeptical, Baxter continues digging. Sparma begins to taunt him until Baxter snaps and strikes him in the face with the shovel, killing him.As Deacon arrives, a flashback reveals that he accidentally shot the one survivor (who was hiding in the forest and came out when the police arrived. But she surprised Deacon, who shot at her, killing her) of his last murder case and that Farris and Dunigan (Michael Hyatt), the coroner, helped cover it up. Deacon instructs Baxter to bury Sparma in the desert. Deacon spends the night collecting everything in Sparma's apartment and disposing of his vehicle. Then he returns to the desert the following morning to find that Baxter has not buried Sparma but is instead still searching for the victim, desperate to believe Sparma is the killer. Deacon advises him to forget about the case, or it will haunt him for life.Later, at his home, Baxter receives an envelope sent by Deacon, containing a red barrette like the one Ronda Rathbun was wearing when she was abducted. Back in Kern County, Deacon burns everything he collected in the apartment, along with a brand-new pack of barrettes that is missing a red barrette. Basically, Deacon bought the barrettes pack and sent the pink one to Baxter to bring closure to his life, which he never had himself."
}