{
	"title": "Lightyear",
	"release_year": "2022",
	"runtime": "105",
	"tags": [
		"Action",
		"Adventure",
		"Animation",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Chris Evans",
		"Keke Palmer",
		"Peter Sohn",
		"Peter Sohn",
		"Taika Waititi",
		"Dale Soules",
		"James Brolin",
		"Uzo Aduba",
		"Mary McDonald-Lewis",
		"Isiah Whitlock Jr.",
		"Angus MacLane",
		"Angus MacLane"
	],
	"staff": [
		"Angus MacLane",
		"Angus MacLane",
		"Matthew Aldrich",
		"Jason Headley",
		"Rebecca Banks",
		"Galyn Susman",
		"Michael Giacchino",
		"Jeremy Lasky",
		"Ian Megibben",
		"Anthony Greenberg",
		"Natalie Lyon",
		"Kevin Reher",
		"Tim Evatt"
	],
	"votes": 126531,
	"cover": "https://m.media-amazon.com/images/M/MV5BZGI3ZjUyM2ItNmFjYy00NGE3LTg2OTYtMTI2MDk0MjIxNDA1XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The Star Command exploration vessel changes course to investigate signs of life on the unknown planet T'Kani Prime. Space Ranger Buzz Lightyear and his best friend and commanding officer, Alisha Hawthorne, are awakened from hibernation to lead the mission. Alongside a new recruit, they explore the hostile planet but are forced to retreat to their vessel after encountering dangerous lifeforms. During the escape, the vessel sustains severe damage, leaving the crew stranded on the surface. Feeling responsible, Buzz volunteers to test a hyperspace fuel crystal they must develop to return home.A year later, the crew has established a colony to continue repairs. Buzz undertakes a four-minute test flight, but due to relativistic time dilation, he returns to find that four years have passed on T'Kani Prime. Despite the passage of time, Buzz persists in his test flights, accompanied by Sox, an orange robotic feline assigned to assist him. Each test propels him further into the future, with four years passing for every mission. Over the course of 66 years, the colony thrives, Alisha marries her wife Kiko and raises a family, and eventually dies of old age. Meanwhile, Sox refines the fuel, achieving faster-than-light travel capability.Disobeying the orders of Commander Cal Burnside, Alisha's successor, Buzz conducts another test with the improved fuel. The flight is successful, but he leaps 22 years into the future, discovering that T'Kani Prime has been overrun by Zyclops robots under the command of a mysterious leader named Zurg. Buzz encounters a ragtag team of colonists: Izzy Hawthorne, Alisha's adult granddaughter; Mo Morrison, a nave recruit; Darby Steel, a cantankerous parolee; and the robot DERIC. Initially reluctant, Buzz gradually bonds with the team as they evade hostile creatures and repair their ship. Together, they plan to infiltrate Zurg's mothership and destroy the invading force.During the mission, Buzz is captured by Zurg, who reveals himself to be an older version of Buzz from an alternate time line. This older Buzz explains that his time line diverged after the successful hyperspace test, where the colony attempted to arrest him for disobeying orders. Fleeing into deep space, he traveled far into the future, encountering advanced technology and developing a plan to travel back in time and prevent the crew from being stranded on T'Kani Prime. However, doing so would erase the lives of the colonists, including Alisha, Kiko, and Izzy. Younger Buzz refuses to help, unwilling to sacrifice the lives of his friends and their descendants.With help from Zurg's Sox, Buzz and his team escape the mothership, setting it to self-destruct. As they attempt to return to the planet, Zurg intercepts them and seizes the fuel. In a final confrontation, Buzz destroys the fuel crystal, triggering an explosion that appears to kill Zurg. Accepting that T'Kani Prime is now their home, Buzz returns to the colony. Commander Burnside initially orders Buzz's arrest but relents after recognizing his heroism. Buzz is authorized to revive the Space Ranger Corps and surprises everyone by selecting Izzy, Mo, Darby, and Sox as his first recruits. With a new hyperspace fuel crystal developed using the colony's resources, Buzz and his team embark on their next adventure.In a post-credits scene, Zurg is revealed to have survived the explosion.",
	"links": [
		"https://www.amazon.com/Lightyear-Chris-Evans/dp/B0B5PQKYGZ"
	]
}