{
	"title": "K.G.F: Chapter 2",
	"release_year": "2022",
	"runtime": "166",
	"tags": [
		"Action",
		"Crime",
		"Drama",
		"amazon"
	],
	"rating": 8.2,
	"actors": [
		"Yash",
		"Sanjay Dutt",
		"Raveena Tandon",
		"Srinidhi Shetty",
		"Achyuth Kumar",
		"Prakash Raj",
		"Rao Ramesh",
		"Malavika Avinash",
		"T.S. Nagabharana",
		"Easwari Rao"
	],
	"staff": [
		"Prashanth Neel",
		"Prashanth Neel",
		"Sunilbharthi Goswami",
		"Chaluve Gowda",
		"Vijay Kiragandur",
		"Ravi Basrur",
		"Bhuvan Gowda",
		"Ujwal Kulkarni"
	],
	"votes": 152857,
	"cover": "https://m.media-amazon.com/images/M/MV5BZmQzZjVkZTUtYjI4ZC00ZDJmLWI0ZDUtZTFmMGM1Mzc5ZjIyXkEyXkFqcGc@._V1_QL75_UY281_CR4,0,190,281_.jpg",
	"description": "After detailing the events in K.G.F: Chapter 1, Anand Ingalagi suffers a stroke (& goes into a coma due to clotting in the brain. Due to his age, the condition is inoperable) and his son, Vijayendra (Prakash Raj), takes over to narrate the rest of the story to Deepa Hegde (Malavika Avinash), the Chief Editor of 24/news channel & Srinivas (T. S. Nagabharana), news channel owner. Vijayendra says that his father Anand neglected his own family for the sake of the story of KGF. He promises to complete the story, as it cannot go unfinished.Vijayendra says that CBI knew about the criminal syndicate in Bombay and Karnataka at the time. All evidence points towards KGF, but since there was no political interest in the matter, the case was not on CBI's priority list. Garuda was dead in KGF. Rocky already had the workers of KGF on his side.Raja Krishnappa Bairya \"Rocky\" (Yash) kills heir apparent Virat (Vinay Bidappa) (Garuda's younger brother) (he killed Virat even before his killed Garuda) and takes over the Kolar Gold Fields (K.G.F), keeping Reena (Srinidhi Shetty) hostage to ensure the cooperation of Guru Pandian (Achyuth Kumar) (DYSS Party head), Andrews (B. S. Avinash) (Shetty's boss) and Rajendra Desai (Lakki Lakshman) (Reena's father and a high-ranking associate at K.G.F), and kills Kamal (Vasishta N. Simha) (Reena's fiance) when he protests.\nRocky spares Vanaram (Ayyappa P. Sharma), commander of K.G.F, after he pledges loyalty to Rocky. Vanaram starts training the ordinary workers of KGF in the use of firearms and starts building a defense force. Vanaram deploys a team of 300 men to guard Outpost 1, the main entry point into KGF.As Rocky's influence grows, many central ministers plan the downfall of Guru Pandian's government, to bring in the Govt of Ramika Sen. They believe only Ramika can free India from the terror of Rocky and KGF.\nRocky issues orders to start work in eight hidden mines. Suryavardhan (Ramesh Indira), the founder of the K.G.F's political cult and father of Garuda and Virat, wanted the mines to last for generations and hence was mining it slowly. Rocky wanted to capture the world and wanted to mine the entire output in 2 yrs. Reena sees first hand that Rocky enjoys a God like status among the workers of the mines.Meanwhile, Adheera (Sanjay Dutt) (Suryavardhan's brother) resurfaces and kills all guards at an outpost. In a ruse to bring Rocky to Adheera, Andrews kills Desai to lure Reena outside K.G.F, and John (John Kokken) (overseer of K.G.F) captures Reena. Rocky leaves KGF to save Reena. Adheera shoots Rocky but spares his life, while his men roadblock all gold exports from K.G.F. Adheera wanted to dent Rocky's God like image in the eye of his thousands of workers.Meanwhile, Shetty (Dinesh Mangaluru) (Rocky's employer and a prominent gold smuggler) ties up with other subordinates of Andrews across India's western coast and exterminates Rocky's allies with Inayat Khalil's (Balakrishna) (a Dubai based don) newfound support. All seemed lost. KGF had food supplies for only 8 days and starvation is imminent. One mother in particular complains to Rocky that her son's dead body has not been returned from Outpost 1. He considered Rocky as his God.A recuperated Rocky, along with Reena, visits Dubai (he puts all his gold in a helicopter and leaves for Dubai, giving the impression that he is abandoning KGF and its workers) to deal in gold with Khalil. Inayat Khalil rebuff's Rocky saying that Guru Pandian is on his way out, Adheera is moving towards KGF and Shetty controls the entire west coast. Rocky is done.\nBut in a stunning counter-attack (with the help of his uncle Khasim (Harish Rai)) Rocky's aides kill Shetty's associates and recapture the west coast of India. When Inayat finds out, he agrees to Rocky's deal to buy Gold from Inayat directly from Africa, thereby taking all the risk of Gold smuggling on his own hands. Rocky also buys Kalashnikovs from him. Rocky and his gang gravely wound Adheera and kill his henchmen with their newly acquired weapons.\nExasperated with K.G.F, some central ministers had planned a no-confidence motion against the DYSS-supported government to bring Ramika Sen (Raveena Tandon) in power, but Rocky's henchmen threaten other ministers against the vote and the motion fails. Rocky also kills Shetty, gaining control over Bombay. Rocky brings back the dead bodies of all his men at outpost 1, and fulfills the promise to the mother who lost her son.Pandian warns Rocky of Ramika Sen's rising stature, but he disregards him. He industrializes KGF at a rapid pace.\nThree years later in 1981, she wins the Indian general elections and becomes Prime Minister. After CBI officer Kanneganti Raghavan (Rao Ramesh) briefs her about the situation in K.G.F, she issues orders to close all state borders (But state forces cant do anything as 15 Lakh people protect Rocky and wont allow State police to cross KGF boundaries) (Commercial flights are banned over KGF and the only known photo comes from a MIG air-force jet on a training flight, which shows how rapidly KGF has been industrialized) and authorizes Raghavan to raid Rocky's warehouses.\nA young Ingalagi (Ashok Sharma) is caught spying by Rocky's henchmen, but Rocky is impressed by his integrity. The CBI find nothing in their raids save for a 400 gram-gold bar. Rocky retrieves it from a police station and brings the place down with a DuShKa Soviet make machine gun. Ramika is enraged at Rocky's audacity and decides that a military action will need to be undertaken.\nRocky halts all exports from K.G.F, which strains relations with Khalil, but continues the mining. His aides trace his biological father, a drunkard who abandoned his family, and pays the unaware man to take care of his mother's Shanthamma (Archana Jois) newly shifted grave. Reena confesses her feelings to Rocky and they get married.\nRamika finds evidence of Rocky channeling black money into a single trust fund. she is happy that now she can arrest Rocky. Rocky meets with Sen and hands her a file exposing his involvement in money laundering, but she cannot consider it (her party members beg her not to take the complaint) as almost all her party members are complicit in the corruption and take payments from the trust fund.\nStill furious after his defeat, Adheera makes his way to K.G.F through a secret passage (The mines underneath KGF were several kilometers long and some of them expanded outside of KGF's boundaries and were hence unprotected) with Andrews, Daya (Tarak Ponnappa) (Andrews' aide) and John, supported by Khalil's armada.Just as Reena reveals her pregnancy to Rocky, Adheera fatally snipes her. In the ensuing clash, Rocky's army kill Andrews and Daya, while Rocky kills John and chokes Adheera to death.\nRocky and his henchmen disrupt Sen's speech at the Parliament and kill Pandian. Pandian had staged the attack on Garuda (Ramachandra Raju) (Suryavardhan's son) for which Adheera was framed, and informed Adheera of Garuda's attack before hand (Thereby saving him). He was also the one who showed Adheera the secret passage (By first getting Rocky to evacuate the mine by telling him that the mine was yielding nothing but rocks and then gave the maps to Adheera), goaded Andrews into hiring Rocky, staged the no-confidence motion drama in Delhi, and persuaded Shetty to join forces with Khalil just to gain Rocky's trust.\nSen issues a death warrant against Rocky and enforces the Indian Army. Rocky evacuates K.G.F and leaves on a ship with his cache of gold. Before leaving, Rocky forms a new colony for all K.G.F workers. He signals the Navy to his location, but refuses to surrender. Sen issues orders to bomb K.G.F and Rocky's ship, and he drowns in the ocean along with the gold, which stays lost till date. A young Ingalagi decides to write a book on Rocky.In mid-credits scene, three months post-Rocky's death, a CIA official hands over a file listing Rocky's crimes in United States and 16 other nations between 1978-1981 to Sen. In the present, the peon of the television news channel finds the final draft of K.G.F: Chapter 3.",
	"links": [
		"https://www.amazon.com/K-G-F-Chapter-2-Hindi-Yash/dp/B09ZQPC8B2"
	]
}