{
	"title": "Boyhood",
	"release_year": "2014",
	"runtime": "165",
	"tags": [
		"Drama",
		"amazon"
	],
	"rating": 7.9,
	"actors": [
		"Ellar Coltrane",
		"Patricia Arquette",
		"Ethan Hawke",
		"Elijah Smith",
		"Lorelei Linklater",
		"Steven Chester Prince",
		"Bonnie Cross",
		"Sydney Orta",
		"Libby Villari",
		"Marco Perella"
	],
	"staff": [
		"Richard Linklater",
		"Richard Linklater",
		"Richard Linklater",
		"Jonathan Sehring",
		"John Sloss",
		"Cathleen Sutherland",
		"Lee Daniel",
		"Shane F. Kelly",
		"Sandra Adair",
		"Beth Sepko",
		"Rodney Becker"
	],
	"votes": 370123,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTYzNDc2MDc0N15BMl5BanBnXkFtZTgwOTcwMDQ5MTE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 2002, 6-year-old Mason Evans (Ellar Coltrane) lives with his divorced mother, Olivia (Patricia Arquette), and 8-year-old sister, Samantha (Lorelei Linklater), in a small town in Texas. Mason is sharp but distracted at school. He is late in turning in homework, stares at the window all day, and destroyed a pencil sharpener while trying to sharpen rocks.\nMason overhears Olivia arguing with her boyfriend Ted (Steven Chester Prince), saying she has no free time due to parenting. Olivia had to cancel on a date as her babysitter bailed at the last minute.In 2003, Olivia and the children move to Houston so she can attend the University of Houston and get a better job. The new house has a pool and Mason and Samantha get their own rooms. Samantha and Mason are typical toddlers who cannot get along and keep fighting. While Olivia attends college grandmother Catherine (Libby Villari) (Olivia's mother) helps to take care of the kids.In 2004, Mason's father, Mason Sr. (Ethan Hawke), visits Houston and takes Mason and Samantha bowling. Mason Sr. works in Alaska and is not sure whether is ready to move back yet. Mason Sr is smoking now and has strong views about the Iraq war which he teaches to the kids.\nWhen he drops the children off at home, he argues with Olivia while Mason and Samantha watch from a window. Catherine was supposed to drop the kids back home, ad Olivia was not happy to see Mason Sr. in her house.\nOlivia takes Mason to one of her classes, introducing him to her professor, Bill Welbrock (Marco Perella); Mason sees them flirt.In 2005, Olivia and Bill have married and blended their two families. Olivia and Bill visit Europe on their honeymoon, while the kids stayed with Catherine. They share experiences such as playing video games, playing dumb charades, playing golf, and attending a midnight release of Harry Potter and the Half-Blood Prince. Bill likes his alcohol.\nMason and Samantha are enrolled in the same school as their step-siblings, Mindy (Jamie Howard) and Randy (Andrew Villarreal). There, Mason befriends Nicole (Jessi Mechler), who has a crush on him.In 2006, Mason and Samantha bond with Mason Sr. as he takes them out for a day in Houston (they visit an aviary, play hide and seek at the park, play catch with baseball gloves, running down a hill, watch a baseball game), culminating in a Houston Astros game and a sleepover at his house. Mason Sr has just passed his 2nd actuarial exam.\nOlivia continues her education and is initially supportive of Bill's strict parenting style, which includes many chores for the children (dusting, dishes, cleaning the back yard, racking the leaves) and an enforced shaving of Mason's long hair. Mason is really upset as Bill did not even ask before cutting his hair. He is also upset with Olivia, who has been really busy with school and has no time for home.In 2007, Bill gradually becomes abusive and violent towards Olivia and the children due to his recent alcoholism. After he assaults Olivia (when she confronts him about his drinking), she moves out with Mason and Samantha to a friend Carol's (Barbara Chisholm) house (when Bill starts drinking in front of whole family at dinner) and files for divorce. Olivia's withdraws money from her accounts, before Bill can freeze them.\nOlivia's stepchildren stay with their father, since Olivia is unable to locate their biological mother, facing an uncertain future. Samantha feels that they have abandoned Randy and Mindy to their abusive father. Mason and Samantha are enrolled in a new school and have to start their social life all over again.In 2008, Mason Sr. learns that Samantha has a boyfriend named Garret and talks to her and Mason about contraception. Mason Sr. warns Samantha against the dangers of teenage pregnancies. Samantha and Mason are campaigning for Obama election in their neighborhood.\nMason Sr. takes his son camping and they connect through music, film, and Mason's blossoming interest in girls. Mason Sr advises him to be interested in what girls have to say. Mason and Samantha have grown into their lives in San Marcos, a town close to Austin.\nMason Sr is dating Tammy (Tamara Jolaine). He works with an insurance company now and feels settled.In 2009, Mason is bullied at school and playfully teased on a camping trip (for not having had sex yet) but starts receiving attention from girls. Olivia takes a job in teaching psychology at college and moves in with Jim (Brad Hawkins), a student and Iraq War veteran.In 2010, Mason has started high school and experimented with marijuana and alcohol. Mason Sr., who has remarried and has a baby, takes Mason and Samantha to visit his wife's parents. For Mason's 15th birthday, Mason Sr. gives him a suit and CDs; Mason's step-grandparents give him a Bible and a shotgun.In 2011, Mason is lectured by his photography teacher, who sees his potential but is disappointed in his lack of ambition. Mason attends a party and meets Sheena (Zoe Graham), who becomes his girlfriend. After Mason arrives home late one night from a party, a drunk Jim confronts him about his late hours. Olivia and Jim subsequently break up, and the family's financial situation worsens.In 2012, Mason and Sheena visit Samantha, who is attending the University of Texas at Austin, where they share their hopes and fears about college. Samantha's roommate discovers them asleep together in her dormitory.In 2013, during the end of Mason's senior year in high school, he has a painful breakup with Sheena, wins the second-place silver medal in a state photography contest, and is awarded college scholarship money. Mason's family throws him a graduation party and toasts his success.Mason Sr. gives him advice about his breakup. Planning to sell the house and downsize, Olivia meets Samantha and Mason for lunch and asks them to sort through their possessions. Later that year, as Mason prepares to leave for college, Olivia breaks down, disillusioned by how quickly life has passed. At Sul Ross State University in Alpine, Mason moves into his dorm and meets his new roommate Dalton (Maximillian McNamara), Dalton's girlfriend Barb (Taylor Weaver), and Barb's roommate, Nicole. Mason takes drugs given to him by Barb and the group goes hiking at Big Bend Ranch State Park. Nicole shares with Mason her belief that, rather than people seizing moments, moments seize people; Mason agrees.",
	"links": [
		"https://www.amazon.com/Boyhood-Patricia-Arquette/dp/B00MBWMIDW"
	]
}