{
	"title": "Skyfall",
	"release_year": "2012",
	"runtime": "143",
	"tags": [
		"Action",
		"Adventure",
		"Thriller",
		"amazon"
	],
	"rating": 7.8,
	"actors": [
		"Daniel Craig",
		"Javier Bardem",
		"Naomie Harris",
		"Judi Dench",
		"Ralph Fiennes",
		"Bérénice Marlohe",
		"Albert Finney",
		"Ben Whishaw",
		"Rory Kinnear",
		"Ola Rapace"
	],
	"staff": [
		"Sam Mendes",
		"Neal Purvis",
		"Robert Wade",
		"John Logan",
		"Ian Fleming",
		"Barbara Broccoli",
		"Michael G. Wilson",
		"Thomas Newman",
		"Roger Deakins",
		"Stuart Baird",
		"Debbie McWilliams",
		"Dennis Gassner"
	],
	"votes": 737497,
	"cover": "https://m.media-amazon.com/images/M/MV5BMzQzODYyNjg0OV5BMl5BanBnXkFtZTcwMjQ0OTY0OA@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In Istanbul, MI6 agents James Bond (Daniel Craig) and Eve Moneypenny (Naomie Harris) pursue mercenary Patrice (Ola Rapace), who has stolen a hard drive containing details of undercover agents placed in terrorist organizations by NATO states. After a pursuit across Istanbul, Patrice wounds Bond in the shoulder and, as the two men fight atop a train, M (Judi Dench) orders Moneypenny to shoot Patrice, despite not having a clear shot; Moneypenny inadvertently hits Bond, who falls into a river. Bond is presumed dead and Patrice escapes with the hard drive.Three months later, due to a public inquiry into M's handling of the stolen hard drive, she is pressured to retire by Gareth Mallory (Ralph Fiennes), the chairman of the Intelligence and Security Committee of Parliament and a former SAS officer. Although she claims she is still useful, MI6's servers are hacked, and M receives a taunting computer message moments before the MI6 building explodes. MI6 relocates to its emergency offices underground. Bond, who used his presumed death to retire, learns of the attack and returns to service in London. He fails a series of physical, medical, and psychological examinations, but M approves his return to the field, ordering him to identify Patrice's employer, recover the hard drive, and kill Patrice. He meets Q (Ben Whishaw), MI6's new quartermaster, who gives him a radio beacon and a Walther PPK pistol.Shrapnel taken from Bond's shoulder wound helps identify Patrice, and intelligence places him in Shanghai.\nIn Shanghai, Bond follows Patrice from the airport. Patrice heads to a building and sets up his rifle for a shot. Bond is unable to prevent him killing a target. The two fight and Patrice falls to his death before Bond can learn his employer's identity. Bond finds a casino token Patrice intended to cash in for the assassination, leading him to a casino in Macau. In the meantime the list has been Decrypted and a message sent to M that 5 names will be posted on the Internet every week. At the casino, Bond is approached by Sévérine (Bérénice Marlohe), Patrice's accomplice (when Bond tries to cash the chip which was worth $4MM). Severine understands that Bond killed Patrice as he wanted to meet Patrice's employer, who is also her employer.Recognising her tattoo, he concludes she was a sex slave \"rescued\" by a criminal who now employs her, a man Bond wishes to meet. She warns him he is targeted by her bodyguards, but promises to help if Bond kills her employer. She wants to be free of Silva and hence agrees to help Bond. Bond thwarts the attack and joins Sévérine on her yacht, the Chimera. British agents start turning up dead and Mallory ups the pressure on M, and orders a public inquiry into the leaks.\nThey travel to an abandoned island off the coast of Macau, where the crew captures and delivers them to Sévérine's employer, Raoul Silva (Javier Bardem). Once an MI6 agent, Silva turned to Cyber-terrorism and orchestrated the attack on MI6. Silva reveals his hatred for M and talks about how M always lied to him and betrayed him, which got Silva captured. Silva also tells Bond that he has also been lied to by M (He failed his evaluation, but M told him that he had passed). Silva had tried to end his life by taking the cyanide pill when he was captured by the Chinese, but it simply dissolved the insides of Silva's lower jaw, but kept him alive. Silva tries to recruit Bond for his organization, but Bond just pretends to play along. Silva kills Sévérine, but Bond alerts MI6 reinforcements who capture Silva for rendition to Britain.M tells Bond that Silva was a agent in the Hong Kong office & a brilliant hacker. But he had started acting beyond his brief in hacking the Chinese. The HK transition was coming up, so M gave up Silva in exchange for 6 agents & a peaceful transition. At MI6's new underground headquarters, Q attempts to Decrypt Silva's laptop, but inadvertently gives it access to the MI6 servers, allowing Silva to escape. Q concludes Silva wanted to be captured as part of a plan to kill M, whom he resents for disavowing and betraying him to the Chinese government in 1997, leaving him to be tortured and disfigured. Bond gives Silva chase through the London Underground (where Silva destroys an underground tunnel and a whole tube train falls through it on Bond, but he escapes) and thwarts Silva's attack at a Parliament inquiry where M is present.Instructing Q and Bill Tanner (Rory Kinnear) to leave an electronic trail for Silva to follow, Bond uses his Aston Martin DB5 to take M to Skyfall, his childhood home in the Scottish Highlands. They meet Skyfall's gamekeeper Kincade (Albert Finney), and together the trio set up a series of booby traps throughout the house. When Silva's men arrive, Bond, M, and Kincade kill most of them, but M is wounded. Silva arrives by helicopter with more men and heavy weapons, so Bond sends M and Kincade through a priest hole to hide in a nearby chapel, and rigs propane tanks to explode. As the house and the helicopter are destroyed, Bond escapes down the same tunnel.Silva survives the destruction of the house, following Kincade and M to the chapel. Confronting M, Silva forces his gun into her hand and presses his temple to hers, begging her to kill them both. Bond arrives and kills Silva by throwing a knife into his back. M then succumbs to her wounds and dies in Bond's arms.\nFollowing M's funeral, Moneypenny formally introduces herself to Bond and tells him she is retiring from fieldwork to become secretary for Mallory, the newly appointed M. Bond meets with Mallory, and tells him he is ready to get back to work.",
	"links": [
		"https://www.amazon.com/Skyfall-Daniel-Craig/dp/B00B5HQL50"
	]
}