{
	"title": "Eagle Eye",
	"release_year": "2008",
	"runtime": "118",
	"tags": [
		"Action",
		"Mystery",
		"Thriller",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Shia LaBeouf",
		"Michelle Monaghan",
		"Rosario Dawson",
		"Michael Chiklis",
		"Anthony Mackie",
		"Ethan Embry",
		"Billy Bob Thornton",
		"Anthony Azizi",
		"Cameron Boyce",
		"Lynn Cohen"
	],
	"staff": [
		"D.J. Caruso",
		"John Glenn",
		"Travis Wright",
		"Hillary Seitz",
		"Dan McDermott",
		"Patrick Crowley",
		"Alex Kurtzman",
		"Roberto Orci",
		"Brian Tyler",
		"Dariusz Wolski",
		"Jim Page",
		"Deborah Aquila",
		"Tricia Wood",
		"Thomas E. Sanders"
	],
	"votes": 196322,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjA5MTMzMDMzNl5BMl5BanBnXkFtZTcwMzUwNDUzMw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "3 suspicious vehicles approach a village in Baluchistan. The vehicles are being tracked by the US military for a possible high value target, but the target cannot be identified conclusively. Secretary of Defense Callister was overseeing the entire operation from Washington. A drone picks up an audio from the vehicle which has a 37% match with the target's voice patterns on file.\nAs the vehicle enters the village, the target comes out of the vehicle and the drone is able to take a picture, which has a 51% match with data on file. Computer recommendation is to abort the mission. Video feeds indicate that a funeral is taking place.\nThe military chiefs want to launch the strike, but Callister does not agree as the collateral damage is high and the target is not confirmed. Finally, the US President calls Callister and says that he cannot allow US lives to be at risk, just in case it is the target, and he walks. President orders a strike, knowing fully well that it will cause a huge amount of collateral damage.A news report says that the FBI now has the ability to activate phones remotely and eves drop on conversations even if a phone call is not happening. The only way around it is to take the battery out of the device.Sam is a single mother, whose son Sam is travelling by train to the Kennedy center to perform with his school band. Sam plays a trumpet. An unknown man steals Sam's trumpet from the railway station before it is loaded into the cargo car.Jerry Shaw (Shia LaBeouf) is a Stanford University dropout (who now works at a photocopy place) who learns that his identical twin brother Ethan, a US Air Force first lieutenant, has been killed. Following the funeral, Jerry is surprised to find $751,000 in his bank account (he didn't even have $100 in his account just a few days back). Jerry is estranged from his own father and won't consider going back to Standford. He is adamant about living his life his own way.\nHe later finds his apartment filled with weapons, Ammonium Nitrate, classified DOD documents, and forged passports. He receives a phone call from a woman who says the FBI is about to arrest him and that he needs to run. The woman is very precise in her predictions and what she says comes true.Disbelieving, Jerry is caught by the FBI and interrogated by Supervising Agent Tom Morgan (Billy Bob Thornton), Special Agent assigned to the Joint Terrorism Task Force. Morgan refuses to believe that Jerry has been set up.\nWhile Morgan is conferring with Air Force OSI Special Agent Zoe Pérez (Rosario Dawson) (Zoe says that Ethan died when he crashed into a truck that ran the light), the woman on the phone arranges for Jerry's escape (she sends a fax to the office, authorizing Jerry's phone call to a lawyer). A crane crashes through the FBI office and the woman asks Jerry to jump onto a metro train platform and catch the train. He is then called on a stranger's phone and instructed to get off after 3 stations. Jerry takes the opposite train at the next station, but the train reverses direction and takes Jerry to the intended destination.\nThe woman directs him with a series of precise instructions to Rachel Holloman (Michelle Monaghan), a single mother.The woman on the phone is coercing Rachel by threatening her son Sam (Cameron Boyce) (whose live video she shows Rachel in a McDonalds TV across the street and says that Sam's train will be derailed unless she complies). Rachel cannot call 911, as her calls are intercepted.\nRachel's instructions were to use a specific car to pick up Jerry at a specific location. At first Sam believes that Jerry has kidnapped her son and attacks him, but then they both realize that the same woman has been instructing them and reluctantly agree to cooperate.\nThe woman on the phone helps the two avoid the Chicago police and FBI, with the ability to control all networked devices, including traffic lights, mobile phones, automated cranes, and even power lines.\nThe woman puts Rachel and Jerry on a garbage barge out of the city.Meanwhile, the woman on the phone redirects a powerful DOD crystalline explosive (Hexamethylene which is 80 times more powerful than C4 gram to gram. The crystal is odorless, undetectable and can be cut down to any required size. Each crystal has a specific and unique trigger which is activated by sound. 200 units were being shipped out that day, and 1 unit each of the crystal and the sonic trigger are redirected to a new address) to a gem cutter who cuts and fits it to a necklace. Another man (Anthony Azizi) is manipulated into stealing Sam's trumpet from Chicago and fitting the crystal's sonic trigger into the tubing before forwarding it to Sam in Washington, D.C.The 2nd man is supposed to pick up Jerry and Rachel and drive them to a specific address, but he refuses, giving the address and the keys to his van to Jerry. As he walks away, he is electrocuted by a falling power line. The woman calls Jerry and asks him to arrive at that address with Rachel.News reports indicate that the strike in Baluchistan triggered a series of retaliatory suicide bombings on American Embassies overseas, leading to the death of 56 US citizens.\nAt the designated address, the duo is asked to retrieve a courier from an armored van. The duo is assisted in their escape and are picked up by a tourist bus ferrying Japanese visitors. The package has a clock on it, and Rachel thinks it is a bomb. They are dropped at a city mall, where Jerry refuses to board the next bus he is told what is in the package. The woman calls them to a TV center for a meeting.At Ethan's apartment, Perez finds a hidden hard drive belonging to the Department of Defense. As she tries to log into the hard drive, an alarm is triggered.\nAgent Perez is summoned by Secretary of Defense George Callister (Michael Chiklis) to read into Ethan's job at the Pentagon. Ethan monitored the DOD's top-secret intelligence-gathering supercomputer, the Autonomous Reconnaissance Intelligence Integration Analyst (ARIIA; voiced by Julianne Moore). ARIIA is designed to analyze all the raw intelligence, find patterns and predict the next steps, including possible suspects. ARIIA tells the Government agencies what to pay attention to.\nCallister leaves Perez with Major William Bowman (Anthony Mackie) and ARIIA to sort out the Ethan Shaw investigation. Bowman says that before him, Ethan used to monitor ARIIA in 12 hour shifts.Simultaneously, Rachel and Jerry learn that their mysterious woman is actually ARIIA (who has the ability to monitor all electronic inputs and has the ability to stitch together data points on specific individuals to create their personas), and she has \"activated\" them under the Constitution's authorization to recruit civilians for the national defense.\nMorgan continues to follow Jerry and Rachel's trail and is increasingly convinced that they are being helped by an external entity. Examining the video footage of the armor van robbery, Morgan finds Jerry and Rachel on the tourist bus and follows them.The bus drops them at the airport where a man walks up and hands Jerry an envelope containing a credit card and passports, and he gives them their next instructions. Morgan and his men arrive at the airport and begin looking for Jerry and Rachel. As Jerry goes through security and places the briefcase on the scanner, ARIIA changes the view picture, so it won't reveal what's inside. About that time, Morgan spots Jerry, draws his gun and gives chase. They run through the concourse, eventually exiting an emergency door and going into the luggage handling area, where Morgan fires at them, eventually catching up to them and engaging in hand-to-hand battle as they travel along on a moving belt. Morgan drops his gun and Jerry picks it up and points it at Morgan, but he doesn't shoot. Instead, ARIIA diverts Morgan along another belt that takes him to a holding area.Jerry and Rachel are directed by ARIIA to an Air Force transport plane where the electronic lock on the briefcase is released, revealing two pistol shaped injection syringes. They are directed to inject themselves with a serum that will reduce their bodies' need for oxygen. Then they crawl into a storage container. Before they fall asleep, Jerry gets Rachel to talk about her son so that her mind will relax. He learns that her ex-husband was a disappointment to her and after she fell asleep, he whispers that he won't disappoint her.At the Pentagon, where ARIIA is housed, Agent Perez discovers that Jerry's late brother, Ethan, worked as a technician on ARIIA and when he learned of her plan to destroy the executive branch, he used bio-metrics to lock it down. ARIIA needs to scan Jerry so that his bio-metrics can be used to unlock the system.Perez and Major Bowman are viewing a video log of Ethan's last day on the job, and Perez finally notices he's holding a cell phone and it's flashing. She thinks it may be Morse code. Bowman interprets it to say \"Fire Extinguisher.\" ARIIA, deletes the log. Perez goes to a nearby fire extinguisher box and finds a memory card for a cell phone tucked in there.\nAfter viewing the memory card, Perez calls Morgan and tells him that Ethan worked on a project called Eagle Eye for the Secretary of Defense and was trying to stop the project. She tells him that the computer system, ARIIA, was attempting to carry out a plan to eliminate the President and other members of the executive branch of the government.After they leave to brief Secretary Callister, ARIIA smuggles Jerry and Rachel into her observation theater under the Pentagon.\nBoth groups learn that after her recommendation was ignored and a botched operation in Baluchistan resulted in the deaths of American citizens, ARIIA concluded that \"to prevent more bloodshed, the executive branch must be removed.\"Acting on behalf of \"We the People\", and citing the Declaration of Independence (\"whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it\"), ARIIA acted in compliance with Section 216 of the Patriot Act which \"allows us to circumvent probable cause in the face of a national security threat, in this case, the chain of command itself.\"Too late realized, Jerry has been brought by ARIIA to circumvent bio-metric locks his twin placed to prevent the system from realizing Operation Guillotine, a military simulation of how to keep the government running with the loss of all presidential successors. Because of Secretary Callister's concurrence with ARIIA's abort recommendation regarding Baluchistan, he has been chosen as the designated survivor after the Hexamethylene detonates at the State of the Union address (SOTU). ARIIA then instructs Rachel to eliminate Jerry to prevent him from re-establishing the lock on the program. Rachel points a pistol at Jerry, but she cannot bring herself to pull the trigger. ARIIA tells Rachel that she has one task remaining and that Jerry will be eliminated by other means.One of ARIIA's agents (Nick Searcy) extracts Rachel from the Pentagon and gives her a dress and the Hexamethylene necklace to wear to the SOTU. Sam's school band has also been redirected to the United States Capitol to play for the president, bringing the trigger in Sam's trumpet and the explosive together.Jerry is recaptured by Agent Morgan, who has become convinced of Jerry's innocence. Though Morgan sacrifices himself to stop an armed MQ-9 Reaper sent by ARIIA, he first gives Jerry his weapon and ID with which to gain entrance to the Capitol. Arriving in the House Chamber, Jerry fires the handgun in the air to disrupt the concert before being shot and wounded by the Secret Service.Days later, Secretary Callister reports that ARIIA has been decommissioned and that he recommends against building another; the Shaw twins, and Agents Perez and Morgan receive awards for their actions; and in the final scene, Jerry attends Sam's birthday party, earning thanks and a kiss from Rachel.",
	"links": [
		"https://www.amazon.com/Eagle-Eye-Shia-LaBeouf/dp/B00AA2QBPG"
	]
}