{
	"title": "Megamind",
	"release_year": "2010",
	"runtime": "95",
	"tags": [
		"Action",
		"Adventure",
		"Animation",
		"max",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"Will Ferrell",
		"Jonah Hill",
		"Brad Pitt",
		"Tina Fey",
		"David Cross",
		"Ben Stiller",
		"Justin Theroux",
		"Jessica Schulte",
		"Tom McGrath",
		"Tom McGrath",
		"Emily Nordwind"
	],
	"staff": [
		"Tom McGrath",
		"Alan Schoolcraft",
		"Brent Simons",
		"Lara Breay",
		"Denise Nolan Cascino",
		"Lorne Balfe",
		"Hans Zimmer",
		"Michael Andrews",
		"Leslee Feldman",
		"David James"
	],
	"votes": 301081,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTAzMzI0NTMzNDBeQTJeQWpwZ15BbWU3MDM3NTAyOTM@._V1_QL75_UX190_CR0,8,190,281_.jpg",
	"description": "Megamind (Will Ferrell) is a super-intelligent alien, a (self-proclaimed) incredibly handsome criminal genius and master of all villainy. As a super-villain of the fictional Metro City, he constantly battles and is defeated by his nemesis, the superhero protector of the city known as Metro Man (Brad Pitt). The rivalry between Megamind and Metro Man has extended from their arrival on Earth as infants; sent by their parents from their dying home worlds, Metro Man's arrival accidentally resulted in Megamind growing up as an orphaned misfit genius while the former as a handsome superhero with a perfect upbringing.On the day that Metro City dedicates a museum to their protector, Megamind and his only friend and sidekick Minion (David Cross) kidnap reporter Roxanne Ritchi (Tina Fey) and lure Metro Man into a copper-lined room. To everyone's surprise, Metro Man is unable to escape, claiming copper to be his only weakness, and appears to be killed when Megamind's death ray strikes him. Megamind revels in his victory against Metro Man, but shortly after becomes depressed, his villainy having no meaning without anyone to stop him.Shortly before destroying the Metro Man Museum, Megamind disguises himself as its curator Bernard (Ben Stiller) to avoid being found by Roxanne. While in this disguise, Megamind is inspired by a comment from Roxanne to create a superhero by injecting a worthy target with a serum fashioned from Metro Man's DNA, granting them Metro Man's super-abilities. As Megamind is selecting his target, Roxanne sneaks into his lair; in the resulting chaos, Megamind accidentally fires the serum into Hal, Roxanne's cameraman (Jonah Hill). Taking advantage of the gullible Hal, Megamind appears to the transformed human as his \"space dad\", grooming Hal into a new superhero, \"Titan\" and preparing him to fight Megamind.Meanwhile, Megamind has become attracted to Roxanne, and continues to date her using his Bernard disguise. This brings trouble from Hal/Titan, who is infatuated with Roxanne and jealous of Bernard, as well as Minion, who sees Megamind losing interest in villainy and angrily leaves him. On a dinner date, Megamind and Roxanne share a kiss, during which Megamind's disguise falters, leading Roxanne to angrily dump him and Megamind to misplace his \"invisible car\" and, inside it, the superhero serum device used to create Titan. Megamind, heartbroken, returns to his lair and vows to resume villainy and fight Titan the next day as planned.Megamind becomes impatient waiting for Titan and seeks him out, only to find that Titan (misspelling his own superhero name as \"Tighten\") has been casually misusing his powers for crime. Outraged, Megamind taunts Titan/Tighten into fighting him by revealing his \"space dad\" and \"Bernard\" disguises; this backfires when Megamind realizes that Tighten, who is growing more and more mentally unstable, intends not to capture Megamind but to kill him. Unable to neutralize Tighten's powers (as the superhero serum device is still missing), Megamind resorts to a fail-safe by capturing Tighten in the same copper-lined trap that thwarted Metro Man; to his horror, Tighten is revealed to have no weakness to copper and it fails to contain him. Fleeing to safety, Megamind can only watch as Tighten takes over the city and goes on a destructive rampage as the new villain.Megamind returns to Roxanne, apologizing and convincing her to lead him to Metro Man's secret headquarters where they might find another way to stop Tighten. They are surprised to find Metro Man himself there, alive and well and secluded in his headquarters. Metro Man reveals he had become tired of being a superhero, feeling forced into the responsibility, and after faking his own death (under a ruse that copper was his \"weakness\"), went into hiding to pursue his real dream as a musician. With Metro Man refusing to be involved, Roxanne tries to convince Megamind to fight Tighten as the city's hero instead, but Megamind feels he is destined to always be the failing villain and turns himself in at the local prison.Later, Tighten captures Roxanne, threatening to kill her if Megamind does not come to fight him. Minion returns to Megamind's side and breaks his old master out of prison. Following a plan crafted by Megamind, Minion disguises himself as Megamind himself to lure Tighten safely away from Roxanne, while Megamind disguises himself as Metro Man to scare Tighten away from Metro City.\nThe plan works until Tighten sees through Megamind's trick by his mispronunciation of \"Metro City\" as \"Metrocity\" Again, Megamind is forced to run from Tighten's wrath, until Roxanne discovers where Megamind left his invisible car and the superhero serum device. Megamind successfully retrieves the device and uses it on Tighten, reverting him back to Hal. As Hal is taken away to jail, the city cheers for its new hero, a role that Megamind realizes he is capable of choosing himself.In the aftermath, the former Metro Man Museum is rededicated to Megamind, who is slowly coming around to being the hero. He and Roxanne have developed a relationship, and hidden in the crowds, a disguised Metro Man gives Megamind his congratulations.",
	"links": [
		"https://www.max.com/movies/megamind/61c6865b-575c-4ff9-a879-e0c31ab36930",
		"https://www.amazon.com/Megamind-Brad-Pitt/dp/B0C9TTMSFB"
	]
}