{
	"title": "Blended",
	"release_year": "2014",
	"runtime": "117",
	"tags": [
		"Comedy",
		"Romance",
		"amazon",
		"netflix"
	],
	"rating": 6.5,
	"actors": [
		"Adam Sandler",
		"Drew Barrymore",
		"Wendi McLendon-Covey",
		"Kevin Nealon",
		"Terry Crews",
		"Bella Thorne",
		"Joel McHale",
		"Abdoulaye NGom",
		"Jessica Lowe",
		"Braxton Beckham"
	],
	"staff": [
		"Frank Coraci",
		"Ivan Menchell",
		"Clare Sera",
		"Jack Giarraputo",
		"Mike Karz",
		"Adam Sandler",
		"Rupert Gregson-Williams",
		"Julio Macat",
		"Tom Costain",
		"Angela Demo",
		"Barbara J. McCarthy",
		"Perry Andelin Blake"
	],
	"votes": 147241,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzc2ODI5NjAyMl5BMl5BanBnXkFtZTgwMzIyOTE4MDE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Lauren Reynolds (Drew Barrymore), who has two sons, Brendan (Braxton Beckham) and Tyler (Kyle Red Silverstein), meets Jim Friedman (Adam Sandler), a widower with three daughters, Hilary (Bella Thorne), Espen (Emma Fuhrmann), and Lou (Alyvia Alyn Lind) on a blind date at Hooters.Jim's wife died of cancer and his three daughters, Hilary \"Larry\", Espen \"ESPN\" and Louise \"Lou\", try to cope with her loss.\nLauren's husband Mark (Joel McHale) cheated on her but she never told her kids, Brendan and Tyler, why they are divorced, so they are hostile to her dating again. Lauren organizes closets for a living.\nWhen Lauren was out on date, she had left the boys with babysitter Tracy (Lauren Lapkus). The boys literally tear the house apart to get Lauren to return from her date early.The date ends in disaster due to conflict between Jim's clumsy and careless attitude and Lauren's perfectionist nature. Jim drinks Lauren's beer while she is in the bathroom, he is more interested in watching TV or ogling at pretty waitresses. Jim and Lauren both got married in college. The Buffalo wings that Jim ordered were too hot for her. Jim pretends to get an emergency phone call and then walks out, leaving $20 for his half of the bill.Lauren is friends with Jen. Jen works with Lauren in organizing closets and makes her wear a black dress to get Lauren to feel confident that she is still hot and desirable. The kind of woman that men cheat with.Hillary dresses like a tomboy and is often mistaken for a boy. Espen claims that she can speak to her dead mother.\nMeanwhile Lauren struggles with Brendan and Tyler, as they have no positive male role model. Mark only likes to do fun things with the boys and drops them with Lauren when they have to do any serious stuff like homework or baseball games. Lauren has to deal with Tyler's meltdown when he strikes out at baseball. She also finds that Brendan is having sexual fantasies about Tracy.Later, Jim and Lauren run into each other at a pharmacy. Jim looking to buy tampons (for Hillary who has started menstruating) and Lauren looking to buy a porn magazine for Brendan. While trading insults, they both help each other out by picking the right product. The cashier mistakenly switches their credit cards.\nAfterwards, Jim realizes that their credit cards were mixed up and goes to Lauren's house.There, he and Lauren learn that Lauren's friend Jen (Wendi McLendon-Covey) has broken up with her boyfriend Dick (Dan Patrick) (of Dick's Sporting Goods), who happens to be Jim's boss, over his having 5 kids and wanting Jen to be \"part of the team\". Jen adds that they will no longer be going on a planned African vacation together.Unbeknownst to each other, Jim and Lauren both arrange to go on the Pre-booked vacation (Jim using Dick's booking and Lauren using Jen's part of the booking) with their families. When they arrive in Africa the two families are surprised to see each other. Things get more awkward when Jim and Lauren are given a romantic suite.Nickens (Terry Crews) is a hotel employee and entertainer. Mfana (Abdoulaye N'Gom) is their tour guide. The families are put together for a \"blended family moon\", where they get together with other couples, including the oversexed Eddy (Kevin Nealon) and Ginger (Jessica Lowe), as well as Eddy's teenage son Jake (Zak Henri), who Hilary develops a crush on at first sight.\nHillary tries to act girly in front of Jake, but Jim doesn't catch on as he keeps addressing her as \"Larry\".The kids make an awkward impression on each other, with Brendan calling his mother \"hot,\" and the others not knowing how to react to Espen, the middle girl, acting like her mother is there with her on the vacation. Over time the kids begin to bond with each other and their respective parents.Jim bonds with the boys by helping them with sports (Like ostrich rides), while Lauren bonds with the girls, helping Hilary change her tomboy look into a more feminine one (and encouraging her to speak to Jake), leading to Jake becoming her boyfriend. As they become closer to all the children, Jim and Lauren begin to warm up to each other. Lauren learns from Hillary that her mom used to work at Hooters, which is why he took Lauren to Hooters for his first date.\nThey inadvertently get together for a couples' massage and have fun with each other.When Lou asks Lauren to put her to bed, Lauren sings her \"Over the Rainbow,\" which, unknown to her, was a song their mother used to sing to them. The other girls pretend to sleep, while discovering how much they love Lauren. She returns this feeling when she kisses each girl's forehead as she says goodnight.On the last night of the trip, Lauren puts on a beautiful black dress that she admired earlier. She wears it that evening and receives admiration from everyone. While the children are pulled away for a kids-only buffet, Jim and Lauren are sat down for a romantic dinner, which Lauren soon discovers was actually planned by Jim specifically for her. They chat briefly about basic parenting techniques and then pull in for a kiss; however, at the last second, Jim pulls away, apologizing and explaining that he \"can't do it\".After returning home, Jim realizes he misses Lauren and that he's fallen in love with her. Although Espen is not fully ready to move on from her mother's passing, she also doesn't want her dad to lose Lauren. At the kids' behest, Jim goes to Lauren's house to give her flowers, only to find Mark there, pretending to be back with Lauren. Tyler gets excited to see Jim and wants to play ball, but Jim sadly leaves and Mark bails on his son again. Mark later tries to make a move on Lauren, but she refuses since he has continuously failed to be a good father, as well as having an affair with his receptionist during their marriage.That following Saturday, Lauren and Brendan go to support Tyler at his game, along with Jen, Dick, who Jen has worked things out with, and his kids. Mark, once again, is a no-show. Jim and his daughters arrive to show encouragement, inspiring Tyler to hit the ball. Jim then finds Lauren and they admit to wanting to be together, and they finally kiss, to the happiness of their kids.",
	"links": [
		"https://www.amazon.com/Blended-Drew-Barrymore/dp/B00KL5HW9Q",
		"https://www.netflix.com/title/70298250"
	]
}