{
	"title": "Wall Street: Money Never Sleeps",
	"release_year": "2010",
	"runtime": "133",
	"tags": [
		"Drama",
		"max",
		"amazon"
	],
	"rating": 6.2,
	"actors": [
		"Shia LaBeouf",
		"Michael Douglas",
		"Carey Mulligan",
		"Josh Brolin",
		"Richard Stratton",
		"Harry Kerrigan",
		"Sunil Hirani",
		"Maria Bartiromo",
		"Austin Pendleton",
		"Thomas Belesis"
	],
	"staff": [
		"Oliver Stone",
		"Allan Loeb",
		"Stephen Schiff",
		"Stanley Weiser",
		"Oliver Stone",
		"Eric Kopeloff",
		"Edward R. Pressman",
		"Craig Armstrong",
		"Rodrigo Prieto",
		"David Brenner",
		"Julie Monroe",
		"Kathleen Chopin",
		"Sarah Finn",
		"Kristi Zea"
	],
	"links": [
		"https://www.max.com/movies/wall-street-money-never-sleeps/fb6d9cb0-a917-4054-807e-5caa93297455",
		"https://www.amazon.com/Wall-Street-Money-Never-Sleeps/dp/B004EESGTA"
	],
	"votes": 107247,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTU5MDEzMzYwMF5BMl5BanBnXkFtZTcwNTcwMjUxMw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 2001, Gordon Gekko (Michael Douglas) is released from prison on parole after serving 8 years for insider trading and mail fraud.\n7 years later in 2008 during the time of the great USA financial collapse, Jacob \"Jake\" Moore (Shia Lebouf) is with girlfriend, Winnie Gekko (Carey Mulligan). Gekko has become an author and a lecturer promoting his new book, 'Is Greed Good?'. Winnie is Gekko's estranged daughter and wants nothing to do with him. Winnie writes an online political magazine.Jake works at Keller Zabel Investments, a banking institution. He tries to raise more money for a fusion research project which will be a viable source of alternative energy down the line, but the rest of the board doesn't agree with him. Jake is one of the firm's top brokers and the protege of its managing director, Lewis Zabel (Frank Langella). Zabel has become disillusioned with the industry and doesn't understand how he can be told a loss is a profit. He gives Jake a $1.5 million bonus & encourages Jake to marry Winnie and have a kid.The next day the company's stock starts crashing. Zabel doesn't come in to work so Jake goes and finds him walking his wife's dog in the park. Jake asks him if Keller Zabel is going to go under, but Zabel just tells him that he's asking the wrong question as everybody is going under.\nZabel meets with the chairmen of the US Treasury at the Federal Reserve. He tries to arrange a bailout, but he is blocked by Bretton James (Josh Brolin), a former businessman that Zabel had crossed eight years prior when his company was going under. James insults Zabel by offering to buy Keller Zabel stock at $3 a share (against its $75 trading value from a week prior). Zabel commits suicide the next day. Jake is distraught.A few weeks later, Jake attends a lecture given by Gordon Gekko about the current financial crisis. Gekko says unrestrained speculation will cause a financial cataclysm, even though everybody is euphoric about the current financial bubble. Jake approaches Gekko and tells him that he's about to marry Winnie. Gekko explains that his daughter won't speak to him because of her brother Rudy's suicide a few years prior over Gekko's imprisonment. Jake thinks Gekko still loves his daughter. He tells Jake that Keller Zabel was in trouble the minute someone started rumors about them and that Jake should look for whoever profited from Keller Zabel's collapse. Jake would enable Gekko to communicate with his estranged daughter, and, in return, Gekko would help Jake collect secret information to destroy Bretton, who ruined Jake's mentor.Jake does some digging and realizes that Bretton James profited from the Keller Zabel collapse. In order to get his attention, Jake spreads false rumors about the nationalization of an African oil rig that Bretton's company owns. The company loses $120 million, and Bretton asks for a meeting with Jake. At the meeting, he tells Jake that he is impressed and offers Jake a job. Determined to take Bretton out and avenge Zabel, Jake accepts.\nWinnie and Jake go out to Long Island to meet with Jake's mother. She asks for $200,000 to float her properties. Jake gives it to her, but Winnie tells Jake in private that she's only going to waste her chance again. Jake takes Winnie to dinner with Gekko & Winnie leaves in the middle, warning Jake that Gekko would destroy them.Gekko tells Jake that his research pointed out that the Locust Fund, a private offshore hedge fund was betting against Keller Zabel. Gekko tells Jake that he suspects it was James' testimony which got him sent away for eight years. Jake is confused, having assumed that it was Bud Fox who put Gekko away back in the late 1980s after Fox's insider trading trial. That was nothing compared to some of Gekko's other activities that he was convicted of. He and Bretton had a falling out and he suspects that Bretton was behind his imprisonment.At work, Jake is put on the sideline so that Bretton's point woman can take over a pitch to the Chinese. They are unimpressed with her pitch. Jake swoops in and presents them with the fusion research. Bretton is impressed by Jake's initiative. However, the firm is in trouble, but Bretton doesn't want anyone to know. The economy is slowly starting to crumble. Bretton hosts a fundraiser and invites Jake and Winnie.\nWandering around the party, Gekko ends up bumping into Bud Fox (Charlie Sheen). Apparently, Fox did his time in prison and went on to build Bluestar Airline into one of the premier airlines in the country after his father's retirement and death. Fox sold the company and retired a multimillionaire.Bretton tells Jake that the Chinese are going to invest $150 million in the fusion research Jake has been supporting. Over the dinner party Winne & Gekko hug & share a moment.\nOver the next few months, the USA economy collapses. Winnie tells Jake that she is pregnant. Jake is floored but excitedly happy and kisses her.Numerous companies around the country are failing. Bretton calls Jake into his office and Jake takes a helicopter to meet Bretton at his estate. Bretton tells Jake that the money the Chinese invested is going into fossil fuels instead of fusion research. Jake gets angry knowing that Bretton is trying to sink the fusion research. Bretton would be unable to control the source once the technology becomes known, unlike with the oil industry. Jake quits and tells Bretton to get lost.Jake tells Gekko about what happened and Gekko reveals that there is a solution: Winnie has an account in Switzerland with $100 million which Gekko set up in the 1980s when she was born. He told her that once he was out of jail, he would need that money to reassert himself, but Winnie reneged when Rudy died. While she has always considered giving it to charity, she hasn't.\nJake could use that money to fund the research and save the company. But since Winnie never declared it, she could go to jail for tax evasion. Gekko tells Jake that he can embezzle it with his old contacts. Jake believes him and goes to talk to Winnie.\nJake asks why she never mentioned the money. Winnie is shocked that he knows but Jake gets enthusiastic about the fusion research. She agrees and the two fly to Switzerland. She signs the money over to Jake. Jake then entrusts the money to Gekko so that he can legitimize the funds for the investment in the fusion research company.A few hours after returning to New York, Jake gets a call saying that the money never arrived. He gets frantic but his mother interrupts him before he goes to deal with Gekko. She asks for $100,000 but Jake gives her $30,000 and tells her that he cannot afford to waste any more money on her ridiculous real estate deals. He goes to Gekko's apartment and finds it empty.Jake tells Winnie what happened and that he's been talking to Gekko for a while. She breaks off their engagement and tells Jake to leave. Jake tracks Gekko to England, where Gekko is running a financial company again with the $100 million he stole from Winnie and Jake. Jake propositions him for one last trade: Winnie gets her $100 million back and Gekko gets a grandson. Jake shows him the ultrasound of his son but Gekko, despite being moved, cannot let go of being someone of importance.Over the next few weeks, by using the previous information collected by Gekko about Bretton, Jake begins piecing together everything from Keller Zabel's collapse to the economic bailouts being issued for Bretton's company. Jake points out that Bretton owns the Locust Fund and puts the pieces together in one large information packet. He gives it to Winnie, telling her that it will put her website on the map for good as a legitimate source of information and that he misses her like crazy.Winnie runs the story and Bretton James is exposed. The board of directors kicks him out of the company and Bretton is forced to testify to his crimes in front of the Congressional Committee. Bretton's career is over. Bretton's board of directors goes to Gekko in order to start doing business with him in view of the new credibility Gekko gained through his London firm's astounding success. Gekko sold the market short and turned the 100 million that he stole from his daughter into the incredible sum of $1 billion dollars.Jake sees the very pregnant Winnie walking to her apartment and helps her carry her things. Jake feels his sons kicks and Winnie thanks him for the help, but they do not reconcile. Gordon appears and tells them that he deposited the $100 million into the fusion researchers account anonymously.\nNow that Gekko attained his aim of becoming a billionaire by using the money he stole from his daughter, he finally returns that relatively small sum. He tells them that they make a good couple and that he would like to be there for them as their father and a grandfather. He walks away saying, \"What? Can't you believe in a comeback?\"\nJake kisses Winnie and they reconcile before the birth and, one year later, they celebrate their son's first birthday with a party, at which Gordon Gekko is also present."
}