{
	"title": "Don't Worry Darling",
	"release_year": "2022",
	"runtime": "123",
	"tags": [
		"Drama",
		"Mystery",
		"Thriller",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Florence Pugh",
		"Harry Styles",
		"Chris Pine",
		"Olivia Wilde",
		"KiKi Layne",
		"Gemma Chan",
		"Nick Kroll",
		"Sydney Chandler",
		"Kate Berlant",
		"Asif Ali"
	],
	"staff": [
		"Olivia Wilde",
		"Katie Silberman",
		"Carey Van Dyke",
		"Shane Van Dyke",
		"Roy Lee",
		"Katie Silberman",
		"Olivia Wilde",
		"Miri Yoon",
		"John Powell",
		"Matthew Libatique",
		"Affonso Gonçalves",
		"Allison Jones",
		"Katie Byron"
	],
	"votes": 153493,
	"cover": "https://m.media-amazon.com/images/M/MV5BY2I0ZDExM2EtZTQ4OC00NGQ0LWIzYjktYWE4MDMxZDZlY2MwXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Alice (Florence Pugh) and Jack Chambers (Harry Styles) are married, living in Victory, California, an idealistic 1950s desert company town. Every day, the men leave for work at Victory Headquarters in the surrounding desert, which their wives are prohibited from entering and discouraged from asking about. The women live as housewives and enjoy luxuries and leisure while the men are out. It is day 987 of the Victory project. Victory project is supposedly about the development of progressive materials, but the wives have no idea what their husband actually do for a living.\nJack's friends include Peter (Asif Ali), Bill (Douglas Smith), Dean (Nick Kroll) and Ted (Ariel Stachel)Alice spends her days with other wives, including her best friend, Bunny (Olivia Wilde), Violet (Sydney Chandler) (Bill's wife) and Peg (Kate Berlant).\nThe ladies attend a ballet class run by Frank's wife Shelley, who is the leader of the ladies' group and handles the assimilation of new members into their society. The ladies cook and clean the house all day long and the men return in the evening, and they end up having amazing sex with their wives.\nAnother resident, Margaret (KiKi Layne) (Ted's wife), has become estranged from the community ever since she had a mental breakdown after her unauthorized desert visit resulted in her son's apparent death. Margaret claims Victory took him as punishment for breaking the rules.\nAt a party hosted by Victory's founder, Frank (Chris Pine), Alice sees Margaret's husband Ted attempt to medicate her after an outburst.\nAlice and Jack then have sex in Frank's bedroom, but she notices Frank observing them in silence.While riding the cross-town trolley bus, Alice sees a plane crash in the desert and rushes to help. She stumbles onto Headquarters and touches one of its mirror-like windows, experiencing surreal hallucinations about another life before waking up at home that night. Jack refuses to acknowledge that Alice saw a plane crash and that she was out in the desert that day.Alice continues to have increasingly strange experiences, then receives a phone call from Margaret, who claims to have seen the same things. After brushing her off, she sees Margaret slit her own throat and fall from her roof. Before she can reach Margaret's body, Alice is dragged away by men in red jumpsuits who work for Frank.Jack dismisses Alice's claims and says Margaret is simply recovering from a household accident (Jack says that Margaret slipped while cleaning the windows and is now in the hospital getting a few stitches).\nWhen Alice asks him what is really happening at the Victory Project, he becomes angry and refuses to answer. The town physician, Dr. Collins (Timothy Simons), prescribes Alice medication, which she and Jack decline, and she steals Margaret's heavily redacted medical file from his briefcase before burning it.\nCollins tells Jack and Alice that due to Margaret's problems, Ted no longer works at the Victory Project and Jack is worried that if Alice does not toe the line, they will lose their lives together too.Becoming increasingly paranoid during a company celebration where Frank promotes Jack, Alice breaks down in the bathroom. Confronted by Bunny, she attempts to explain her suspicions. Bunny reacts angrily when Alice tells her she went to Headquarters, accusing her of jeopardizing their livelihood in Victory and comparing her to Margaret.Alice and Jack invite their neighbors to dinner, including Frank and his wife Shelley (Gemma Chan). Frank privately confirms her suspicions and dares her to challenge him. Spurred on, Alice attempts to expose him over dinner (by pointing out to the guests that all of them have similar back stories, and they all honeymooned in 2-3 common destinations, they all met their husbands in a similar way), but Frank makes her appear delusional to the others, causing Jack grief.\nAlice alleges that Frank controls everyone's life, and even controls the food that they eat.Afterward, Alice tries to tell Jack that Frank confirmed her suspicions as true. However, he shoots her down. Nearing the end of her rope, she begs him to leave the Victory Project with her. He feigns agreement, then lets Frank's men take her away in the driveway. Dr. Collins gives Alice electroshock therapy, during which she sees herself in the 21st century, struggling to get by as surgical resident Alice Warren and living with the unemployed Jack.\nAlice is a successful, but has no time for Jack, who feels neglected and unwanted. She is so tired from work, that she doesn't have the time or the energy to have sex with Jack. Jack listens to Frank's podcasts on the internet on how modern society has removed them from happiness.After her treatment, Alice resumes her life in Victory, but comes to realize the visions are actually memories. She remembers that Jack visited Frank's office and enrolled for the Victory program. He was given devices for himself and Alice, whom he imprisoned in their own home, and kept her sedated while she was under the control of the device. The project has 72 active users.\nConfronted by Alice, Jack confesses the truth: Victory is a simulated world created by Frank, where he and the other men lead their version of perfect lives; the women they have forced into the simulation are unaware that their lives in Victory and their children are artificial.When the men leave for work each day, they are actually logging out of the simulation for real jobs to pay for their captive wives to stay there. Jack argues that Alice was miserable in the real world while in Victory they can both finally be happy, but she is livid she's being held there non-consensual and without her autonomy.\nJack begs Alice to stay, forcefully grabbing her, prompting her to smash a rocks glass over his head, killing him in both the simulation and reality.Frank immediately hears of Jack's death. Bunny finds Alice and admits she has always known about the simulation, but chose to stay to be with her children, who died in real life. She tells Alice that Frank's minions will kill her if she doesn't get to Headquarters-the exit portal from the simulation. Alice silently confronts the neighborhood, and as small explosions begin, the husbands panic.Fleeing in Jack's car, Alice is chased by Dr. Collins and Frank's men. She maneuvers them into fatally crashing into each other. Meanwhile, Shelley fatally stabs Frank to take control of Victory. Arriving at Headquarters, Alice has a final vision of Jack, then puts her hands on Headquarters just before Frank's men can reach her. Seeing disturbing images mixed with visions of herself in the real world, the screen cuts to black as Alice is heard gasping for air.",
	"links": [
		"https://www.amazon.com/Dont-Worry-Darling-Florence-Pugh/dp/B0B8PZXX73"
	]
}