{
	"title": "Death Proof",
	"release_year": "2007",
	"runtime": "127",
	"tags": [
		"Action",
		"Drama",
		"Thriller",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Kurt Russell",
		"Zoë Bell",
		"Rosario Dawson",
		"Vanessa Ferlito",
		"Sydney Tamiia Poitier",
		"Tracie Thoms",
		"Rose McGowan",
		"Jordan Ladd",
		"Mary Elizabeth Winstead",
		"Quentin Tarantino"
	],
	"staff": [
		"Quentin Tarantino",
		"Quentin Tarantino",
		"Elizabeth Avellan",
		"Robert Rodriguez",
		"Erica Steinberg",
		"Quentin Tarantino",
		"Quentin Tarantino",
		"Sally Menke",
		"Mary Vernieu",
		"Steve Joyner"
	],
	"votes": 317460,
	"cover": "https://m.media-amazon.com/images/M/MV5BYjRlOTM0OTktZTBjNi00ZjZiLWJkMzktMmU2ZDBkMTQxN2FmXkEyXkFqcGc@._V1_QL75_UY281_CR5,0,190,281_.jpg",
	"description": "Three friends: Arlene (Vanessa Ferlito), Shanna (Jordan Ladd), and radio DJ \"Jungle\" Julia Lucai (Sydney Tamiia Poitier) drive down Congress Avenue in Austin, Texas, on their way to celebrate Jungle Julia's birthday. While bar-crawling, Julia reveals that she made a radio announcement earlier that morning, offering a free lap dance from Arlene in return for addressing her as \"Butterfly,\" buying her a drink, and reciting a segment of the poem \"Stopping by Woods on a Snowy Evening\".They are unaware they are being stalked by an aging and sadistic Hollywood stunt double, \"Stuntman\" Mike (Kurt Russell). After trailing them to a bar, Mike follows the instructions from the radio announcement to get the lap-dance. Despite some initial trepidation, due to having seen Mike's car earlier in the day, and asking if he has been following them, Mike puts her at ease (partly by saying she's chicken), impresses her with his smooth talk, and Arlene agrees to the dance (not seen in the theatrical version due to a \"missing reel\").The three women prepare to depart with their friend Lanna, whom they met at the bar. Meanwhile, Pam (Rose McGowan), another intoxicated female bar patron, has been impressed by the teetotaler Mike and accepts a ride home from him, considering him to be a safe ride. Mike takes Pam to his matte black 1971 Chevy Nova SS 396, which is a stunt car rigged with a safety cage inside, confirming that his car is \"death proof\".As Mike drives Pam off, it becomes clear he is trying to kill her, reminding her that his car is \"death proof\", but only to the driver. Since the passenger seat has no safety restraints at all, he kills her by driving recklessly and then slamming on the brakes, which smashes her skull into the dashboard. Mike speeds off, leaving behind photos he took earlier of the three other women, so as not to get caught with any evidence. He eventually comes on their red 1997 Honda Civic Hatchback on an empty road and drives at full speed directly into it. The force of the impact kills all four women in the Honda, and also covers up the real reason of Pam's death.The local hospital finds Mike with only minor injuries (broken collar bone and smashed index finger) and asserts that since Mike was sober while the four women were intoxicated, he cannot be charged. This concerns Texas Ranger Earl McGraw (Michael Parks), who is convinced Mike is guilty but cannot investigate without evidence. Though he chooses not to pursue a long, drawn-out investigation, McGraw tells his son (who also happens to be his deputy) that should Stuntman Mike try this again, McGraw will 'make damn sure he don't do it in Texas'.Fourteen months later, three young women, Abernathy Ross (Rosario Dawson), Kim Mathis (Tracie Thoms), and Lee Montgomery (Mary Elizabeth Winstead), are traveling through Lebanon, Tennessee in their customized yellow 1972 Ford Mustang. They stop briefly at a convenience store, where Mike is resting in his new ride, a 1969 Dodge Charger R/T 500, and is intrigued by the women. The women, unaware of Mike, pick up their friend, stunt-woman Zoe Bell, from the airport. Zoe informs them she wants to test-drive a white 1970 Dodge Challenger R/T, exactly the same type of car from the 1971 film, Vanishing Point, which just happens to be nearby. After they get to the car's location, Abernathy tries to convince the owner, Jasper, to let them \"test drive\" it alone. He refuses at first, but after Abernathy tells him Lee will stay behind (under the false pretense that they are in town to film a porno, of which Lee is the star), he agrees.In the process of all this, Zoe reveals to Abernathy and Kim that she has an ulterior motive in taking the car; she wants to play a game called \"Ship's Mast\", where she rides on the car's hood using only leather belts to hold onto, while Kim drives it at high speeds. Kim is hesitant, but then agrees to do the stunt. As Kim drives, Zoe goes on the top of the car, while Kim accelerates. The trio enjoys the stunt, unaware that Mike is watching them from the hood of his car. While they are driving, Abernathy notices him too late, and he rear-ends them, causing Zoe to drop one of their belts. He continues to ram the car, intending to kill Zoe. After few collisions, he T-bones them, causing Zoe to drop. He leaves the car, smiling about the events, but Kim shoots him. He escapes. Abernathy and Kim cry over the loss of their friend, but Zoe shows up, not injured at all (she is a professional stunt-woman). They agree to catch Mike and beat him. Zoe takes a piece of pipe and rides shotgun.Meanwhile, Mike has stopped in a small narrow road to treat his wound with whiskey. The girls drive up from behind his car quickly and rear end him at high speed. Zoe gets out and beats him with the pipe and the girls pursue him while he attempts to escape and plead with them by apologizing. They ultimately cause him to crash and beat him mercilessly. As the end credits roll, stills and short film clips of China Girls play over the song \"Chick Habit\" by April March.",
	"links": [
		"https://www.amazon.com/Grindhouse-Death-Proof-Kurt-Russell/dp/B0CM1Q3Q8Z"
	]
}