{
	"title": "Cloverfield",
	"release_year": "2008",
	"runtime": "85",
	"tags": [
		"Action",
		"Horror",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Mike Vogel",
		"Jessica Lucas",
		"Lizzy Caplan",
		"T.J. Miller",
		"Michael Stahl-David",
		"Odette Annable",
		"Anjul Nigam",
		"Margot Farley",
		"Theo Rossi",
		"Brian Klugman"
	],
	"staff": [
		"Matt Reeves",
		"Drew Goddard",
		"J.J. Abrams",
		"Bryan Burk",
		"Michael Giacchino",
		"Michael Bonvillain",
		"Kevin Stitt",
		"Alyssa Weisberg",
		"Martin Whist"
	],
	"votes": 425318,
	"cover": "https://m.media-amazon.com/images/M/MV5BOWM3NmYyMjAtMjU3YS00MDJjLThmNDItNWUzZmFmMzk5NTEyXkEyXkFqcGc@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "The film is presented as found footage from a personal video camera recovered by the United States Defense Advanced Research Projects Agency. A disclaimer text states that the footage is of a case designated \"Cloverfield\" and was found in the area \"formerly known as Central Park\". The video consists chiefly of segments taped the night of Friday, May 22, 2009. The newer segments were taped over older video that is shown occasionally.The first video segment opens when Rob (Michael Stahl-David) wakes up on the morning of Monday, April 27 having slept with Beth (Odette Yustman), a previously platonic friend. They make plans to go to Coney Island that day.\nThe footage cuts to May 22 6:43 PM, when Rob's brother Jason (Mike Vogel) and his girlfriend Lily (Jessica Lucas) prepare a farewell party for Rob who will be moving to Japan. Their friend Hud Platt uses a camera to film testimonials, after Jason unloaded the task to him. Hud is an amateur, and the video footage he shoots is very jerky and cuts in and out very quickly.\nHud has a crush on a mutual friend Marlena of Lily, who is also attending the party. Later in the night, Rob arrives for his surprise party.\nRob soon realizes that Hud is using Rob's video camera to shoot the testimonials and that he didn't change the video tape inside, which means he taped over Rob and Beth's trip to Coney Island.\nIn her farewell message, Beth is really distracted on camera. Later, Hud catches Rob and Beth fighting with each other in the hallway. Turns out Beth had not broken up with Travis (Ben Feldman), when she slept with Rob, over a month ago. Beth is still with Travis and Rob is angry about that.After Beth leaves the party, an apparent earthquake strikes, and the city suffers a brief power outage. The local news reports that an oil tanker has capsized near Liberty Island. When the party-goers leave the building, they see the head of the Statue of Liberty crash in the street with several stunning scratch and bite marks.\nHud (T.J. Miller) records what appears to be a hand of a large creature several blocks away. A glimpse of a monster is shown that causes the Woolworth Building to collapse. The group decides to exit Manhattan via the Brookly Bridge.\nLater, a gigantic tail destroys the Brooklyn Bridge, also killing Jason. News reports show the Army National Guard's 42nd Infantry Division attacking the monster and smaller \"parasite\" creatures falling off its body and attacking people.Rob listens to a phone message from Beth saying she is trapped in her apartment and unable to move. Going against the crowd, Rob, Hud, Lily, and Marlena (Lizzy Caplan) (another party guest) venture to Midtown Manhattan to rescue Beth. The monster is shown to be moving between the buildings in Midtown Manhattan, causing widespread damage.\nThey find themselves in a battle between the creature and military, run into the subway station. Rob convinces the group to follow the tunnel tracks to reach a station near Beth's apartment. Inside the tunnels (while navigating using the flashlight from the camera) they are attacked by several of the parasites.\nWhile saving Hud, Marlena is bitten by one of the creatures. The four escape the subway and enter an underground mall where Marlena begins to feel unwell. They are found by soldiers and taken to a command center nearby. The soldiers tell the group, that they have not yet identified the monster's origin, and whatever it is, it is winning.\nWhen Marlena begins bleeding from her eyes, she is forcibly taken to a field hospital and explodes.Rob, still intending on saving Beth, persuades one of the military commanders to let them go. He is informed when the last evacuation helicopter will depart before the military executes its \"Hammer Down Protocol\", which will destroy Manhattan in its entirety in order to kill the monster. The last helicopters will leave Manhattan at 0600 the next day.\nThe surviving group travel to Beth's apartment building to discover it leaning on a neighboring skyscraper. After crossing roofs from the other building, the group finds Beth impaled on exposed metal construction bar. They free her and make their way to the evacuation site at Grand Central Terminal, where they encounter the creature again.Lily is first rushed into a departing Marine Corps helicopter to escape before the terminal is destroyed. Moments later, Rob, Beth and Hud are taken away in a second helicopter and witness the creature being bombed. The bombing causes the creature to fall, and success is assumed, but then it lunges out of the smoke, hitting the second helicopter and causing it to crash in Central Park, killing all the occupants except Rob, Beth and Hud.Fifteen minutes before the Hammer Down Protocol is to commence, the trio regain consciousness and attempt to flee; Hud turns back to retrieve the camera when the creature suddenly appears and kills him. Rob and Beth grab the camera and take shelter under an arch as sirens blare, and the bombing starts. Rob and Beth each provide their last testimony of the day's events. The bridge begins to crumble, and the camera is knocked out of Rob's hand and buried beneath rubble. Rob and Beth proclaim their love for each other just as the bomb explodes, the camera freezing up before the footage cuts.The film ends with the finale of Rob and Beth's trip to Coney Island on Apr 27th, 2009. Unseen by them, an indiscernible object falls from the sky and into the ocean. Just before the camera cuts out, Beth states, \"I had a good day.\"After the credits, a voice can be heard saying, \"Help us...\" When played in reverse, it says, \"It's still alive.\"",
	"links": [
		"https://www.amazon.com/CLOVERFIELD-Matt-Reeves/dp/B07QB3F5QV"
	]
}