{
	"title": "The Power of the Dog",
	"release_year": "2021",
	"runtime": "126",
	"tags": [
		"Drama",
		"Western",
		"amazon",
		"netflix"
	],
	"rating": 6.8,
	"actors": [
		"Benedict Cumberbatch",
		"Kirsten Dunst",
		"Jesse Plemons",
		"Kodi Smit-McPhee",
		"Geneviève Lemon",
		"Kenneth Radley",
		"Sean Keenan",
		"George Mason",
		"Ramontay McConnell",
		"David Denis"
	],
	"staff": [
		"Jane Campion",
		"Jane Campion",
		"Thomas Savage",
		"Jane Campion",
		"Iain Canning",
		"Roger Frappier",
		"Tanya Seghatchian",
		"Jonny Greenwood",
		"Ari Wegner",
		"Peter Sciberras",
		"Nikki Barrett",
		"Tina Cleary",
		"Carmen Cuba",
		"Nina Gold",
		"Grant Major"
	],
	"votes": 196330,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzgyMzA2NDEtZWUxNy00MDNmLTllMDYtNzZmNTU5ZWVmMzhlXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1925 Montana, wealthy ranch owner brothers Phil (Benedict Cumberbatch) and George Burbank (Jesse Plemons) meet widow and inn owner Rose Gordon (Kirsten Dunst) during a cattle drive. The kind-heart George is quickly taken with Rose, while the volatile Phil, much influenced by his late mentor \"Bronco\" Henry, mocks Rose's son Peter (Kodi Smit-McPhee) for his lisp and effeminate manner.\nOn the way Phil had encountered cattle that died from Anthrax. Phil notices that George is attracted to Rose. George goes to meet her even afterwards and Phil warns him that Rose is only after his money.George and Rose soon marry without the knowledge of Phil. Rose uses George's money to send her son to college to study medicine and surgery, while she moves into the Burbank ranch house. Phil immediately takes a disliking to her, believing she took advantage of George for his wealth. His rough ways and taunting manner unnerve her. George organizes a dinner party with his parents (Old Lady (Frances Conroy) & Old Gent (Peter Carroll)) and the governor Edward (Keith Carradine) & his wife (Alison Bruce) so they can meet Rose and hear her play their new piano. Phil, after being asked by George to wash up before dinner, is nowhere to be found. Rose is very reluctant to play the piano, citing her lack of ability, but is pressured to do so by George and their guests. She is unable to play more than a few notes and is further humiliated when Phil, still dirty, enters and belittles her. As they leave, she takes a drink of alcohol, something she was previously opposed to.By the time Peter comes to stay at the ranch for the summer break, Rose has become an alcoholic, which she hides from George. Phil and his men taunt Peter, and he sequesters himself in his room, dissecting animals and studying diseases. In a secluded glade, Phil masturbates with Bronco Henry's handkerchief. Peter enters the glade and finds a stash of magazines with Bronco Henry's name on them depicting nude men. He observes Phil bathing in a pond with the kerchief around his neck; Phil notices him and chases him off.Phil suddenly begins to show decency to Peter, offering to plait him a lasso from rawhide and teach him how to ride a horse. Phil is impressed when Peter immediately picks out a shadow in the shape of a dog on a nearby mountain. Peter, out on a solo ride, comes across a diseased cattle carcass and cuts into its hide with a scalpel. Out on a fencing job, Peter and Phil corner and kill a rabbit, and Phil gets an open wound on his hand. Afterwards, Peter tells Phil about finding the body of his father, who had hanged himself, and cutting him down himself. Peter then informs Phil that his dad was often worried that Peter wasn't a kind enough person. Phil is both a bit shocked and uneasy at Peter's complete lack of emotion when telling him this.Seeing how much time her son is spending with Phil, Rose's alcoholism worsens. Upon learning about Phil's policy of burning the hides he does not need for himself; Rose defiantly gives them to local Indigenous traders who thank her with a pair of gloves. She then collapses from her rapid alcohol consumption and George tends to her.With no hides to finish Peter's lasso, Phil is despondent and attempts to lash out at Rose before being stopped by George. However, Peter calms him down by offering him the hide he cut from the dead cattle. Phil is touched and promises Peter they'll have a much better relationship from now on. They spend the night in the barn finishing it, and Phil tells Peter a story of how Bronco Henry saved his life by combining their body heat in freezing weather and does not answer when Peter asks if they were naked, and they then seductively share a cigarette. When Phil does not show up for breakfast the next morning, George finds him sickened in bed and his wound heavily infected. A delirious Phil looks for Peter to give him the finished lasso, but George takes him away to the doctor before he can hand it over. In the next scene, George is seen picking out a coffin while Phil's body is prepared for burial.At his funeral, the doctor tells George that Phil most likely died from anthrax, puzzling him, as Phil was always careful to avoid diseased cattle. Having not gone to the funeral, Peter opens a Book of Common Prayer to the burial rite and then flips to the Psalter and reads Psalm 22:20: \"Deliver my soul from the sword; my darling from the power of the dog.\" Later he puts his finished lasso under his bed with gloved hands. As he walks down the hall he stops at a window and watches George and a now sober Rose return home, and embrace. He turns away and smiles, revealing that he intentionally gave Phil the anthrax-infected carcass knowing it would kill him. It is implied that was his plan the entire time, in order to save his mother and secure her happiness with George.",
	"links": [
		"https://www.amazon.com/Power-Dog-Novel-Thomas-Savage-ebook/dp/B004ZGZBWC",
		"https://www.netflix.com/title/81127997"
	]
}