{
	"title": "Druk",
	"release_year": "2020",
	"runtime": "117",
	"tags": [
		"Drama",
		"amazon"
	],
	"rating": 7.7,
	"actors": [
		"Mads Mikkelsen",
		"Thomas Bo Larsen",
		"Magnus Millang",
		"Lars Ranthe",
		"Maria Bonnevie",
		"Helene Reingaard Neumann",
		"Susse Wold",
		"Magnus Sjørup",
		"Silas Cornelius Van",
		"Albert Rudbeck Lindhardt"
	],
	"staff": [
		"Thomas Vinterberg",
		"Thomas Vinterberg",
		"Tobias Lindholm",
		"Kasper Dissing",
		"Sisse Graum Jørgensen",
		"Sturla Brandth Grøvlen",
		"Janus Billeskov Jansen",
		"Anne Østerud",
		"Sabine Hviid"
	],
	"votes": 200772,
	"cover": "https://m.media-amazon.com/images/M/MV5BNjYxN2EwYjUtNzdiOS00NTgwLTgwNzMtZmE1NGMzYTYxNzBjXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Teachers Martin (Mads Mikkelsen), Tommy (Thomas Bo Larsen), Peter (Lars Ranthe) and Nikolaj (Magnus Millang) are colleagues and friends at a gymnasium school in Copenhagen. All four struggle with unmotivated students and feel that their lives have become boring and stale.\nThe Principal (Susse Wold) has just declared a zero alcohol semester after some students had a drinking game and went on rampage across the townAnika (Maria Bonnevie) is Martin's wife and works late nights to support the family financially (and she and Martin have no sex life as a result). Martin is worried that Anika does not find him attractive anymore. Martin's students are unhappy with him as he is tough grader, and they feel that being in his class pulls their grades down and reduces their chances of securing admission in a good university. Martin is confronted by his senior students and their parents, who express that he has become a barrier to them passing their history exams.At a dinner celebrating Nikolaj's 40th birthday, the group begins to discuss psychiatrist Finn Skarderud, who has theorized that humans are born with a blood alcohol content (BAC) deficiency of 0.05%, and that being at 0.05% makes one more creative and relaxed.While the group dismisses the theory, Martin, who is depressed due to troubles in his marriage, is inspired and starts to drink at work. The rest of the group eventually decides to join him, considering the ordeal an experiment to test Skarderud's theory.\nThey start a group log of what occurs when they start drinking at regular intervals to maintain this blood alcohol level. Two of the friends have personal challenges that also make this experiment attractive: Martin is depressed and alienated from his family and students, Nikolaj's wife seems to have contempt for him.\nThey agree to a set of rules: their BAC should never be below 0.05 and that they should not drink after 8:00pm. Each man has his own way of sneaking drinks of alcohol during the day while teaching or coaching children, but they never drink and drive, with 0.05 being the legal limit.Within a short period of time, all four members of the group find both their work and private lives more enjoyable. Martin, in particular, is delighted as he finally manages to reconnect with his wife and children. Martin is able to get his class under control, who appreciate his newfound confidence and joyful nature. He teaches history through the lens of drinking alcohol, connecting with heavy drinking students.\nEventually their stash of liquor is discovered by the school janitor who reports it to the principal. Thankfully, the principal believes that some students are drinking on campus.Agreeing that the experiment should be taken further, the group increases the daily BAC limit to 0.10. Martin is visibly sloshed at this level of BAC. Still finding their lives improved. Martin's class loves him now and even responds positively to his demands for tests and other evaluations. Martin takes his family for a canoeing vacation after 8 years, which surprises his wife, Anika. They have sex out in the woods.Tommy makes a winner out of a spectacles wearing young boy by coaching him in football. Nikolaj gets his class interested in classical music, the group decides to attempt binge drinking to observe how their bodies and minds respond.\nThe group has a fun night, but after coming home drunk, both Martin and Nikolaj are confronted by their families (Nikolaj urinates in his own bed). Martin's family express their worries, revealing that they knew he has been drinking for weeks. He and his wife express how each has drawn away from the other, and she admits to infidelity. The group abandons the experiment. Martin and his wife have split up, and while he tries to make amends, she rejects him.Months later, all the members of the group have stopped drinking during the day with the exception of Tommy, who has become an alcoholic. A few days after arriving to work drunk (& hence fired from school), Tommy boards his boat with his old dog, sails out on the ocean and commits suicide. Peter helps one of his nervous students to pass the exam by getting him to relax by sipping some alcohol during the exams. The three remaining members of the group go out to dinner after Tommy's funeral and appear reluctant to drink the alcohol which is served. While dining, Martin receives a message from his wife who states that she is willing to give their marriage a new chance while the recently graduated students drive by. Martin, Peter and Nikolaj join them in celebrating and drinking at the harbor.Martin, a former jazz ballet dancer, dances with the rest of the party-goers, which he had refused up to this point in the film despite his colleagues' repeated urging. His dance becomes increasingly energetic and joyous, and the story ends as he leaps into the water, on a freeze frame of him in midair.",
	"links": [
		"https://www.amazon.com/Another-Round-Mads-Mikkelsen/dp/B08PCPY4SF"
	]
}