{
	"title": "Ice Age: Dawn of the Dinosaurs",
	"release_year": "2009",
	"runtime": "94",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"amazon"
	],
	"rating": 6.9,
	"actors": [
		"Ray Romano",
		"John Leguizamo",
		"Denis Leary",
		"Eunice Cho",
		"Karen Disher",
		"Harrison Fahn",
		"Maile Flanagan",
		"Jason Fricchione",
		"Bill Hader",
		"Kelly Keaton",
		"Kelly Keaton"
	],
	"staff": [
		"Carlos Saldanha",
		"Michael Thurmeier",
		"Michael Berg",
		"Peter Ackerman",
		"Mike Reiss",
		"Yoni Brenner",
		"John C. Donkin",
		"Lori Forte",
		"John Powell",
		"Harry Hitner",
		"Christian Kaplan"
	],
	"votes": 268270,
	"cover": "https://m.media-amazon.com/images/M/MV5BZWJjZDYwMjgtZDZiMy00YzcyLThjN2YtYjI1ZDQ2ZDJkOTVmXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Ellie is pregnant, and Manny is determined to create a safe environment for her and their unborn child, haunted by the tragic loss of his previous family. Manny's over protectiveness, however, begins to push Diego away, as the saber-tooth tiger feels he's losing his edge and considers leaving the herd. Meanwhile, Sid, fearing abandonment, stumbles upon three eggs in an underground cavern. Ignoring Manny's warning to leave them, Sid adopts the eggs, which hatch into baby Tyrannosaurs the next morning. Elsewhere, Scrat becomes enamored with a flying saber-tooth squirrel named Scratte, though she is more interested in his prized acorn.Despite Sid's efforts to raise the baby dinosaurs, their wild antics disrupt the herd and destroy the playground Manny built for his child. This angers Manny further. Matters escalate when the mother Tyrannosaurus arrives to reclaim her young. Sid refuses to return them, leading the mother to carry him and her babies underground. Manny, Ellie, Diego, and the possums give chase, discovering a massive subterranean world teeming with dinosaurs. They encounter a territorial dinosaur but are saved by Buck, a one-eyed, eccentric weasel who has been living in the jungle and hunting Rudy, a massive albino Baryonyx that cost him his eye. Buck agrees to guide them to Lava Falls, where the mother Tyrannosaurus is taking Sid and her young.Meanwhile, the mother dinosaur gradually warms to Sid, though he later finds himself separated and pursued by Rudy. Sid narrowly escapes but ends up stranded on a rock drifting toward the perilous Lava Falls.As the group closes in on Sid, Ellie goes into labor, and a pack of Guanlong dinosaurs triggers a rock slide that separates her from the others. Buck directs Manny and Diego to protect Ellie while he and the possums go after Sid. Diego rediscovers his courage while fending off the Guanlong and supports Ellie as she gives birth. Manny arrives just in time to meet their newborn daughter, whom they name Peaches. Buck, Crash, and Eddie rescue Sid in a daring effort, navigating dangerous flying reptiles and finally reaching Lava Falls just in time to save him. Sid, while overjoyed to reunite with the herd, is saddened that he couldn't properly bid farewell to the Tyrannosaurus family.As the herd prepares to leave the dinosaur world, Rudy ambushes them. The mother Tyrannosaurus charges to their rescue, knocking Rudy off a cliff. With Rudy seemingly defeated, Sid says a heartfelt goodbye to the dinosaurs. Buck, initially planning to join the herd on the surface, changes his mind upon hearing Rudy's distant roar, indicating the predator's survival. Buck stays behind to continue his mission, sealing the passage to the lost world to protect his friends.Back in their icy home, Manny and Ellie embrace their new life as parents to Peaches, while Diego decides to stay with the herd. Meanwhile, Scrat and Scratte briefly settle in the dinosaur world together, but Scratte's bossy nature drives Scrat to choose his acorn over her. Their ensuing tussle launches Scrat back to the surface, leaving Scratte and the acorn trapped in the dinosaur world.",
	"links": [
		"https://www.amazon.com/Ice-Age-Dinosaurs-Ray-Romano/dp/B002OQT928"
	]
}