{
	"title": "Im Westen nichts Neues",
	"release_year": "2022",
	"runtime": "148",
	"tags": [
		"Action",
		"Drama",
		"War",
		"netflix"
	],
	"rating": 7.8,
	"votes": 254862,
	"actors": [
		"Felix Kammerer",
		"Albrecht Schuch",
		"Aaron Hilmer",
		"Moritz Klaus",
		"Adrian Grünewald",
		"Edin Hasanovic",
		"Daniel Brühl",
		"Thibault de Montalembert",
		"Devid Striesow",
		"Andreas Döhler"
	],
	"staff": [
		"Edward Berger",
		"Edward Berger",
		"Lesley Paterson",
		"Ian Stokell",
		"Erich Maria Remarque",
		"Edward Berger",
		"Daniel Marc Dreifuss",
		"Malte Grunert",
		"Volker Bertelmann",
		"James Friend",
		"Sven Budelmann",
		"Simone Bär",
		"Constance Demontoy",
		"Arwa Salmanova",
		"Christian M. Goldbeck"
	],
	"cover": "https://m.media-amazon.com/images/M/MV5BOWJiYWMyYTktZThhOS00ZjgxLWE0YTQtZDMyNTQxMjMyYjI2XkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "It's 1917 and wartime in Germany (it's the 3rd year of the great war), as many bodies lay strewn about on the frozen ground near a forest. Furious gunfire rings through the landscape. Germans and French attack each other from their trenches. German officers push their men out of the trenches towards enemy positions and they are slaughtered in their dozens.\nA few months ago, German army buries its dead in mass graves, but strips them off their uniforms and boots before burying them. The recovered uniforms are sent by train to industrial laundromats, where they are washed and dried. They are then sent to a sewing factory for repairs. The repaired uniforms are sent back to the army.Paul Baumer (Felix Kammerer) lies about his age so that he can enlist alongside his friends (Ludwig Behm (Adrian Grünewald), Franz Muller (Moritz Klaus), Albert Kropp (Aaron Hilmer) & Tjaden Stackfleet (Edin Hasanovic)) - all of them very young men filled with romanticized, patriotic notions. Paul reports on a recruiting camp and is given a recycled uniform.The reality of war almost immediately dismantles their exuberance. Soon (too soon) Paul is thrown into a trench, with little equipment, minimal training (Just basic military parades and instructions on how to clean the rifle), and the swiftly repaired uniform of another soldier on his back.\nThe group is transported to the western front, but the truck is diverted by a doctor who needs it to transport 40 wounded men back to the safety of base. The unit is made to march to the front and are hit by a French gas attack on the way.\nThe unit reaches the trenches and are asked to remove water from the depths in the middle of regular rain, and a constant drone of gunshots and exploding shells. On his first night as watch, Paul is hit by a sniper bullet, but luckily it hits the helmet and Paul survives.Only the hardy advice of an older veteran Stanislaus \"Kat\" Katczinsky (Albrecht Schuch) prevents him from becoming another hapless statistic on his first day. Kat tells Paul to shoot, change position and cover to survive.\nMany soldiers panic during their first artillery barrage, when the Germans hide in their bunkers and are relentlessly pounded. The roof caves, and many soldiers die inside the bunker. As Paul is rescued, he comes out to see the entire trench destroyed. Paul is asked to gather the dog tags of all the dead Germans (hundreds had died, including Ludwig)\n18 months later, 7th Nov 1918, German Army command, Matthias Erzberger (Daniel Brühl) is a Minister of Defense and is told that 40,000 Germans died in the last few weeks alone, and the trend is getting worse. He knows the war is almost over for Germany.Paul and Kat are friends. They resort to stealing geese from houses in occupied France to survive. Things are relatively quiet as the unit is back in reserve and not deployed on the front. Kat is anxious to get going again. Franz has sex with a French girl.\nThe unit is asked to look for 60 fresh recruits who were supposed to arrive a day earlier. Paul & Kat lead a team who finds them dead in a railway shed, which was gassed by the French. The fresh recruits took off their masks too soon.Compiegne, France, 8th Nov 1918, Erzberger travels by train for an armistice negotiation. General Friedrichs (Devid Striesow) thinks this is a bad idea, as he feels French will try to gain an upper hand in negotiations by making advances on the ground in battle. Friedrichs plans an offensive on the French.\nThe reserve forces are moved back to the front, and this include Kat & Paul's unit.General Ferdinand Foch (Thibault De Montalembert) leads the French delegation. The meeting takes place in a train cab. Erzberger proposes a ceasefire for the duration of the negotiations. But Foch makes him ask for an armistice. Once he does, Foch gives Erzberger a list of French demands, to be agreed to in 72 hrs. The war continues in the meantime.\nThe German launch the offensive and lose many men before they reach the French trenches. The Germans kill many French soldiers in the trenches but are taken aback by the arrival of a tank on the battlefield. The tanks pulverize the trenches with their cannons & machine guns. The Germans retreat. Only hand grenades are able to stop the tanks.\nThe French unveil the flame throwers and burn the Germans alive on the battlefield. Germans are stunned by the assault and abandon their trenches to move 2 miles back to another trench under their control.Erzberger reads the French terms, which ask for total capitulation. The army doesn't want a surrender, but Erzberger reminds them that 250,000 Americans are landing in Europe each month. and already large parts of Germany are lost to the French. Erzberger sends a copy of the demands to the Govt by telegraph. By night, Erzberger is urged by the Govt to sign.\nMeanwhile at the battlefield, the retreating Germans are pursued by French aircraft and killed. Paul kills a French soldier to survive. Paul reaches the barracks to learn that peace negotiations are on. Paul finds Tjaden, who has been hit just above the knee and is unlikely to survive. Tjaden says that Franz was killed. Tjaden then kills himself.The next day, Erzberger urges Foch to spare the population, but Foch is in no mood to relent. He asks Erzberger to sign and he does. The peace is to take effect in 6 hours, at the 11th hour of the 11th day of the 11th Month. Friedrichs is furious and plans one last push to regain German pride before the peace takes effect.\nPaul and Kat return to the same French farm they hit earlier, to steal another goose. But Paul is discovered and shot at and the Dup has to escape without any food this time. But the farmer's son follows them and shoots Kat when he is alone in the jungle. Paul carries Kat all the way back to base but can't find any medics. But Kat was already dead. Paul is all alone in life now, as all his friends are dead.\nMeanwhile Friedrichs orders one last strike on the French before the armistice takes effect at 11 am. The Germans march across the no man's land between trenches and take the French forces by surprise, who are already celebrating the peace. After surviving many attacks, Paul is finally stabbed through the heart by a French bayonet. That is the moment at which the clock strikes 11 am and the ceasefire comes into effect. Another young German boy is given the task to gather all the dog tags of dead German soldiers.\nIn 4 years of war, the front-line barely moved. 3 million soldiers died in the trenches. 17 million died in WW I overall.",
	"links": [
		"https://www.netflix.com/title/81260280",
		"https://www.amazon.com/Westen-nichts-Thomas-Schneider-Remarque/dp/3462046322"
	]
}