{
	"title": "Shershaah",
	"release_year": "2021",
	"runtime": "135",
	"tags": [
		"Action",
		"Biography",
		"Drama"
	],
	"rating": 8.3,
	"actors": [
		"Sidharth Malhotra",
		"Sidharth Malhotra",
		"Kiara Advani",
		"Shiv Panditt",
		"Pranay Pachauri",
		"Sahil Vaid",
		"Atul Singh Verma",
		"Shataf Figar",
		"Vijay Meenu",
		"Anil Charanjeett",
		"Raj Arjun"
	],
	"staff": [
		"Vishnuvardhan",
		"Sandeep Shrivastava",
		"Shabbir Boxwala",
		"Harry Gandhi",
		"Hiroo Johar",
		"Karan Johar",
		"Tanishk Bagchi",
		"John Stewart Eduri",
		"Jaani",
		"Javed Khan",
		"Kamaljeet Negi",
		"A. Sreekar Prasad",
		"Jogi Mallang",
		"Subrata Chakraborty",
		"Amit Ray"
	],
	"votes": 130724,
	"cover": "https://m.media-amazon.com/images/M/MV5BZTAzNzg0OGUtZmY1My00Y2VmLTk2YzYtNDU3MjlmNzU5ZjE3XkEyXkFqcGc@._V1_QL75_UY281_CR11,0,190,281_.jpg",
	"description": "The movie begins with Vishal Batra (Sidharth Malhotra) delivering a talk in an auditorium about his martyred twin brother, Capt. Vikram Batra. He starts narrating the story from their teenage years and story goes to flashback.Young Vikram is playing cricket when the ball flies into the hands of some boys. He decides to get the ball back from the boys despite his brother, Vishal's warnings. When the boys refused to return the ball, Vikram gets into a fight. When his father later G.L. Batra (Pawan Chopra) scolds him, he claims that no one can snatch his things. In the late '80s, a show named Param Vir Chakra used to run. Vikram used to watch it at his neighbor's house. The show inspired him to be a soldier.A grown-up Vikram (also Sidharth Malhotra) (In 1998) is now a soldier and is posted at Sopore, Jammu and Kashmir and allotted to the Delta company of the 13th Battalion of the Jammu and Kashmir Rifles aka 13 JAK RIF. He is welcomed by the soldiers and heads to the headquarters of Jammu and Kashmir rifles.\nHis unit includes Major Rajeev Kapoor (Himmanshoo A. Malhotra), Naib Subedar Bansi Lal Sharma (Anil Charanjeett), CO Major Subrata Mukherjee (Abhiroy Singh), Subedar Raghunath Singh (Raj Arjun), Captain Sanjeev Jamwal (Shiv Pandit), Major Ajay Singh Jasrotia (Nikitin Dheer)After a few months, Vikram has many friends in the local population. Vikram's unit is posted at a checkpoint where Mukherjee had a tip that weapons are going to pass through. During routine checking Vikram sees a jeep trying to turn back. Without Mukherjee's command, Vikram starts attacking the jeep and the jeep returns fire. Sanjeev comes to help and Vikram saves him from the line of fire. Vikram and Sanjeev kill the terrorists, but Sanjeev scolds Vikram for not following orders and endangering civilian lives. Later, Sanjeev thanks Vikram for saving his life.Vikram heads to the camp and sees that he received a letter from his girlfriend, Dimple Cheema (Kiara Advani). The film flashes back to 1995, where Vikram fell in love with a girl from his group of friends. Dimple accepts his love and they go on dates.\nThen Vikram asked Dimple to marry him where she accepted it but then her father Mr. Cheema (Bijay Anand) had caught them and makes him understand that they are from different castes. Vikram discusses the matter with his father and mother Kamal Kanta Batra (Vijay Meenu), who are very excited. Vikram decides to join the merchant navy to convince Mr Cheema that he is the right match for Dimple. Meanwhile Dimple announced to her father that if she is not married to Vikram, she will not marry at all. Vikram realizes that army is his dream and mission. He tells Dimple to wait for him as he complete his training and joins the army as an officer.Back in present, the terrorist captured at the check post is identified as Attaullah (David Browne), who works for Haider (Mir Sarwar). Haider kills 4 informants who betrayed him in giving info to the army. He vows to kill 13 men from 13 JAK RIF. meanwhile Gafoor's (Zahoor Zaidi) son Arslaan (Afnan Ashia) wants to go to Pakistan for weapons training. Gafoor is a friend of Vikram and reaches out to him. Arslaan says he wants out, But Vikram convinces him to stay with Haider for a few more days, as army's informant.\nHaider traps Mukherjee's platoon in an ambush as they were coming back from a raid. with quick thinking from Vikram, the unit is able to repel the attack, but many army men are killed including Bansi (who was just about to go on leave to visit his daughter).Lt. Colonel Yogesh Kumar Joshi (Shataf Figar) wants his team to find Haider. Vikram presses Arslaan to reveal Haider's location, over Gafoor's objections. Yogesh gives permission to Vikram to lead the operation against Haider. Vikram doesn't have visual confirmation on Haider, but decides to go on instinct and attacks. Eventually Haider is found and eliminated.meanwhile Gen. Musharaff (Bobby Khanna) overrules Gen. Tariq Pervez (Kapil Kumar) and orders Pak army regulars to occupy mountains peaks across the LOC, during peak winter. He says that if he can cut off the Srinagar Leh highway, Kashmir can be won for Pakistan. As summer approaches, Pak regular capture Indian Army units coming to occupy the heights. 5 soldiers are later returned, dead, and with a shocking amount of torture to their bodies. India declares war and 13 JAK RIF is assigned as reserve force.\nPak army shells their camp, and many soldiers die. Jasrotia is paralyzed from the waist down and dies shortly thereafter. 13 JAK RIF is moved from the reserve to active roster. Vikram is given the code-name \"Shershaah\". They are assigned the task of capturing Pt 5140, which is at a height of 17000 ft.After an overnight climb at 85 degrees incline, Vikram's unit attacks Pak positions on Pt 5140 at first light. Together with Sanjeev, the 13 JAK RIF manages to kill all Pak army regulars and capture the post. Vikram is promoted to Captain.\ndue to their success 13 JAK RIF is assigned the task to capture the most difficult hill Pt 4875. The hill controls 70 kms of Indian territory and control of the hill means end of the Kargil war. The attack starts with heavy casualties, but Vikram's unit makes steady progress in eliminating enemy positions. The final bunker on the hill is very heavily fortified and has an extremely exposed approach. Plus, the CO informs Vikram that Pak reinforcements are on the way and his unit needs to capture the hill before the reinforcements get there.\nVikram leads the assault but is killed by sniper fire before both the sniper and the bunker are taken down by Indian soldiers. Vikram dies looking at the Indian flag hoisted over the hill.\nVikram is cremated with full military honors and is awarded the Param Vir Chakra.",
	"links": []
}