{
	"title": "Talk to Me",
	"release_year": "2022",
	"runtime": "95",
	"tags": [
		"Horror",
		"Thriller"
	],
	"rating": 7.1,
	"actors": [
		"Ari McCarthy",
		"Hamish Phillips",
		"Kit Erhart-Bruce",
		"Sarah Brokensha",
		"Jayden Davison",
		"Sunny Johnson",
		"Sophie Wilde",
		"Marcus Johnson",
		"Kidaan Zelleke",
		"James Oliver"
	],
	"staff": [
		"Danny Philippou",
		"Michael Philippou",
		"Danny Philippou",
		"Bill Hinzman",
		"Daley Pearson",
		"Kristina Ceyton",
		"Samantha Jennings",
		"Cornel Wilczek",
		"Aaron McLisky",
		"Geoff Lamb",
		"Nikki Barrett",
		"Kelly Graham",
		"Bethany Ryan"
	],
	"votes": 161556,
	"cover": "https://m.media-amazon.com/images/M/MV5BY2I2NzJmY2YtYTM3Ni00ZGJhLThkZTItODFhMzhlZjZkMDQ5XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "A young man, Cole, stumbles through a crowded house party as he attempts to locate his brother Duckett, who has locked himself in a bedroom. Cole breaks down the door and retrieves an injured Duckett, before taking him into the living room where Duckett stabs his brother in the chest and then himself in the face, killing himself in front of the party-goers.Meanwhile, 17-year-old Mia is struggling with the second anniversary of her mother Rhea's suicide and her distant relationship with her father, Max. Mia, her best friend Jade and Jade's little brother Riley sneak out to a house party hosted by Hayley and Joss where the main attraction is the severed, embalmed hand of a powerful medium, which they use to conjure spirits by lighting a candle and saying the phrase \"talk to me,\" before proceeding to say \"I let you in\" for full possession, and blowing out the candle once ninety seconds has passed. Mia volunteers to go first, and is possessed by a spirit that threatens Riley before Joss and Hayley rip the hand away and blow out the candle, bringing Mia back to her normal self.Mia, ecstatic over the feeling the hand brought her, along with Hayley, Joss and Jade's boyfriend Daniel all gather at Jade's house the next night, where Riley volunteers to play the game, only to be possessed by Rhea's spirit, who attempts to reconcile with Mia. The time limit is exceeded and Riley's body is overtaken by the spirits, repeatedly smashing his face against the table and causing him to be hospitalized. Mia, now haunted by visions of Rhea, is turned away by Jade and her mother Sue, who blame her for Riley's injuries. Seeking comfort from Daniel, Mia invites him to sleep over, but she assaults him after she's possessed by a spirit, causing Daniel to leave and Mia to realize that the spirits have followed them. Having secretly taken the embalmed hand from Jade's house, Mia uses it to contact Rhea, who tells her that her death was purely accidental and that she needs to help Riley, who is evidently still possessed after he attacks Jade at the hospital and violently self-harms in front of her.Mia, Jade, Daniel, Hayley and Joss track down Cole, who reveals that Joss was the one to give Duckett the hand leading to his death, and that Riley's body will inevitably kick the spirits out. Mia deduces that they need to complete the ritual by blowing out the candle, which they failed to do the first time, to save Riley, but they are only able to contact the spirit of a little girl in the hospital who shows Mia a vision of Riley being tortured in limbo. Mia returns home, where Max reveals that Rhea's death was not accidental, and reads her a suicide note that he had hidden from her to prevent her from blaming herself, causing Mia to retreat to her room where Rhea's spirit tells her that Max is lying before she is attacked by a hallucination of Max. Max arrives just as the vision disappears, and Mia inadvertently stabs her father in the neck with a pair of scissors.After being told by Rhea that Riley needs to die in order to be set free, Mia tricks Jade and Sue into leaving the hospital and enters Riley's room, where he takes the appearance of a rotting spirit, but finds herself unable to kill him. Jade arrives at Mia's house where she finds a bleeding Max before returning to the hospital just as Mia leaves with Riley in a wheelchair toward the highway. The spirits attempt to convince Mia to push Riley into oncoming traffic, but coming to her senses and realizing this would hand him over to the spirit realm completely, Mia instead jumps in front of a car herself, saving Riley who is then rescued by Jade.An injured Mia is suddenly transported to the hospital, where she sees a fully healed Riley waking up with his family. As she attempts to reach her father, he leaves in an elevator and she is engulfed in darkness, ending up trapped in limbo. She finds herself on the other side of the embalmed hand while foreign party-goers play the game and summon her spirit.",
	"links": []
}