{
	"title": "Defiance",
	"release_year": "2008",
	"runtime": "137",
	"tags": [
		"Action",
		"Drama",
		"History",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Daniel Craig",
		"Liev Schreiber",
		"Jamie Bell",
		"Alexa Davalos",
		"Allan Corduner",
		"Mark Feuerstein",
		"Tomas Arana",
		"Jodhi May",
		"Kate Fahy",
		"Iddo Goldberg"
	],
	"staff": [
		"Edward Zwick",
		"Clayton Frohman",
		"Edward Zwick",
		"Nechama Tec",
		"Pieter Jan Brugge",
		"Edward Zwick",
		"James Newton Howard",
		"Eduardo Serra",
		"Steven Rosenblum",
		"Gail Stevens",
		"Victoria Thomas",
		"Dan Weil"
	],
	"votes": 156757,
	"cover": "https://m.media-amazon.com/images/M/MV5BM2YzY2UzMDUtODM1NS00MmNlLTg0Y2EtYjhiODczMmExMGFlXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The film is based on a true story, beginning in August 1941, several weeks after Nazi Germany launched its invasion into USSR. Nazi Einsatzgruppen (task forces) are sweeping through Eastern Europe behind the relentlessly advancing German forces across the occupied parts of western Soviet Union, systematically killing Hebrews. Within weeks 50,000 Hebrews are murdered. 1,000,000 await deportation and death.Among the survivors not killed or restricted to ghettos are the Belarusian Hebrew Bielski brothers: Tuvia (Daniel Craig), Zus (Liev Schreiber), Asael (Jamie Bell) and Aron (George MacKay). They managed to escape the Nazi purge by hiding wherever they could.\nTheir parents are dead, killed by local police under orders from the occupying Germans. The brothers flee to the Naliboki Forest, vowing to avenge the deaths of their parents. The brothers have known this forest since their childhood and have knowledge all its assets.Tuvia doesn't want to confront the Germans head on & prefers carefully planned guerrilla tactics, but Zus is more \"impatient\" and wants direct results. Zus has a wife and child, whom he hopes will join him at the right time.\nThe brothers survive by constantly being on the move, not spending much time in any single location. The brothers want to mount an attack on the Germans to avenge their parent's death, but they have no weapons or ammunition. Tuvia kills the local Auxiliary Police chief responsible for his parents' deaths.They encounter other Hebrew escapees hiding in the forest, and the brothers take them under their protection and leadership. Although Zus is less enthusiastic about playing protector to his fellow Hebrews, than killing Germans. Tuvia and Zus gather supplies from the locals to sustain the survivors, who also protect them from the ever-vigilant Germans. Zus says that they need to be able to move quickly, but Tuvia says that the survivors are there, and he cannot ignore them.\nSoon the survivors are large enough group with women and children that they build shelters from wood.Over the next year, they shelter a growing number of refugees, raiding local farms for food and supplies and moving their camp whenever they are discovered by the collaborationist police. The joiners in the camp tell Zus that his wife and child have been killed in camps that they escaped from.Zus wants revenge for his wife and child and wants to attack Germans, but Tuvia says that they need to work out an approach of getting what they want without forcing a direct confrontation with the German occupation forces.\nThe brothers stage raids on the Germans and their collaborators. Inevitably, some Hebrews are killed in the raids and Asael barely manages to escape a German patrol. Casualties cause Tuvia to reconsider this approach because of the risk to the hiding Hebrews. Tuvia is livid with Zus for having put lives at risk.Rivalry between the two eldest brothers, Tuvia and Zus, fuels a disagreement between them about their future. The survivors want Tuvia to take ownership and accountability for their survival, but Tuvia instead tells the survivors to work together. He decides to raid only those farms who can afford to spare and leave the others alone. Tuvia says that their revenge will be to live.\nZus does not follow Tuvia's instructions and does as he pleases. From a new batch of survivors, Tuvia learns that his wife has also died in a concentration camp.Their settlement is eventually found by the Germans and raided. But the survivor scouts saw them coming and were able to leave their settlement just in time. Zus blames Tuvia and his policy of not killing the hostile locals, as one of them ratted their location out to the Germans.As winter approaches, Zus decides to leave the camp and join a local company of Soviet partisans, while his older brother Tuvia remains with the camp as their leader. An arrangement is made between the two groups in which the Soviet partisans agree to protect the Hebrew camp in exchange for supplies.Asael falls in love with Chaya Dziencielsky (Mia Wasikowska) and eventually gets married to her just before the winter sets in. Lilka Ticktin (Alexa Davalos) is a Polish refugee and Tulia observes her, but never acts on his warm feelings for her.After a winter of sickness, starvation, attempted betrayal and constant hiding, the camp learns that the Germans are about to attack them in force (This was in response to Zus and the Russians attacking a large German military column inside the Jungle, which brought their attention to it).\nThe Soviets refuse to help. The Soviet partisans decide to retreat eastward, but Zus is unwilling to comply with the order of the partisan leader to follow their retreat. The Hebrews evacuate the camp as German dive-bombers strike.A delaying force stays behind, led by Asael, to slow down the German ground troops. The defense does not last long; only Asael and a camp member named Sofiya survive to rejoin the rest of the group, who, at the edge of the forest, are confronted with a seemingly impassable marsh. They cross the marsh with only one casualty but are immediately attacked by a German platoon supported by a Panzer III tank. Just as all seems lost, the Germans are assaulted from the rear by a partisan force led by Zus, who had deserted the Soviets to rejoin the group.The survivors escape into the forest. They lived in the forest for another two years, building a hospital, a nursery, a school, growing to a total of 1,200 Hebrews.\nOriginal photographs of the real-life characters are shown, including Tuvia in his uniform and their fates are shared: Asael joined the Soviet Army and was soon killed in action, never getting to see the child he fathered; Tuvia, Zus and Aron survived the war and emigrated to America to form a successful trucking firm in New York City.The epilogue also states that the Bielski brothers never sought recognition for what they did and that the descendants of the people they saved now number in the tens of thousands.",
	"links": [
		"https://www.amazon.com/Defiance-Not-Specified/dp/B0D7G65F64"
	]
}