{
	"title": "Invictus",
	"release_year": "2009",
	"runtime": "134",
	"tags": [
		"Biography",
		"Drama",
		"History",
		"max",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"Morgan Freeman",
		"Matt Damon",
		"Tony Kgoroge",
		"Patrick Mofokeng",
		"Matt Stern",
		"Julian Lewis Jones",
		"Adjoa Andoh",
		"Marguerite Wheatley",
		"Leleti Khumalo",
		"Patrick Lyster"
	],
	"staff": [
		"Clint Eastwood",
		"Anthony Peckham",
		"John Carlin",
		"Clint Eastwood",
		"Robert Lorenz",
		"Lori McCreary",
		"Mace Neufeld",
		"Kyle Eastwood",
		"Michael Stevens",
		"Tom Stern",
		"Joel Cox",
		"Gary Roach",
		"Fiona Weir",
		"James J. Murakami"
	],
	"links": [
		"https://www.max.com/movies/invictus/f4ca3b86-d777-4284-bd91-f54b3f5145db",
		"https://www.amazon.com/Invictus-Morgan-Freeman/dp/B003F9E5D6"
	],
	"votes": 168917,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjAyMzExMDM1N15BMl5BanBnXkFtZTcwNTcyMTQ5Mg@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "On 11 February 1990, Nelson Mandela (Morgan Freeman) is released from Victor Verster Prison after having spent 27 years in captivity. Four years later, Mandela is elected the first colored President of South Africa. Zindzi Mandela-Hlongwane (Bonnie Henna) is his devoted wife.His presidency faces enormous challenges in the post-Apartheid era, including rampant poverty and crime, and Mandela is particularly concerned about racial divisions between colored and white South Africans, which would lead to violence and civil war. The poor South Africans see Mandela as a ray of hope to correct decades of injustice under the British Apartheid regime.\nMandela has the tough job to meet aspirations of the colored people and address the fears of the whites. Brenda Mazibuko (Adjoa Andoh) is Mandela's personal assistant.The ill will which both groups hold towards each other is seen even in his own security detail where relations between the established white officers (Etienne Feyder (Julian Lewis Jones)), who had guarded Mandela's predecessors, and the colored ANC additions (including Linga Moonsamy (Patrick Mofokeng), Jason Tshabalala (Tony Kgoroge)) to the security detail, are frosty and marked by mutual distrust.\nJason is the leader of the joint team. Mandela insists on a mixed team as he says that when people see him in public, they see his bodyguards. Jaason objects that the same officers killed many South Africans, but Mandela asks Jason to forgive them and build a Rainbow Nation.While attending a game between the Springboks, the country's rugby union team, and England, Mandela recognizes that some colored people in the stadium are cheering for England, and not their own country, as the mostly white Springboks represent prejudice and apartheid in their minds. He remarks that he did the same while imprisoned on Robben Island as it made the wardens very angry. South Africa loses the match badly. The President of the Sports Committee says that if the team continues to lose, it would be easier to ditch the green and gold colors of the team, and to make wholesale changes to the starting line-up as well.Knowing that South Africa is set to host the 1995 Rugby World Cup in one year's time, Mandela persuades a meeting of the newly colored-dominated South African Sports Committee to support the Springboks. The committee had just voted to change the name of the team to the Proteas, but Mandela heard about the vote and arrived at the meeting to make this request. He felt that the country was making a mistake by not supporting the Springboks name and colors.He then meets with the captain of the Springboks rugby team, Francois Pienaar (Matt Damon), and implies that a Springboks victory in the World Cup will unite and inspire the nation. Mandela also shares with Francois a British poem, \"Invictus\", that had inspired him during his time in prison.\nFrancois' parents were considering moving to Zimbabwe, fearing repercussions in South Africa, but Francois decides to stay after the approach from Mandela.The team includes Chester Williams (McNeil Hendricks) left wing and the only colored player on the team, Joel Stransky (Scott Eastwood) fly half and goal kicker, Ruben Kruger (Grant L. Roberts) blindside flanker, Naka Drotske (Rolf E. Fitschen) reserve hooker, Rudolf Straeuli (Vaughn Thompson) reserve flanker, equipment manager (Sean Cameron Michael), coach (Louis Minnaar) and others.Francois and his teammates train. Many South Africans, both colored and white, doubt that rugby will unite a nation torn apart by nearly 50 years of racial tensions, as for many colored people, especially the radicals, the Springboks symbolize white supremacy. Both Mandela and Pienaar, however, stand firmly behind their theory that the game can successfully unite the South African country.Things begin to change as the players interact with the fans and begin a friendship with them. During the opening games, support for the Springboks begins to grow among the colored population. By the second game, the whole country comes together to support the Springboks and Mandela's efforts. Mandela's security team also grows closer as the racially diverse officers come to respect their comrades' professionalism and dedication.As Mandela watches, the Springboks defeat one of their arch-rivals-Australia, the defending champions and known as the Wallabies-in their opening match. They then continue to defy all expectations and, as Mandela conducts trade negotiations in Taiwan, defeat France in heavy rain to advance to the final against their other arch-rival: New Zealand. New Zealand and South Africa were universally regarded as the two greatest rugby nations, with the Springboks then the only side to have a winning record (20-19-2) against New Zealand, since their first meeting in 1921.Meanwhile, one day during the tournament, the Springbok team visited Robben Island, where Mandela spent the first 18 of his 27 years in jail. There, Pienaar is inspired by Mandela's will and his idea of self-mastery in \"Invictus\". Francois mentions his amazement that Mandela \"could spend thirty years in a tiny cell and come out ready to forgive the people who put him there\".Supported by a large home crowd of all races at Ellis Park Stadium in Johannesburg, Pienaar motivates his teammates for the final. Mandela's security detail receives a scare when, just before the match, a South African Airways Boeing 747-200 jetliner flies in low over the stadium. However, it is not an assassination attempt, but a demonstration of patriotism, with the message \"Good Luck, Bokke\"-the Springboks' Afrikaans nickname-painted on the undersides of the plane's wings. Mandela also famously arrives onto the field before the match wearing a Springbok cap and a replica of Pienaar's #6 jersey.The Springboks complete their run by beating the New Zealand 15-12 in extra time, thanks to a drop goal from fly-half Joel Stransky. Mandela and Pienaar meet on the field together to celebrate the improbable and unexpected victory, and Mandela hands Pienaar the William Webb Ellis Cup, as the Springboks are now indeed rugby union's world champions. Mandela's car then drives away in the traffic-jammed streets leaving the stadium. He insists that there is no hurry as his security team wanted to change the route due to the cheering crowd. As Mandela watches South Africans celebrating together in the street from his car, his voice is heard reciting \"Invictus\" again."
}