{
	"title": "Lone Survivor",
	"release_year": "2013",
	"runtime": "121",
	"tags": [
		"Action",
		"Biography",
		"Drama",
		"amazon"
	],
	"rating": 7.5,
	"actors": [
		"Mark Wahlberg",
		"Taylor Kitsch",
		"Emile Hirsch",
		"Ben Foster",
		"Yousuf Azami",
		"Ali Suliman",
		"Eric Bana",
		"Alexander Ludwig",
		"Rich Ting",
		"Dan Bilzerian"
	],
	"staff": [
		"Peter Berg",
		"Peter Berg",
		"Marcus Luttrell",
		"Patrick Robinson",
		"Sarah Aubrey",
		"Peter Berg",
		"Randall Emmett",
		"Akiva Goldsman",
		"Explosions in the Sky",
		"Steve Jablonsky",
		"Tobias A. Schliessler",
		"Colby Parker Jr.",
		"John Brace",
		"Linda Lowy",
		"Tom Duffield"
	],
	"votes": 310156,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjA0NTgwOTk5Ml5BMl5BanBnXkFtZTcwMjE3NDc5OQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Navy Seals go through a brutal training regime to prepare them for surviving the toughest conditions they could encounter during a mission. 25% of the candidates who start the training manage to finish. The course is extremely difficult and includes Limited sleep, Cold water, Constant physical exercise, Combat training and \"Hell Week\", a five-and-a-half-day period with fewer than four hours of sleep.In Afghanistan, Taliban leader Ahmad Shah (Yousuf Azami) is responsible for killing over twenty United States Marines, as well as villagers and refugees who were aiding American forces. Taraq is Shah's right-hand man.In response to these killings, the United States Navy SEALs are assigned to perform a counter-insurgent mission to capture Shah. As part of the mission, a four-man SEAL reconnaissance and surveillance team is tasked to track Shah's whereabouts. The four SEAL teammates are team leader Michael P. \"Murph\" Murphy (Taylor Kitsch); hospital corpsman and sniper Marcus Luttrell (Mark Wahlberg); sonar technician Matthew \"Axe\" Axelson (Ben Foster); and communications specialist Danny Dietz (Emile Hirsch).Lieutenant Commander Erik S. Kristensen (Eric Bana) authorizes the mission. The team is given communication codes for various operational situations including the positive ID of Shah. The satellite communication is supposed to be patchy in the mountains and the team is told not to sweat if they miss 1-2 scheduled check-ins with J-Bad, the forward operating base.Inserted overnight via helicopter (2 Apache and 2 Chinook, but after the drop the Chinook and the Apache are returned to different bases), the four-man team make their way toward Shah's last known location. The Chinooks hold the Quick Reaction Force that would fly in once Shah is identified, to lead the assault.The team is inserted into the Hindu Kush region of Afghanistan, where they make their trek through the mountains. Due to the mountainous terrain the team is operating in, communications with J-Bad become difficult.The team arrives at their designated location. Though the team identify Shah, the SEAL teammates are discovered by an elderly shepherd and two teenage goat herders; one of whom is carrying a Walkie-Talkie. At that moment, the communication with J-Bad goes down. Murphy tries to call Erik on an unsecured Satellite phone, but even that does not work as the line does not stay stable.\nAfter much debate, Luttrell convinces the others that they will receive backlash if they kill the three herders, including 2 kids (They believe that US media would blame the SEALs for the debacle). The team releases the herders, and as they attempt to abort the mission, they are ambushed by Taliban forces (as one of the teenagers sped down the mountain and alerted the Taliban forces in the village). The SEALs were headed up the mountain to call for extract and head home.\nThough the SEALs begin with the advantage, the sheer number of the Taliban forces begins to overwhelm them and their position.They kill several approaching Taliban members but find themselves too heavily outnumbered. All four men take a number of serious injuries during the firefight, and in an attempt to flee from the insurgents, they jump off the edge of a cliff. They are thrown off balance when an RPG detonates in front of them.Despite their injuries, the SEAL team runs through the woods. Dietz begins to lose consciousness and shout questions to Luttrell, unknowingly relaying the SEAL team's position to the Taliban. Murphy and Axelson jump off another cliff to flee from the Taliban fighters. Luttrell tries to carry Dietz down the mountain, but Dietz is shot in the shoulder; the impact forces Luttrell to lose his grip and fall forward off the cliff.A dying Dietz remains at the top of the cliff, in the custody of Shah and the Taliban insurgents who surround him. Murphy plots to climb back up the mountain in order to receive a phone signal to make an emergency call, via a satellite phone. Axelson and Luttrell shoot at the Taliban fighters, while covering Murphy. When he finally reaches higher ground, Murphy is able to alert the Navy SEAL QRF base of his team's location but is shot dead by several Taliban fighters.In response to Murphy's distress call, a quick reaction force team attempts to extract the remaining members of the reconnaissance and surveillance team. The QRF scrambles to the SEALs' aid, though the two Chinook helicopters fly in without Apache support.During an attempt to insert SEAL teammates who were riding in one of two CH-47 Chinook helicopters, the Taliban insurgents shoot down one of the helicopters, killing eight Navy SEALs and eight Special Operations aviators who were on board; the second helicopter is able to escape. After witnessing the attack, Luttrell and a badly injured Axelson are left behind. Axelson attempts to find cover but is killed when he leaves his hiding spot to kill several approaching insurgents. When Luttrell is discovered by the Taliban, one of the insurgents fires a rocket-propelled grenade, and its impact causes him to land at the bottom of a rock crevice where he is able to hide from the Taliban fighters.Luttrell awakens the next day and runs to a nearby village, where he is discovered by local Pashtun villagers. One of the villagers, Mohammad Gulab (Ali Suliman), takes Luttrell into his home and sends a mountain man to the nearest American air base to alert military forces of Luttrell's location.The Taliban fighters and Shah arrive at the village to capture and kill Luttrell, but Gulab and the villagers intervene, threatening to kill the fighters if they harm Luttrell. The fighters leave, but later return to punish the villagers for protecting Luttrell. Luttrell and Gulab are able to fend off several fighters during the ensuing attack. The remaining Taliban fighters are chased away by American forces, who arrive via helicopters and bring Luttrell to safety.Photos of the real-life Marcus Luttrell, Mohammad Gulab and the fallen soldiers who died during the mission are shown during a four-minute montage, and an epilogue reveals that the Pashtun villagers agreed to help Luttrell as part of a traditional code of honor known as the Pashtunwali.",
	"links": [
		"https://www.amazon.com/Lone-Survivor-Mark-Wahlberg/dp/B00JX1ROME"
	]
}