{
	"title": "The Book of Eli",
	"release_year": "2010",
	"runtime": "118",
	"tags": [
		"Action",
		"Adventure",
		"Drama",
		"amazon"
	],
	"rating": 6.8,
	"actors": [
		"Denzel Washington",
		"Mila Kunis",
		"Ray Stevenson",
		"Gary Oldman",
		"Jennifer Beals",
		"Evan Jones",
		"Joe Pingue",
		"Frances de la Tour",
		"Michael Gambon",
		"Tom Waits"
	],
	"staff": [
		"Albert Hughes",
		"Allen Hughes",
		"Gary Whitta",
		"Broderick Johnson",
		"Andrew A. Kosove",
		"Joel Silver",
		"David Valdes",
		"Atticus Ross",
		"Leopold Ross",
		"Claudia Sarne",
		"Don Burgess",
		"Cindy Mollo",
		"Mindy Marin",
		"Gae S. Buckley"
	],
	"votes": 343819,
	"cover": "https://m.media-amazon.com/images/M/MV5BZjk4N2U2YTAtNWEzZC00N2VmLTlkNDctMjg5YjI4OTExZTFhXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "Thirty years after a nuclear apocalypse, Eli (Denzel Washington) travels on foot toward the west coast of US. Along the way, he demonstrates survival and fighting skills, hunting wildlife and swiftly defeating a group of highway bandits who try to ambush him. Searching for a source of water, he arrives in a ramshackle town built and overseen by Carnegie (Gary Oldman). Carnegie dreams of building more towns and controlling the people by using the power of a certain book. His henchmen scour the desolate landscape daily in search of it, but to no avail.In the local town bar, Eli is set upon by a gang of bikers and he kills them all. Realizing Eli is a literate man like himself, Carnegie asks Eli to stay, although it is made clear the offer is non-negotiable. After Carnegie's blind concubine Claudia (Jennifer Beals) gives Eli some food and water, Carnegie orders Claudia's daughter Solara (Mila Kunis) to seduce Eli. Eli turns her down, but she discovers he has a book in his possession. Eli pacifies her with stern words but offers to share his food with her. Before they eat, though, he has her pray with him. The following day, Solara prays with her mother. Carnegie overhears them and realizes Solara's words may relate to the book he has been seeking. Through violence, he forces Solara to tell him Eli was reading a book. When he asks what kind, she says she does not know but forms a cross with her two index fingers. Carnegie realizes Eli has a copy of the Bible, the book he has been seeking. Eli sneaks out of his room and goes to the store across the street, where he had earlier asked the Engineer (Tom Waits) to recharge his battery for his portable music player.Carnegie attempts to stop Eli by having all his henchmen shoot at him, but the bullets seemingly just graze him, as if he is being protected. Eli shoots most of Carnegie's henchmen and hits Carnegie in the leg with a shotgun blast. After Eli leaves, Solara follows him and leads him to the source of the town's water supply, hoping she can accompany him on his travels. Eli traps her inside and continues on alone. Solara escapes and soon finds herself ambushed by two bandits who attempt to sexually assault her, but Eli appears and kills them.As they continue on, Eli explains to Solara the nature of his journey. According to Eli, his book is the last remaining copy of the Bible, as all other copies were intentionally destroyed following the nuclear war. He says he was led to the book by a voice, which then directed him to travel westward to a place where it would be safe. The voice assured him that he would be protected on his journey. Thus, for the last thirty years he has traveled west, guided by his faith.Eventually, Eli and Solara arrive at a strange house. They stop to investigate and quickly fall through a trap door. The residents, Martha (Frances de la Tour (as Frances De La Tour)) and George (Michael Gambon), invite them in for tea. When the travelers realize that the couple are cannibals, they attempt to leave quickly, but they bump into Carnegie and his posse outside the house. Eli, Solara, Martha, and George hole up inside the house. A shootout ensues, leading to the deaths of some of Carnegie's men, as well as George and Martha. Eli and Solara are captured. Carnegie threatens to kill Solara, which prompts Eli to hand over the Bible. Carnegie shoots him and leaves him for dead.While in transit, Solara escapes and drives back to help Eli. Rather than chase her, Carnegie chooses to return to the town with the Bible, since his vehicle is running out of fuel. Solara picks Eli up and they continue west until they reach the Golden Gate Bridge. They then row to Alcatraz, where they find a group of survivors. Eli tells the guards that he has a copy of the King James version of the Bible, and they are allowed in. Once inside, they are introduced to Lombardi (Malcolm McDowell (uncredited)), the curator. Eli, who is revealed to be blind, begins to dictate the Bible from memory.Meanwhile, back in the town, Carnegie manages to open the locked Bible with the help of his Engineer, but he is horrified to discover that it is a Braille copy. He is unable to persuade Claudia to read it for him. Carnegie's leg wound has become septic, and he realizes he will die without making use of the Bible. Claudia laughs because Carnegie lost too many men chasing Eli and the book. Without enough manpower to keep order, the people of his town take control. Eli finishes dictating the Bible after being shaved and cleaned; he dies, presumably from his wounds, shortly thereafter. The printing press at Alcatraz begins printing the new King James Bible, after which Lombardi places a copy on the bookshelf between copies of the Torah and Tanakh on one side and the Qur'an on the other. Solara is offered sanctuary in Alcatraz, but she instead chooses to head back home, bringing along with her the possessions that once belonged to Eli.",
	"links": [
		"https://www.amazon.com/Book-Eli-Denzel-Washington/dp/B003KRGCTI"
	]
}