{
	"title": "From Paris with Love",
	"release_year": "2010",
	"runtime": "92",
	"tags": [
		"Action",
		"Crime",
		"Thriller"
	],
	"rating": 6.4,
	"actors": [
		"John Travolta",
		"Jonathan Rhys Meyers",
		"Kasia Smutniak",
		"Richard Durden",
		"Bing Yin",
		"Amber Rose Revah",
		"Eric Godon",
		"François Bredon",
		"Chems Dahmani",
		"Sami Darr"
	],
	"staff": [
		"Pierre Morel",
		"Adi Hasak",
		"Luc Besson",
		"India Osborne",
		"David Buckley",
		"Michel Abramowicz",
		"Frédéric Thoraval",
		"Swan Pham",
		"Jacques Bufnoir"
	],
	"votes": 122304,
	"cover": "https://m.media-amazon.com/images/M/MV5BNThhNDcyYjktNTNkOC00NDFmLTkyMjAtNGU2NjYyY2ZlMjBhXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "A personal aide to the U.S. Ambassador in France, James Reese (Jonathan Rhys Meyers) has an enviable life in Paris and a beautiful French girlfriend, but his real passion is his side job as a low-level operative for the CIA. But even here, he is relegated to menial jobs such as changing registration plates of cars and to handle security for the Ambassador. He only watches from a distance when field agents of the CIA come in secretly to use the logistics set up by Reese and proceed to complete their assignments.\nReese wants to become a higher-level agent with more responsibilities. Reese wants to be considered for the special operations assignments for the CIA.\nAs the result of a shortage of agents in France, he is assigned as a partner to special agent Charlie Wax (John Travolta). Reese is told that if he can pull this job, he would be considered as part of the special ops club.\nJust before leaving for his new assignment, Reese's girlfriend Caroline gifts him a ring, which she says belonged to her father.Reese's first test is to have Wax released from airport detention by the French Customs when Wax does not want to surrender the cans of his favorite energy drink. Despite the apparent triviality of an energy drink that Wax could probably purchase in Paris, Wax continues to verbally abuse French Customs until Reese places a Diplomatic Mail sticker on Wax's luggage containing the energy drink, which makes them immune from Customs and Quarantine requirements.Once in the car, Wax apologizes for his behavior while opening the tins and revealing the concealed pieces of his personal SIG Sauer, which he refers to as \"Mrs. Jones\".\nWax asks Reese to drive him to a Chinese restaurant. Once there, Wax starts a shootout with the restaurant staff, who are very well armed themselves. After everybody is dead, Wax reveals that the restaurant is a hub for supplying cocaine to the city.Wax explains that he has been sent to Paris to investigate a drug ring at least indirectly responsible for the death of a woman (the woman overdosed on drugs at a party) who happens to be the niece of the Secretary of Defense.\nWax and Reese follow the surviving waiter to the owner Mr. Wong (Yin Bing) of the restaurant. Wax confronts the owner and gets the name of the person who supplies the cocaine to his restaurant.During the investigation, Wax reveals that there was no overdose-their goal is to trace the money back to a circle of Pakistani terrorists.\nWax takes Reese to a brothel, controlled by a Pakistani, and enters it pretending to be a customer. Reese sees Caroline in that part of town and is worried that she will judge him as he was seen with Wax and a prostitute. Wax says that Reese should ask what Caroline was doing in that part of town.\nWax observes the Pakistani withdrawing money from a next-door bank in a large carry bag and decides to pursue him.\nEvidence leads them to the hide out of the terrorists, resulting in an armed confrontation in which most of the terrorists are neutralized.\nWax and Reese learn that the terrorists plan to infiltrate the U.S. Embassy with explosives hidden beneath their burkas. As they collect evidence, they find photographs of Agent Reese pinned to a wall.Wax and Reese hide at Caroline's apartment and meet one of her friends. Wax is told by his handlers that the friend's number was found on the cell phone of every dead terrorist found that day. Wax shoots down Caroline's friend.\nWax discovers that Reese's fiance Caroline (Kasia Smutniak) is a \"sleeper\" agent who was assigned to infiltrate them. Caroline was able to track Wax and Reese through the ring that she gave him earlier that week.\nWhen confronted, Caroline shoots Reese in the shoulder and escapes through a window. A Volvo picks her up on the street below.Going through Caroline's apartment he finds the drawings of a burqa, Reese learns that the terrorists are targeting an African AID summit meeting, to which Reese had access.\nWax goes after the car in which Caroline escaped, while Reese heads to the summit. Wax tells Reese that Caroline is likely to be wearing a shock activated vest, and so Reese will have to shoot her in the head.Caroline attempts to detonate an explosive vest while the last remaining terrorist in the Volvo attacks a US motorcade traveling to the summit by speeding towards them, wired with explosives. Wax destroys the vehicle with an AT4 rocket launcher just in the nick of time. Reese finds Caroline at the summit and attempts to dissuade her from carrying out her mission by professing his love. She attempts to detonate her vest anyway and Reese is forced to kill her.As Wax leaves Paris, Reese escorts him to his plane. Wax offers a full-time partnership. The two play a game of chess on the tarmac, placing their handguns on a utility cart, Reese revealing that he is now carrying a Desert Eagle pistol and earning another modicum of admiration from his new partner.",
	"links": []
}