{
	"title": "Män som hatar kvinnor",
	"release_year": "2009",
	"runtime": "152",
	"tags": [
		"Crime",
		"Drama",
		"Mystery",
		"amazon"
	],
	"rating": 7.8,
	"actors": [
		"Michael Nyqvist",
		"Noomi Rapace",
		"Ewa Fröling",
		"Lena Endre",
		"Sven-Bertil Taube",
		"Peter Haber",
		"Peter Andersson",
		"Marika Lagercrantz",
		"Ingvar Hirdwall",
		"Björn Granath"
	],
	"staff": [
		"Niels Arden Oplev",
		"Nikolaj Arcel",
		"Rasmus Heisterberg",
		"Stieg Larsson",
		"Søren Stærmose",
		"Jacob Groth",
		"Eric Kress",
		"Anne Østerud",
		"Tusse Lande",
		"Niels Sejer"
	],
	"votes": 224473,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTc2Mjc0MDg3MV5BMl5BanBnXkFtZTcwMjUzMDkxMw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "December 2002, Mikael Blomkvist (Michael Nyqvist), publisher of Millennium magazine, loses a libel case involving allegations he published about billionaire financier Hans-Erik Wennerström (Stefan Sauk). Lisbeth Salander (Noomi Rapace) is a surveillance agent contracted to investigate Blomkvist. Salander delivers a comprehensive report on Blomkvist to a lawyer, Dirch Frode (Ingvar Hirdwall), on behalf of his only client, 82-year-old Henrik Vanger (Sven-Bertil Taube). Salander tells Frode that Blomkvist is clean & he was framed somehow in the Wennerstrom case, but that is her personal opinion & exempted from the report. Vanger hires Blomkvist to investigate the disappearance of his great-niece, Harriet, who vanished on Children's Day in 1966. Vanger believes that Harriet was murdered by a family member. Vanger tells Mikael that his father used to work for Vanger in 1965 & Mikael himself had played with Harriet on occasions. Harriet disappeared in 1966 when the entire Vanger family had gathered on a Swiss island for the annual board meeting. there was an accident on the only approach bridge connecting the island to the mainland, blocking traffic for 24 hrs. Harriet disappeared during that time. One of the family members is the killer. Vanger selected Blomkvist because of his spotless reputation.When Lisbeth Salander is told that her current legal guardian has suffered a stroke, & she is instructed to meet her new guardian lawyer Nils Bjurman (Peter Andersson), who takes control of her finances. Bjurman, a sexual sadist, forces Salander to perform fellatio on him in return for access to her bank account. At their next meeting, he beats her, handcuffs her to his bed, and anally rapes her, not knowing that Salander is recording the incident with a hidden video camera.After Salander recovers from the rape, she pays Bjurman an unexpected visit. She stuns him with a taser and ties him up. She compels him to relinquish control of her finances and in one year's time to recommend termination of her state guardianship. Failure to comply with her demands will result in the release of the DVD evidence of her rape to the media. Salander tattoos Bjurman's abdomen with the message \"I am a sadist pig and a rapist\". Salander has a huge tattoo of a dragon on her back.Blomkvist moves into a cottage on the Vanger estate. Vanger tells him that his three brothers (Harald, Richard & Gottfried) were all members of the Swedish Nazi Party. Of the three, only Harald is still living. Harriet was Gottfried's daughter & MArtin was her brother. Martin now lives on the island & is head of the Vanger group of companies. Gottfried's wife Isabella is alive & was a terrible mother to Harriet. Harald had daughter Cecilia (Who no longer speaks to Harald). Cecilia had a sister Anita who died of cancer. Inside Harriet's Bible, Blomkvist finds a list of five names alongside what appear to be phone numbers. He visits police inspector Morell (Björn Granath), who informs him that his investigation team had been unable to decipher them. Using a series of photographs taken during the Children's Day parade, Blomkvist believes that Harriet may have seen someone that day who may have killed her. Gottfried had died one yr before Harriet's disappearance at a cottage on the island by drowning in a nearby lake. Harriet used to visit the cottage often with Anita.Blomkvist realizes that a woman took photos at the parade of Sep 1966 of the side of the street, where Harriet saw someone that made her leave suddenly. He traces the woman & finds the picture that reveals the hazy outline of a man.\nUsing her access to Blomkvist's computer, Salander discovers the meaning of the numbers next to the names and sends an email to Blomkvist. Upon discovering that his computer has been hacked, Blomkvist is directed by Dirch Frode to Salander's apartment. He convinces her to help him with the case, and she joins him at the cottage. Together, using the clue that Salander discovered, they connect all but one of the names on Harriet's list to murdered women between 1945 and 1955. They are all Jewish names, leading Blomkvist and Salander to suspect that the murders were motivated by anti-Semitism.Henrik has a heart attack & is hospitalized. The Vanger family led by Martin & Isabella urge Blomkvist to quit, but he refuses (Harald is deer hunting & is unable to attend). Blomkvist realizes that the woman in 1966 photos is not Harriet, but her cousin Anita who looked remarkably similar to Harriet. Blomkvist is shot at by a man in deer hunting costume. Inspector Morell finds the last missing name on the bible list. That lady was also brutally murdered in Jan 1965, & used to be Gottfried's secretary. Gottfried died in the lake, shortly thereafter.They suspect the reclusive Harald Vanger (Gösta Bredefeldt) to be the culprit, as the two other Vanger brothers (Richard & Gottfried) had already died by the time Harriet disappeared. Salander searches through Vanger's business records to trace Harald to the crime scenes, while Blomkvist breaks into his house. Harald attacks Blomkvist, but Harriet's brother, Martin (Peter Haber), shows up and escorts Blomkvist to his home. When Blomkvist reveals what he has uncovered, Martin drugs him. In the meantime, Salander investigates the receipts & accounts of the Vanger company & finds that it wasn't Harald who traveled to all the murder locations, but it was Martin and his father Gottfried who traveled on those exact dates & were responsible for the murders. She returns to the cottage to find Blomkvist missing.Blomkvist wakes to find himself bound in Martin's cellar. Martin confesses to decades of rape and murder, but denies killing Harriet. Salander appears and attacks Martin with a golf club. While she frees Blomkvist, Martin flees in his car. Salander gives chase on her motorcycle. Martin drives his car off the road and dies in a fiery crash as Salander watches without attempting to rescue him.Blomkvist meets with Henrik and Morell to inform them that Martin did not kill Harriet. He flies to Australia and discovers Harriet living under her dead cousin Anita's name. He returns her to Sweden to be reunited with Henrik. Harriet reveals that she killed her father Gottfried, who, along with her brother Martin, had been sexually abusing her. Fearing for her life when she saw Martin at the Children's Day parade, she fled the estate with Anita's help.Salander visits Blomkvist in prison and gives him new information on the Wennerström case. Blomkvist publishes a new story on Wennerström in Millennium, which is a sensation, and he is released from prison. Wennerström is found dead, and his offshore bank account in the Cayman Islands is raided. The police suspect a young woman caught on CCTV. Blomkvist is convinced that she is Salander in disguise. The film ends with the same woman walking along a sunny beach promenade.",
	"links": [
		"https://www.amazon.com/Girl-Dragon-Tattoo-English-Subtitled/dp/B008WQUO78"
	]
}