{
	"title": "The Ghost Writer",
	"release_year": "2010",
	"runtime": "128",
	"tags": [
		"Crime",
		"Drama",
		"Mystery",
		"amazon"
	],
	"rating": 7.2,
	"actors": [
		"Ewan McGregor",
		"Pierce Brosnan",
		"Olivia Williams",
		"Jon Bernthal",
		"Tim Preece",
		"Jim Belushi",
		"Timothy Hutton",
		"Anna Botting",
		"Yvonne Tomlinson",
		"Milton Welsh"
	],
	"staff": [
		"Roman Polanski",
		"Robert Harris",
		"Roman Polanski",
		"Robert Benmussa",
		"Roman Polanski",
		"Alain Sarde",
		"Alexandre Desplat",
		"Pawel Edelman",
		"Hervé de Luze",
		"Fiona Weir",
		"Albrecht Konrad"
	],
	"votes": 171875,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTI3NzMwMzkyNV5BMl5BanBnXkFtZTcwODk4NjQxMw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "An unnamed British ghostwriter (Ewan McGregor) is recruited to complete the memoirs of former UK Prime Minister Adam Lang (Pierce Brosnan). His predecessor on the project and Lang's long-term aide, Mike McAra, died in an apparent accident. McAra's car was found abandoned on a ferry and his body found on a far off beach, suggesting that he committed suicide by jumping off the ferry.The writer travels to the fictional Massachusetts village of Old Haven on Martha's Vineyard, where Lang is staying with his wife, Ruth (Olivia Williams), and a staff of servants and security personnel. The writer is checked into a small hotel. Lang's personal assistant (and mistress), Amelia Bly (Kim Cattrall), forbids him to take McAra's manuscript outside, emphasizing that it is a security risk.Shortly after the writer's arrival, Lang is accused by former Foreign Secretary Richard Rycart (Robert Pugh) of authorizing the illegal seizure of suspected terrorists and handing them over for torture by the CIA, a possible war crime. Lang faces prosecution by the International Criminal Court unless he stays in the U.S. or any other country that does not recognize the court's jurisdiction. As reporters and protesters swarm the island, the writer is moved into McAra's old room at Lang's house, where personal belongings have not been cleared out yet. Lang then travels to Washington, D.C.. While clearing the room, the writer finds an envelope containing photographs of Lang's university days that suggest McAra may have stumbled across clues to a dark secret. The secret being that Adam had been a part of the party for 2 yrs before he met Ruth, while publicly the story is that Adam joined the party after he met Ruth during his days at Campbridge. Among the material is a handwritten phone number he rings and is answered by Rycart.During a bicycle ride around the island, the writer encounters an old man (Eli Wallach) who tells him that the current couldn't have taken McAra's body from the ferry where he disappeared to the beach where it was discovered. He also reveals that a neighbor saw flashlights on the beach the night the body was discovered, but later fell downstairs and went into a coma. The writer is later intercepted by Ruth and her security guard, who take him back to the estate. There, Ruth admits that Lang has never been very political, and until recently had always taken her advice. When the writer tells her the old man's story, she suddenly rushes out into the rainy night to \"clear her head.\" Upon returning, she confides in the writer that Lang and McAra had argued the night before he died. She and the writer end up sleeping together.The next morning, the writer decides he is getting too intimate with his subject and to move back to the hotel, taking the car that McAra used on his last journey. The writer follows the Pre-programmed directions on the car's sat-navigation that eventually lead him to Belmont, and the home of Professor Paul Emmett (Tom Wilkinson). Emmett denies anything more than a cursory acquaintance with Lang, despite the writer showing him two photographs of the pair, as well as another one on the wall of Emmett's study.When the writer tells Emmett that the sat-navigation proves McAra visited him on the night he died, Emmett denies any knowledge and becomes evasive. The writer leaves Emmett's estate, and is forced to elude pursuit by a car. The writer boards the ferry back to Martha's Vinyard, but when he sees the car that had followed him drive aboard, with two men looking for him, he flees the boat at the last moment and checks into a small motel by the ferry dock.Not knowing to whom to turn, the writer again dials Rycart's cell phone asking for help. While waiting for Rycart to pick him up at the motel, the writer does research on Emmett and links his think tank to a military contractor. He also finds leads that connect Emmett to the CIA. When Rycart arrives, he reveals that McAra gave him documents linking Lang to torture flights, and that claimed he had found something new which he wrote about in the \"beginning\" of the manuscript. The men cannot, however, find anything in the early pages. The writer and Rycart further discuss Emmett's relationship with Lang, with Rycart recounting how Lang's decisions uniformly benefited U.S. interests when he was Prime Minister. When the writer is summoned to accompany Lang on the return flight, he confronts Lang and accuses him of being a CIA agent recruited by Emmett. Lang derides his suggestions.Upon leaving the aircraft, Lang is assassinated by a British anti-war protester, who is in turn shot by Lang's bodyguards. Despite Lang's death, the writer is asked to complete the book for posthumous publication, as in light of the assassination, it will be a certain bestseller. During the book's launch party in London, Amelia unwittingly tells the writer that the Americans tightened access to the book, as the \"beginnings\" contained evidence that threatened national security. She also tells him that Emmett was Ruth's tutor when she was a Fulbright scholar in Harvard. The writer realizes that the clues were hidden in the original manuscript at the beginning of each chapter, and discovers the message, \"Lang's wife Ruth was recruited as a CIA agent by Professor Paul Emmett of Harvard University.\" Ruth shaped Lang's every political decision to benefit the U.S., under direction from the CIA.The writer passes a note to Ruth telling of his discovery. She unfolds the note, and is devastated. When she sees the writer raising a glass, she is kept from following him by Emmett and other assistants. As the writer leaves the party he attempts to take a taxi, without success, and as he crosses the street off-camera, a car accelerates in his direction, and sound effects and flying papers indicate that he has been hit.",
	"links": [
		"https://www.amazon.com/Ghost-Writer-Ewan-McGregor/dp/B003SJ4VJ6"
	]
}