{
	"title": "Wrath of Man",
	"release_year": "2021",
	"runtime": "119",
	"tags": [
		"Action",
		"Crime",
		"Thriller",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Jason Statham",
		"Holt McCallany",
		"Josh Hartnett",
		"Rocci Boy Williams",
		"Jeffrey Donovan",
		"Scott Eastwood",
		"Andy Garcia",
		"Deobia Oparei",
		"Laz Alonso",
		"Raúl Castillo"
	],
	"staff": [
		"Guy Ritchie",
		"Nicolas Boukhrief",
		"Éric Besnard",
		"Guy Ritchie",
		"Ivan Atkinson",
		"Ivan Atkinson",
		"Bill Block",
		"Guy Ritchie",
		"Christopher Benstead",
		"Alan Stewart",
		"James Herbert",
		"Chelsea Ellis Bloch",
		"Daniel Hubbard",
		"Marisol Roncali",
		"Martyn John"
	],
	"votes": 213682,
	"cover": "https://m.media-amazon.com/images/M/MV5BODE4ZGY4OTktNDBjMy00NGVkLTk5YWUtNjA3NGU3MTA5NzM0XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In Los Angeles, an armored truck robbery leaves two guards and a bystander dead. This sets off a chain reaction of events, told in four parts.A Dark Spirit (Part 1) -- Five months after the robbery, Patrick Hill (Jason Statham) joins Fortico Security as an armored truck guard. His manager Terry (Eddie Marsan) commends his references, and company trainer Haiden \"Bullet\" Blaire (Holt McCallany) nicknames him \"H\". Hill barely passes his training, and gets off to a rocky start with his colleagues, including \"Boy Sweat\" Dave (Josh Hartnett), Sticky John (Alex Ferns), Shirley (Tadhg Murphy), Stuart (Alessandro Babalola), \"Hollow\" Bob Martin (Rocci Boy Williams as Rocci Williams) and Dana Curtis (Niamh Algar). H has replaced Sticky John in his job, who has been relegated to a desk job. Sticky John tries to get to know H, but H is not the social type. H is assigned to a daily detail with Bullet and Dave.\nDuring a drop-off of $2.5 million in cash, Bullet is taken hostage. Hill convinces a panicked Dave to comply with the robbers' demands, before disposing of the entire crew with expert marksmanship and merciless efficiency. Before killing them, H wants to know whom the robbers work for.Questioned by FBI agents investigating the robbery (they are same guys who are investigating the robbery from 5 months ago. H denies there is any connection between the 2 robberies), Hill is assigned to desk duty as a precaution, but Fortico's CEO Blake Halls (Rob Delaney) returns him to working in the field.\nThe investigators Hubbard (Josh Cowdery) & Okey (Jason Wong) identify him to their superior, Agent King (Andy Garcia), as someone the FBI has been hunting for 25 years, but King tells them to leave Hill alone. An associate Kirsty (Lyne Renée) delivers Hill a dossier of Fortico employee files, photos of Dana's family, and an autopsy report.Three months later, Hill and Bullet are waylaid in Chinatown, but the robbers flee at the sight of Hill. Bullet and Dave share their suspicions about Hill with each other. Dana takes H out for a date, and H questions Dana at gunpoint about her stash of $125,000. She claims to have stolen the cash from a liquor store pickup, and Hill shows her photos of her parents, threatening them if she is withholding information.Scorched Earth (Part 2) -- Five months before joining Fortico, on the day of the first robbery, Hill is with his son Dougie (Eli Brown). Revealed to be working with his own robbery crew, Hill grudgingly agrees to monitor the armored truck's route, leaving Dougie in the car. But turns out that there were 2 teams of robbers after the truck. The 2nd team of robbers hijack the truck much before Hill's team, and spot Dougie nearby in Hill's car (which was parked right next to the spot where the truck was stopped). Racing back to his son, Hill watches as Dougie is executed, and is shot himself and left for dead. Three weeks later, Hill wakes up in the hospital. Blaming him for Dougie's death, his wife Jane (Eve Macklin) leaves him. He meets with King, who gives him a list of possible suspects and agrees to temporarily turn a blind eye.Hill is actually Mason Hargreaves, a notorious crime lord; determined to find Dougie's killer, Hargreaves and his men - led by Mike (Darrell D'Silva), Brendan (Cameron Jack), and Moggy (Babs Olusanmokun) - kill nearly everyone on King's list, without results. They even find a crime family with $2.5 M stashed in the house, but Mike and Moggy reckon its not the team they are looking for.\nMike voices his concerns about retaliation (& suggests that it was perhaps an inside job with Fortico), and Hargreaves agrees to lay low in London, but instead assumes the identity of Patrick Hill and joins Fortico to continue the hunt himself. It was Hargreaves' own crew who attempted the Chinatown robbery, until Mike recognized him.Bad Animals, Bad (Part 3) -- Sometime before the first robbery, a group of disgruntled veterans - Carlos (Laz Alonso), Sam (Raúl Castillo), Brad (Deobia Oparei), Tom (Chris Reilly), Jan (Scott Eastwood), and their former sergeant, Jackson (Jeffrey Donovan) - decide to become thieves. They rob Carlos's wealthy client (Carlos was working as a security guard after his discharge from the military), resulting in only a few hundred thousand dollars. With help from an unidentified guard (working inside Fortico) who served under Jackson, they pull off a more ambitious heist ($6 M) of an armored truck. Turns out Jackson's crew and Hargreaves crew went after the same truck and events of the first robbery ensued; unaware of Hargreaves' identity, Jan needlessly shoots the guards, Dougie, and Hargreaves, who sees Jan's face.Liver, Lungs, Spleen & Heart (Part 4) -- Five months later, the veterans reunite to steal over $150 million from the Fortico depot on Black Friday weekend. Bullet reveals to Hargreaves that he is Jackson's inside man (and he admits to playing his part in the first robbery), threatening him into cooperating. Jackson's crew boards H's and Bullet's truck, while Bullet had disabled the cameras. Bullet needed H to get the crew inside the depot. The crew takes the depot hostage, but an alarm is triggered; in the ensuing gunfight, Bullet kills Dana and Dave, and Hargreaves kills several of the robbers. Fleeing with Bullet and Jackson, Jan kills them to escape alone with the money.Jan finds a phone in one of the money bags, planted by Hargreaves to track its location. Hargreaves confronts him with Dougie's autopsy report, shooting him in the same places he shot Dougie. Abandoning the money, Hargreaves tells King his task is done and is driven away.",
	"links": [
		"https://www.amazon.com/Wrath-Man-Guy-Ritchie/dp/B0B6G69VB1"
	]
}