{
	"title": "Blue Valentine",
	"release_year": "2010",
	"runtime": "112",
	"tags": [
		"Drama",
		"Romance",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"Ryan Gosling",
		"Michelle Williams",
		"John Doman",
		"Faith Wladyka",
		"Mike Vogel",
		"Marshall Johnson",
		"Jen Jones",
		"Maryann Plunkett",
		"James Benatti",
		"Barbara Troy"
	],
	"staff": [
		"Derek Cianfrance",
		"Derek Cianfrance",
		"Joey Curtis",
		"Cami Delavigne",
		"Lynette Howell Taylor",
		"Alex Orlovsky",
		"Jamie Patricof",
		"Grizzly Bear",
		"Andrij Parekh",
		"Jim Helton",
		"Ron Patane",
		"Cindy Tolan",
		"Inbal Weinberg"
	],
	"votes": 213685,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTU4MTQ2MzA1Ml5BMl5BanBnXkFtZTcwODE3NTgwNA@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "In the movie, the present time-line is inter-cut with the story of how Dean and Cindy became involved.Dean (Ryan Gosling) is a young high school dropout, working for a moving company in Brooklyn. Cindy (Michelle Williams) is a Pre-med student living with her constantly fighting parents and also caring for her grandmother in Pennsylvania. Cindy and Dean meet at Cindy's grandmother's nursing home while Dean is delivering furniture to a nursing home in Pennsylvania, he runs into Cindy, who is visiting her grandmother.\nInitially pushy with his advances, he gives her his work number but she never calls; however, they coincidentally meet again on a bus and begin seeing each other.\nCindy discovers she is pregnant and tells Dean that the baby is most likely not his, as her ex-boyfriend Bobby (Mike Vogel) didn't use protection. Dean asks Cindy whether or not she wants to keep the baby. At an abortion clinic, Cindy decides at the last moment to cancel the procedure, and on a bus ride home, Dean tells her he doesn't mind if the child is not his, and that he wants to begin a family with her. Before the wedding, Bobby finds out about Dean and beats him up. Cindy and Dean soon get married at a Justice of Peace.Five years later, the couple lives in rural Pennsylvania with their daughter Frankie (Faith Wladyka). Dean works at painting houses while Cindy is a nurse at a clinic. One evening, Dean insists on taking Cindy out for a romantic getaway at a motel so they can have some time off from their preoccupied lives, much to Cindy's reluctance.While buying wine in a liquor store, Cindy sees Bobby, who asks Cindy if she has ever cheated on her husband. She hesitates, but eventually says no. In the car, Cindy and Dean get into an argument when she mentions seeing Bobby again. At the motel, they continue fighting during sex. Dean wants to have another Child with Cindy and Cindy brushes him off. Then Cindy tries to stop Dean from having sex with her and when he complains, she takes off her panties, and lets him have sex with her without any complaint.Cindy is called away early in the morning to work at the clinic, and she leaves a note for Dean. At the clinic, Cindy's boss, Dr. Feinberg (Ben Shenkman), talks to her about a position he had offered her, and asks if she would move closer to work, suggesting that they would be able to spend time together on weekends.\nMeanwhile, Dean drives around while drinking and smoking, and is shown to be painting houses for work. While driving to an event at Frankie's school, Cindy finds Megan dead by the roadside. She arrives late to the event. Dean is already there; when she tells Dean what she found, he blames her for leaving the gate open while she silently breaks down in tears. When they get home, Dean breaks down and Cindy comforts him. Later, despite Cindy's reluctance due to being scheduled as on-call for work the following day, Dean insists on a getaway at a motel 2 hours away to \"get drunk and have sex\". They drop Frankie off at Cindy's dad. Dean does not enter the home; when Cindy asks why, he states he cannot smoke near Cindy's father's oxygen tank. While driving them to the motel, Cindy stops by a liquor store and has an awkward encounter there with her ex, Bobby, which causes an ensuing argument in the car between her and Dean.\nImmediately after arriving at the motel, Dean repeatedly tries to seduce Cindy in the shower and afterwards, but she rebuffs him. Dean and Cindy proceed to drink alcohol. Overwhelmed by his advances and frustrated with his lack of ambition, she questions Dean while they are drunk which leads to another explosive outburst. Dean continues his advances and Cindy gives in but is disappointed when Dean asks if she wants to have another child with him. Their argument becomes explosive again and she locks the door between them, leaving him outside the bedroom. At 6 am, Cindy is called in for work to start at 9 am. She takes the car and leaves a note for Dean. At the clinic, Dr. Feinberg recommends that Cindy move into an apartment near the new clinic instead of moving her family, off-hand suggesting that they could keep each other company if she is lonely which visibly upsets Cindy.Back at the motel, an annoyed Dean finds the note upon waking and shows up drunk at the clinic. Dean forces his way in while yelling at Cindy, following her from room to room, as the clinic receptionist attempts to intervene. They have a heated argument. Dr. Feinberg hears the commotion and also attempts to intervene, and Dean punches him. Dr. Feinberg then fires Cindy, threatens to call the cops on Dean, and kicks them both out. While leaving, Cindy demands a divorce, causing Dean to throw away his wedding ring, but they attempt to look for it. Back at her parents' house, Dean tearfully pleads with an upset Cindy to give the marriage another chance for Frankie. Cindy says she doesn't want Frankie to grow up with parents who despise each other like she did, and that she cannot cope with his behavior.Dean reminds Cindy of their wedding vows, and the two apologize to each other. Dean is seen walking away from the house, with Frankie running after him. Dean tells Frankie to go back to her mom despite Frankie begging him to stay. Dean tricks Frankie by challenging her to a race in an attempt to send her back to Cindy, and he continues walking away while Cindy picks up an upset Frankie, who cries \"I love him.\"",
	"links": [
		"https://www.amazon.com/Blue-Valentine-Ryan-Gosling/dp/B004R170M4"
	]
}