{
	"title": "An Education",
	"release_year": "2009",
	"runtime": "100",
	"tags": [
		"Drama",
		"amazon"
	],
	"rating": 7.2,
	"actors": [
		"Carey Mulligan",
		"Peter Sarsgaard",
		"Alfred Molina",
		"Olivia Williams",
		"Cara Seymour",
		"William Melling",
		"Connor Catchpole",
		"Matthew Beard",
		"Amanda Fairbank-Hynes",
		"Ellie Kendrick"
	],
	"staff": [
		"Lone Scherfig",
		"Lynn Barber",
		"Nick Hornby",
		"Finola Dwyer",
		"Amanda Posey",
		"Paul Englishby",
		"John de Borman",
		"Barney Pilling",
		"Lucy Bevan",
		"Andrew McAlpine"
	],
	"votes": 138716,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTg4NjgzOTc0MF5BMl5BanBnXkFtZTcwOTc2OTE3Mg@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1961 London, Jenny Mellor (Carey Mulligan) is a 16-year-old schoolgirl on track to get accepted to Oxford University. Her studies are controlled by her strict father, Jack (Alfred Molina). Her parents (Mother Marjorie (Cara Seymour)) are conservative & want the best for her. They trust Jenny completely & give her the freedom to live her life the way she wants.But her parents are very disapproving of all the class boys that Jenny brings to her home. Jenny's dad likes people who know what they want to be doing in life. He appreciates Jenny for her focus on getting into Oxford & hence automatically disapproves of any young man who comes into their home & says that they aren't sure of what they want to be doing next in life. He calls them \"teddy boy\".After youth orchestra rehearsals, Jenny waits at a bus stop on the street in heavy rain when David Goldman (Peter Sarsgaard), an older man stops his Bristol 405 and tells her that he is a music lover and is worried about her cello getting wet, and he convinces Jenny to put her cello in his car while she walks alongside. As the rain becomes heavier, Jenny asks David if she can sit inside the car. The two talk about music and, before being dropped off, Jenny confides that she is looking forward to attending university and being able to live a life of culture, doing things such as going to art galleries and watching French films. The following week, David has flowers delivered to Jenny's house, wishing her luck at her youth orchestra's concert. Later, she sees him in town and approaches him. David asks Jenny if she is free to go and see a concert and have supper with him and his friends. She happily agrees and thanks him.On the night of the concert, Jack disapproves of Jenny going, but when David comes by to pick up Jenny, he easily charms Jack into letting him take Jenny and bring her home later than her normal curfew.\nDavid introduces Jenny to his equally charming friends, including a lady by the name of Helen (Rosamund Pike) who ends up becoming a mentor to Jenny in the grown-up group of David's. Jenny is smitten by the high lifestyle of effortless elegance of Helen & wants to emulate her. Danny (Dominic Cooper) is Helen's \"boyfriend\" & by the looks of it is enormously wealthy. Danny & David are friends with each other. David, Helen and Danny seem to hang out together for too often.\nFinding she is also interested in art, they invite Jenny to an art auction. David picks up Jenny at school and they go to the auction, winning a bid for a painting by Edward Burne-Jones and going to Danny's place afterwards.Jenny starts spending a lot of time with this group & her grades start slipping at school. David even manages to convince Jenny's parents to send her away on a weekend trip with him on the pretext of a chance meeting with a famous author Clive Lewis (one of Jenny's favorites who wrote The Chronicles of Narnia) who is currently visiting Oxford. That night David acts as gentleman with Jenny & doesn't force her into sleeping with him, although there is fondling.\nJenny then shows a signed copy of The Lion, the Witch and the Wardrobe to her parents (in fact signed by David, as they had never met Lewis). Impressed by David's connections and charisma, Jack and Marjorie approve of their romantic relationship.Later, Jenny discovers that David is a con man who makes money through a variety of shady practices. She is initially shocked but silences her misgivings in the face of David's persuasive charm.\nSoon, David takes Jenny to Paris as a 17th birthday gift. Jenny's parents invite Graham (Matthew Beard), a boy Jenny knows from Youth Orchestra to Jenny's birthday party, but David arrives, and Graham goes home. David takes Jenny to Paris and that night David and Jenny have sex for the first time.In Paris, the two go sight-seeing, take photos, and go dancing, and Jenny loses her virginity to David. Back in London, Jenny gives her favorite teacher, Miss Stubbs (Olivia Williams), Chanel perfume as a gift from her trip, but Miss Stubbs refuses the gift, telling Jenny that she knows where it came from and is both concerned and disapproving of her relationship with David. They argue and have a falling-out. Later that night, David proposes marriage. After talking with her parents, Jenny accepts the proposal, but the news causes an argument with her headmistress Miss Walters (Emma Thompson), and she decides to drop out of school and not pursue a place at university.When David proposes marriage, Jenny accepts and leaves school. All of Jenny's teachers plead with her to continue on her journey to Oxford, but Jenny is exulted with the attention she is getting & accepts David's offer. Her parents aren't the least bit bothered & in fact her dad seems happy that now Jenny will be well looked after & there is no need for her to go to oxford after all.She one night, while David is treating Jenny's family to dinner, Jenny happens to check David's mail & discovers David is already married. Shocked, Jenny tells David to take her and her parents back home. Jenny tearfully argues with David, telling him she gave up her education to be with him. David says he will get a divorce and agrees that he will tell her parents the truth with her, but after she goes inside her house, he drives off and is never seen again.Jenny despairs, and goes to see Danny and Helen, blaming them for not telling her the truth early on. She also blames her parents for encouraging her to throw her life away with an older man. Jenny goes to see David's wife Sarah (Sally Hawkins), who tells her that David is a serial adulterer, and has a son. Later that night, Jack apologizes to Jenny, admitting that he messed up and that he believed David could give her the life she wanted.Jack points out that although David wasn't who he said he was, Jenny had also deceived her parents about David's nature by playing along with some of David's lies to her parents. When Jenny is then refused re-admission to her old school to repeat her last year and take her exams, she goes to Miss Stubbs, apologizing and asking for her help. Miss Stubbs eagerly agrees, and Jenny resumes her studies and is accepted at Oxford the following year. In a closing voiceover, Jenny shares a story about dating boys her age and starting over with fresh eyes, despite her experience with David.",
	"links": [
		"https://www.amazon.com/Education-Peter-Sarsgaard/dp/B0032W5H9C"
	]
}