{
	"title": "District 9",
	"release_year": "2009",
	"runtime": "112",
	"tags": [
		"Action",
		"Sci-Fi",
		"Thriller",
		"amazon"
	],
	"rating": 7.9,
	"actors": [
		"Sharlto Copley",
		"David James",
		"Jason Cope",
		"Jason Cope",
		"Vanessa Haywood",
		"Mandla Gaduka",
		"Kenneth Nkosi",
		"Eugene Khumbanyiwa",
		"Louis Minnaar",
		"William Allen Young",
		"Nathalie Boltt"
	],
	"staff": [
		"Neill Blomkamp",
		"Neill Blomkamp",
		"Terri Tatchell",
		"Carolynne Cunningham",
		"Peter Jackson",
		"Clinton Shorter",
		"Trent Opaloch",
		"Julian Clarke",
		"Denton Douglas",
		"Philip Ivey"
	],
	"votes": 723662,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTM4OTI1OTM5NF5BMl5BanBnXkFtZTcwMzk5MTU1Mg@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "In 1982, a giant extraterrestrial spaceship arrives at Earth and hovers over the South African city of Johannesburg. The doors didn't open for 3 months and finally A human investigation team (who cuts through the doors to enter the spacecraft) finds over one million malnourished aliens (derogatorily called \"Prawns\") inside, and the South African government relocates them to a terrestrial camp called District 9. However, over the years it turns into a slum, and locals from Earth often complain that the aliens are filthy, ignorant lawbreakers who bleed resources from humans.Sarah Livingstone (Nathalie Boltt), a sociologist at Kempton Park University was part of the first contact team. The camp was supposed to be temporary, but since there was no plan, district 9 became permanent. Michael Bloemstein (Vittorio Leonardi), MNU Department of Alien Civil Affairs knows that the aliens are here to stay. Dirk Michaels (William Allen Young), the CEO of MNU.\nIt is theorized that the ship is inoperable as its command module detached and mysteriously \"disappeared\".20 yrs since their arrival, and Following unrest between the aliens and locals (Locals want the aliens gone, as they have acquired arms and are resorting to crime), the government hires Multinational United (MNU), a huge weapons manufacturer, to relocate the aliens (now 1.8 MM of them) to a new camp outside the city. Piet Smit (Louis Minnaar), an MNU executive, appoints MNU employee and his son-in-law Wikus Van De Merwe (Sharlto Copley) (a mild-mannered, bumbling, awkward bureaucrat at the MNU Department of Alien Affairs), to lead the relocation. The \"prawns\" resist and the relocation goes slow.Nigerians are running many scams in district 9, including selling cat food to aliens, cross species prostitution and alien weapons. They are headed by Obesandjo. Many people believed that MNU's plan to relocate the aliens was a cover to get hands on alien weapons, which are bio-engineered to their DNA and hence cannot be operated by humans. Nigerians have the biggest cache of alien weapons, which they have amassed for 20 yrs, without the ability to use them. Obesandjo kills and eats aliens, believing that it would give him the power to use alien weapons.Meanwhile, three aliens, Christopher Johnson (Jason Cope), his young son CJ, and Christopher's friend Paul, search a District 9 garbage dump for alien fuel in Prawn technology, which Christopher has had them spend the last twenty years synthesizing enough of to enact his plan.\nThey finally finish in Paul's shack as the relocation begins, but when Wikus comes to the shack to serve Paul a notice, he finds the hidden container with the fuel and accidentally sprays some of it in his own face while confiscating it. Paul is killed by Koobus Venter (David James), a cruel leader of the MNU mercenaries who takes pleasure in killing the aliens.Wikus begins mutating into a Prawn, starting with his left arm, which was injured after the fuel exposure, and which was hidden under a large bandage. After playing down his symptoms (vomiting, nosebleed, headache, and fingernail and tooth loss), he passes out and is taken to a hospital where his left hand is now discovered to have become a prawn claw. He is transferred to the MNU lab, where researchers perform brutal experiments and discover his chimeric DNA grants him the ability to operate Prawn weaponry, that is biologically restricted for use only by the aliens (humans are biologically unable to make the alien weapons work).\nWanting to capture this human/alien Hybridity before Wikus fully transforms, Smit orders for Wikus's body to be vivisected and harvested for its profitable properties. Wikus, however, overpowers the lab personnel and escapes. While Koobus Venter's forces hunt for him, a smear story is broadcast on television, one that reaches Wikus' wife (who is Smit's daughter) Tania (Vanessa Haywood), claiming Wikus is a wanted fugitive who has contracted a contagious disease from copulating with aliens.Wikus takes refuge in District 9 (since this is only place not under constant surveillance by the humans), accidentally finding Christopher and the mother spaceship's concealed command module drop-ship underneath his slum house. Christopher explains to Wikus that the confiscated fuel is crucial to his plan of reactivating the drop-ship, and if he can get them in the drop-ship to the mothership, he can cure Wikus and reverse his physical transformation. Wikus attempts to acquire weapons from the District 9 Nigerian arms dealer Obesandjo (Eugene Wanangwa Khumbanyiwa), who wants to eat Wikus's alien arm because he believes it will grant him alien abilities. Wikus, however, seizes an alien weapon and, able to use it, escapes with a collection of weapons he and Christopher can use to attempt a retrieval of the alien fuel.Wikus and Christopher then force their way through MNU to the lab and retrieve the fuel. However, after seeing the barbaric experiments MNU has performed on his people in the lab (including a dissected Paul), Christopher tells Wikus he must return home as fast as possible for help and cannot undo Wikus' mutation until he returns in three years, due to the limited supply of the fuel. Enraged, Wikus knocks Christopher down and attempts to fly the drop-ship module to the mothership himself, but it is shot down by Koobus Venter's forces. Venter captures Wikus and Christopher, but Obesandjo's gang ambushes the MNU convoy, seizes Wikus, and brings Wikus to Obesandjo, who prepares to chop off Wikus's prawn arm.Meanwhile, CJ, remaining hidden in the drop-ship, remotely activates the mothership and a large, alien, mechanized battle suit located in Obesandjo's base. The suit guns down the Nigerians, and Wikus enters the suit and rescues Christopher from the mercenaries. Heading to the drop-ship, the two come under heavy human weapons fire, and Wikus stays behind to fend off the mercenaries, buying time for Christopher, who promises to return after three years and heal Wikus, to leave. After all of the other mercenaries are killed, Venter finally cripples the suit and is about to execute Wikus when slum aliens attack and dismember him alive. Christopher makes it into the drop-ship with CJ, and the drop-ship is levitated via a tractor beam back into the mothership, which Christopher then uses to leave Earth.Humanity is left to speculate whether or not Christopher will return to take all the remaining aliens back to their home world, or if he will return to declare war on Earth. MNU's experiments on the alien population are exposed, and the aliens are moved to the new camp, named District 10. Tania finds a metal flower on her doorstep, giving her hope that Wikus is still alive, and a now fully-transformed Wikus is shown in a junkyard crafting the flower for his wife.",
	"links": [
		"https://www.amazon.com/District-9-Sharlto-Copley/dp/B002WTOXUK"
	]
}