{
	"title": "Shutter Island",
	"release_year": "2010",
	"runtime": "138",
	"tags": [
		"Drama",
		"Mystery",
		"Thriller",
		"amazon"
	],
	"rating": 8.2,
	"actors": [
		"Leonardo DiCaprio",
		"Emily Mortimer",
		"Mark Ruffalo",
		"Ben Kingsley",
		"Max von Sydow",
		"Michelle Williams",
		"Patricia Clarkson",
		"Jackie Earle Haley",
		"Ted Levine",
		"John Carroll Lynch"
	],
	"staff": [
		"Martin Scorsese",
		"Laeta Kalogridis",
		"Dennis Lehane",
		"Bradley J. Fischer",
		"Mike Medavoy",
		"Arnold Messer",
		"Martin Scorsese",
		"Robert Richardson",
		"Thelma Schoonmaker",
		"Ellen Lewis",
		"Dante Ferretti"
	],
	"votes": 1487582,
	"cover": "https://m.media-amazon.com/images/M/MV5BN2FjNWExYzEtY2YzOC00YjNlLTllMTQtNmIwM2Q1YzBhOWM1XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "U.S. Marshals Edward (Teddy) Daniels (Leonardo DiCaprio) and Chuck Aule (Mark Ruffalo) are called to Shutter Island, a federal mental hospital for the criminally insane, because a patient named Rachel has escaped the day before. Teddy has lost his family in an apartment fire years before. McPherson (Ted Levine) is the deputy warden. Males & females are in different buildings with the most dangerous patients in building C and the marshals are told not to go without McPherson & Dr. Cawley (Ben Kingsley) accompanying them.They meet Dr. Cawley, who says one faction believes in surgical techniques like lobotomies to treat patients, where another side says that the new psychotropic drugs are the way to treat people. He explains that Rachel, had killed 3 of her kids & simply believed that they weren't dead. She thought the kids were in the hospital & all the staff were neighbors. Crawley refuses to share personnel files with Teddy. In Rachel's room they find a note saying, \"Where is number 67?\". At the staff meeting it emerges that Rachel's doc Shaheen has just left for a vacation. Teddy is furious.There are frequent flashbacks to Teddy's time in WWII as a soldier, and Teddy has internal talks where his dead wife, Dolores (Michelle Williams), gives him advice. Teddy's unit is the one that first encountered the Concentration Camp Dachau, with a dead woman and her dead daughter in her arms. Also, a German Commander tried to commit suicide by shooting himself, but survives & Teddy kicks the gun away so that he bleeds to death. Teddy admits to shooting all Nazi guards of the camp in cold blood.Dr. Naehring (Max Von Sydow) is Dr. Cawley's superior. He is German & Teddy doesn't like him. He tells Teddy that he won't share personnel records & Teddy is angry.\nInterviewing other patients suggests they are coached. One patient writes RUN in his notebook. Crawley also says that Rachael was on drugs to numb her mind & her biggest issue was her refusal to face what she had done. Teddy tells Chuck that he wanted to come to a mental institution as Laeddis, the arsonist who burnt his building down was sent to Shutter. But there is no paperwork. He also came across a prisoner George Noyce who was actually sent here & told Teddy about the research.Then Mcpherson asks them to change into patient whites, giving up their wet business suits. They are given different cigarettes & pills for Teddy's migraine. Crawley tells Teddy that Rachel has been found. in dream Teddy sees Laeddis (Elias Koteas) in Crawley's chair. Laeddis has a scar running from his right eye down to the left side of his chin. In another Rachael now replaces the dead Hebrew & her daughter asks Teddy why he didn't save her. In another she has killed all her kids & is asking Teddy to get rid of them. His wife appears tells him that Laeddis is still on Shutter.\nThe next day the backup generators failed, and all of the patient's cell doors were therefore opened. Teddy & Chuck get into building C. Teddy finds George Noyce, He tells Teddy that the only way he can save Noyce is to forget his wife and Laeddis. Noyce tells him that Laeddis is no longer in C building, but that they have taken him to the lighthouse, where they are planning to do a lobotomy on him. Teddy wants to go to the lighthouse & Chuck dissuades him. Teddy goes anyways & finds the tide has cut off the lighthouse from the mainland.He finds a cave with a woman inside claiming to be Rachael, she says she was a doctor & resisted the lobotomy that helped patients forget their past & their pain. She warns Teddy to stop taking food, pills & cigarettes from the hospital & says that he will be committed by being declared insane, because he was asking too many questions about what was going on at Shutter.Teddy can't find Chuck & Crawley tells him that he came to the island alone. His wife appears again & implores him not to go to lighthouse. Teddy blows up Crawley's car & sneaks into the lighthouse to rescue Chuck whom he thinks has been kidnapped for mind experiments, checking each room but finding no operating rooms for surgical experiments. He Finds Crawley inside who has his gun which Teddy checked in. Crawley tells Teddy that he is patient of Shutter for 24 months & that the hospital has been doing a role play to get him to finally realize the truth. He calls in Dr. Sheehan, and it is Chuck! He agreed to play along with Teddy's fantasy and to keep tabs on him. Dr. Cawley tells Teddy that his real name is Andrew Laeddis and Edward Daniels is an anagram. The same with Rachael Solando & Dolores Chanal (his wife). Crawley says Teddy has created this alternate reality to escape from his crime that he cannot admit.He also says that Teddy hurt orderlies & Noyce 2 weeks ago & now the board of directors have voted to lobotomize Teddy unless he gives up his violence immediately. Thats why Crawley constructed the role play to prove the impossibility of Teddy's notions of conspiracy & to make him accept the truth. His wife Dolores was a manic depressive & Teddy ignored everyone's advice. She burnt down his apartment & he moved to a lake house where she drowned his kids. Teddy shot her.Crawley makes Teddy admit that he blamed himself for not realizing earlier that his wife was having trouble; that he feels responsible for killing his kids because he didn't get her help when she needed it. He created a fantasy world where he never killed his wife, and he never had a breakdown. Crawley tells him that they broke through Andrew once before, but he regressed. Next morning Teddy talks to Chuck about getting off the island showing that he has regressed. Chuck indicates for lobotomy. While going Teddy indicates that he is going voluntarily because he can't stand the truth.",
	"links": [
		"https://www.amazon.com/Shutter-Island-Leonardo-DiCaprio/dp/B003NTSBTC"
	]
}