{
	"title": "Big Eyes",
	"release_year": "2014",
	"runtime": "106",
	"tags": [
		"Biography",
		"Crime",
		"Drama",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Amy Adams",
		"Christoph Waltz",
		"Danny Huston",
		"Krysten Ritter",
		"Jason Schwartzman",
		"Terence Stamp",
		"Jon Polito",
		"Delaney Raye",
		"Madeleine Arthur",
		"James Saito"
	],
	"staff": [
		"Tim Burton",
		"Scott Alexander",
		"Larry Karaszewski",
		"Scott Alexander",
		"Tim Burton",
		"Lynette Howell Taylor",
		"Larry Karaszewski",
		"Danny Elfman",
		"Bruno Delbonnel",
		"JC Bond",
		"Nicole Abellera",
		"Heike Brandstatter",
		"Coreen Mayrs",
		"Jeanne McCarthy",
		"Rick Heinrichs"
	],
	"votes": 100245,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjA2ODM5MDE3N15BMl5BanBnXkFtZTgwOTIxNjc1MzE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1958, Margaret (Amy Adams) leaves her husband and takes her young daughter Jane (Delaney Raye) to North Beach, San Francisco. Supporting her daughter alone, Margaret gets a job painting illustrations at a furniture factory.\nDee-Ann (Krysten Ritter) is Margaret's friend who helps her settle down in SFO.While creating portraits at an outdoor art show, Margaret meets Walter Keane (Christoph Waltz), who is selling his Parisian Street scene paintings. Margaret was selling live portraits for one dollar a piece. Walter approaches Margaret and tells her not to sell her work cheap.\nWalter charms Margaret and Jane, he starts taking Margaret out for dinner. They make plans for visiting France. Walter says that he studied art in Paris. Margaret has a signature style of drawing girls with big eyes. She always signs her work as KEANE. Walter appears to be a rich Realtor on the side.\nMargaret's ex-husband send her a court notice seeking custody of Jane. Soon, Walter proposes to her, and they marry.Walter approaches Reuben (Jason Schwartzman) who owns an art gallery and shows him his own and Margaret's work. Reuben is dismissive and wont allow Walter to display the work in his gallery.\nWalter goes to a popular jazz club and tries to convince the club's owner, Enrico Banducci (Jon Polito), to purchase the couple's paintings. He only agrees to rent out the walls to Walter. A drunk woman is touched by one of Margaret's paintings and buys it.\nHe fights with Banducci (for only giving him wall space next to the club's toilets) and puts the man's head through one of Margaret's canvases. This becomes a front-page story in a local newspaper. When Walter goes to the club again it is packed with curious people who want to see the paintings that made grown men fight.\nDick Nolan (Danny Huston), a celebrity gossip columnist (who serves as the film's narrator), wants to know more about Walter's art, but is only interested in Margaret's paintings. Particularly he is interested in Margaret's paintings of young girls with big eyes. Walter goes along with the misunderstanding, failing to clarify that they are Margaret's creation.Afterward, Walter shows Margaret all the money they have made from the sales. He tells her they are a great team; she can stay at home painting, and he will sell the paintings.Walter opens up his own Keane gallery, promoting the art as his own work, and eventually hits on the idea of making cheap reproductions of Margaret's works, which sell in huge numbers.\nThe family moves into a mansion. Walter spends his time hobnobbing with celebrities while Margaret is stuck at home, feeling increasingly isolated. He even makes Margaret lie to Jane about who is doing the paintings.\nMargaret becomes more upset about Walter taking credit for her art and lying to Jane (Madeleine Arthur) about who is the real artist. Margaret decides to paint in a different style with elongated features and small eyes, so that she can honestly tell people she is also a painter.While going through a crate Margaret finds a stack of paintings of Parisian Street scenes, but they are all signed by S. CENIC. She realizes that she has never actually seen Walter paint. Walter paints over the name of the original artist and claims the paintings as his own. Margaret confronts Walter, he confesses saying he always wanted to be an artist, but never had the talent.Disillusioned, Margaret indicates that she is losing her interest in continuing the ruse, so Walter threatens to have her killed. Walter learns of the New York World's Fair and demands Margaret paint something to put on display. Jane discovers her mother working on the World's Fair painting \"Tomorrow Forever\". Jane tells her mother she always knew that she was the real artist.At a party, Walter is angered after reading John Canaday's (Terence Stamp) scathing review of the \"Tomorrow Forever\" exhibit and confronts Canaday. At home, he drunkenly blames Margaret for the failure of the painting and becomes violent. Along with her daughter, she runs and locks them both in the studio, in an attempt to stay away from harm. He then starts throwing lit matches through the studio's keyhole, at her and Jane. As he continues to throw lit matches and nearly sets the house on fire, both Margaret and Jane manage to escape, take the car, and drive away from home.One year later, Margaret and Jane have settled in Honolulu, Hawaii. Walter will not agree to a divorce unless Margaret signs over the rights to every painting and produces 100 more. Margaret agrees and continues sending paintings to California. Margaret is visited by two Jehovah's Witnesses who convince her that honesty is important.The next time Walter receives the paintings, they are signed \"MDH Keane\". On a Hawaiian radio show, Margaret reveals she is the real artist behind the paintings attributed to Walter, making national news. Dick Nolan publishes Walter's claims that Margaret has \"gone nuts\". Margaret sues both Walter and the newspapers that printed his version of the story for libel and slander.At the trial, reporters swarm the courthouse in Honolulu. The court quickly dismisses the libel lawsuit against the newspapers. Without a lawyer, Walter defends himself against slander. Margaret testifies that she felt she had no choice. Walter asks himself questions as a witness.The judge (James Saito) directs both Margaret and Walter to create a painting in one hour as proof of the real artist. Margaret paints steadily, but Walter is hesitant, claiming his arm hurts too much to hold a paintbrush. Margaret completes her painting and wins the lawsuit.Outside the courthouse, Margaret says she doesn't care about money and just wants credit for her paintings. A fan asks her to sign a copy of \"Tomorrow's Masters\" and she does, finally autographing her own work.\nWalter continued to insist he was the true artist until his death, though he never painted again, and that he died in poverty. Margaret eventually moved back to San Francisco, where she opened a new gallery, and still paints every day.",
	"links": [
		"https://www.amazon.com/Big-Eyes-Amy-Adams/dp/B0CKMZGPXD"
	]
}