{
	"title": "My Name Is Khan",
	"release_year": "2010",
	"runtime": "165",
	"tags": [
		"Adventure",
		"Drama",
		"Romance",
		"amazon"
	],
	"rating": 7.9,
	"actors": [
		"Shah Rukh Khan",
		"Kajol",
		"Sheetal Menon",
		"Katie Amanda Keane",
		"Kenton Duty",
		"Benny Nieves",
		"Christopher B. Duncan",
		"Jimmy Shergill",
		"Sonya Jehan",
		"Parvin Dabas"
	],
	"staff": [
		"Karan Johar",
		"Shibani Bathija",
		"Niranjan Iyengar",
		"Hiroo Johar",
		"Gauri Khan",
		"Shankar Mahadevan",
		"Loy Mendonsa",
		"Ehsaan Noorani",
		"Shankar-Ehsaan-Loy",
		"Ravi K. Chandran",
		"Deepa Bhatia",
		"Shanoo Sharma",
		"Sharmishta Roy"
	],
	"votes": 117590,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTUyMTA4NDYzMV5BMl5BanBnXkFtZTcwMjk5MzcxMw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "During November 2007, San Francisco-based autistic Rizwan Khan (Shah Rukh Khan), on his route to meet President George W. Bush so that he can convey that his name is Khan, and he is not a terrorist. He is muttering under his breath due to his autism and is taken for further checks on account of racial profiling. He misses his last flight to Washington DC and has to take a bus since the next flight is the next day and is too expensive for him.Rizwan Khan is an autistic Muslim man who grew up with his dad, Dilawar Amanaullah Khan; mom, Razia (Zarina Wahab); and brother, Zakir (Jimmy Shergill) in Borivali, Mumbai. Dilawar works for the State Transport workshop in Borivali, and Rizwan accompanies him, learns the trade, and can repair virtually anything. After his passing, Rizwan, autistic, is abused by his classmates, as well as by Zakir, who feels neglected, so she hires Wadia (an unemployed master's graduate) to teach Rizwan. Rizwan has a natural intelligence, but Zakir feels ignored due to all the attention paid to Rizwan. Years later, Zakir decides to re-locate to U.S.A., and once there, gets married to Hasina (Sonya Jehan).He sponsors Razia and Rizwan, but Razia passes away before she can go to the US. In San Francisco, where Zakir runs 'Mehnaz Herbal Beauty Products', Rizwan is hired as a door-to-door salesman, while Hasina (who is a Psychology professor at Brooklyn University) concludes that he has Asperger's Syndrome.While selling products, he meets with and is attracted to a Hindu Salon worker, Mandira Rathod (Kajol), a single mother of Sameer (Arjun Aujila), whose husband abandoned her (Mandira got married when she was only 19 and her husband abandoned her 3 years later and without an alimony) and re-located to Australia. Mandira works for Rita (Navneet Nishan), the manager of the salon. Both Rizwan and Mandira decide to get married much to Zakir's chagrin (as Mandira is a Hindu), who asks Rizwan to leave.The trio re-locate to Banville, open their own salon. Rizwan and his wife, Mandira, live next door to the Garrick family, comprising Mark and his wife (Katie A. Keane) and son Reese (Kenton Duty).\nThe Khans' perfect existence gets disrupted after the September 11 attacks. They encounter racial profiling after the 9-11 terrorist attacks, are blacklisted, shunned and suffer losses.\nMark Garrick goes to cover the war in Afghanistan and dies there. One afternoon an argument between Rizwan's stepson Sameer and Reese turns into a fight between older students where Sameer is killed. The elder students threaten Reese against revealing the truth.Shocked beyond belief, Mandira blames Rizwan, stating that Sameer \"died only because of his surname.\" She sarcastically says that to be back together, he has to tell the people and President of the United States that his name is Khan, and he is not a terrorist.Rizwan, taking her words literally, sets out on a road trip to first meet President George W. Bush. Despite following Bush all over the country, Rizwan is not able to meet Bush. After 6 months the police decide to close Sameer's case, as there is not witness, no evidence and no suspects. Mandira is livid, but helpless.While at a mosque in Los Angeles, he overhears a violent speech from a doctor named Faisal Rahman (Arif Zakaria) who is quoting his religious texts. Rizwan counters Faisal with the true interpretation of the Quran and that it is a book of love and faith, and not of violence. While waiting in a crowd to meet President Bush, Rizwan aggressively shouts out loud: \"My name is Khan, and I am not a terrorist!\". Rizwa is arrested as the crowd thinks he said \"terrorist\".Rizwan is interrogated as a terrorist suspect. He is later released after a media campaign by some Indian student reporters Raj Burman (Arjun Mathur), Komal (Sugandha Garg) and Bobby Ahuja (Parvin Dabas) (these 3 reporters were present when Rizwan was arrested for screaming \"I am not a terrorist\".. They investigate his story and find out everything about his life), who claim his innocence by revealing his attempts to inform the FBI about Faisal Rahman. Based on Rizwan's call, Faisal and 8 other associates are arrested, and Rizwan is proven to be innocent.\nThe media prosecutes the Govt to keep an autistic man in jail as a terrorist.\nOn his way Rizwan had stayed at the town of Wilhemina, Georgia, with a black family. Now he finds that the town has been hit by a hurricane and is underwater. Rizwan cares about the people who cared for him and rushes to Wilhemina to help the family. They find the entire town sheltered in the church, which is about to fall. Rizwan is a celebrity now and his efforts gain nationwide attention and bring ordinary citizens to Wilhemia to launch rescue and reconstruction efforts. Even Obama sees these efforts on TV.Meanwhile, Reese finally reveals the identity of the boys who killed Sam and they are arrested shortly. Rizwan is then stabbed by one of Faisal's followers but later recovers and meets Obama (Christopher B. Duncan) (since he won the election and is now the POTUS), who tells him: \"Your name is Khan and you are not a terrorist.\" Madira forgives Rizwan.",
	"links": [
		"https://www.amazon.com/My-Name-Khan-Shah-Rukh/dp/B003S5K8GK"
	]
}