{
	"title": "The Ugly Truth",
	"release_year": "2009",
	"runtime": "96",
	"tags": [
		"Comedy",
		"Romance"
	],
	"rating": 6.4,
	"actors": [
		"Katherine Heigl",
		"Gerard Butler",
		"Bree Turner",
		"Eric Winter",
		"Nick Searcy",
		"Jesse D. Goins",
		"Cheryl Hines",
		"John Michael Higgins",
		"Noah Matthews",
		"Bonnie Somerville"
	],
	"staff": [
		"Robert Luketic",
		"Nicole Eastman",
		"Karen McCullah",
		"Kirsten Smith",
		"Kimberly di Bonaventura",
		"Gary Lucchesi",
		"Deborah Jelin Newmyer",
		"Steven Reuther",
		"Aaron Zigman",
		"Russell Carpenter",
		"Lisa Zeno Churgin",
		"Deborah Aquila",
		"Tricia Wood",
		"Missy Stewart"
	],
	"votes": 232433,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTM2MTM2OTUwNl5BMl5BanBnXkFtZTcwNTgwNTE0Mg@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Abby Richter (Katherine Heigl) is a morning show TV producer in Sacramento, California. Abby firmly believes in true love and is a big supporter of complex self-help books such as \"Chicken Soup For The Soul\" and \"Men Are From Mars, Women Are From Venus\".\nJoy (Bree Turner) is Abby's assistant. Her show is anchored by Larry (John Michael Higgins) and Georgia (Cheryl Hines) who are married to each other. Stuart (Nick Searcy) is Abby's boss.\nManaging the TV show is a stressful job as something is going wrong all the time, and Larry and Georgia cannot stand to be with each other in the same room.Abby has a disastrous blind date with Jim Ryan (Kevin Connolly). Abby is thorough, as she has printed Jim's online dating profile and has even done a background check on him. Jim checks 9 out of the 10 attributes that Abby looks for in a date. It was a short date, as Jim leaves.\nBack home, she happens to see a segment of a local television show, \"The Ugly Truth,\" featuring Mike Chadway (Gerard Butler), whose cynicism about relationships prompts Abby to call in to argue with him on-air. Mike calls BS on all the self-help books and believes that men are simple, and women treat them as a work in progress. Mike encourages women to exercise, get skinny, and buy trashy lingerie to land a boyfriend. According to Mike, men are interested in how women look and not their personality. Abby says that men are capable of love but doesn't have any examples to share with Mike on-air.\nThe next day, she discovers the TV station is threatening to cancel her show because of its poor ratings. The station owner Stuart has hired Mike to do a segment on her show.At first, the two have a rocky relationship; Abby thinks Mike is crass and disgusting while Mike finds her to be naive and a control freak. Abby sends Georgia to destroy Mike on-air during her show. Mike turns that tables by proving that Larry hates Georgia's success and that their marriage is a sham. That they have not had sex in 3 months, and Georgia says that it is not her fault that Larry can't get an erection due to her making twice as much money as him. Then Mike gets Larry and Georgia to make up and share a passionate kiss on-air.Mike convinces Abby that together they make good TV and hence they should do the show together to salvage her job. Abby lives alone with her cat D'Artagnan.\nNevertheless, when she meets the man of her dreams, a doctor named Colin (Eric Winter) living next to her, Mike convinces her that by following his advice she will improve her chances with Colin. Mike is right when Abby tries to ask Colin out on a date, and he tries to blow her off. He says that he knows how men operate and knows about lust, seduction and manipulation.\nAbby is skeptical, but they make a deal: If Mike's management of her courtship results in her landing Colin, proving his theories on relationships, she will work happily with him, but if Mike fails, he agrees to leave her show.Mike succeeds in improving the ratings, brings married co-anchors Georgia and Larry closer and successfully instructs Abby to be exactly what Colin would want through a number of pointers including: always laugh at his jokes, show off your curves, never talk about your problems, no ponytails and say he is amazing in bed.\nFor a first date, Colin takes Abby for a baseball game. Abby is all over the place, as she tries to follow Mike's instructions. She ends up spilling soda on his pants, appears to be giving him a blow-job, wile cleaning them, when it is captured on live cam. Still, Colin is into Abby as he kisses her while dropping her back home.Mike tells Abby to keep Colin on the leash, and not have sex with him. Instead, show him the sensual, and the wild side of herself. Mike learns that Abby has not had sex in 11 months and doesn't masturbate either. Mike gifts her a vibrating brief, which is remote controlled. Abby puts those on for a date with Colin, but then she is picked by Mike and Stuart for a meeting with network executives. Stuart invites Colin as well.\nAt dinner, the remote falls out of Abby's bag and lands in the hands of a kid, who turns it up to max and Abby ends up having an orgasm right on the table in front of everyone.Mike is invited to appear on The Late Late Show with Craig Ferguson and is offered a job at another network. Abby is forced to cancel a romantic weekend away with Colin, during which they had planned to finally sleep together, and instead fly to Los Angeles to persuade Mike to stay with her show.They drink and dance and Mike admits he doesn't want to move because he wants to stay in Sacramento near his sister and nephew. In the hotel elevator, they passionately kiss, but go to their separate rooms. Mike, dealing with the intensity of his feelings for Abby, calls on her room only to find Colin has shown up to surprise her. He leaves. Abby is upset and soon realizes Colin only likes the woman she has been pretending to be, not the real her. She breaks up with him.Mike quits and takes a job with a rival TV station in Sacramento and ends up doing a broadcast at the same hot-air balloon festival as Abby. He cannot resist intruding when she kicks the new \"Mike Chadway\" imitator off the air and goes into a tirade about men. The balloon takes off while they argue. Abby says she broke up with Colin, and Mike admits he loves her. Abby kisses him while they fly off, all of which is broadcast due to a camera mounted in the balloon. The film ends with Abby and Mike in bed. When Mike asks if he is really that good, Abby smirks and responds, \"You'll never know.\"",
	"links": []
}