{
	"title": "Julie & Julia",
	"release_year": "2009",
	"runtime": "123",
	"tags": [
		"Biography",
		"Drama",
		"Romance",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Amy Adams",
		"Meryl Streep",
		"Chris Messina",
		"Stanley Tucci",
		"Linda Emond",
		"Helen Carey",
		"Mary Lynn Rajskub",
		"Jane Lynch",
		"Joan Juliet Buck",
		"Crystal McCreary"
	],
	"staff": [
		"Nora Ephron",
		"Nora Ephron",
		"Julie Powell",
		"Julia Child",
		"Alex Prud'homme",
		"Nora Ephron",
		"Laurence Mark",
		"Amy Robinson",
		"Eric Steel",
		"Alexandre Desplat",
		"Stephen Goldblatt",
		"Richard Marks",
		"Kathy Driscoll",
		"Francine Maisler",
		"Mark Ricker"
	],
	"votes": 130051,
	"cover": "https://m.media-amazon.com/images/M/MV5BMzA4NjA2NjI2NV5BMl5BanBnXkFtZTcwOTEzNzI2Mg@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 2002, Julie Powell (Amy Adams) is a young writer with an unpleasant job at the Lower Manhattan Development Corporation's (LMDC) call center, where she answers telephone calls from victims of the September 11 attacks and members of the general public complaining about the LMDC's controversial plans for rebuilding the World Trade Center. To do something she enjoys, she decides to cook every recipe in Mastering the Art of French Cooking (1961) by Julia Child (Meryll Streep) in one year; Powell decides to write a blog to motivate herself and document her progress.Woven into the story of Powell's time in Queens in the early 2000s is the story of Julia's time in Paris throughout the 1950s. Julia is an enthusiastic and unabashed woman, moves to Paris with her diplomat husband, Paul Child. As an American, Julia is fascinated with French cooking and believes that she is French at heart.\nJulia met Paul when she was 40 and she was still a virgin. And when they got married, Julia could not even boil an egg.She attends Le Cordon Bleu to learn French cooking and is initially met with skepticism as she is the only woman in the class. Julia pays a hefty fee to attend the advanced cooking class meant only for professional chefs. But she has to learn the basics like cutting onions in a professional manner.\nMadame Elizabeth Brassart (Joan Juliet Buck), the proprietress of the school, clashes with Julia. However, Julia is undaunted and begins collaborating on a book about French cooking for American housewives with Simone \"Simca\" Beck (Linda Emond) and Louisette Bertholle (Helen Carey).The plot highlights similarities in the women's challenges. Julia lives in a plush Parisian apartment, but Julie has to move into a cramped Queens 900 square feet dump so that her husband can be close to his work. Julie's friends Cassie (Vanessa Ferlito), Regina (Casey Wilson) and Annabelle (Jillian Bach) are all successful in their careers. Sarah (Mary Lynn Rajskub) is Julie's best friend.\nAnnabelle interviews Julie for her magazine article & when it comes out it makes Julie look like a total loser. Annabelle wrote that Julie, a person who started a novel, temped for 8 years, gave up & now works in a cubicle (as a mid-level bureaucrat) trying to help people with the aftereffects off 911.Julie learns that Annabelle is doing a blog about herself and gets the same idea as she believes that she can write a blog as well.\nJulie's husband Eric (Chris Messina) understands her frustration at work & helps her cultivate her hobby of cooking by challenging her to complete the Julia Childs cook book in 1 year & to start blogging about the same under her \"Julie/Julia Project\".\nJulie says that before Julia there was no gourmet French cooking in the US, and it was all consumed via frozen foods and can openers. Julie has to cover 524 recipes in 365 days.In flashback we see how Julia was happy in Paris & loved French food, but was bored & how her husband Oaul (Stanley Tucci) encouraged her to write a book about French cooking for Americans as there are no French cookbooks in English at the time. Julia joins a professional cooking class & works very hard to gain her expertise & respect from fellow students. She also starts teaching French cooking with 2 partners who are writing a French cookbook in English.Julie starts her blog & slowly gains a steady following of readers who follow her exploits of following Julia's cookbook almost 50 years after she wrote it. Julie poaches and eats an egg for the first time in her life. Julie is at 65 recipes in 47 days, and 103 recipes in 2 months.\nWhat starts as a hobby turns into an obsession when Julie hits the difficult recipes which she can't afford as the ingredients are too expensive and the technique to cook them are too sophisticated.\nBoth women receive much support from their husbands, except when Powell's husband becomes fed up with her excessive devotion to her hobby and leaves her for a short time.Julia's single sister Dorothy (Jane Lynch) visits her in Paris. Julia helps her meet eligible bachelors & Dorothy finds the love of her life & gets married. That is the happiest day off Julia's life. She is a little sad when Dorothy falls pregnant which only reminds her that she has been unsuccessful in having a baby after years of trying.Julia's partners learn that their publisher doesn't think their book would sell in France & asks them to customize it for the Americans. They ask Julia to take charge of the book. Julia's work is delayed due to the several shifting due to the transfer of her husband, who works as a cultural attache for the US Govt. At one point, he is also called back to US to be investigated for being a communist but is exonerated.\nJulie's husband leaves her after one of her meltdowns & Julie realizes that Julia never lost her temper because of food. Julie apologizes to bring her husband back.Although Child's book is rejected by Houghton Mifflin upon her visit to the US, it is accepted and published by Alfred A. Knopf. Louisette's less-than-diligent efforts on the project means that she is eventually told she will get a smaller share of the royalties than Julia and Simca.Finally, Julie and Eric are visited by Amanda Hesser, a food writer from The New York Times, who features her blog in a story, after which her project begins to receive the attention of journalists, literary agents, and publishers.Julie is hurt when a journalist tells her that Julia was critical of Julie's blog project, but she retains her love and gratitude for Julia and the inspiration she provided. The last scenes show Julie and Eric visiting a reconstruction of Julia Child's kitchen at the Smithsonian Institution, and Julia in the same kitchen at her home receiving a first print edition of her cookbook and celebrating the event with Paul.",
	"links": [
		"https://www.amazon.com/Julie-Julia-Meryl-Streep/dp/B002VXDOT8"
	]
}