{
	"title": "3 Idiots",
	"release_year": "2009",
	"runtime": "170",
	"tags": [
		"Comedy",
		"Drama",
		"amazon"
	],
	"rating": 8.4,
	"actors": [
		"Aamir Khan",
		"Madhavan",
		"Mona Singh",
		"Sharman Joshi",
		"Kareena Kapoor",
		"Boman Irani",
		"Omi Vaidya",
		"Jaaved Jaaferi",
		"Parikshit Sahni",
		"Olivier Lafont"
	],
	"staff": [
		"Rajkumar Hirani",
		"Abhijat Joshi",
		"Rajkumar Hirani",
		"Vidhu Vinod Chopra",
		"Chetan Bhagat",
		"Vidhu Vinod Chopra",
		"Shantanu Moitra",
		"Atul Raninga",
		"Sanjay Wandrekar",
		"C.K. Muraleedharan",
		"Rajkumar Hirani",
		"Rohan Mapuskar",
		"Menaka Nagarajan",
		"Nalini Rathnam",
		"Girdhar Swami",
		"Sumit Basu",
		"Rajnish Hedao"
	],
	"votes": 442505,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzc4ZWQ3NmYtODE0Ny00YTQ4LTlkZWItNTBkMGQ0MmUwMmJlXkEyXkFqcGc@._V1_QL75_UY281_CR3,0,190,281_.jpg",
	"description": "In the present day, Farhan receives a call from Chatur, saying that Ranchi is coming. Farhan is so excited that he fakes a heart attack to get off a flight and picks up Raju from his home (who forgets to wear his pants). Farhan and Raju meet Chatur at the water tower of their college ICE (Imperial College of Engineering), where Chatur informs them that he has found Rancho.\nChatur taunts Farhan and Raju that now he has a mansion worth $3.5 million in the US, with a heated swimming pool, a maple wood floor living room and a Lamborghini for a car. Chatur reveals that Rancho is in Shimla.10 years ago, Farhan Qureshi (R. Madhavan) and his friends, Raju Rastogi (Sharman Joshi), and Ranchodas \"Rancho\" Shyamaldas Chanchad (Aamir Khan) are students at the Imperial College of Engineering, one of the best colleges in India.\nMan Mohan (Rahul Kumar) (MM) is the odd jobs boy at the college and is nicknamed Millimeter. Chatur was their classmate, who was born in Uganda and studied in Pondicherry. He doesn't understand Hindi very well.\nRancho displays his presence of mind when he avoids ragging by electrocuting his senior, when he comes to urinate on his door.Farhan wants to become a wildlife photographer but is pursuing an engineering degree to fulfill his father's wish, whereas Raju needs to improve his family's financial situation (Raju also prays excessively to all known Gods to secure his good grades and a bright future), and Rancho studies for the pleasure of building machines.Rancho incurs the wrath of college's dean, Professor Viru Sahastrabuddhe a.k.a. 'Virus' (Boman Irani), by giving creative and unorthodox answers in class. Virus espouses the competitive mentality of educational institutions and says that his son failed to get into ICE after 3 attempts. He is proud of an astronaut pen, developed by NASA, and given to him by his dean as a symbol of excellence. Virus was told to pass on the pen to the brilliant mind he encounters in his life.\nBut Rancho asks why the astronauts not use a pencil.Rancho loved machines and constantly experimented with them. Joy Lobo was a fellow student who shared his passion for innovation. Virus threatens Joy that he will fail the course as he has not submitted his assignments on time. Joy says that he is creating Quad copter and is very close to solving the problem. Virus refuses to grant any leeway to Lobo.\nRancho blames the rote-learning mentality of the institution for the suicide of Joy Lobo (Ali Fazal). Virus is blunt to Rancho and says that he lost his own son on a weekend and yet he delivered a lecture in the college on Monday.Livid with Rancho, Virus writes to Farhan and Raju's parents and informs them that they are not in good company with Rancho. Farhan's father Salim (Parikshit Sahni) tells Rancho about all the sacrifices he made to fund Farhan's engineering journey. Rancho realizes that Farhan is a great photographer, but is asked to leave when he suggests to Salim that Farhan should be a wildlife photographer.\nAt Raju's house, his parents live in abject poverty and rely on Raju to pull them out of their mess.Virus's model student is Chatur Ramalingam (Omi Vaidya), called \"Silencer\" for his silent but malodorous farts. Virus wants Farhan and Raju to bunk in Chatur's room. Raju is swayed as he knows that he is the only hope for prosperity for his family.\nRancho humiliates Chatur by replacing praise with an obscenity in the speech memorized by Chatur for delivery before the authorities on Teacher's Day. Chatur is humiliated and that night he challenges Rancho to meet 10 years later at the water tower to compare the outcome of their life.\nMeanwhile, Rancho falls in love with Virus's medical student daughter Pia (Kareena Kapoor). Rancho meets Pia at her sister Mona's (Mona Singh) wedding. Pia is engaged to Suhas (Olivier Lafont) who is a very brand conscious individual.\nRancho proves to Pia that Suhas has no interest in her and is only interested in marrying her for his own image.Raju realizes his mistake when Rancho brings his sick father to the hospital by borrowing Pia's scooter. The doctors agree that he would have died if Rancho had waited for an ambulance.\nDespite everything, Raju and Farhan are at the bottom of their class and Rancho tops it. In the class photo, Rancho bets Virus that his friends Farhan and Raju will land a job in the campus placements.The tensions escalate when the three friends break into Virus's house at night so Rancho can propose his own marriage to Pia (Kareena Kapoor). Virus hears the boys escaping but only finds Raju drunk in class.\nThe next day, Virus threatens to expel Raju, who, unable to choose between betraying his friend and disappointing his family, attempts his own death. After extensive care by Pia and his friends, he awakes from a coma.Afterward, Farhan pursues photography by seeking an internship with a famous wildlife photographer in Hungary. Farhan goes home and convinces his father that he will be happier as a wildlife photographer.\nWhile Raju gives eccentric answers to an interview and refuses to compromise on his values. Both manage to get jobs despite Virus's challenge that no one will give them jobs.\nVirus vows to make the course's final exam as hard as possible so that Raju is unable to graduate.Pia, in reply, tells Rancho of the exam, and he and Farhan steal the examination's questions for Raju who refuses to cheat. Virus finds out that the 3 friends have stolen the papers & sentences them to expulsion. When Virus gets home, Pia confronts him that her brother also committed suicide due to Virus, as he wanted to be a writer and not an engineer.\nThe boys earn a reprieve when Viru's pregnant elder daughter Mona (Mona Singh) goes into labor.A heavy storm cuts electricity and the roads are flooded due to which Virus is not able to get Mona to the hospital. Pia instructs Rancho to deliver the baby in the college common room via Voice over IP, after Rancho restores power using car batteries and a power Inverter invented by Rancho. After the baby is apparently stillborn, Rancho resuscitates it; wherefore Virus allows them to take and pass their final exams. Rancho comes first and is awarded Virus's prize pen, retained for an especially capable student.Their story is framed as intermittent flashbacks from the present day, ten years afterward, in which Raju and Farhan are in search of Rancho. They are joined by Chatur, now a wealthy businessman, looking to seal a deal with scientist Phunsukh Wangdu who has 400 patents under his name.\nAt the house ascribed to Rancho in Shimla, they discover another individual (Jaaved Jaffrey) under that name (and whose photo was in the class picture instead of Rancho's), whom they blackmail by seizing his father's ashes and threatening to flush them down a toilet.\nThus threatened, the householder reveals that their friend was an orphan servant boy who loved learning, while he himself disliked it, wherefore the family sent the servant to study in his master's place, until graduation, where-after the master pockets the qualifications and the benefits thereof, while the impersonator becomes a schoolteacher in Ladakh.Farhan decides to inform Pia and finds that Pia is getting married to Suhas. Raju and Farhan confront Pia and tell her that they know Rancho's location and convince her to come with them.Raju and Farhan then take Pia to Ladakh, where they see inventions resembling those of their friend. When the latter's friends ask his real name, he identifies himself as Phunsukh Wangdu, Chatur's prospective business partner.\nUpon learning this, Chatur is horrified and begs Phunsukh to establish the business relationship, apparently to no effect.",
	"links": [
		"https://www.amazon.com/3-Idiots-Aamir-Khan/dp/B07V4HFXKZ"
	]
}