{
	"title": "The Northman",
	"release_year": "2022",
	"runtime": "137",
	"tags": [
		"Action",
		"Adventure",
		"Drama",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Alexander Skarsgård",
		"Nicole Kidman",
		"Claes Bang",
		"Ethan Hawke",
		"Anya Taylor-Joy",
		"Gustav Lindh",
		"Elliott Rose",
		"Willem Dafoe",
		"Phill Martin",
		"Eldar Skar"
	],
	"staff": [
		"Robert Eggers",
		"Sjón",
		"Robert Eggers",
		"Leifur B. Dagfinnsson",
		"Robert Eggers",
		"Mark Huffam",
		"Lars Knudsen",
		"Robin Carolan",
		"Sebastian Gainsborough",
		"Jarin Blaschke",
		"Louise Ford",
		"Kharmel Cochrane",
		"Craig Lathrop"
	],
	"votes": 260869,
	"cover": "https://m.media-amazon.com/images/M/MV5BYzgwM2JiY2MtNWQ5OC00NDc1LWExMjYtYmY2YjViZmViYWM5XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In AD 895, King Aurvandill War-Raven (Ethan Hawke) returns to the island of Hrafnsey (In the North Atlantic) after his overseas conquests, reuniting with his wife, Queen Gudrún (Nicole Kidman), and his heir, Prince Amleth (Alexander Skarsgard). Aurvandill loves Amleth beyond all compare.To prepare Amleth for his eventual ascension, the two participate in a spiritual ceremony overseen by Aurvandill's jester, Heimir (Willem Dafoe). In the ceremony Aurvandill makes Amleth swear vengeance in case someone was to attack and kill Aurvandill. By touching Aurvandill's blood, Amleth can also visualize the tree of kings. The next morning, Aurvandill's bastard brother Fjolnir (Claes Bang) murders the king, raids his hill-fort and carries away Gudrún. Fjolnir's sends his foreman Finnr (Eldar Skar) to kill Amleth, but Amleth cuts off his nose and flees by boat, swearing vengeance. Finnr is known as The Nose Stub, tells Fjolnir that Amleth is dead and buried at sea.Years later, Amleth lives as a Berserker with a band of Vikings (In the Land of Rus). The Vikings believe themselves to be part human, part wolves and conduct their lives as such. After an attack in Gardariki (where Vikings commit brutal atrocities, such as burning all the children of the village alive), Amleth encounters a Seeress (Björk) in the temple of Svetovit; the Seeress predicts that Amleth will soon take revenge on Fjolnir (he will travel to an island where he will kill Fjolnir on a burning lake. He will need to seek a magic sword that would help him defeat Fjolnir), and that his path is intertwined with a Maiden-King. Amleth learns that Fjolnir was overthrown by Harald of Norway and lives in exile in Iceland. Harald allows Fjolnir a batch of slaves every year to work on his farm, from which Fjolnir pays his taxes to Harald. Ravens guide Amleth in his quest for revenge, and Amleth considers them to be spirits of his late departed father.Posing as a slave, Amleth sneaks aboard a ship bound to Iceland and Fjolnir. He encounters a Slavic woman named Olga (Anya Taylor-Joy), who claims to be a sorceress from the Birch Forest. They are taken to Fjolnir's farm, where he learns his mother has married Fjolnir and bore him a son named Gunnar (Elliott Rose). Thorir (Gustav Lindh) the Proud, is Fjolnir's elder son and Amleth's cousin\nAmleth gets to work and spies on the entire farm, and even gets into Fjolnir's house, where he finds Gudrun living a peaceful life.One night, Amleth encounters a magician who facilitates a spiritual dialogue between Amleth and the late Heimir, revealed to have been murdered by Fjolnir. He then tells Amleth about Draugr, a magical sword (which can only be unsheathed at night) at the Gates of Hel. Amleth enters a mound and obtains the blade after fighting the Undead Mound Dweller (Ian Whyte) (Amleth defeats the Mound Dweller by drawing him into the moon light, as he cannot be killed in the shadows). He hides it upon return to the farm. The next day, Amleth is selected to compete in a game of Knattleikr against another farm. The game turns violent and Gunnar (who enters the game to help his team win) is almost killed, but Amleth saves him. As a reward, Fjolnir's adult son, Thorir, grants him overseer duties and allows him to choose a woman.During the evening celebrations, Amleth and Olga make love; they promise to overcome Fjolnir together. Amleth kills several of Fjolnir's men, and Olga mixes their food with fly Agaric, a potent hallucinogen. The ensuing chaos and the suspicion that the Christian slaves are behind the killings allows Amleth to enter Fjolnir's house. He meets his mother, who reveals that she was originally taken into slavery and that Amleth's conception was the result of rape. She reveals that she wanted Aurvandill and Amleth dead; she tries but fails to seduce Amleth. Enraged, Amleth kills Thorir and steals his heart.Gudrún reveals Amleth's true identity to Fjolnir and calls for him to kill him. Fjolnir threatens to kill Olga, but Amleth offers to trade Olga's life for Thorir's heart. After a severe beating, Amleth is released from his restraints by a flock of ravens (which represents his father's spirits). Olga rescues Amleth and the two escape by boat. Amleth has a vision and discovers that Olga is pregnant with twins, one of whom will become the Maiden-King prophesied by the Seeress. Fearing that his children will never be safe, Amleth decides to kill his uncle and jumps overboard, despite Olga's pleas.Back at the farm, Amleth frees the slaves and kills most of Fjolnir's men. While searching for Fjolnir, Amleth is attacked by his mother and drives Draugr through her heart. Gunnar attacks Amleth, stabbing him repeatedly in the back before Amleth kills him. Fjolnir, discovering his wife and son dead, tells Amleth to meet him at the Gates of Hel-the crater of the volcano Hekla-to resolve the conflict via Holmgang. At the volcano, Amleth and Fjolnir engage in a fierce sword-fight; Fjolnir is decapitated, and Amleth is fatally wounded. As Amleth lies dying, he has a future vision of Olga embracing their twin children, before a Valkyrie appears to carry him through the gates of Valholl (Valhalla).",
	"links": [
		"https://www.amazon.com/Northman-Alexander-Skarsg%C3%A5rd/dp/B09W5PD24P"
	]
}