{
	"title": "The Hangover",
	"release_year": "2009",
	"runtime": "100",
	"tags": [
		"Comedy",
		"max",
		"amazon"
	],
	"rating": 7.7,
	"actors": [
		"Zach Galifianakis",
		"Bradley Cooper",
		"Justin Bartha",
		"Ed Helms",
		"Heather Graham",
		"Sasha Barrese",
		"Jeffrey Tambor",
		"Ken Jeong",
		"Rachael Harris",
		"Mike Tyson"
	],
	"staff": [
		"Todd Phillips",
		"Jon Lucas",
		"Scott Moore",
		"Daniel Goldberg",
		"Todd Phillips",
		"Christophe Beck",
		"Lawrence Sher",
		"Debra Neil-Fisher",
		"Juel Bestrop",
		"Seth Yanklewitz",
		"Bill Brzeski"
	],
	"votes": 860041,
	"cover": "https://m.media-amazon.com/images/M/MV5BNDI2MzBhNzgtOWYyOS00NDM2LWE0OGYtOGQ0M2FjMTI2NTllXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Doug and Tracy are about to be married. Tracy's parents Sid (Jeffrey Tambor) and Linda (Sondra Currie) are not big fans of him, but Tracy loves him. The marriage is in 5 hours when Doug's friend Phil calls and tells Tracy that they cannot find Doug.2 days before the wedding:\nTo celebrate his upcoming marriage to Tracy (Sasha Barrese), Doug (Justin Bartha) travels to Las Vegas with his best friends Phil (Bradley Cooper) (a teacher) and Stu (Ed Helms) (a dentist), as well as Tracy's brother Alan (Zach Galifianakis). Alan is Doug's socially inept, future brother-in-law, who suffers from ADHD and acts childishly and erratically.\nDoug wants to cancel as there are too many things left to do, but Tracy insists since Alan has packed his bags over 2 weeks ago and is really excited. Alan is not supposed to be within 200 feet of a school or Chucky Cheese. Tracy tells Doug not to let Alan gamble or drink too much. Alan is an expert at counting cards.\nPhil gathered money from his students on the pretext of a class trip, and that's his spending money for Vegas. Stu has a dominating girlfriend, Melissa whom he has told that he is going to wine country. Phil believes that marriage kills the freedom and personality of a man. Phil is livid that Stu has to lie to Melissa about going to Vegas, but she had sex with a bartender on her vacation on a cruise liner.They travel in Doug's future father-in-law Sid's vintage Mercedes-Benz W111. They check into a hotel villa (Phil gets the receptionist Lisa (Nathalie Fay) to change their booking and the villa costs $4200 a night. Stu is afraid that Melissa checks her statements and doesn't want any expenses on his credit card) in Caesars Palace and celebrate with a few drinks on the hotel rooftop. Stu reveals that he wants to propose to Melissa after he returns from Melissa. He has his grandmother's ring which is managed to save through World War II.\nThe next morning, Phil, Stu, and Alan awaken to find they have no memory of the previous night. Doug is nowhere to be found, Stu's tooth is missing, the suite is in disarray, a tiger is in their bathroom, a chicken is in their living room, and a baby is in the closet.\nThey see Doug's mattress impaled on a statue outside of Caesars Palace and when they ask for their Mercedes, the valet delivers an LVPD police cruiser.Phil has a hospital tag on him and that's where they decide to start their search for Doug.\nUsing clues to retrace their steps, the trio travel to a hospital where they discover from Dr Valsh (Matt Walsh) they were drugged with Rohypnol, known as Roofies (also called the date-sexual assault drug), causing their memory loss, and that they went to the hospital from a chapel the previous night.\nAt the chapel, they learn that Stu married a stripper named Jade (Heather Graham), despite being in a long-term relationship with his domineering and philandering girlfriend Melissa (Rachael Harris). Eddie (Bryan Callen) was the wedding organizer and a witness. Stu gave Jade his grandmother's ring. The baby belongs to Jade.\nThe guys want the marriage annulled, but Eddie needs both parties for the annulment.Outside the chapel, the trio is attacked by gangsters saying they are looking for someone. They flee and track down Jade. They return the baby to Jade, but Stu is unable to get his ring back.\nThey are then arrested by the police for having stolen a police cruiser. After being told that the Mercedes has been impounded (it was found at 5 am that morning in the middle of Los Angeles Boulevard), the trio are released when they unknowingly volunteer to be targets for a taser demonstration.\nWhile driving the Mercedes, they discover a naked Chinese man named Mr. Chow (Ken Jeong) in the trunk. Chow jumps out of the trunk, beats the trio up with a crowbar and flees. Alan confesses that he drugged their drinks to ensure they had a good night, believing the drug to be ecstasy.Returning to their suite, they find the boxer Mike Tyson, who orders the trio to return his tiger to his mansion immediately. Stu drugs the tiger, load it into the Mercedes, and drive towards Tyson's home. However, the tiger awakens midway and attacks them, clawing Phil on the neck and damaging the car's interior. After pushing the car, the rest of the way to the mansion, they deliver the tiger to Tyson.\nWhile driving back, their car is intentionally T-boned by a black Cadillac Escalade. The passengers are revealed to be the gangsters from the chapel, and their boss Chow.Chow accuses the trio of kidnapping him and stealing $80,000 in poker chips. Chow says that he kept the chips in his satchel, which got exchanged with Alan's Satchel. When Chow found the mistake and went after the guy, Phil put him in the car trunk. As the trio denies this, Chow tells them he has Doug, and threatens to kill him if it is not returned. Unable to find Chow's $80,000, Alan, with help from Stu and Jade, uses his knowledge of card counting to win $82,400 playing blackjack.The next morning, they meet with Chow in the desert and exchange the chips for Doug, only to find this Doug (Mike Epps) is the African American drug dealer who accidentally sold Alan the Roofies. With Doug's wedding set to occur in five hours, Phil calls Tracy to tell her that they cannot find Doug.Meanwhile, in discussion with Stu, \"African American Doug\" mentions that someone that takes Roofies is more likely to end up on the floor than on the roof; Stu suddenly realizes where Doug is before Phil can reveal Doug's disappearance to Tracy. The trio travels back to Caesars Palace where they find a dazed and sunburned Doug on the roof. They realize that they had moved him there on his mattress the previous night as a practical joke but immediately forgot when the Roofies wore off.Doug had thrown the mattress onto the statue in an attempt to signal help. Before leaving, Stu makes arrangements to go on a date with Jade the following week. Jade returns the ring back to Stu. Jade also reveals that Stu pulled out his own tooth when Alan bet him that he wasn't good enough to pull out his own tooth.\nWith no flights available back to Los Angeles, the four quickly drive home to make the wedding. Despite their late arrival, Doug and Tracy are married. Doug reveals that when he woke up, he found $80,000 worth of chips in his pockets.\nAt the wedding, Stu angrily breaks up with Melissa, having grown tired of her personality. As the reception ends, Alan finds Stu's digital camera containing photos of the events from the night in Las Vegas, and the four agree to look at the pictures together before deleting them.",
	"links": [
		"https://www.max.com/movies/hangover/2a8a879a-f0eb-4df4-9206-d1d641589486",
		"https://www.amazon.com/Hangover-Bradley-Cooper/dp/B002RRXGKA"
	]
}