{
	"title": "The Unbearable Weight of Massive Talent",
	"release_year": "2022",
	"runtime": "107",
	"tags": [
		"Action",
		"Comedy",
		"Crime",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Nicolas Cage",
		"Nicolas Cage",
		"Pedro Pascal",
		"Tiffany Haddish",
		"Sharon Horgan",
		"Paco León",
		"Neil Patrick Harris",
		"Lily Mo Sheen",
		"Alessandra Mastronardi",
		"Jacob Scipio",
		"Katrin Vankova"
	],
	"staff": [
		"Tom Gormican",
		"Tom Gormican",
		"Kevin Etten",
		"Kristin Burr",
		"Nicolas Cage",
		"Mike Nilon",
		"Kevin Turen",
		"Mark Isham",
		"Nigel Bluck",
		"Melissa Bretherton",
		"Luise Eigner",
		"Jessica Kelly",
		"Mary Vernieu",
		"Tonucha Vidal",
		"Kevin Kavanaugh"
	],
	"votes": 159330,
	"cover": "https://m.media-amazon.com/images/M/MV5BMWEzMTA3MjAtOTkwYS00ZTNlLWIzYzMtMDIxNzU0NTlkMGRlXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Hollywood actor Nicolas Cage is struggling with his career after being passed over for several major film roles and is constantly pestered and tormented by \"Nicky\" (Nicolas Cage), who appears to him as his younger (and more successful) self (a figment of Cage's imagination, seen as a younger version of himself). His relationship with his ex-wife Olivia (Sharon Horgan) and daughter Addy (Lily Sheen) is also marred by years of emotional neglect. Following an embarrassing and humiliating event (Cage gets drunk, sings a bad song to take out his own frustration at his own failures) at Addy's birthday party and losing a key film role, Cage plans to retire from acting. He decides to accept a vague offer of $1 million from his agent Richard Fink (Neil Patrick Harris) that involves going to Majorca to meet billionaire playboy Javi Gutierrez (Pedro Pascal) and to be the guest of honor at his birthday. Cage is forced to accept the offer as he has alimony and has substantial debts to pay off due to his lavish lifestyle.Upon meeting Javi, Cage is initially annoyed by his neediness and insistence that they create an improvisational movie based on a script he wrote, but is soon inspired by Javi's determination, and the two of them quickly bond over their surprisingly shared love of films such as The Cabinet of Dr. Caligari and Paddington 2 (the latter of which Cage watches for the first time with Javi).\nSoon after, Cage is confronted by CIA agents Vivian (Tiffany Haddish) and Martin (Ike Barinholtz). They suspect that Javi, who they claim made his fortune through arms dealing, is behind the kidnapping of Maria (Katrin Vankova), the daughter of a Catalan anti-crime politician, with the hope that he will drop out of an upcoming election. Despite his insistence otherwise, Cage decides to help the CIA with the mission. Although Cage insists that yrs of being an actor has given him an ability to read people and his guts tells him that Javi is not an arms dealer.After successfully rigging the cameras in Javi's compound, Cage attends a party where he announces his collaboration with Javi on a new movie, as an excuse to stay on the compound long enough to find Maria (Martin and Vivian tell Cage that they suspect Javi of having imprisoned Maria on his compound). After a misadventure involving LSD (Cage and Javi trip out and imagine that they both are being watched. They try to \"run away\" from the spies and share a moment when they help each other climb a wall), Cage discovers that Javi keeps a shrine room dedicated to all of his movies, including a wax figure of his character Castor Troy from the film Face/Off, complete with identical golden guns. Cage finds it difficult to betray Javi, but Vivian convinces him to work the kidnapping into their script so that he could potentially reveal where Maria is.Cage explains his new idea to Javi, who believes that Cage is creatively bankrupt, and possibly has issues he needs to work out. Javi brings Olivia and Addy to his villa from Los Angeles; they are frightened and angered over what is happening. Cage tries to make amends with them, but they reject his appeal and accuse him of prioritizing his film career over his family. Javi privately goes to meet with his cousin Lucas (Paco León), who is revealed to be the true arms dealer and the one who kidnapped Maria. Lucas warns him that Cage is working with the CIA and pressures him to kill Cage, or else Lucas will kill Javi. Cage begins to rethink his friendship since Javi flew in his wife and daughter. Meanwhile Lucas plays Cage's recordings to prove to Javi that Cage is working for the CIA. Lucas tells Javi to kill Cage.Cage and Javi have a stand-off with each other, but neither can bring themselves to kill the other. Lucas sends his men after both of them, and they race back to the house to discover that Addy has been kidnapped. Cage takes Javi, Olivia and Javi's assistant Gabriela (Alessandra Mastronardi) to the CIA safe house, only for the house to have been compromised; Martin has been killed, while Vivian sacrifices herself to kill Lucas's men before they can ambush the group. With Javi's help, Cage and Olivia pose as a reclusive criminal couple (The head of a rival crime family in Majorca, who have not been seen for 15 yrs. Lucas has been trying to contact them to form an alliance with them) to get close to Lucas. They manage to locate Addy and Maria but are found out. However, Cage, Addy, Maria and Olivia escape while Javi and Gabriela stay behind to distract Lucas.Cage, Addy, Olivia and Maria race to the American embassy with Lucas still in pursuit. Upon arrival, Lucas holds Cage at gunpoint, but Addy tosses him a knife which Cage uses to kill him-transitioning into the movie that Cage and Javi completed, presumably based on their adventure. Cage is applauded for his new film and congratulates Javi before going home with his family to watch Paddington 2, now with a better relationship.",
	"links": [
		"https://www.amazon.com/Unbearable-Weight-Massive-Talent/dp/B0CBL4869Z"
	]
}