{
	"title": "House of Gucci",
	"release_year": "2021",
	"runtime": "158",
	"tags": [
		"Biography",
		"Crime",
		"Drama",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Lady Gaga",
		"Adam Driver",
		"Al Pacino",
		"Jeremy Irons",
		"Jared Leto",
		"Jack Huston",
		"Salma Hayek",
		"Alexia Murray",
		"Vincent Riotta",
		"Gaetano Bruno"
	],
	"staff": [
		"Ridley Scott",
		"Becky Johnston",
		"Roberto Bentivegna",
		"Sara Gay Forden",
		"Giannina Facio",
		"Mark Huffam",
		"Ridley Scott",
		"Kevin J. Walsh",
		"Harry Gregson-Williams",
		"Dariusz Wolski",
		"Claire Simpson",
		"Teresa Razzauti",
		"Kate Rhodes James",
		"Arthur Max"
	],
	"votes": 162521,
	"cover": "https://m.media-amazon.com/images/M/MV5BMmQ3OTRiYWItMGRiOC00ZTVmLWJjMjEtNjZhNDQ5NjIxODNjXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1978, Patrizia Reggiani (Lady Gaga) is a young, attractive Italian woman working as an office manager within her father's small trucking firm. At a party, Patrizia meets Maurizio Gucci (Adam Driver), a law student and heir to a 50% interest in the Gucci fashion house through his father Rodolfo (Jeremy Irons). Patrizia aggressively pursues the awkward Maurizio (she forces him to ask her out on a date), charming him into love. Rodolfo (who had a spy following Maurizio at all times) warns Maurizio that Patrizia is only after wealth and tells Maurizio that he will disinherit him if he marries Patrizia; Maurizio chooses Patrizia over his connection to Gucci, leaving the family.Patrizia and Maurizio marry, and Maurizio takes a job at the Reggiani trucking company. When Patrizia becomes pregnant, she sees her child as an avenue for familial reconciliation. She lets it slip to Maurizio's uncle Aldo (Al Pacino) that she is pregnant; Aldo is delighted by the news and takes the couple under his wing (he teaches Patrizia everything about the fashion business, including the cattle farms that generate the leather to the retail shops with the glamorous models). Aldo lives in New York but comes to Italy to host his birthday party. Patrizia and Maurizio attend, but Rodolfo backs out. Aldo asks Patrizia and Maurizio to visit him in New York. Patrizia sees how via NYC, Aldo is servicing a Japanese clientele. Aldo wants Maurizio to start playing a more active role with Gucci in his legal capacity (as a lawyer)Aldo introduces Patrizia to his unintelligent son Paolo (Jared Leto) (& his wife Jenny Gucci (Florence Andrews)), who aspires to be a designer within Gucci despite his lack of talent. When Aldo starts spending time with Maurizio, Paolo takes his designs to Rodolfo for sponsorship, and it told that he is totally incompetent and sends him away.\nThanks to Aldo, Maurizio and a terminally ill Rodolfo reconcile shortly before the latter's death. Rodolfo writes Maurizio back into his will but fails to sign a document transferring the Gucci shares to him before he dies. Patrizia forges Rodolfo's signature, giving Maurizio a 50% interest in Gucci.Patrizia starts to devise a plot to obtain a controlling interest in Gucci by acquiring some of Aldo and Paolo's shares (the two hold the other 50% interest). Patrizia finds that her maid has a Gucci bag and investigates to find a whole market of fake Gucci products. Turns out Aldo knew about this, and was the source of the fake merchandise, as he wanted Gucci to be an household brand, and not an inspirational one.She clashes with Aldo over the firm's clandestine sale of cheap \"fake\" Gucci products on the black market and begins to consult Giuseppina \"Pina\" (Salma Hayek), a psychic whose ad she saw on TV, for guidance. She manipulates Maurizio, who has little real interest in Gucci, into taking a more active role within the company. She convinces Maurizio that Aldo has to go as he has become an embarrassment to the brand.Paolo acquires proof that Aldo has been evading taxes in the United States; he gives the proof to Patrizia in exchange for her promise that he will be allowed to design his own line under the Gucci name and distribute it. Aldo is arrested by the IRS and sentenced to a year and a day in prison. Patrizia lies to the Italian police and tells them that Paolo is not authorized to use the Gucci trademark; the police stop his fashion show by force. Patrizia and Maurizio ask Paolo to sell them his shares, but he rebuffs them and cuts ties between them.Italian police ransack Maurizio's house and attempt to arrest Maurizio for forging Rodolfo's signature. Maurizio's family flee to Switzerland, where Maurizio meets his old friend Paola Franchi (Camille Cottin). After an argument between Maurizio and Patrizia, Maurizio decides that he is tired of his wife's influence on himself and the company. He orders his wife and daughter to return to Italy and begins an affair with Paola, which Pina seemingly senses.\nWhen Maurizio's business plans harm the company, he seeks assistance from equity company Investcorp, through which he hatches a scheme to acquire shares of the company from a now-impoverished Paolo. Aldo returns from prison and immediately realizes what Paolo has done. When Investcorp offers to buy Aldo out, he refuses until Maurizio reveals himself as the deal's instigator. Dejected, Aldo sells the shares and cuts contact with Maurizio.Patrizia attempts a reconciliation with Maurizio, but he flatly ignores her. Later, he asks Patrizia for a divorce through his long-time assistant Domenico De Sole (Jack Huston), which Patrizia refuses. Maurizio recruits up-and-coming Texan designer Tom Ford (Reeve Carney) to revitalize the company's image through a new line. Ford's products are successful, but Maurizio has so thoroughly mismanaged the company (Revenues are dropping, company has debt, profits are elusive. Plus, Maurizio has bought many expensive items and billed it to the company as expense) that, by 1995, Investcorp's leaders feel compelled to buy him out for 150 MM dollars, replacing him with Ford and De Sole. Patrizia eventually grows so furious with Maurizio that she asks Pina to help her kill him. Pina puts Patrizia in contact with two hit-men. A few days later, the hit-men shoot Maurizio to death in broad daylight outside his office.Closing intertitles describe the fate of the remaining characters: Aldo died of prostate cancer in 1990 and Paolo died in poverty shortly following the sale of their shares to Maurizio. Patrizia (29 years), Pina (25 years), and the hit-men (26 years) are sentenced prolong prison terms following their arrest for murder. Gucci is fully acquired by Investcorp and successfully managed into the present (net worth of $60 Bn); no Gucci family members remain at the company.",
	"links": [
		"https://www.amazon.com/House-Gucci-HarperCollins-French-Forden-ebook/dp/B09KYFWLJV"
	]
}