{
	"title": "Bronson",
	"release_year": "2008",
	"runtime": "92",
	"tags": [
		"Action",
		"Crime",
		"Drama",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Tom Hardy",
		"Tom Hardy",
		"Kelly Adams",
		"Luing Andrews",
		"Katy Barker",
		"Gordon Brown",
		"Amanda Burton",
		"Mark Devenport",
		"Paul Donnelly",
		"Andrew Forbes",
		"Jon House"
	],
	"staff": [
		"Nicolas Winding Refn",
		"Brock Norman Brock",
		"Nicolas Winding Refn",
		"Danny Hansford",
		"Rupert Preston",
		"Johnny Jewel",
		"Larry Smith",
		"Matthew Newman",
		"Des Hamilton",
		"Adrian Smith"
	],
	"votes": 142328,
	"cover": "https://m.media-amazon.com/images/M/MV5BYTkyNTRkNWUtN2Q3MC00Mzg4LThlZTUtYzEyZjlkYjc1NDA3XkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "Bronson (Tom Hardy) introduces himself to the camera, stating he always wanted to be famous. He cannot sing, he cannot act, and so he shows the calling he found: a cut to a naked Bronson fighting several prison guards in a cage. Then we are presented with several assorted points from his life, inter-cut with Bronson on stage before an audience in several stages of performance make-up, and speaking directly to camera while seemingly behind bars.Michael Peterson is shown as a baby, and then as a young boy involved in fights with pupils and a teacher at school using a desk as a weapon. He had his first job at a chip shop, where he committed his first crime, stealing money from the cash register and giving some of the money and a kiss to a young woman who was working there.\nPeterson ends up roughing up the 2 police officers who come to interrogate him. It is 1974 and it is a tough time to be a young man in England, as jobs are hard to come by.\nHe then goes on to marry the woman, Irene (Kelly Adams) and has a baby with her.Peterson goes to jail after robbing a post office and getting away with a small amount of cash. His first prison sentence is of seven years. At sentencing, his mother (Amanda Burton) hopes he will be out in four but his violence in prison extends his sentence beyond seven years.\nPeterson thrives in prison, comparing it to a hotel room, and every night he displays violent behavior towards the guards, which causes the other inmates to treat him like a star. Peterson intentionally provokes the guards to attack him by refusing every order given to him, and then beats them up mercilessly.When Peterson comes up for parole, he decides that he wants to be famous for being Britain's most violent prisoner. So, Peterson scuttles his chances of parole by picking up more fights.\nThe authorities send him to a series of different prisons in hope that one of them will be able to handle him, but nothing seems to help. Eventually he is sent to Rampton Secure Hospital, where he is injected with high doses of sedative drugs every time he tries to start a fight.A man approaches Peterson while he is being subdued with drugs and seems to be sympathetic to Peterson. This soon changes as the man, John White (Joe Tucker), reveals that he is a pedophile and suggests that he and Peterson should sexually assault a nine-year-old girl. The furious Peterson expresses aggressive hate towards the man but is unable to do anything against him as he is completely paralyzed due to the effects of the drugs pumped into him. Peterson manages to spit at White.In an attempt to prove his sanity and be sent back to prison he finally tries to strangle the pedophile after pretending to be calm for several days. He comments to the audience that despite all his prison time (totaling 26 years and counting) and solitary confinement, he has never killed anyone.Because of this he is sent to the high-security psychiatric hospital, Broadmoor, where he starts a large-scale riot.\nNews footage from the actual event shows Peterson up on the roof, thus being branded \"Her Majesty's most expensive prisoner\". Peterson claims to have caused \"tens of millions of pounds' damage\". He credits this destruction with the government's decision to declare him \"sane\" and have him released.He is received at the prison by his mother, who asks him to meet his Uncle Jack in Luton.\nOn parole and living with his uncle Jack (Hugh Ross) in Luton, he is introduced to Paul Daniels (Matt King), a nightclub owner and a former fellow prisoner with Peterson.\nPeterson becomes involved in bare-knuckle boxing and changes his name to Charles \"Charlie\" Bronson, after the famous actor. Not content with his meager winnings, he ups the stakes by fighting two opponents at once and even fights a dog.\nThis career ends quickly after he falls in love with a woman Alison (Juliet Oldfield), steals an engagement ring, proposes to her and is arrested for robbery. He was out of prison for only 69 days.Back in prison, he is once again involved in several fights with guards, thus extending his sentence. The character of his violent outbursts starts to become more sophisticated.\nHe takes the prison librarian hostage and waits for reinforcements to arrive, alternately screaming at his hostage and peaceably inquiring after his family. When other guards arrive, he strips naked and forces the librarian to assist in applying his \"body armor\" of petroleum jelly, to make him harder to grab in the imminent brawl. After being restrained, he is warned by the prison governor (Jonathan Phillips) that he will die inside if his behavior does not improve.He becomes interested in art, which the prison officials think is a good way to develop his interacting skills with other human beings. Encouraged by a prison art teacher (James Lance), who notices something special in his drawings, he becomes a model prisoner for a while, channeling his confusion and pain into vivid imagery of birds and grotesque creatures.Eventually this project gets out of hand. While prison officials wait outside, he demands music be played. He paints his naked body black and ties the teacher to a post. He paints a mustache onto the teacher's face, forces an apple into his mouth and removes his hat and glasses to put on the teacher's head, making the teacher into a parody of a Magritte painting. After this human still-life has been arranged to his satisfaction, he accepts his fate, calling for the prison guards to burst in for yet another brawl, for which he will be sent back to solitary confinement.Charles Bronson has not been granted a release date, and he is seen badly beaten, his chin torn, groaning, in what is effectively a cage coffin in the center of a large, dark room.",
	"links": [
		"https://www.amazon.com/Bronson-Tom-Hardy/dp/B0037VIBGY"
	]
}