{
	"title": "Don't Look Up",
	"release_year": "2021",
	"runtime": "138",
	"tags": [
		"Comedy",
		"Drama",
		"Sci-Fi",
		"netflix"
	],
	"rating": 7.2,
	"actors": [
		"Leonardo DiCaprio",
		"Jennifer Lawrence",
		"Meryl Streep",
		"Cate Blanchett",
		"Rob Morgan",
		"Jonah Hill",
		"Mark Rylance",
		"Tyler Perry",
		"Timothée Chalamet",
		"Ron Perlman"
	],
	"staff": [
		"Adam McKay",
		"Adam McKay",
		"David Sirota",
		"Adam McKay",
		"Kevin J. Messick",
		"Nicholas Britell",
		"Linus Sandgren",
		"Hank Corwin",
		"Francine Maisler",
		"Clayton Hartley"
	],
	"votes": 615451,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjhhNWFjNzctYTJjOS00MDc0LThiNjItZmM0ZDVmMWViY2UzXkEyXkFqcGc@._V1_QL75_UY281_CR18,0,190,281_.jpg",
	"description": "Kate Dibiasky (Jennifer Lawrence), a Michigan State University astronomy graduate student doing work with the Subaru Telescope, discovers a previously unknown near-Earth object. Her professor, Dr. Randall Mindy (Leonardo DiCaprio), calculates that the comet will impact Earth in about six months, and is large enough to cause a planet-wide extinction event. NASA internally confirms Mindy's calculations. Accompanied by NASA's Planetary Defense Coordination Office head Dr. Teddy Oglethorpe, (Rob Morgan) Dibiasky and Mindy present their findings to the White House but are met with apathy (They are made to wait all day in the waiting hall (and then put up in a cheap motel for the night) before being granted an meeting with the President and her top advisers) from President Janie Orlean (Meryl Streep) and her son, Chief of Staff Jason Orlean (Jonah Hill). The comet is predicted to strike off the coast of Chile with the power of a billion Hiroshima bombs. This is an extinction level event. 100% certainty of impact. Yet the White House's reaction is to wait and assess, as Janie explains that she has had many \"end of the world\" meetings during her tenure as President.Oglethorpe urges Dibiasky and Mindy to leak the news to the media, and they do on a morning talk show hosted by Brie Evantee (Cate Blanchett) and Jack Bremmer (Tyler Perry). The world is still engrossed with the breakup news of pop star Riley Bina (Ariana Grande) and her boyfriend DJ Chello (Scott Mescudi). Mindy and Dibiasky meet Bina at the waiting room for the talk show. Bina reconciles with Chello on live TV, even though Chello cheated on Bina publicly. Chello proposes and Bina accepts.When the hosts do not take the threat seriously, Dibiasky loses her composure and rants about the threat, prompting widespread online mockery. Dibiasky's boyfriend Phillip (Himesh Patel) dumps her by publicly denouncing her, while the stoic Mindy receives public approval. The actual news about the comet's threat receives little public attention. Furthermore, the threat of the comet is publicly denied by Orlean's Director of NASA Dr Calder (who calls the story more near miss hysteria), a top donor to Orlean with no background in aeronautics.When Orlean is involved in a sex scandal (She has sent pics of her private parts to her supreme court nominee), she diverts attention and improves her approval ratings by confirming the threat of the comet and announcing a project to launch a spacecraft that can strike and divert the comet. Benedict Drask (Ron Perlman), a general, is tasked with piloting the spacecraft that will divert the course of the comet.Due to this pivot and Janie wins the approaching mid-terms. Her popularity skyrockets and she gets her supreme court nominee approved in the Senate.\nThe spacecraft successfully launches but is forced to turn back by Orlean when Peter Isherwell (Mark Rylance), the tech billionaire CEO of BASH and another of Orlean's top donors, discovers that the comet is composed of trillions of dollars' worth of rare-earth elements. The White House agrees to commercially exploit the comet by fragmenting and recovering it from the ocean using new technology proposed by BASH's Nobel Laureates that has not undergone scholarly peer review.The White House sidelines Dibiasky and Oglethorpe, while hiring Mindy as the National Science Advisor. Dibiasky reveals the government's plan to let the comet hit Earth, sparking riots worldwide. Orlean's administration threatens Dibiasky into silence. Mindy becomes a prominent voice advocating for the comet's commercial opportunities and begins an affair with Evantee. World opinion is divided among those who demand total destruction of the comet, those who decry unjustified Alarmism and believe the mining of the comet will create jobs, and those who deny that the comet even exists.Dibiasky returns home to Illinois (where she is disowned by her parents who are in support of the jobs that the comet is going to create) and begins a relationship with a teenage boy named Yule (Timothée Chalamet). Mindy's wife, June (Melanie Lynskey), discovers his infidelity and leaves him. Mindy becomes angry (after he questions Peter on the lack of scientific peer review of his plan. Peter insults Mindy by saying that BASH has 40 MM data points on Mindy, knows what diseases he is going to have and when and how he is going to die), voicing his frustrations on live television, launching into a rant criticizing Orlean's administration for downplaying the impending apocalypse and questioning humanity's indifference. Subsequently, he leaves the operation to commercially exploit the comet and reconciles with Kate as the comet becomes visible from Earth.\nAs Mindy, Dibiasky and Oglethorpe organize a protest campaign on social media against Orlean and BASH telling people to \"Just Look Up\" and calling on other countries to conduct operations of their own to deflect the comet, Orlean's administration launches an opposing campaign, \"Don't Look Up\". Bina and Chello support Mindy's campaign and even organize a concert to help spread their message.When Orlean cuts out China, India and Russia from the comet mining deal, the three countries conduct a joint attempt of their own to deflect the comet, but their spacecraft explodes at launch. BASH's attempt at breaking the comet apart also goes awry (4 ships, out of 30 fail to launch) and fails (Many more explode on the comet and never complete their mission of deploying micro nukes. The explosives fail to fire in sync and the comet is still whole), leading to Isherwell, Orlean and some other wealthy Americans fleeing Earth on a spaceship (with 2000 seats) designed to keep its passengers alive Cryogenically while it seeks the nearest Earth-like planet. Peter's algorithms had predicted that they would be eaten by a Bronteroc, but they don't know what it means.\nOrlean offers Mindy two places on the ship, but he declines, choosing to spend his last moments in the company of his family, Dibiasky, Yule, and Oglethrope. The evacuees inadvertently leave Jason behind. The comet hits the planet, killing the majority of the population of Earth, though some survive; the minority includes Jason, who sees nobody around him, and then posts about this on social media.22,740 years later, the Americans who left Earth prior to the impact land on a lush alien planet, ending their cryogenic sleep. They exit their spacecraft nude and mostly empty-handed. Orlean is quickly killed and eaten by an alien creature called a Bronteroc, while more Bronterocs approach the humans.",
	"links": [
		"https://www.netflix.com/title/81252357"
	]
}