{
	"title": "The Ides of March",
	"release_year": "2011",
	"runtime": "101",
	"tags": [
		"Drama",
		"Thriller",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Paul Giamatti",
		"George Clooney",
		"Philip Seymour Hoffman",
		"Ryan Gosling",
		"Evan Rachel Wood",
		"Marisa Tomei",
		"Jeffrey Wright",
		"Max Minghella",
		"Jennifer Ehle",
		"Gregory Itzin"
	],
	"staff": [
		"George Clooney",
		"George Clooney",
		"Grant Heslov",
		"Beau Willimon",
		"George Clooney",
		"Grant Heslov",
		"Brian Oliver",
		"Alexandre Desplat",
		"Phedon Papamichael",
		"Stephen Mirrione",
		"Ellen Chenoweth",
		"Sharon Seymour"
	],
	"votes": 232399,
	"cover": "https://m.media-amazon.com/images/M/MV5BNTU4MjkzNTY0OF5BMl5BanBnXkFtZTcwNDI5ODIxNg@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Stephen Myers (Ryan Gosling) strolls up to a podium in an auditorium and begins to speak on his religious preferences. Stephen isn't a candidate but one of the main staffers for a candidate. He adds padding to Gov. Mike Morris (George Clooney) side, so his height will match his opponent.\nGovernor Mike Morris, a popular, idealistic candidate is going up against Senator Pullman in a Democratic primary. It is clear whoever wins Ohio, will win the nomination and will go on to run for President. Morris and Pullman have their debate in which Pullman questions Morris' views on religion. Morris deflects them easily saying he was a former catholic and does not know what happens after death. All he knows is he is not an atheist, Jewish, Muslim, or any other religion association.Stephen and Paul Zara (Phillip Seymour Hoffman), the senior campaign manager to Morris, bump into Tom Duffy (Paul Giamatti). Duffy is the head campaign manager for Pullman.\nPaul and Stephen have dinner with Ida (Marisa Tomei) a reporter they are both friendly with. Stephen notes he has been on more campaigns than most people have when they're 40, and he has never seen a guy like Morris. Ida doesn't buy into his idealism, thinking all politicians are the same.The next day, Stephen crosses paths with Molly (Evan Rachel Wood), an intern he had worked with before. Molly mentions the dive bar most of the interns go to and invites Stephen to have a drink with her the next night. Stephen agrees.Paul has a meeting with Senator Thompson (Jeffery Wright) at his home. They need his endorsement so that his delegates will vote his way. Thompson wants something.\nStephen and Morris have a meeting with the staffers. Stephen tells Morris he should go all the way on one of his policies; mandatory service via army, peace Corp etc. in return for college tuition being paid. Duffy calls Stephen for a meeting. Stephen calls Paul and leaves a message and tells him that it's important.Duffy wants to recruit Stephen to Pullman's camp. They already promised Senator Thompson a cabinet position, so the race is basically over. Stephen refuses & when Paul calls, says its nothing.\nMolly and Stephen go for a drink that night. Molly reveals her father is Jack Stearne (Gregory Itzin), the DNC chairman and that he is an asshole. The morning after. Stephen and Molly had slept together the night before. Stephen asks she stay quiet about their dalliance and Molly promises to.Stephen, Morris, and several staffers including Ben Harpen (Max Minghella) are on a plane going to another speech. In the back, Stephen confesses to Paul that he met with Tom Duffy. He offered him a job and explained that Sen. Thompson is being promised a cabinet position. Paul is enraged that Stephen lied to him. Paul tells Stephen to find an empty room. They are going to talk to Morris after the speech.Morris finds out about Senator Thompson wanting to be Secretary of State in exchange for his endorsement. Morris refuses to budge saying they need win Ohio another way. Morris' team hits the pavement trying to rally support and do damage control in light of recent developments. Morris and his wife Cindy talk in the car. Cindy tells him to give Thompson what he wants so they can win.Stephen and the staffers are on the bus when he gets an IM from Molly asking if he wants to meet up again. They have sex again. Later, Molly is sleeping when her phone goes off. Stephen answers it, but they hang up. It was Morris' calling. Molly cracks and tells him Morris and she had an affair one time. Molly says (she's pregnant). Stephen is blown away; his squeaky-clean candidate is more dirty than he thought.The next day, Stephen tells Ben to take out the maximum petty cash they can withdraw (500). He meets with Molly, telling her to meet him later.\nStephen meets with Ida who knows about his meeting with Tom Duffy. Ida reveals unless he gives her information on Thompson, she will leak his story. Stephen calls Duffy who denies leaking the story. Stephen sees some men taking pictures and gets paranoid. He hangs up.Stephen meets Molly with $1,800. She needs to get an abortion and then go home. She can no longer work on the campaign. Stephen takes Molly to the clinic, promising to pick her up afterward.\nStephen meets with Paul. Ben is in the room, as well. Paul reveals he leaked the story. It will give them justification to fire him from the campaign. Stephen is shocked, but Paul gives him a monologue about being honest & loyal to your candidate. Paul tells Stephen he is fired, and Morris agrees with it. It's because they can't trust him.Molly is never picked up by Stephen. She eventually has to take a cab back to the hotel. Ben is in her room saying he just got promoted to Stephen's job and Stephen was fired threatening to bring everyone down. Molly is scared, thinking she is about to be used as a pawn in Stephen's game and she will be humiliated when he secret pregnancy because of Morris is used by Stephen to \"bring everybody down\"\nStephen meets with Tom Duffy saying he wants in. Duffy says he knows he just got fired, and it will look bad if they take him on. Realization washes over Stephen. \"You never intended on hiring me.\" he says. Duffy talks around the issue but eventually admits it more or less. If he played off Paul's ethics of loyalty so he would fire Stephen, they could poach him. If they didn't want him, Paul and Morris still wouldn't have him. Duffy would still cause a large blow to Morris' campaign.Stephen goes back to the hotel and sees a man rush out of Molly's room. He goes inside and sees her body on the floor. She killed herself. Stephen eyes her phone and steals it. He listens to her voicemail, pleading for him not to do anything rash (like leak her affair with Morris). Tears brim in his eyes.\nSteven meets with Thompson, who seems to not know he was fired. Thompson reveals that he wants the cabinet position, and if he does not have confirmation from Morris by the next day, he will endorse Pullman.Morris holds a press conference about Molly's death, claiming not to know her too well. He gets a call from Molly's cell & sees Stephen. Stephen asks Morris to fire Paul & hire him as head manager. Morris WILL endorse Thompson and get his delegate's support. Morris asks what he thinks he has. Stephen tells him that you can do a lot in this country; you can start wars, ruin the budget, take bribes. \"But you can't have sex with the interns.\" Morris is defiant, telling him that everything is circumstantial. Stephen tells him that she was pregnant, and he took her to the clinic.Morris goes on the defensive. The girl is dead. Since she had an abortion, there is no DNA evidence. It will just be Stephen's word versus his. And he is just a disgruntled ex-staff member. Stephen says there was a note he took.\nPaul is getting a haircut and walks out a barbershop the next day. Morris is nearby in his SUV asking to talk for a minute. We don't see or hear the conversation, but Paul gets out stunned. He has been fired. Paul later gets on TV, claiming new positive numbers made him, and Morris mutually decide to hand it over to someone different (Stephen).Stephen attends Molly's funeral while her father cries at the pulpit saying his daughter was a good person that enriched everyone she knew. Stephen talks to Paul, who reveals he knew Molly since she was born. Paul notes he got a consulting job on K Street for a million a year, a cushy job \"where people won't F**K you over.\" Paul says that he and Stephen should have a beer one day, and Stephen can tell him what he had on Morris to make him fire Paul.Thompson endorses Morris and asks for his delegates support in voting for Morris. Stephen watches from the crowd, apathetically watching as Thompson and Morris speak in platitudes when he knows their real character and motivations.\nBen is working in an office when a new intern, a brunette dead ringer for Molly introduces herself as Jill Morris (no relation).Stephen is walking to an interview when he is stopped by Ida, asking if he wants to comment on a story she is doing. Ida claims that Stephen handed the Thompson endorsement to Morris and that he got Paul fired.\nStephen sits in a chair to do a TV interview. As they put an earpiece in and check the audio, Stephen sits in the chair in silence and meditates on the past couple weeks. Duffy's grim prediction has rung true; he is no longer hopeful about the future of politics. He is just another cog in the machine. His idealism has been irrevocably shattered. He was willing to use Molly, a scared, young girl to get back at Morris and Paul. His actions indirectly caused her suicide.Stephen listens as Morris gives his speech mentioning that integrity and dignity matters. Stephen now knows Morris has neither. Morris for all his talk is just like the rest of the politicians. When pushed came to shove he failed the test of character. Rather than own up to them, he swept his scandal under the rug and fired his loyal friend.The news broadcaster comes into the earpiece, saying they are speaking to new head manager of the Morris campaign, Stephen Myers. The newscaster asks him how recent upheavals including Thompson's endorsement came to be. Stephen stares at the camera with a blank, chilling expression.",
	"links": [
		"https://www.amazon.com/Ides-March-George-Clooney/dp/B006X4MUYG"
	]
}