{
	"title": "Moon",
	"release_year": "2009",
	"runtime": "97",
	"tags": [
		"Drama",
		"Mystery",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.8,
	"actors": [
		"Sam Rockwell",
		"Kevin Spacey",
		"Dominique McElligott",
		"Rosie Shaw",
		"Adrienne Shaw",
		"Kaya Scodelario",
		"Benedict Wong",
		"Matt Berry",
		"Malcolm Stewart",
		"Robin Chalk"
	],
	"staff": [
		"Duncan Jones",
		"Duncan Jones",
		"Nathan Parker",
		"Stuart Fenegan",
		"Trudie Styler",
		"Clint Mansell",
		"Gary Shaw",
		"Nicolas Gaster",
		"Manuel Puro",
		"Jeremy Zimmermann",
		"Tony Noble"
	],
	"links": [
		"https://www.amazon.com/Moon-Sam-Rockwell/dp/B0030B0S2Q"
	],
	"votes": 379822,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTgzODgyNTQwOV5BMl5BanBnXkFtZTcwNzc0NTc0Mg@@._V1_QL75_UY281_CR1,0,190,281_.jpg",
	"description": "In the near future, Lunar Industries has made a fortune after an oil crisis by building Sarang Station, an automated lunar facility to mine the alternative fuel helium-3 from lunar soil, rich in the material.\nLunar Industries provides for energy needs of 70% of the planet Earth by generating energy from the fusion reactions of helium-3 mined from the far side of the moon.The facility is fully automated, requiring only a single human to maintain operations, oversee the harvesters, and launch canisters bound for Earth containing the extracted helium 3.\nSam Bell (Sam Rockwell) nears the end of his three-year work contract (Sam is supposed to rotate back to Earth in 2 weeks) at Sarang Station. Sam only ever must leave the station when the harvesters have a full load of helium-3 and bring the helium-3 canisters back to the station for further processing and storage, before transportation to Earth. Sam drives to the harvester in a rover, and the rover is small enough that it can drive straight into the harvester's belly through an opening at the back. Once in, Sam replaces the full canisters with the empty ones and drives back to base.Chronic communication problems have disabled his live feed from Earth and limit him to occasional recorded messages from his wife Tess (Dominique McElligott), who was pregnant with their daughter Eve when he left. His only companion is an artificial intelligence named GERTY (Kevin Spacey), who assists with the base's automation and provides comfort for him. GERTY is not a humanoid robot, and he travels around the base with overhead transport trusses installed on the ceilings.Sam has memories of his time on Earth, with his wife Tess.\nTwo weeks before his return to Earth, Sam suffers from hallucinations of a teenage girl. One such image distracts him while driving to the harvester in his rover, causing him to crash his lunar rover into the harvester, which ends with the rover getting tangled in the harvester's tracks. Rapidly losing cabin air from the crash, Sam falls unconscious just after he puts on his space suit and helmet.Sam awakes in the base infirmary with no memory of the accident. He overhears GERTY receiving instructions from Lunar Industries to ramp up production on the other harvesters and to wait for the arrival of a rescue team.\nSuspicious (as communications to Earth are supposed to be non-functional, but GERTY says that the base can receive messages via a link from Jupiter). Sam notices that one of the harvesters is stalled and offers to go out and fix it, but GERTY informs him that instructions are for Sam to stay safe and recover from his injuries.Sam manufactures a fake problem (he engineers a gas leak inside the station and argues that it could be due a micro-meteorite hit) to persuade GERTY to let him outside to check for damage to the exterior shell of the station.\nSam travels to the crashed rover, where he finds his unconscious doppelganger. He brings the double back to the base and tends to his injuries. The two Sams start to wonder if one is a clone of the other. It takes a while for the 2 Sams to get comfortable around each other and get over the initial awkwardness.\nLunar Industries Central relays a new message saying that rescue unit Eliza will reach the Lunar mining station in 14 hours. Older Sam believes that he is going back home with the rescue team. Newer Sam says that nobody is going anywhere and insists that even the older Sam is a clone.\nAfter a heated argument and physical altercation, they coerce GERTY into revealing that they are both clones of the original Sam Bell.\nOlder Sam realizes that the 100+ messages he sent Tess, were never delivered to her. And the video messages he got from Tess, were recordings of the messages between Tess and the Original Sam. His memories of Tess and his daughter Eve are memory implants.GERTY activated the newest clone after the rover crash and convinced him that he was at the beginning of his three-year contract. GERTY says that Lunar Industries Central has no knowledge that the older Sam has been recovered from the crash site by the newer Sam.\nNewer Sam wonders how he got to the lunar station so fast after older Sam's accident and believes that there might be other clones in the station.\nMeanwhile the older Sam is not feeling very well, and his health is getting worse every hour. As GERTY sees older Sam in pain, it shows him video logs of all the Sams before him and that they die at the end of their service life of 3 years, which is disguised as their contract term. The Older Sams enter a hibernation pod for transport back to Earth and are instead incinerated.The two Sams search the facility, discovering a secret vault (underneath the Hibernation pod) containing hundreds of hibernating clones. They determine that Lunar Industries is unethically using clones of the original Sam Bell to avoid the cost of new astronauts.Newer Sam also believes that he heard GERTY having a live conversation with central. He believes that the communication signal is being jammed outside the base and they are being lied to as Central does not want them talking to anybody on Earth.\nThe elder Sam drives past the interference radius in a second rover and tries to call Tess on Earth. He instead makes contact with Eve (Kaya Scodelario), now 15 years old, who says Tess died \"some years ago.\" He hangs up when Eve tells her father (offscreen, identified as \"Original Sam\") that someone is calling regarding Tess.The two Sams realize that the incoming rescue team will kill them both if they are found together. The newer Sam convinces GERTY to revive another clone, planning to leave the revived clone's corpse in the crashed rover and send the older Sam to Earth in one of the helium-3 transports. But the older Sam, with his health declining, knows that he will not live much longer, having learned that the clones are designed to \"break down\" at the end of the 3-year contract. The older Sam suggests the younger Sam leave instead, and that he (the older Sam), is placed back into the crashed rover to die so Lunar Industries will not suspect anything.Following GERTY's advice, the younger Sam reboots GERTY to wipe its records of the events. Before leaving, the younger clone programs a harvester to crash and wreck a jamming antenna, thereby enabling live communications with Earth. The older Sam, back in the crippled rover, remains conscious long enough to watch the launch of the transport carrying the younger Sam to Earth. The rescue team finds the newly awakened clone in the medical bay and the body of the older Sam and are fooled.The transport arrives at Earth, and news reports describe how Sam's testimony on Lunar Industries' activities has stirred up an enormous controversy, and the company's unethical practices have plummeted the company's stock."
}