{
	"title": "I Love You, Man",
	"release_year": "2009",
	"runtime": "105",
	"tags": [
		"Comedy",
		"Romance",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Paul Rudd",
		"Jason Segel",
		"Rashida Jones",
		"Sarah Burns",
		"Greg Levine",
		"Jaime Pressly",
		"Jon Favreau",
		"Jane Curtin",
		"J.K. Simmons",
		"Andy Samberg"
	],
	"staff": [
		"John Hamburg",
		"John Hamburg",
		"Larry Levin",
		"Donald De Line",
		"John Hamburg",
		"Theodore Shapiro",
		"Lawrence Sher",
		"William Kerr",
		"Allison Jones",
		"Andrew Laws"
	],
	"votes": 218154,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTU4MjI5NTEyNV5BMl5BanBnXkFtZTcwNjQ1NTMzMg@@._V1_QL75_UX190_CR0,6,190,281_.jpg",
	"description": "Peter Klaven (Paul Rudd), a real estate agent, just got engaged to his girlfriend Zooey Rice (Rashida Jones). Zooey is ecstatic about the engagement and calls her friends Denise (Jaime Pressley) and Hailey (Sarah Burns) to tell them about it, but Peter does not seem to have any close friends to share the good news with. Peter is apparently more adept at getting along with women and has a history of allowing his male friends to fall by the wayside when he is involved with a woman. Peter realizes he needs to find male friends in order to have a best man for his upcoming wedding.Peter turns to his gay younger brother, Robbie (Andy Samberg), for advice on dealing with men. He attends a Major League Soccer game with a man named Lonnie (Joe Lo Truglio), who has a rather loud and annoyingly high-pitched voice. He has dinner with another man named Doug (Thomas Lennon), who he soon discovers is bisexual. He also has lunch with an elderly man named Mel (Murray Gershenz). He even joins Denise's somewhat hostile husband, Barry (Jon Favreau), and his friends for their poker night. Peter inadvertently projectile-vomits on Barry after winning a beer-drinking contest, prompting an angry Barry to kick him out of his house.\nFeeling rejected, Peter is about to give up, when during an open house at Lou Ferrigno's mansion which Peter is trying to sell, he meets Sydney Fife (Jason Segel), an investor who is attending the showing simply to pick up divorced women and take advantage of the free food. The two hit it off very well and exchange business cards.The two quickly become friends, and Sydney eventually invites Peter into his \"man cave,\" a space in his garage where he keeps his collection of musical instruments and various other belongings. Peter finally introduces Sydney to Zooey at their engagement party, where Hailey makes advances on Sydney, who appears uninterested. The meeting takes an unfortunate turn when a nervous Sydney makes a very awkward toast.The next night, Peter is watching TV with Zooey, when Sydney calls and talks Peter into joining him for a Rush concert. Hesitant to break his plans, Peter reluctantly agrees to go on the condition that he can bring Zooey. During the concert, Peter and Sydney bond, leaving Zooey feeling ignored. The next day, while shopping for tuxedos, Sydney asks Peter why he is marrying Zooey, and also asks for an $8,000 loan. After some thought, Peter decides to lend Sydney the money, and later grants him the honor of being best man at his wedding.Zooey, meanwhile, has become suspicious of Sydney, especially after he gets into a fight with Lou Ferrigno (as himself), which may cost Peter the exclusive sales rights to Ferrigno's house. Peter tells Zooey that he lent Sydney money and asks her if she knows why they are getting married, Zooey leaves to stay at Denise and Barry's house.Peter leaves for work the next morning only to discover that Sydney has used the $8,000 loan to purchase several ridiculous billboard advertisements promoting Peter's real estate business. Still upset over his fight with Zooey, Peter confronts Sydney and decides to end their friendship. Peter then patches things up with Zooey.Upon arriving at work, Peter discovers that Sydney's billboard advertising campaign was successful, as he immediately begins receiving more clients and offers on the Ferrigno house. Encouraged by this career boost, Peter finally stands up to his insufferable colleague, Tevin Downey (Rob Huebel), who has been badgering Peter for half the selling rights to the lucrative Ferrigno property. When Tevin makes one final attempt to get a piece of the Ferrigno listing, Peter slaps him across his face and tells him to stay away from it.While Zooey and Peter prepare for the wedding, Sydney finds himself alone and desperate to hang with someone, but phone calls to his other friends, who all have wives and children, prove futile, and he even out of boredom and depression, watches Chocolat, which is a movie Peter mentioned watching with Zooey on what he felt was the best night of his life in the last couple of years.Peter feels bad about fighting with Sydney but does not re-invite him to the wedding. Instead, he assembles an array of random groomsmen that includes Robbie, Father Oswald (J. K. Simmons), Doug, Lonnie, Mel, and Ferrigno. Before the wedding, Zooey sees Peter looking forlorn, clearly missing his friend Sydney. She calls and invites Sydney, who is, unbeknownst to them, already en route to the wedding. Just before the vows are to be taken, Sydney makes a dramatic entrance via moped. He informs Peter and Zooey that he is, in fact, a successful investor and returns the money he borrowed from Peter, stating that the billboards were the couple's wedding present. Peter and Zooey declare their love to each other, Sydney assumes the role of best man, and the wedding commences.As the end credits begin to roll, we see the wedding reception, where Peter and Sydney join the hired band (played by OK Go) in a rendition of the Rush song \"Limelight\" and even pull Zooey on stage to join them. Meanwhile Hailey and Lonnie get together, Denise ends up throwing up on Barry, whose anger over it subsides when she mentions she's pregnant, and finally when the song ends, Sydney attempts to toast the newlyweds and Peter runs to frantically stop him as the screen cuts out (still remembering Sydney's ill-advised toast at the engagement dinner.)",
	"links": [
		"https://www.amazon.com/Love-You-Man-Paul-Rudd/dp/B002ICE0O0"
	]
}