{
	"title": "The Hobbit: The Desolation of Smaug",
	"release_year": "2013",
	"runtime": "161",
	"tags": [
		"Adventure",
		"Drama",
		"Fantasy",
		"max",
		"amazon"
	],
	"rating": 7.8,
	"actors": [
		"Ian McKellen",
		"Martin Freeman",
		"Richard Armitage",
		"Ken Stott",
		"Graham McTavish",
		"William Kircher",
		"James Nesbitt",
		"Stephen Hunter",
		"Dean O'Gorman",
		"Aidan Turner"
	],
	"staff": [
		"Peter Jackson",
		"Fran Walsh",
		"Philippa Boyens",
		"Peter Jackson",
		"Guillermo del Toro",
		"Carolynne Cunningham",
		"Peter Jackson",
		"Eric Monette",
		"Fran Walsh",
		"Howard Shore",
		"Andrew Lesnie",
		"Jabez Olssen",
		"Victoria Burrows",
		"Amy Hubbard",
		"John Hubbard",
		"Liz Mullane",
		"Dan Hennah"
	],
	"links": [
		"https://www.max.com/movies/hobbit-the-desolation-of-smaug-extended-edition/6ba42b80-1619-4ed4-b250-0f0718fd3141",
		"https://www.amazon.com/Hobbit-Desolation-Sir-Ian-McKellen/dp/B00ISJSK7K"
	],
	"votes": 714507,
	"cover": "https://m.media-amazon.com/images/M/MV5BMzU0NDY0NDEzNV5BMl5BanBnXkFtZTgwOTIxNDU1MDE@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "At the Inn of the Prancing Pony in Bree, Gandalf (Ian McKellen) persuades Thorin Oakenshield (Richard Armitage) to obtain the Arkenstone to unite the Dwarves. The 7 armies of the dwarfs have sworn their allegiance to the king who wields the Arkenstone, a jewel that was stolen by the Smaug, before he overtook Lonely Mountain & set up base there. Gandalf suggests that the Dwarves army is the best way to destroy Smaug & to take back the lonely mountain. He suggests that a stealthy burglar would be needed to steal the jewel back from Smaug.One year later, Thorin and his company are being pursued by Azog (Manu Bennett) and his Orc party down the Carrock following the events of the previous film. After Bilbo (Martin Freeman) informs the group that a massive black bear is also tracking them, Gandalf ushers them along to the nearby home of Beorn (Mikael Persbrandt) to seek his aid; Beorn is a skin-changer who sometimes takes the form of the bear.That night, Azog is summoned to Dol Guldur by the Necromancer (Benedict Cumberbatch) and instructs his son Bolg (Lawrence Makoare) to take over the hunt for Thorin.\nThe following day, the bear changes shape to become Beorn. Beorn advice Gandalf to avoid the direct road to Lonely Mountain as it goes through Dol Guldur where the Orcs have an alliance with the Necromancer. Instead, he tells them to take the road via Mirkwood which goes through Elve country. The company reaches Mirkwood. Here Gandalf discovers Black Speech graffiti imprinted on an old ruin, and abruptly leaves without explanation after warning them to remain on the path and wait for him before entering the Lonely Mountain. However, they lose their way and are caught by giant spiders. Bilbo, with the help of the One Ring, sets about freeing the dwarfs, which results in him dropping the ring; Bilbo begins to learn of the corrupting influence the ring has on him after brutally killing a spider to retrieve it.At the same time the Wood Elves arrive, led by Legolas (Orlando Bloom) and Tauriel (Evangeline Lilly), who imprison the Dwarves following an altercation with the Elven king Thranduil (Lee Pace). Thranduil offers Thorin freedom in return for Thorin getting the starlight jewel from the Lonely Mountain back to Thranduil. Thorin confronts the king about his neglect of the Dwarves of Erebor following Smaug's attack 60 years earlier and is consequently imprisoned with the other Dwarves.Bilbo again uses the magical powers of the ring to make himself invisible & infiltrates the Elve fortress where the dwarfs have been kept hostage. He manages to arrange an escape using empty wine barrels that are sent downstream. While being pursued by the Elves, they are ambushed by Bolg and his Orc party and Kili is wounded.\nThranduil seals off his kingdom when he learns that an evil entity has returned and is amassing great power in the south, but the captain of the Elve guard Tauriel disobeys him and leaves to assist the dwarfs (she is smitten by one of the dwarfs who is taller than the others, Kili (Aidan Turner)), followed by Legolas (Thranduil's son who is smitten with Tauriel).Meanwhile, Gandalf meets Radagast (Sylvester McCoy) to investigate the tombs of the Nazgul, which are found empty. The tombs contained the 9 servants of evil that answered to the dark lord Sauron. Gandalf reveals to Radagast that they answer to only one master & that Sauron has returned.The company then meets a man named Bard (Luke Evans) who smuggles them into Esgaroth, the Lake-town where the descendants of Dale now reside. Thorin promises the Master of Lake-town and its people a share of the mountain's treasure for their assistance and receives a grand farewell. Kili is forced to stay behind, tended by Fili (Dean O'Gorman), Oin (John Callen) and Bofur (James Nesbitt). Bard opposes Thorin's offer publicly, but it is also revealed that Bard is a descendant of the last ruler of Dale and possesses the last black arrow capable of defeating Smaug. Bard's ancestor had fired 3 arrows at the Smaug & managed to injure it but could not defeat it in battle.Meanwhile, Gandalf returns to Dol Guldur in the south, while Radagast is sent to warn Galadriel (Cate Blanchett) of their discovery at the tombs. Gandalf finds the ruins infested with orcs and is subsequently attacked by Azog. While he attempts to escape, the Necromancer reveals itself, and a duel erupts between the two. The Necromancer overpowers Gandalf and reveals its true identity as the Dark Lord Sauron.Meanwhile, Thorin and his remaining company reach the Lonely Mountain, where Bilbo discovers the hidden entrance and is sent to retrieve the Arkenstone, only to awaken Smaug (Benedict Cumberbatch).In Laketown, Bard attempts to bring the black arrow to the town's launcher, but is arrested in the process, leaving his son to hide the arrow. Kili, Fili, Oin, Bofur and Bard's daughters are then attacked by Bolg and his Orc party, who have infiltrated the town in search of Thorin. Legolas and Tauriel arrive soon after and fend off the Orcs. Legolas leaves in pursuit of Bolg, while Tauriel stays to tend to Kili; the two then acknowledge the bond that has developed between one another. Meanwhile, a defeated and imprisoned Gandalf awakens and watches as Azog and the Orc army march off towards the Lonely Mountain.Meanwhile, Bilbo and the Dwarves, now being hunted by Smaug, trick the dragon into rekindling the forges, and attempt to kill him by drowning him in molten gold. However, Smaug emerges and stumbles out of the mountain, determined to destroy Lake-town and its people for aiding the Dwarves. He then takes to the air as Bilbo watches in horror at what they have unleashed."
}