{
	"title": "Foxcatcher",
	"release_year": "2014",
	"runtime": "134",
	"tags": [
		"Biography",
		"Drama",
		"History",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Steve Carell",
		"Channing Tatum",
		"Mark Ruffalo",
		"Vanessa Redgrave",
		"Sienna Miller",
		"Anthony Michael Hall",
		"Guy Boyd",
		"Brett Rice",
		"Jackson Frazer",
		"Samara Lee"
	],
	"staff": [
		"Bennett Miller",
		"E. Max Frye",
		"Dan Futterman",
		"Anthony Bregman",
		"Megan Ellison",
		"Jon Kilik",
		"Bennett Miller",
		"Rob Simonsen",
		"Greig Fraser",
		"Jay Cassidy",
		"Stuart Levy",
		"Conor O'Neill",
		"Jeanne McCarthy",
		"Jess Gonchor"
	],
	"votes": 150590,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTQ2MjQxNjYxOV5BMl5BanBnXkFtZTgwMzIwODUxMzE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Olympic wrestling champion Mark Schultz (Channing Tatum) speaks at an elementary school in place of his older brother, Dave Schultz (Mark Ruffalo). Both are Olympic gold medal-winning wrestlers, but despite his own achievements Mark feels overshadowed by Dave. Mark is contacted by philanthropist and wrestling enthusiast John E. Du Pont (Steve Carell), an heir to the E.I. Du Pont family fortune, who arranges to fly Mark to his estate in Pennsylvania where Du Pont has built a private wrestling training facility. Du Pont then invites Schultz to join his wrestling team, \"Team Foxcatcher\", to train for the World Championship and be paid. Mark accepts the offer, with Du Pont urging him to enlist his brother Dave as well. Dave declines for the sake of his wife and two kids who are settled where they live, so Mark moves to Pennsylvania alone.Mark stays in a homey guest house (\"the chalet\") and is greeted there later in the night by Du Pont. Through training with his new teammates and Du Pont's financial support, Mark excels with Foxcatcher, winning Gold at the 1987 World Wrestling Championships, with coaching inputs at critical points from Dave. Du Pont praises him, and they develop a kind of friendship. Du Pont introduces Mark to cocaine, which he starts to use regularly. He confides in Mark, whom he now calls a true friend, telling him how his mother, Jean Du Pont (Vanessa Redgrave), paid a boy to act as his friend. Jean Du Pont tells her son that she believes wrestling is a \"low sport\" and she doesn't like seeing him be low. One day, Mark and his teammates in Foxcatcher take a morning off from training to watch mixed martial arts (MMA) on TV. Angered by this (as well as Mark's insistence that his brother will not join Team Foxcatcher), Du Pont verbally and physically rebuffs him, saying that he'll enlist Dave by any means necessary.Dave decides to move with his family to Pennsylvania so he can join Foxcatcher, after John basically asks him to name his price. His self-esteem damaged by Du Pont, Mark decides to work and train alone, pushing Du Pont and even Dave away. As Team Foxcatcher prepares to enter the preliminaries for the 1988 Summer Olympics in Seoul, Du Pont's mother is escorted into Du Pont's gym to watch him coach his team. He awkwardly demonstrates basic maneuvers for her and the other wrestlers. Jean leaves in disgust after seeing Du Pont give his back to his student.At the 1988 Olympic Trials in Pensacola, Florida, Mark performs poorly, losing his first match. Angered by his failure, Mark destroys his room, sobs, and goes on an eating binge. Dave manages to break into his room and is alarmed at his brother's condition. They work feverishly so he can make his weight check. As Mark exercises, Dave prevents Du Pont from speaking with Mark. Mark competes well enough to win his match and make the Olympic team. Dave notices that Du Pont is absent, learning that he left for Pennsylvania after being told his mother died. After returning to the estate, Mark tells Dave that \"you and I both know that I can't stay\" at Foxcatcher once the Olympics are over and asks Dave to leave with him. A documentary funded by Du Pont about his exploits with Team Foxcatcher is made, during which Dave is asked to praise him as coach and mentor. Mark loses his matches in Seoul, after which he leaves Team Foxcatcher. While Dave continues to live at Du Pont's estate and train with Foxcatcher, as a condition for his remaining, he negotiates an arrangement with Du Pont to continue to support Mark financially.Later, Du Pont he is seen sitting alone in his mansion's trophy room watching the documentary about Team Foxcatcher, which ends with Mark complimenting Du Pont at a ceremony depicted earlier. Du Pont calls his bodyguard and drives to Dave's home, where he finds him in the driveway working on his car radio. As Schultz approaches Du Pont's car to greet him, Du Pont rolls down his window, asks Dave \"Do you have a problem with me?\", and shoots him at close range. Dave's wife, Nancy (Sienna Miller), calls 911, and as Du Pont drives off, she runs outside to her husband who dies in her arms. Du Pont is arrested, and the film ends showing Mark as he competes in a cage fighting match with the crowd's cheers ringing in his headSubsequent events\nFollowing Dave Schultz's death, his widow, Nancy, and their two children moved to Northern California where they still reside. In June 1997, Schultz was posthumously inducted into the U.S. National Wrestling Hall of Fame. Mark Schultz stopped wrestling competitively after the 1988 Olympic games and now lives in Oregon where he coaches wrestling as well as works as a freelance \"life coach\" and \"inspirational speaker\". In November 1999, John Du Pont agreed in an out-of-court settlement of the civil suit filed against him by Nancy Schultz to pay Dave's three surviving heirs \"at least $35 million\", the largest amount resulting from a U.S. wrongful death suit ever paid directly by one person.A year after the shooting, Du Pont, who had entered a plea of not guilty by reason of insanity, went on trial at the Delaware County Courthouse in Media, PA. After three weeks of testimony followed by seven days of deliberation by the six man and six-woman jury to consider eight distinct possible verdicts, on February 25, 1997, Du Pont was found guilty but mentally ill of murder in the third-degree. He was subsequently sentenced by Common Pleas Judge Patricia Jenkins to 13 to 30 years in prison. According to then Delaware County District Attorney (now MC R-PA7) Pat Meehan, Du Pont was the richest American ever tried for murder in the United States. After a period of further psychiatric treatment at the Norristown State Hospital, Du Pont was eventually transferred first to Cresson State Correctional Institution near Altoona, PA and later to Laurel Highlands State Prison in Somerset where he died on December 9, 2010, at age 72. Both facilities were formerly state-run mental hospitals. At the time of his death from chronic obstructive pulmonary disease and emphysema, John Du Pont had been incarcerated for murder for almost 15 years.Foxcatcher Farm was eventually sold, and the one-and-a-quarter square mile estate broken up for development. A 123-acre segment is now occupied by the campus of The Episcopal Academy, a private independent K-12 school founded in 1785, which moved there in 2008 from split campuses located in the nearby Philadelphia Main Line communities of Merion and Devon. The 90-year-old Du Pont mansion, Liseter Hall, in which Du Pont was raised and had lived for 57 years, was demolished in January 2013. The mansion stood on a 400-acre portion of the property that is now being developed by Toll Brothers into a \"master planned community of 449 luxury homes\" called Liseter Estate",
	"links": [
		"https://www.amazon.com/Foxcatcher-Channing-Tatum/dp/B00R2LU906"
	]
}