{
	"title": "Paddington",
	"release_year": "2014",
	"runtime": "95",
	"tags": [
		"Adventure",
		"Comedy",
		"Family"
	],
	"rating": 7.3,
	"actors": [
		"Hugh Bonneville",
		"Sally Hawkins",
		"Julie Walters",
		"Jim Broadbent",
		"Tim Downie",
		"Madeleine Worrall",
		"Lottie Steer",
		"Geoffrey Palmer",
		"Theresa Watson",
		"Imelda Staunton"
	],
	"staff": [
		"Paul King",
		"Paul King",
		"Hamish McColl",
		"Michael Bond",
		"David Heyman",
		"Nick Urata",
		"Erik Wilson",
		"Mark Everson",
		"Nina Gold",
		"Theo Park",
		"Gary Williamson"
	],
	"votes": 136586,
	"cover": "https://m.media-amazon.com/images/M/MV5BZDUzM2E4NmItNzk2OS00MjIxLTk3M2YtYzJhZjNiZWQyOGRlXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In the deep jungles of darkest Peru, a British geographer named Montgomery Clyde (Tim Downie) happens upon a previously unknown species of bear. He is about to shoot it to take back a specimen to England when another bear playfully takes his gun away. He learns that this family of bears is intelligent and can learn English, and that they have a deep appetite for marmalade. Clyde teaches the bears about the human world (and the city of London) and in turn learns about their way of life. He names them Lucy (Imelda Staunton) and Pastuzo (Michael Gambon). As he departs, he throws his hat to Pastuzo and tells the bears that they are always welcome should they wish to go to London.Years later, the two bears are living in harmony (with all the human artifacts left behind by Clyde, with the most treasured being the hat that Clyde gifted Pastuzo) with their nephew. The nephew has come to love Marmalade as his uncle and aunt and actively seeks the fruit in the jungle to make of the Marmalade from.An earthquake strikes their home, forcing them to seek shelter underground. Distracted and upset at the loss of his home, Pastuzo is unable to reach the shelter in time. He disappears, with his hat being found the next day by his nephew, in the middle of extensive damage to the jungle from the devastating earthquake. Aunt Lucy encourages her nephew to go and find solace in London, after which she says she will move into the Home for Retired Bears.\nLucy says that once there was a war in London and orphans were left in the train station with a label around their necks. The orphans were adopted by strangers and raised as their own kids. Lucy is sure that London has not forgotten this kindness.The young bear arrives in London after stowing away on a cargo ship (and surviving on jars of Marmalade) and reaches Paddington station, but he fails to find a home as all passengers at the station avoid him.\nAs the bear sits in one corner, looking forlorn, the Brown family gets off the train. Henry Brown wants to hurry and not make eye contact with the bear, but Mary approaches the bear and gets to know his story.He is taken in briefly by the Brown family, who name him after Paddington Station, where they found him. Henry Brown (Hugh Bonneville), a devoted risk analyst, is adamant that Paddington (Ben Whishaw) stay only one night while they find a place for him to live permanently.His wife Mary and their two children, their adventurous son Jonathan (Samuel Joslin) and their multilingual but insecure daughter Judy (Madeleine Harris) who also initially shuns Paddington, and their eccentric housekeeper Mrs. Bird come to find Paddington endearing.\nPaddington causes a series of accidents across the house, further isolating himself from the Browns. Paddington floods the bathroom and as Henry opens the bathroom door, it floods the entire house.\nPaddington writes a letter to Lucy observing that London is not how he imagined it to be. He says that he doubts he will ever find a home in the city.Paddington thinks he can find a home with the explorer who found his aunt and uncle (and who said that he would always welcome the bears if they ever came to London) but does not know the explorer's name. Mary Brown (Sally Hawkins) takes Paddington to an antique shop owner Samuel Gruber (Jim Broadbent) who discovers that the hat bears the stamp of the Geographers Guild, but the Guild says that it never sent a member to explore darkest Peru. With the help of Mr. Brown, Paddington infiltrates the Geographers Guild archives and discovers an expedition to Peru was undertaken by Montgomery Clyde, but the Guild erased their record of it. He uses the city's phone books to track the addresses of all the \"M Clyde's\" in London.Meanwhile, a sadistic museum taxidermist named Millicent Clyde (Nicole Kidman) captures, kills, and stuffs exotic animals to house in the Natural History Museum. When she becomes aware of Paddington, she immediately sets out to hunt him down. The Brown family departs for the day, leaving Paddington home alone.Scheming with the Browns' nosy and lonely next-door neighbor Mr. Curry (Peter Capaldi), who instantly falls in love with her, Millicent sneaks in while the Browns are out and attempts to capture Paddington. As he defends himself, he inadvertently starts a fire in the process. Paddington tries to tell the Browns the truth, but due to him not seeing who did it as Millicent was wearing a gas mask, no one believes him.Feeling unwanted at the Browns, Paddington leaves and attempts to track Montgomery Clyde himself. He finally locates the house, only to discover that Clyde died many years ago, and that Millicent is actually his daughter - who resents her father for losing his job and membership with the museum; out of a change of heart, he refused to bring a valuable Peruvian bear specimen home, even though it would have made him the wealthiest man in the world.\nShe pretends to be gracious and welcoming to Paddington but at the museum after he learns of her resentment of her father as well as her desire to stuff him, he tries to escape, but Millicent tranquilizes him and prepares to have him stuffed.Millicent is determined to succeed where her father failed and become rich and famous herself. When Mr. Curry discovers her true intentions, he informs the Brown family, and they rush to save Paddington. They rescue him, and Paddington subdues Millicent by throwing a marmalade sandwich at her, which attracts a huge flock of pigeons, distracting her as family relative Mrs. Bird (Julie Walters) opens a roof hatch and inadvertently pushes her off of the roof, trapping her on a flagpole.In the aftermath, the Browns adopt Paddington into their family and Millicent is sentenced to community service at a petting zoo. Paddington writes to Aunt Lucy saying he is happy and has finally found a home.",
	"links": []
}