{
	"title": "Last Vegas",
	"release_year": "2013",
	"runtime": "105",
	"tags": [
		"Comedy",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Robert De Niro",
		"Michael Douglas",
		"Morgan Freeman",
		"Kevin Kline",
		"Mary Steenburgen",
		"Jerry Ferrara",
		"Romany Malco",
		"Roger Bart",
		"Joanna Gleason",
		"Michael Ealy"
	],
	"staff": [
		"Jon Turteltaub",
		"Dan Fogelman",
		"Amy Baer",
		"Joseph Bechor",
		"Joseph Drake",
		"Laurence Mark",
		"Mark Mothersbaugh",
		"David Hennings",
		"David Rennie",
		"Derrick Dover",
		"Mark Fincannon",
		"Melissa Kostenbauder",
		"Francine Maisler",
		"David J. Bomba"
	],
	"votes": 137463,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTQ2ODg2MTIyNF5BMl5BanBnXkFtZTgwMzU2NjgwMDE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Billy (Michael Douglas), Paddy (Robert De Niro), Archie (Morgan Freeman) and Sam (Kevin Kline) are childhood friends from Flatbush, Brooklyn, who are living in their senior years. Sam and his wife Miriam are living mundane lives in a Florida retirement village. Archie, twice-divorced and retired from the Air Force, lives with his overprotective son Ezra and his family in New Jersey after suffering a stroke. Paddy lives alone curmudgeonly in his Brooklyn apartment in grief since the death of his wife, Sophie, over a year ago. Meanwhile, Billy is a successful entrepreneur in Malibu, California, who lives with his 31-year-old girlfriend Lisa. Shortly after proposing to Lisa, Billy finds an old bottle of scotch he and his friends stole in their childhood days and touches base with Sam and Archie, who immediately propose a bachelor party for Billy in Las Vegas before his wedding that weekend. After receiving permission by Miriam to cheat on her, Sam flies to New Jersey to secretly pick up Archie before driving off to Brooklyn to collect Paddy and fly off to rendezvous with Billy in Vegas.The quartet meet up at the airport, where Billy and Paddy get into a heated argument due to a falling-out in the past. Archie breaks up the fight and demands they stop and enjoy the weekend for a change and to celebrate Billy's wedding with a little fun because \"they need this.\" They head to Binion's Gambling Hall and Hotel to check in, only to realize that the hotel is closed for renovations. Billy gets his assistant to find them a room at the Aria Resort and Casino, since that is where the wedding will be held. While taking a break in the casino, they meet Diana, a lounge singer who charms the guys as they joke about Sam's sex life, Archie's medical issues and Billy's young bride. Paddy begins to express his anger toward Billy for not attending Sophie's funeral and is eventually charmed by Diana to rejoin the group over some martinis. They convince Diana to join them at The Aria where they get stuck in a traffic jam and walk down The Las Vegas Strip.While waiting for their rooms, Archie goes to a blackjack table and has a brief altercation with a cocky gambler named Dean. After Dean leaves the table, Archie buys chips with $15,000 (half of his pension funds), much to Sam and Paddy's surprise. Later, Paddy warns Sam that Archie is on a losing streak and has lost nearly $9,000. They rush to pull him off the table, only to discover that he is actually at $102,000. The trio are noticed by the pit boss, and they reluctantly leave the table in fear of being accused of cheating. Meanwhile, as Billy tours the wedding chapel with Diana, he becomes charmed with her as she explains to him that she moved to Vegas because she was recently laid off as a tax attorney in Atlanta and always wanted to sing despite being a divorced single mother.Later, the quartet become judges of a wild swimsuit competition. They are then confronted by the casino manager, who was impressed with Archie's blackjack game; he happily gives them the best penthouse suite to stay in with their own host, Lonnie, who reluctantly accepts the job as the original guest was supposed to be 50 Cent. Upon entering the suite, Billy suggests they open the old bottle of scotch to celebrate the gang's reunion, but Paddy confronts him about his absence from Sophie's funeral and leaves the group. That night, the remaining three go to Haze where they cut the line after waiting for over an hour where the bouncer stops them and tells them that they can only enter if they buy bottle service, which they eventually agree to after seeing more women enter the club. There, Billy and Sam talk with the bride-to-be and maid-of-honor from a hens party while Archie goes dancing. Dean comes by and begins groping the would be bride and is stopped by Archie, Billy and Sam. Dean attempts to throw a punch at Billy but is knocked down by Paddy, who stopped by to give Archie his cell phone due to several missed calls by Ezra.The next day, while the others are hungover and recovering, Paddy visits Diana and tells her that he and Billy were both in love with Sophie when they were younger, and she picked Paddy to be hers. Diana catches his eye while she tries to convince him to stop grieving and move on with life because Sophie would want it. Afterwards, Paddy joins Billy at their pool cabana and admits he needs to move on from Sophie's passing while also showing concern for Billy about marrying a younger woman. The others join in and discuss throwing a big party in their suite. Later, Dean is brought in by Lonnie to the cabana to apologize for his behavior and is tricked into believing the quartet are four mafia members from the East Coast called \"The Flatbush Four.\" As Billy relaxes, the other three get fancy suits and (with help from Dean) prepare for the bachelor party and invite several people including the hens party, exotic dancers, a band of transvestites, and cast members of Zarkana. Billy later visits Diana at her job, where she tells him she is fond of him. As they walk along The Strip, Billy tells Diana that Paddy gave Sophie an ultimatum to choose either Billy or him and she secretly chose Billy first, but Billy felt Sophie was meant to be with Paddy, so she went with Paddy instead.The bachelor party goes into full force as Paddy gets ready to be social again. Sam meets the maid of honor from the night before who begins flirting with him to his delight. Archie dances with the would be bride and other female party-goers, gives advice to Dean on how to meet women properly, and is confronted by a surprise appearance from a worried Ezra, who is later told by Archie to simply enjoy this special time with his father. Ezra calms down and accepts. As Sam and the maid of honor head upstairs to be alone, he encourages and enjoys her seductive ways but eventually turns them down as he says while the experience of sex with her would be so spectacular, he has a tradition of telling Miriam about all the wonderful things that happen in his life. In order to stay wonderful, he'd have to tell his wife about what really happened in Vegas, which would be devastating to her. Paddy tells Billy he invited Diana to the party because he likes her and wants to start anew after Sophie's passing, but realizes Billy likes her too. They rush to meet her as she enters the party and Billy pushes Paddy into the decorative pool and takes Diana upstairs to tell her that Paddy likes her and to give him a chance. She gets embarrassed and feels like she is being treated like Sophie and \"gifted\" by Billy when Paddy walks in and hears the whole story about Sophie and Billy for the first time. Paddy is devastated and finds the old bottle of scotch, throws it in the trash and leaves the party.The next morning, Paddy confronts Billy at the pool and tells him he does not know women like he loved Sophie for all the years they were together and that the wedding must be stopped. As Lisa and her bridesmaids arrive, Paddy pushes Billy into the pool and as a return favor for his being with Sophie, Paddy tells Lisa the wedding is off. Billy and Lisa talk it over while the guys have small talk with the bridesmaids who are now prepared for a sloppy drunken time with an angry Lisa. As the guys pack up to leave, Billy comes to terms with his age and admits his fear of getting old and being alone. They come together as friends again and tell Billy to go see Diana. Billy shows up at Diana's job and reveals his feelings for her. The guys say their goodbyes to Dean and Lonnie and finally decide to crack open the old bottle of scotch for a final toast.A few months later, Billy and Diana call Archie and Paddy to announce they are getting married. They try to call Sam, but he is unable to answer the phone as he is busy in bed with Miriam.",
	"links": [
		"https://www.amazon.com/Last-Vegas-Robert-Niro/dp/B00HNY6PSW"
	]
}