{
	"title": "Looper",
	"release_year": "2012",
	"runtime": "119",
	"tags": [
		"Action",
		"Drama",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Joseph Gordon-Levitt",
		"Bruce Willis",
		"Emily Blunt",
		"Paul Dano",
		"Noah Segan",
		"Piper Perabo",
		"Jeff Daniels",
		"Pierce Gagnon",
		"Qing Xu",
		"Tracie Thoms"
	],
	"staff": [
		"Rian Johnson",
		"Rian Johnson",
		"Ram Bergman",
		"James D. Stern",
		"Nathan Johnson",
		"Steve Yedlin",
		"Bob Ducsay",
		"Craig Fincannon",
		"Lisa Mae Fincannon",
		"Lindsay Graham",
		"Mary Vernieu",
		"Ed Verreaux"
	],
	"votes": 608477,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTg5NTA3NTg4NF5BMl5BanBnXkFtZTcwNTA0NDYzOA@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In the year 2044, 25-year-old Joseph Simmons (Joseph Gordon-Levitt), works for a mafia company in Kansas City as a \"Looper\". Since tracking systems in the future of 2074 have made it nearly impossible to dispose of bodies undetected, the syndicate sends its enemies back in time to be executed.\nLed by a man sent from the future named Abe (Jeff Daniels), Loopers kill and dispose of victims sent back in time from 2074 and are paid by employers with bars of silver attached to the target as payment. Additionally, when a Looper is retired, the Looper's future self is sent back in time exactly thirty years as a routine target, but with a gold bar payment; this event is referred to as \"closing the loop\", and, similarly to routine hits, carries serious consequences if not carried out.One night, Seth (Paul Dano), Joe's friend and a fellow Looper who is a telekinetic, visits him in a panic; on the verge of closing his own loop, Seth's future self (Frank Brennan) warned him of a mysterious character called the Rainmaker, who overran the future crime bosses and was retiring all of the Loopers' contracts in 2074, resulting in numerous premature Looper deaths. Hesitating, Seth unintentionally allowed his future self to escape, and is being hunted by his employers for failing to close his own loop. Joe hides Seth in his apartment and is taken to Abe (the leader of the Loopers, who was sent back in time by the mob bosses to control them); under threat of losing half of all his silver, Joe reluctantly tells Abe where he hid Seth. Mutilating the young version of Seth, Abe scares the future Seth into returning by violently damaging his past self's body; upon returning, however, the future Seth is killed to close his loop.When Joe closes his own loop, he shoots his older self (Bruce Willis) without hesitation, as his head is sacked and is therefore initially unidentifiable. He retires to Shanghai, China, where he later falls in love and marries. After his 30 years pass, Joe is taken from his home to be sent back to 2044 to close the loop, but his wife is killed in the process. Fighting and killing his captors as a result, Joe returns to 2044 unmasked and unbound, allowing him to surprise his younger self and avoid death. Later meeting his younger self, old Joe explains he still returned to 2044 to kill the Rainmaker as a child. Young Joe, still trying to close his loop, ends up in a struggle trying to kill old Joe. Stealing a map containing coordinates and a code from old Joe, young Joe then flees when Kid Blue (Segan) and Abe's men appear with the intent to kill them.Young Joe, following the map, reaches a farmhouse owned by Sara (Emily Blunt) and her son Cid (Pierce Gagnon). When Joe shows Sara the map, Sara recognizes the code as Cid's birthday along with the zip code of the hospital he was born in, prompting Joe to discover old Joe is going to kill the three children that could become the Rainmaker. Joe then decides to wait at the farm for the arrival of his older self and becomes close to Sara. Joe soon learns that Cid is a telekinetic, and that Cid was raised by Sara's sister for most of his life until she was accidentally killed by Cid during one of his telekinetic rage episodes. One morning, they are attacked by one of Abe's thugs named Jesse (Garret Dillahunt), who is killed when Cid falls into a rage and lets out a large telekinetic blast. Cid's extraordinary telekinetic powers - which are far more powerful than any other mutant's - cause Joe to realize that he is the Rainmaker; however, the realization radically changes old Joe's memories, tipping him off that Cid is the Rainmaker. Before old Joe can act, however, Kid Blue captures him.Escaping capture, old Joe kills Abe and his gang, and heads for Sara's house. Kid Blue, reaching the farm, is fought and killed by young Joe; concurrently, old Joe pursues Sara and Cid into the farm cane fields where he maims Cid, resulting in Cid causing a telekinetic blast. Before Cid can kill old Joe, Sara calms and reassures him to stop his telekinetic rage; then, telling Cid to run, Sara stands in old Joe's path to stop him shooting Cid. Young Joe realizes that his older self will shoot Sara and enrage Cid, perpetuating the creation of the Rainmaker rather than preventing it.Unable to stop his older self and knowing it's his last chance to stop the Rainmaker, young Joe instead shoots himself; by doing so, he erases his future self through suicide, saving Sara and potentially preventing Cid from becoming the Rainmaker.",
	"links": [
		"https://www.amazon.com/Looper-4K-UHD-Joseph-Gordon-Levitt/dp/B01A7IJOFG"
	]
}