{
	"title": "Violent Night",
	"release_year": "2022",
	"runtime": "112",
	"tags": [
		"Action",
		"Comedy",
		"Thriller",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"David Harbour",
		"John Leguizamo",
		"Beverly D'Angelo",
		"Alex Hassell",
		"Alexis Louder",
		"Edi Patterson",
		"Cam Gigandet",
		"Leah Brady",
		"André Eriksen",
		"Brendan Fletcher"
	],
	"staff": [
		"Tommy Wirkola",
		"Pat Casey",
		"Josh Miller",
		"Guy Danella",
		"David Leitch",
		"Kelly McCormick",
		"Dominic Lewis",
		"Matthew Weston",
		"Jim Page",
		"Lindsay Graham",
		"Mary Vernieu",
		"Roger Fires"
	],
	"votes": 101777,
	"cover": "https://m.media-amazon.com/images/M/MV5BZmE5ODNmODYtNDg0MC00ZDc4LWEyZmItNTQ2MGQ5MGQxMzllXkEyXkFqcGc@._V1_QL75_UY281_CR18,0,190,281_.jpg",
	"description": "In Greenwich, Connecticut, Jason Lightstone (Alex Hassell) and his estranged wife Linda (Alexis Louder) take their daughter Trudy (Leah Brady) to his mother Gertrude's (Beverly D'Angelo) mansion for a Christmas gathering. They overhear Trudy's Christmas wish for family unity through an old Walkie-Talkie (which Jason had gifted Trudy and told her that the gadget was a direct hot-line to Santa). Al (Ray Strachen) is the guard at Gertrude's enormous estate.Other family members at the gathering are Jason's sister Alva (Edi Patterson), her boyfriend Morgan Steel (Cam Gigandet), and her son Bert (Alexander Elliot). Gertrude is supposed to select the heir to her fortune and Alva and Jason are in the running.\nBert had a sexual harassment accusation at school. Gertrude paid off the school and they named a gymnasium after the family. Morgan wants Gertrude to fund a film for him.\nMeanwhile, Santa Claus (David Harbour) arrives at the estate, just as a group of mercenaries with holiday code-names, led by \"Mr. Scrooge,\" (John Leguizamo) raid the house with some of them posed as caterers and take the family hostage after killing the staff.Startled by Tinsel's (Phong Giang) gunfire, Santa's reindeer are frightened off the roof. Wrapped in Christmas tree lights, Tinsel is pulled out of an upstairs window and impaled on a large decorative icicle on the ground floor.\nStranded, Santa resolves to rescue Trudy and her family from Scrooge, who wants $300 million cash hidden in a vault in the mansion. This money was paid by the US Government to Gertrude to distribute in the Middle East, to grease the dictators and keep the oil flowing. But Gertrude pocketed the money and claimed that it disappeared in the fog of war.\nScrooge puts up his vault specialist Sugarplum (Stephanie Sy) on the job to pry it open.After killing the mercenary Frosty (Can Aydin) in a brutal hand to hand combat fight, Santa takes his radio and finds Trudy's channel. He then finds that the mercenaries are on his \"naughty list.\" When Scrooge discovers that Trudy has been talking with Santa on her Walkie-Talkie, Jason denies Santa's existence, and a distraught Trudy runs past the kidnappers and successfully hides in the attic.\nSanta reassures her over the radio, revealing to her his ancient Viking warrior past. His name was Nicomund and had a favorite hammer named the skull-crusher. Santa says that he was greedy back then and wanted jewels and wealth. Trudy encourages Santa to use his skills to do good instead.\nWhen Trudy talks about her parents, Santa says that grown up relationships are hard and reveals that he has been with Mrs Santa for over 1100 years. He says that sometimes the magic goes away, despite doing everything right.Santa cannot call for help since all lines to the outside have been cut. He sews up his own wounds.Wounded Santa is captured by Scrooge, who hates Christmas. Recognizing their real identities, Santa convinces henchmen Gingerbread (Andre Eriksen) and Candy Cane (Mitra Suri) of his authenticity (by revealing precisely their true names and their Christmas wish when they were kids) and escapes magically, although his magic sack is burned.Gertrude's \"kill squad,\" led by Commander Thorp (Mike Dopud), arrives and kills Morgan (who was trying to escape the estate and had come across the Kill Squad in the woods) revealing their allegiance to Scrooge. Scrooge tells Thorp that there is a wild man in Santa suit running around and complicating things for them.\nDiscovering an empty vault, Scrooge threatens Linda. Scrooge had iron clad intel that $300 million in cash was delivered to the mansion the day before, hence the only possibility is that it was intercepted by someone on the inside.\nJason admits he stole the money, hidden in an outdoor nativity, and planned to flee with his family. Jason says that after years of groveling to Gertrude, he finally realized that he was destroying the only good thing in his life.\nGertrude forgives him, revealing this as a Lightstone family rite of passage and naming him her heir. Gertrude says that she stole the company from her grandfather and declares that the Lightstone takes what is theirs.The Beta unit of the kill squad is assigned to kill Santa, and they find him hiding in a shed nearby.\nIn a shed, Santa finds a sledgehammer and eliminates the kill squad.\nTrudy sets up Home Alone-inspired traps (nails in the floor, ladders with steps sawed off, bowling balls, sticky glue on the floor, glass Christmas decorations on the floor), leading to Gingerbread's death.\nSanta arrives in the attic and kills Candy Cane before she can shoot Trudy. Alva, Linda, and Bert thwart Scrooge's order to kill hostages by killing Krampus (Brendan Fletcher). Santa reunites Trudy with Linda.\nLinda distracts the remaining men outside with machine gun fire, as Santa gets close to them and starts attacking them with the sledgehammer. Scrooge and Thorp escape into the woods with Gertrude and the money, pursued by Santa, who kills Peppermint (Rawleigh Clements-Willis).Linda kills Jingle (Finn McCager Higgins), and Trudy witnesses her parents' reunion.\nSanta is lured into a cabin by Scrooge, where Scrooge finds Santa's naughty list with his real name on it. Scrooge realizes that Santa is real.\nSanta and Scrooge fight in a cabin in which Scrooge lands several hard blows on Santa. As they grapple, a badly wounded Santa magically flies up the chimney while clinging to Scrooge's body, mangling Scrooge's body and killing him.Thorp shoots Santa but is killed by a vengeful Gertrude. Despite using burnt money for warmth, Santa slowly starts succumbing to the gunshot wounds. Trudy rallies her family to affirm their belief in Santa, healing him from near death. Confused by the magic, but renewed in faith, Santa receives his returning reindeer, a note from Mrs. Claus, a new gift sack, and the return of his long-lost hammer Skullcrusher. He bids Trudy farewell and continues his gift deliveries.In a mid-credits scene, Bert Vlogs next to a dead mercenary, tells his viewers that Santa is real and warning them to behave during Christmas.",
	"links": [
		"https://www.amazon.com/Violent-Night-David-Harbour/dp/B0B8JS38F2"
	]
}