{
	"title": "X: First Class",
	"release_year": "2011",
	"runtime": "131",
	"tags": [
		"Action",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.7,
	"actors": [
		"James McAvoy",
		"Michael Fassbender",
		"Jennifer Lawrence",
		"Jennifer Lawrence",
		"Kevin Bacon",
		"Laurence Belcher",
		"Bill Milner",
		"Rose Byrne",
		"Beth Goddard",
		"Morgan Lily",
		"Oliver Platt"
	],
	"staff": [
		"Matthew Vaughn",
		"Ashley E. Miller",
		"Zack Stentz",
		"Jane Goldman",
		"Matthew Vaughn",
		"Gregory Goodman",
		"Simon Kinberg",
		"Lauren Shuler Donner",
		"Bryan Singer",
		"Henry Jackman",
		"John Mathieson",
		"Eddie Hamilton",
		"Lee Smith",
		"Luise Eigner",
		"Roger Mussenden",
		"Jeremy Rich",
		"Lucinda Syson",
		"Chris Seagers"
	],
	"votes": 734498,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTg5OTMxNzk4Nl5BMl5BanBnXkFtZTcwOTk1MjAwNQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "At a German concentration camp in Poland in 1944, young Erik Lensherr (Michael Fassbender) is separated from his parents by Nazi guards. The child's desperate mind remarkably bends a metal gate until a guard knocks Lensherr unconscious. Scientist Sebastian Shaw (Kevin Bacon), who has observed this through a window, calls Lensherr up to see him. He orders Lensherr to use his power to move a coin. When Lensherr cannot, despite his best efforts, Shaw shoots and kills Lensherr's mother in front of him. In his rage, Lensherr's out-of-control magnetic power kills the two guards and destroys two rooms, to Shaw's delight.Around this same time, in Westchester County, New York, mansion, a young Charles Xavier (James McAvoy) meets a young, shape-shifting girl named Raven (Jennifer Lawrence), disguised as his mother, who is looking through the fridge for food. Using his mind to talk to Raven. Raven shifts back to her normal, blue-skinned form. Overjoyed to meet someone else \"different\" like him, he says she can come live with his family.In Switzerland in the movie's present-day of 1962, Lensherr forces a banker (by ripping out one of the metal fillings in his mouth) to trace a bar of Nazi gold to Shaw's address in Argentina. In a tavern there patronized by former German soldiers, Lensherr kills three men as he learns that Shaw has a yacht in Florida.\nMeanwhile, in England, Oxford University graduate Xavier is publishing his thesis on mutation; his foster sister Raven, a waitress, lives with him. Raven has feelings for Xavier & wants to date him, but Xavier side steps the issue, partly because Raven is blue in color, \"Different\".Simultaneously in Las Vegas, Nevada, CIA agent Moira MacTaggart (Rose Byrne) follows U.S. Army Colonel Hendry (Glenn Morshower) into the Hellfire Club, where she sees Shaw, Emma Frost (January Jones) (is a Telepath & can turn into diamond skin), Riptide (Alex Gonzalez a) (Tornadoes) and Azazel (Jason Flemyng) (Teleportation). Shaw calmly threatens Hendry, telling him that the Colonel should reverse his position on advocating that the U.S. install nuclear missiles in Turkey, a move the government had previously avoided so as not to provoke war with the Soviet Union. When Hendry refuses, Shaw has Riptide demonstrate his power to conjure tornadoes from thin air and hurls Hendry into a wall. Convinced, Shaw has Azazel Teleport Hendry to the US president's War Room, where he supports the missile placement in Turkey.Taggart tries to convey to her superiors that Colonel Hendry has been forced by mutants, but no one believes her.\nShaw later meets with Colonel Hendry on his yacht, and refuses to give Hendry his money, at which point Hendry pulls out a grenade and threatens to pull the pin. Shaw takes the grenade and pulls the pin himself and absorbs the blast (at which point we now learn that Shaw is a mutant, and absorbs energy, which also keeps him young), then taps Hendry, expelling the grenade's energy into the Colonel, destroying him.MacTaggart seeks Xavier's advice on mutation and takes Xavier and Raven to the CIA to convince the chief that Shaw is a threat. After convincing them that mutants exist, they are to be taken to a covert facility, but first Xavier insists they track down Shaw. Shaw is aboard his yacht relaxing with Frost and Riptide when Lensherr appears. Frost uses her telepathy to pacify Erik and pushes him overboard.Lensherr attacks Shaw, using the anchors and chains of the yacht to tear the boat apart. When Shaw escapes in a submarine hidden below the upper decks of the boat, Lensherr tries to stop him, but Xavier stops him so that he does not drown. Lensherr joins Xavier and Raven at the CIA facility, where they meet Hank McCoy (Nicholas Hoult) (Another set of hands in place of feet), another mutant. McCoy and Xavier use a prototype Cerebro to locate mutants and recruit several of them to train & to enhance their powers to stop Shaw. Upon the recruiting process, we also see Xavier and Lensherr walk up to Logan (Hugh Jackman) (Wolverine) in a bar and introduce themselves. He tells them to go to hell, and they walk off.Shaw plans to meet with a Russian general but sends Frost instead as he wants to attack the CIA facility where Xavier is building his army of mutants. Frost is captured by Xavier and Lensherr. Xavier taps into Frost's mind and finds out that Shaw wants to start a nuclear war between the US and Russia in order to wipe out all normal humans.When Xavier & Lensherr are gone, the facility is attacked by Azazel, Riptide and Shaw, with all the guards being killed. Shaw offers the new mutants to a place on his side, but most of them refuse. He recruits Angel (Zoe Kravitz) (the fly wings) after offering and kills Darwin (Edi Gathegi) (Adapt to survive) by forcing him to ingest a massive amount of energy when he tries to fight back.\nWhen Lensherr and Xavier return they all go to Xavier's mansion and begin to train, though Raven is conflicted about hiding her natural form. Hank creates a vaccine that is supposed to turn his and Raven's appearance normal, however, when Hank takes it, his mutant physical features are enhanced (& he ends up becoming the blue colored scientific wolf like creature in the first few X men movies). Lensherr supports Raven by saying that he accepts her for who she is and how she looks and wouldn't try to change a thing about her.Xavier helps everyone enhance their powers including Lensherr. But he is still taken aback when Raven decides to come in front of him in her true-blue form. Xavier encourages Raven to take the cure that Hank designed for her, but Raven refuses & at that moment the partnership between Lensherr & Raven is sealed forever.\nShaw then meets the Russian general himself & forces him to place missiles in Cuba, using his mind control tricks via Frost.President Kennedy institutes a blockade using the US 7th fleet in the Atlantic. The Russians respond by sending in their own armada to defend the ship bound missiles against the USA. Shaw travels with the Russian fleet to ensure that the missiles get to Cuba. Xavier, MacTaggart and Lensherr fly to the blockade to stop the fleets from engaging. Shaw uses the nuclear core of his submarine to charge himself up and a helmet to block Xavier's telepathy. While Azazel kills the crew of the Russian missile ship, Xavier uses his powers to control a officer on a Russian Ship to fire on & destroy the missile ship before it crosses the line.Lensherr pulls Shaw's submarine from the water, but an attack from Azazel & Riptide forces the jet and submarine to crash. Lensherr finds Shaw inside the nuclear core of the submarine, he removes Shaw's helmet and gets Xavier to take control of Shaw's mind. Lensherr puts on the helmet, admits that he agrees with everything Shaw believes about mutants and humans, and then kills him by slowly forcing the coin that Shaw taunted him with when he killed Lensherr's mother, through his brain.At the same time, the US & Russians decide that mutants are a greater threat to their existence & decide to destroy them. The two fleets fire their missiles at the mutants, but Lensherr, now fully in control of his abilities, holds the missiles in the air, then turns them on the fleet. In the ensuing fight Xavier manages to distract Lensherr, but when MacTaggart fires at Lensherr he deflects the bullets, with one paralyzing Xavier.Lensherr takes Raven, Angel, Riptide and Azazel and leaves. Xavier, now confined to a wheelchair for the rest of his life, and the mutants return to the mansion, where he will open a school. He wipes MacTaggart's memory, and Lensherr breaks Frost out of the CIA headquarters, and in his new uniform he tells Frost to call him Magneto.",
	"links": [
		"https://www.amazon.com/X-Men-First-Class-4K-UHD/dp/B08GWWTB8X"
	]
}