{
	"title": "The Lone Ranger",
	"release_year": "2013",
	"runtime": "150",
	"tags": [
		"Action",
		"Adventure",
		"Drama",
		"amazon"
	],
	"rating": 6.4,
	"actors": [
		"Johnny Depp",
		"Armie Hammer",
		"William Fichtner",
		"Tom Wilkinson",
		"Ruth Wilson",
		"Helena Bonham Carter",
		"James Badge Dale",
		"Bryant Prince",
		"Barry Pepper",
		"Mason Cook"
	],
	"staff": [
		"Gore Verbinski",
		"Justin Haythe",
		"Ted Elliott",
		"Terry Rossio",
		"Jerry Bruckheimer",
		"Gore Verbinski",
		"Hans Zimmer",
		"Bojan Bazelli",
		"James Haygood",
		"Craig Wood",
		"Denise Chamian",
		"Jess Gonchor",
		"Mark 'Crash' McCreery"
	],
	"votes": 246056,
	"cover": "https://m.media-amazon.com/images/M/MV5BYjQ1YWE5NzktOWYyYS00MTBmLWE1NDUtMTU5Mzc2YWQyNzhjXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "At a sideshow in a San Francisco fair in 1933, a boy, Will, who idolizes a legend known as the Lone Ranger, encounters Tonto (Jhonny Depp), an elderly Comanche Native American Indian, who proceeds to recount his experiences with the Old West adventurer.In Colby, Texas on March 18, 1869, lawyer John Reid returns home via the uncompleted Transcontinental Railroad, managed by railroad tycoon Latham Cole. Unknown to Reid, the train is also carrying Tonto and outlaw Butch Cavendish, who is being transported for his hanging after being captured by Dan Reid, John's Texas Ranger brother. Cavendish's gang rescues Butch and derails the train. During the escape Tonto tries to kill Butch, but it is not revealed why. Once the train carnage comes to a stop, Tonto is jailed and Dan deputizes John as a Texas Ranger, and with six others, they go after the Cavendish gang.Cavendish's men ambush and kill all their pursuers (John and Dan included) in a canyon and Cavendish cuts out and eats at Dan's heart. Tonto, who has escaped from jail, comes across the dead men and buries them. However, a white spirit horse awakens John as a \"spirit walker\", and Tonto explains John cannot be killed in battle. Tonto also tells him Collins, one of the Rangers, betrayed Dan and is working with Cavendish, whom Tonto believes is a \"wendigo\" (an evil spirit born of the desert). As John is thought to be dead, he wears a mask to protect his identity from enemies. Tonto gives John a silver bullet made from the fallen Rangers' badges and tells him to use it on Cavendish.John & Tonto decide to team up to track Cavendish. Tonto again says that he has been tracking Butch for 126 yrs but doesn't reveal why. At a brothel Collins recently visited, Red Harrington (Helene Bonham Carter) informs them about Dan and Collins' fight over a cursed silver rock. Meanwhile, Cavendish's men, disguised as Comanches, raid frontier settlements. John and Tonto arrive after raiders abduct Dan's widow and son, Rebecca and Danny.Regretting his earlier actions, Collins attempts to help Rebecca and Danny escape but is shot dead by Cole, who rescues them. Claiming the raiders are hostile Comanches, Cole announces the continued construction of the railroad into Indian territory and dispatches United States Cavalry Captain Jay Fuller to exterminate the Comanche. Cole orders the construction of a large railroad bridge to cover the canyon that marks the boundary between white man's land and Comanche land.A Comanche tribe captures John and Tonto soon after the pair finds railroad tracks in Indian territory. The tribe leader tells John of Tonto's past: As a boy, Tonto had rescued Cavendish and Cole from near-death and showed them the location of a silver mine, in exchange for a pocket watch. The mine was close to the location of the railroad bridge that Cole is now building on the Comanche border. The men murdered the tribe to keep the mine a secret, leaving Tonto with great guilt making himself believe that the men were possessed by evil spirits within the silver and vowed to find and kill them both.Tonto and John escape as the cavalry attack the Comanche. At the silver mine, they capture Cavendish after killing his men. Tonto demands that John use the silver bullet to kill Cavendish, but John refuses and tells Tonto what the Comanche chief told him. Tonto attempts to kill Cavendish, but John knocks him unconscious and brings in Cavendish alive. John berates Tonto for lying to him with made up stories about Wendigo and white spirits. He throws away the mask that Tonto had given him.Meanwhile, Fuller seems to have rescued Danny & Rebecca from Cavendish & brought them to Cole's custody where Cole attempts to seduce Rebecca by luring Danny.Upon returning Cavendish to Cole and Fuller's custody, Cole's role in the silver mining operation is revealed. Fearing that if his actions are publicly revealed he'll be charged as a war criminal, Fuller sides with Cole. Rebecca and Danny are held hostage, and John is taken back to the silver mine to be executed. However, Tonto rescues him and the two flee as the Comanche attack and are massacred by the cavalry. Realizing that Cole is too powerful to be taken down lawfully, John dons the mask again. Tonto and John rig the railroad bridge with explosives.At the site of the union of the Transcontinental Railroad, Cole reveals his true plan: to take complete control of the railroad company and use the mined silver to gain more power. John and Tonto rob a bank to steal nitroglycerin and use it to destroy a railroad bridge. With Red's help, Tonto steals the train with the silver, and Cole, Cavendish and Fuller pursue him in a second train on which Rebecca and Danny are being held captive. Riding the horse, John pursues both trains. After a furious chase and fights on both trains, both Cavendish and Fuller are killed while Rebecca and Danny are rescued. Tonto confronts Cole and reveals himself by returning the watch he traded years ago, leaving Cole to drown buried beneath the silver ore after the train plunges off the severed bridge into the river below.The town and railroad enterprise recognize John (whose identity is still unknown to them) as a hero and offer him a law-enforcement position. John declines and rides off with Tonto. Back in 1933, Will questions the truth of the tale. Before departing, Tonto gives him a silver bullet and tells him to decide for himself. Will puts his mask on and glances back toward the tent where Tonto stood, only to see a crow fly there.A credits scene shows an elderly Tonto wearing a suit and carrying a suitcase walking through a canyon.",
	"links": [
		"https://www.amazon.com/Lone-Ranger-Blu-ray-Digital-Copy/dp/B00DJYJWVW",
		"https://www.amazon.com/Lone-Ranger-Behind-Trail-Outlaw/dp/1608872106"
	]
}