{
	"title": "Ip Man",
	"release_year": "2008",
	"runtime": "106",
	"tags": [
		"Action",
		"Biography",
		"Drama",
		"amazon"
	],
	"rating": 8.0,
	"actors": [
		"Donnie Yen",
		"Simon Yam",
		"Siu-Wong Fan",
		"Ka-Tung Lam",
		"Lynn Xiong",
		"Hiroyuki Ikeuchi",
		"Xing Yu",
		"You-Nam Wong",
		"Yu-Hang To",
		"Calvin Ka-Sing Cheng"
	],
	"staff": [
		"Wilson Yip",
		"Edmond Wong",
		"Tai-Lee Chan",
		"Raymond Pak-Ming Wong",
		"Kenji Kawai",
		"Sing-Pui O",
		"Ka-Fai Cheung"
	],
	"votes": 235278,
	"cover": "https://m.media-amazon.com/images/M/MV5BZmJjZDE0MmYtNzgwYy00NTg2LWE0NDYtNzA0YTA4MjA0NmYxXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "In the 1930s, Foshan is a hub of Southern Chinese martial arts, where various schools actively recruit disciples and compete against each other. Although the Wing Chun master Ip Man (Donnie Yen) is the most skilled martial artist in Foshan, he is unassuming and keeps a low profile. As an independent wealthy man, he feels no need to accept any disciples and instead spends his days training, meeting with friends, and spending time with his family. However, his wife Cheung Wing-Sing (Lynn Hung) is often resentful of the time he spends training and discussing martial arts with friends and colleagues.Chow Ching-Chuen is Ip's friend who notices that people are getting richer in China. He believes that the spending power is increasing and soon people will demand more clothes. He decides to open a cotton mill in Foshan. Chow Ching-Chuen is Ip's good friend and partners with him in his new venture.Though not a professional martial artist, Ip is respected in Foshan due to the abilities he displays in friendly, closed-door competitions with local masters.\nOne day, a local troublemaker named Yuan (Wong You-Nam) loses his kite, which lands in a tree in the Ip family's back yard. While retrieving it, Yuan witnesses Ip defeating fellow Kung Fu master Liu (Chen Zhihui) in a sparring match, and spreads the news around town, inadvertently embarrassing Liu.\nYuan's brother Lin, a restaurant owner and disciple of Liu, publicly embarrasses Yuan as he tries to arrange a rematch between Liu and Ip.Ip's reputation is further enhanced when he defeats an aggressive, rude, highly skilled Northern Chinese martial arts master, Jin Shanzhao (Fan Siu-Wong), thus upholding the regional pride of fellow Southern stylists and others in Foshan.The Japanese invasion in 1937 adversely affects the life of everyone in Foshan. Ip's house is claimed by the Japanese and used as their Foshan headquarters. Ip and his family lose their wealth and are forced to move into a decrepit house. Desperate to support his family, Ip accepts work at a coal mine.The Japanese General Miura (Hiroyuki Ikeuchi), who is a Karate master, establishes an arena where Chinese martial artists compete with his military trainees. The Chinese earn a bag of rice for every match they win. Li Chiu (Gordon Lam), a former police officer and Ip's acquaintance, is now working as a translator for the Japanese and is making the offer to the martial artists working at the coal mine.Ip at first declines to participate in the matches. However, when his friend Lin (Xing Yu) goes missing, he agrees to take part in order to investigate. Ip arrives to see Liu executed by Miura's lieutenant, Sato (Tenma Shibuya), for picking up a bag of rice from a prior victory after conceding in a second match against three Karateka. He also comes to understand that Lin was killed in an earlier fight.Barely able to contain his rage, Ip demands a match with ten Karateka at once. Despite having not practiced Wing Chun since the invasion began (in order to conserve what little food his family had to survive), he proceeds to mercilessly crush each of them with a brutal barrage of his martial art mastery, showing none of the restraint he exhibited in previous engagements. His skill arouses the interest of Miura, who seeks to learn more about Ip and see him fight again. Ip collects Liu's bag of rice and gifts it to his surviving family.When Ip does not return to the arena, Miura grows impatient and sends Sato along with several soldiers to find him. The lieutenant then gestures at Ip's wife, prompting Ip to incapacitate them. Ip later visits his friend Chow Ching-Chuen (Simon Yam), who owns and runs a cotton mill in Foshan. Chow tells Ip that a bandit gang led by Jin Shanzhao is harassing his workers and trying to extort money from them. Ip trains the workers in Wing Chun for self-defense. When the bandits return to the cotton mill, the workers fight back using the techniques that Ip taught them. Ip himself arrives midway through the battle to take care of things personally and defeats Jin Shanzhao, warning him never to harass the workers again.\nAfter the fight, Ip confronts Yuan and gives him a small tin that belonged to Lin after informing him of his brother's death. Yuan opens the tin and finds his kite inside; this motivates Yuan to leave the gang.After overpowering them at the apartment, Ip and his family flee and hide in Li's house. The Japanese track Ip to the cotton mill and take the workers hostage. Despite Li's warnings, Ip surrenders himself to the Japanese while arranging for his wife and son to be sent to Hong Kong for protection.Miura tells Ip that his life will be spared if he agrees to instruct the Japanese soldiers in martial arts. Ip refuses and challenges Miura to a match, which Miura accepts, both because of his love for martial arts and because refusing the challenge would be a humiliation to the Japanese. Behind Miura's back, Sato threatens Ip with death if he does not allow Miura to win.The match between Ip and Miura is held in public in Foshan's square. At first, the two fighters seem equally matched, but Miura soon finds himself unable to penetrate Ip's impeccable defense and becomes overwhelmed by his relentless and direct blows. He is helpless to defend himself as Ip effortlessly uses him as a wooden dummy, inflicting a severe beating on him and clearly winning.As the beaten general lies down after his defeat, Ip looks over to the cheering Chinese crowd and spots his wife and child with Chow (the owner of the factory). Enraged, Sato shoots at Ip and Ip is hit in his shoulder, sparking a scuffle between the Chinese audience and the Japanese soldiers. During the scuffle, Li Chiu kills Sato with Sato's own gun. Ip is taken away in the middle of the chaos.The epilogue reveals that he survives and escapes to Hong Kong with his family with the help of Chow Ching-Chuen. There, Ip establishes a Wing Chun school, where his students come to learn martial arts from him, including Bruce Lee.",
	"links": [
		"https://www.amazon.com/Ip-Man-3-Donnie-Yen/dp/B085W39J4S"
	]
}