{
	"title": "Extraction 2",
	"release_year": "2023",
	"runtime": "122",
	"tags": [
		"Action",
		"Crime",
		"Thriller",
		"amazon",
		"netflix"
	],
	"rating": 7.0,
	"actors": [
		"Chris Hemsworth",
		"Golshifteh Farahani",
		"Adam Bessa",
		"Tornike Gogrichiani",
		"Tornike Gogrichiani",
		"Demetre Kavelashvili",
		"Tornike Bziava",
		"Giga Shavadze",
		"Tinatin Dalakishvili",
		"Andro Japaridze",
		"Mariami Kovziashvili"
	],
	"staff": [
		"Sam Hargrave",
		"Joe Russo",
		"Ande Parks",
		"Anthony Russo",
		"Eric Gitter",
		"Sam Hargrave",
		"Chris Hemsworth",
		"Mike Larocca",
		"Alex Belcher",
		"Henry Jackman",
		"Greg Baldi",
		"William Hoy",
		"Alex Rodríguez",
		"Sarah Finn",
		"Krista Husar",
		"Tekla Javakhadze",
		"Maya Kvetny",
		"Philip Ivey"
	],
	"votes": 154677,
	"cover": "https://m.media-amazon.com/images/M/MV5BZGQwNDdhODAtY2Y0Ni00YzFhLTk1OGUtY2RkMDAzNzBmZjAxXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "After barely surviving a previous mission in Dhaka, Bangladesh, Tyler is rescued from the river and taken to UAE for medical treatment. Nik is by his side throughout the duration. Even though Tyler is in an extended coma, she refuses to give up on him. Tyler regains consciousness. Intense physiotherapy later, Tyler is regaining mobility.9 months later, Tyler Rake (Chris Hemsworth) retires from mercenary work to a cabin in Austria to recuperate. Nik and her brother Yaz took Tyler to the cabin and Nik asks Tyler to focus on rebuilding his life.\nThere, he is approached by a stranger Alcott (Idris Elba) and asked to rescue Ketevan (Tinatin Dalakishvili), the sister of his ex-wife Mia (Olga Kurylenko), and her two children, Sandro (Andro Japaridze) and Nina (Marta Kovziashvili), from Georgia.Ketevan married Davit Radiani (Tornike Bziava), one of the co-founders of the Nagazi, the largest crime syndicate in Georgia. After Davit threw a DEA agent off a bridge, he was imprisoned and unable to bribe his way out due to the pressure from the Americans. Davit forces Ketevan and her children to move into the prison to keep them from leaving him, but the bad living conditions and Davit's abuse cause Ketevan to call Mia for help. Sandro believes that Davit is right and is training him to be grow up into a Nagazi.Meanwhile, a governor on his payroll informs Davit's brother Zurab (Tornike Gogrichiani) that Davit's sentence is extended by ten years. Zurab asks the governor to release his brother, but the governor refuses since he does not want the Americans to go after him. Enraged, Zurab kills the governor and his bodyguards.Alcott tells Tyler that Davit and Zurab run a billion dollars heroin operation from Georgia. Their gang members are fiercely loyal to the brothers and are treated like family. They have all the politicians in their pocket and practically run the country. Once Tyler picks up Ketevan and her kids, Zurab will throw the entire Nagazi army at him.\nTyler starts preparing for the mission by pushing himself physically.Tyler recruits Nik (Golshifteh Farahani) and her brother Yaz (Adam Bessa) to join him, and they infiltrate the prison with help from a bribed guard. Davit alerts the prisoners, who start a riot. During the extraction, Davit attacks Tyler and Ketevan, resulting in Tyler killing him. Sandro doesn't see Tyler killing Davit as Tyler had sent him and Nina ahead with Nik, while he stayed behind to deal with Davit and his mob. Ketevan stayed behind to help Tyler, but soon their exit is blocked.\nTyler and Ketevan fight their way through the riot and an entire yard full of prisoners. Nik picks up Tyler and Ketevan at the prison door, and they drive away just as Zurab and his forces descend upon the prison.\nAs Zurab's forces attack their vehicles, Sandro figures out that Davit has died. The group manages to fight off their pursuers and board on armored train waiting for them at an industrial complex.On the train, Tyler fights off 2 helicopters sent by Zurab to intercept them. One team manages to board the train and goes to the engine to bring it to a halt. Nik fights off the Nagazi's and keeps the train moving. Tyler protects Ketevan and her kids from being captured.\nThe train has no brakes and crashes out at the end of the line, but the whole group survives.They get to a plane and escape to Vienna, but Sandro, who idolizes his father, secretly contacts his uncle and reveals their location. He uses Yaz's satellite phone on the flight to call Zurab. Zurab tells Sandro that Ketevan planned this. She had wanted to take Sandro away for many years now, and now Sandro is with the man who killed Davit.Ketevan tells Nik that Tyler is her brother-in-law. Nik realizes that this is not just a job, it is personal for Tyler.\nSandro confronts Tyler, who tells Sandro that Davit was keeping Ketevan prisoner against her wishes. But Sandro is convinced that Davit was protecting his family for his enemies, by keeping them in prison and it is Ketevan who plotted to kill Davit.\nTyler tells Sandro that Ketevan stayed with Davit to keep him and Nina safe. Now it's up to Sandro to believe her or let himself be consumed by his father's lies.Zurab and his men find and attack Tyler and his team in their DC Towers safe-house in Vienna. Ketevan scolds her son for endangering his own family and naivete. In the chaos, Sandro abandons his mother and joins Zurab. Yaz goes after Sandro to bring him back and gets separated from Nik and Tyler. Nik goes to rescue Yaz, but her car is stuck by a grenade launcher.\nTyler goes to rescue Nik and Yaz, but Zurab has them pinned down and they cannot exit the building perimeter. Tyler decides to take the helicopter, which was at the top of the building.Tyler, Nik and Yaz fight their way through. Nik is knocked unconscious at the edge of the building and is about to slide off, when Tyler grabs her and stops her from falling to her death. Zurab finds them and shoots Tyler's hand, but he doesn't let go of Nik. Nik regains consciousness and shoots at Zurab, allowing Tyler to save Nik and escape.\nThe team flees in one of Zurab's helicopters, but Zurab mortally wounds Yaz. The team retreat to Tyler's cabin, where he and Ketevan are reunited with Mia. Tyler apologizes to Mia for leaving on a mission before their son died from cancer, regretful that the last memory he had was Tyler leaving him.Avtandil (Dato Bakhtadze), Zurab's right-hand man and uncle, discourages Zurab from seeking revenge to prevent more losses and to set a better example for his nephew. Refusing, Zurab kills Avtandil and contacts Tyler, telling him to meet at a nearby airfield next to a church. Tyler heads to the airfield but, unwilling to risk losing her, leaves Nik behind.\nTyler kills the remaining Nagazi and finds Zurab and Sandro in the church, with Sandro wearing an explosive vest. Zurab forces Sandro to take Tyler's pistol, but Sandro, having realized his mistake and what kind of people his father and uncle really are, refuses to shoot Tyler. Nik arrives and disarms the vest, while Tyler fights and kills Zurab.\nTyler and Nik are left wounded as police storm the church.In the aftermath, Nik and Tyler are imprisoned and Mia informs Tyler that Ketevan and her children have been moved to protective custody. Mia helped Ketevan make a deal with the Americans to disclose the operations of the Nagazi, but their financial assets are frozen, locking Ketevan out of any money. Tyler tells her to give them $1 million cash, which he had hidden under the floorboards in his cabin. She assures Tyler that their son died believing his father was a hero.\nTyler is taken out of prison to meet with the stranger from the beginning, who has come with another job, in return for Tyler's freedom. Tyler says he will not accept it without Nik, only to find that the stranger has brought Nik as well, as the film concludes.",
	"links": [
		"https://www.amazon.com/HWC-Trading-Hemsworth-Autograph-Avengers/dp/B09GKQGF27",
		"https://www.netflix.com/title/81098494"
	]
}