{
	"title": "Ghostbusters",
	"release_year": "2016",
	"runtime": "117",
	"tags": [
		"Action",
		"Comedy",
		"Fantasy",
		"amazon"
	],
	"rating": 6.8,
	"actors": [
		"Melissa McCarthy",
		"Kristen Wiig",
		"Kate McKinnon",
		"Leslie Jones",
		"Zach Woods",
		"Ed Begley Jr.",
		"Charles Dance",
		"John Milhiser",
		"Ben Harris",
		"Karan Soni"
	],
	"staff": [
		"Paul Feig",
		"Katie Dippold",
		"Paul Feig",
		"Ivan Reitman",
		"Dan Aykroyd",
		"Amy Pascal",
		"Ivan Reitman",
		"Theodore Shapiro",
		"Robert D. Yeoman",
		"Melissa Bretherton",
		"Brent White",
		"Allison Jones",
		"Jefferson Sage"
	],
	"votes": 249518,
	"cover": "https://m.media-amazon.com/images/M/MV5BZjNhMzU5MjgtY2VhMC00NzZmLTk1YTEtMDc5OGU1OWJiMTE4XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The tour guide Garrett (Zach Woods) is taking a group of people on a tour of the Aldridge mansion in New York City. Garrett tells the group of Gertrude Aldridge, a disturbed woman that was kept locked in the basement by her father. A candlestick falls over on the table near the basement to scare the group and to give them their money's worth, but it's just part of a trick that Garrett played. What Garrett doesn't see is a device beneath the nightstand that is flickering and vibrating.As he is closing up shop, Garrett hears a noise near the basement. The door begins shaking, and he tries to run out of the mansion, but the doorknob has been heated and hence he cannot open it. He tries to break out a window with a stool, only for the stool to be thrown back. Garrett runs back toward the basement. The floor is filling up with green slime, and the stairs break apart. Garrett holds on as he sees a ghost rise up from the floor.Physics researchers Abby Yates (Melissa McCarthy) and Erin Gilbert (Kristen Wiig) are co-authors of a book which posits the existence of paranormal phenomena such as ghosts. When the book proves unpopular, Gilbert distances herself and eventually becomes a physics professor at Columbia University, while Yates continues to study the paranormal at a technical college with eccentric engineer Dr. Jillian Holtzmann (Kate McKinnon) at the Kenneth P. Higgins Institute of Science in New York City. Jillian is a brilliant engineer who is also a bit nutty.Years later, Gilbert learns from Ed Mulgrave (Ed Begley, Jr.), a publisher that Yates republished the book, threatening her bid for tenure at Columbia. The dean at Columbia is Harold Filmore (Charles Dance). Gilbert knows that her association to a book related to paranormal phenomena will undo her work and reputation as a scientific mind. Erin is not proud of having written it, and she's even less than pleased to learn it has resurfaced. Ed had approached Erin because of the haunting at the Aldridge mansion and asks her to look in on it.\nGilbert reunites with Yates. Erin demands Abby take the book off Amazon. Erin then brings up the Aldridge mansion haunting, inspiring Abby and Holtzmann to spring into action. In exchange for getting the book out of publication, Erin agrees to assist Yates and Holtzmann on a paranormal investigation an alleged haunted house, the Aldridge Mansion.The three ladies arrive at the mansion with some equipment. The basement has been locked tight. Erin steps on some slime. The group witness and document a malevolent ghost of the late Gertrude Aldridge. Gertrude's face turns demonic, and she spews Ectoplasmic bile all over Erin before she escapes.\nThis renews Gilbert's belief in the paranormal and friendship with Abby. The ladies record a video with Erin proclaiming that ghosts are real. Unfortunately, this video is uploaded online and falls into Filmore's hands, and he fires Erin for being a bad representation of the school.\nShe accepts an offer to join Yates and Holtzmann's project, but when a new institute director of the Higgins Institute Thomas Shanks (Steve Higgins) learns its nature, he fires them. To continue their research, they steal equipment from the school's lab and they open an office above a Chinese restaurant, and call themselves the \"Conductors of the Metaphysical Examination.\"\nThey start building equipment to study and capture ghosts. Dim-witted but handsome Kevin Beckman (Chris Hemsworth) is tapped as a receptionist.Meanwhile, MTA worker Patty Tolan (Leslie Jones) is approached by a weird guy named Rowan North (Neil Casey). He rambles on about a \"fourth cataclysm\", which Patty pays no mind to. Behind her, Rowan plants another device similar to the one at the mansion. Patty witnesses a ghost in a subway line built under a haunted prison in Auburn and contacts the Department.\nPatty leads the ladies to the tunnel where she spotted the ghost. Holtzmann brings along some equipment she built to catch the ghost. They see the same ghost that Patty saw hovering above them. They record the ghost with their HD cams while Erin is given a proton laser to capture it. The laser isn't strong enough to hold the ghost down, and the train is coming in fast. The ladies run to safety as the train hits the ghost, causing them to get splattered with Ectoplasm slime while the ghost is stuck on the train.\nThe group successfully tests Holtzmann's Proton containment laser, but their proof is again dismissed. Famed myth buster Martin Heiss (Bill Murray) goes on record to dismiss the subway ghost as fake.They advertise their services with a \"no ghosts allowed\" logo that Holtz used based on a graffiti artist's defacement, and the name pundits have labeled them-\"Ghostbusters\". Patty joins the team, providing expertise of New York City, personal protective equipment, and a re-purposed hearse from her mortician uncle Bill Jenkins, named \"Ecto-1\".\nDespite the setbacks, the group continues to develop their ghost containment technology. Hotlzmann shows off some new equipment she made to catch ghosts, including a new laser gun, a grenade, and a proton glove. It's all untested, so most of it turns out to be dangerous, but the team thinks it's all cool.Unbeknownst to them, the ghosts are being summoned by devices built by Rowan North (Neil Casey), an occultist and mad scientist attempting to bring about the Apocalypse. Rowan is attracting ghosts over Manhattan with self-developed ionizers that correspond to the Ghostbusters' technology, allowing him to experiment and create a dimensional vortex powered by turned PSI energy.Rowan is seen planting another device in the theater. The team is called to investigate a ghostly sighting at a musical theater. Abby's Ghost energy detector goes off near the dressing rooms. Patty is chased by a mannequin possessed by a ghost. The Ghostbusters hit the mannequin with their proton lasers, releasing a huge flying ghost monster into the theater. They follow it up to the stage where a band called Beasts of Mayhem are performing. The ghost flies out, making everyone think it's part of the show until the Ghostbusters rush the stage and try to hit it with their lasers. Abby stage-dives and goes for it, and Patty follows, but nobody catches her. She gets up and has the ghost perched on her shoulders. The other three wait for Patty to be still as they hit it with their lasers. Holtzmann pulls out a trap and has the ghost sucked into it.When supernatural myth buster Dr. Martin Heiss demands proof of the Ghostbusters' claims, Gilbert (who resents being labeled as insane or a liar) releases the ghost from containment, and it throws Heiss out a window before escaping. After the police arrive, the team is escorted by Agents Hawkins (Michael Kenneth Williams) and Rourke (Matt Walsh) to meet with Mayor Bradley (Andy García) and his deputy Jennifer Lynch (Cecily Strong).It turns out that the city and the Department of Homeland Security are well aware of New York's ghost problem. While privately supporting the team's work, the mayor's office and DHS publicly denounce them as fraudsters.\nThe Ghostbusters realize Rowan is planting his devices along key lines which intersect at the Mercado Hotel in Times Square, a site with a history of paranormal activity. They find a picture of the staff, and Patty recognizes Rowan among them, knowing he is their guy. The team heads to the hotel and finds Rowan in the basement with a device he built in which he plans to release a horde of ghosts upon the city as payback for being constantly mistreated.Rowan electrocutes himself rather than be captured by the police, and Holtzmann deactivates the portal. The ghost energy detector is left behind and goes haywire.\nGilbert discovers a copy of her and Yates's book among Rowan's possessions. It turns out that he planned all along to become a ghost and turn the spirits he releases into an army under his command and unleash the Fourth Cataclysm.\nAt headquarters, Abby hears a knocking at the door, but no one is there. There is a rattling on the sink's pipe, and she sees a green glow in the drain. Rowan's ghost then possesses Abby. She starts breaking Holtzmann's equipment and then grabs Holtzmann by the throat to dangle her out a window. Patty intervenes and rescues Holtzmann before smacking Rowan out of Abby. Moments later, Kevin pulls up on his motorcycle, and Rowan possesses him. He rides off back to the hotel.\nAfter possessing Kevin, Rowan opens the portal and releases hundreds of ghosts. The police and DHS attempt to stop Rowan and are quickly subdued.Abby, Holtzmann, and Patty gear up and head off the fight ghosts. They run into none other than Slimer (Adam Ray) the green ghost eating from a hot dog cart. He steals the Ecto-1 and drives off. Abby and Patty get ready to shoot at the car, but Holtzmann says the equipment on top of the car is basically a nuke. They then spot a bunch of ghosts that look like giant parade floats, which they start popping with their proton packs. A float in the shape of the Stay-Puft Marshmallow Man shows up and presses down on the three, rendering them immobile. Erin saves them by popping Stay-Puft with a Swiss army knife that Holtzmann gave her. The team then faces off against dozens of ghosts, including Gertrude, the subway ghost, and the theater ghost.Rowan takes the form of the Ghostbusters' logo, grows to enormous height and starts destroying the city. The team devise a plan to use Ecto-1's nuclear reactor (The team turns Ecto-1's reactor as a makeshift bomb, detonating a nuclear explosion inside the vortex) to cause a total Protonic reversal, close the portal and return the ghosts to their own dimension.\nThe plan works, and the ghosts start getting pulled back into the portal. Rowan holds on to two buildings, so the team hits him in the groin with their lasers to loosen his grip.\nThe plan succeeds, but Rowan drags Yates into the portal with him. Gilbert leaps into the portal and rescues Yates, and they both return to Manhattan with prematurely white hair.Afterwards, the mayor's office agrees to secretly fund the Ghostbusters' research while publicly continuing to denounce them as frauds. With new funding, the Ghostbusters are able to move to a better facility-an old fire house. Despite the mayoral smear campaign, New York lights up with thanks and tributes to the Ghostbusters.During the credits, the team being visited by Holtzmann's mentor Rebecca Gorin (Sigourney Weaver), who inspired her to be crazy.\nIn a post-credits scene, Tolan listens to a recording of a ghost encounter and asks the others if they have heard of Zuul.",
	"links": [
		"https://www.amazon.com/Ghostbusters-Melissa-McCarthy/dp/B01I039GVW"
	]
}