{
	"title": "Due Date",
	"release_year": "2010",
	"runtime": "95",
	"tags": [
		"Comedy",
		"Drama",
		"amazon",
		"netflix"
	],
	"rating": 6.5,
	"actors": [
		"Robert Downey Jr.",
		"Zach Galifianakis",
		"Michelle Monaghan",
		"Jamie Foxx",
		"Juliette Lewis",
		"Danny McBride",
		"RZA",
		"Matt Walsh",
		"Brody Stevens",
		"Jakob Ulrich"
	],
	"staff": [
		"Todd Phillips",
		"Alan R. Cohen",
		"Alan Freedland",
		"Adam Sztykiel",
		"Todd Phillips",
		"Daniel Goldberg",
		"Todd Phillips",
		"Christophe Beck",
		"Lawrence Sher",
		"Debra Neil-Fisher",
		"Juel Bestrop",
		"Seth Yanklewitz",
		"Bill Brzeski"
	],
	"votes": 360391,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTU5MTgxODM3Nl5BMl5BanBnXkFtZTcwMjMxNDEwNA@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Peter Highman (Robert Downey, Jr.) is a high-strung architect on his way home from Atlanta to Los Angeles to be present at the birth of his first child with his wife, Sarah (Michelle Monaghan). Peter's biggest fear is that he would not be near his wife when she goes into labor. Like any normal couple they have a hard deciding on a name for their baby, with Peter believing that it is a boy.Once on the plane, Peter learns that Ethan Tremblay (Zach Galifianakis), who had just prior to boarding at the airport, been a passenger in a vehicle that knocked the door off the limo Peter had been in, is sitting behind him in first class. Before boarding Ethan and Peter were standing next to each other prior to check in and one of Ethan's bags got picked by Peter by accident. This bag had a marijuana pipe, which was found by airport security.Later on the flight, Ethan gets upgraded to first class as his seat belt didn't fit and he got inappropriately close to Peter while putting his luggage in the overheard bin above Peter's seat.\nAfter inadvertently using the words \"terrorist\" and \"bomb\", Ethan gets Peter shot by a Federal Air Marshal with a rubber bullet. Both Peter and Ethan are forced off the plane before take-off.After being questioned by security, Peter discovers that he has been placed on the No-Fly List and will have to find another way to get to California. After realizing that he had left his wallet on the plane (he has no ID, no money, no cards and hence cannot even rent a car), Peter reluctantly agrees to travel with Ethan, a bumbling, annoying but well-meaning aspiring actor hoping to make it in Hollywood, to Los Angeles. Ethan is on his way to Hollywood with his dog Sonny after his father's funeral and is carrying his father's ashes in a coffee can (to scatter them all over the Grand Canyon) for the duration of the trip.\nPeter maps out an optimum route to LA, but Ethan wants a stopover at Grand Canyon. Peter cannot understand why the ashes are not in an urn.After stopping in Birmingham, Alabama to purchase marijuana from his dealer Heidi (Juliette Lewis) (which Ethan claims is for medical purposes), Peter and Ethan realize that they only have $60 in cash between them (after Ethan spent $200 on buying the Marijuana). Hence, they cannot even rent a motel room.\nPeter decides to have his wife transfer him money. Since he doesn't have any legitimate I.D on him, Peter has his wife transfer the money in Ethan's assumed last name Tremblay. Once at Western Union, Ethan realizes that the money has been sent to his stage name instead of his real name, Ethan Chase, the name printed on his I.D. The Western Union employee (Danny McBride) refuses to accept Ethan's head shot as proof of ID and declines the transfer. The Western Union guy also says that he will close the shop in 5 minutes as he has reservations at Chilli's. Peter snaps at him for not doing his job till his normal shift timings end. Peter also insults the man's military service record, not realizing that he is handicapped. The person comes out of his cabin and attacks Peter while in his wheelchair. Ethan fails to help Peter, later claiming that the Western Union guy was in a wheelchair.After spending the night at a rest stop, Peter decides on the spur of the moment to drive off and leave Ethan there while he washes up in the rest room, only to return several minutes later after wrestling with his conscience (as Ethan's father ashes were still in the car) and coming close to throwing Ethan's father's ashes off an overpass. Ethan ends up driving while Peter gets some rest. After driving a while, Ethan falls asleep at the wheel and crashes the car.At a Dallas hospital, Peter, who has a broken arm and three cracked ribs, is picked up by his friend Darryl (Jamie Foxx). Again, Peter decides to part company with Ethan, but Daryl persuades him otherwise. After a mere eight minutes in the company of Ethan, Ethan suggests that Peter's child could actually be Darryl's child given the close proximity & friendship between Peter's wife & Darryl (who were college friends & even met exactly 9 months ago). Darryl throws both of them out after mistakenly drinking some of Ethan's father's ashes, which were stored in a coffee tin.Darryl lets them use his Range Rover. The two accidentally end up at the United States-Mexican border in El Paso when Ethan mistakes the 'Mexico' sign at the border crossing for a 'Texaco' gas station. Despite assurances to Peter that he'll handle the situation, Ethan flees from the border checkpoint and leaves Peter to be arrested for possession of marijuana. The Mexican Federal Police takes Peter into custody, but Ethan breaks him out, stealing a border patrol truck & causing several highway car crashes in the process.The duo stops at the Grand Canyon, where Ethan says goodbye to his father and scatters his ashes. Peter confesses that he tried to leave Ethan back at the rest area and apologizes, but Ethan forgives him since he didn't go through with it.\nEthan then decides to make a confession of his own and reveals that he has been holding onto Peter's wallet the whole time, in order to get him to travel with him, so he wouldn't have to do so alone. Peter attacks Ethan in a fit of rage. Sarah calls during the attack to inform Peter that her water has broken. Peter and Ethan immediately begin to speed to California. Along the way, Ethan accidentally shoots Peter with a gun he finds in the truck's glove compartment. Peter refuses to stop for medical attention and instead insists that they continue on to the hospital in L.A.Arriving at the hospital, the two walk around trying to find Sarah's room. They enter Sarah's room and, while she is in labor, Peter passes out from loss of blood. Peter and Sarah's healthy daughter - indisputably Peter's child - is seen later in the nursery. The two go their separate ways with the promise that Peter will call Ethan to keep their friendship intact.\nAt the end, Ethan guest stars on an episode of his favorite television program, Two and a Half Men, with Peter and Sarah watching it in bed with their daughter. Ethan texts Peter during the episode, indicating that the two have become friends.",
	"links": [
		"https://www.amazon.com/Due-Date-Robert-Downey-Jr/dp/B004LFG4WS",
		"https://www.netflix.com/title/70130675"
	]
}