{
	"title": "The World's End",
	"release_year": "2013",
	"runtime": "109",
	"tags": [
		"Action",
		"Comedy",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.9,
	"actors": [
		"Simon Pegg",
		"Nick Frost",
		"Martin Freeman",
		"Rosamund Pike",
		"Thomas Law",
		"Zachary Bailess",
		"Jasper Levine",
		"James Tarpey",
		"Luke Bromley",
		"Sophie Evans"
	],
	"staff": [
		"Edgar Wright",
		"Simon Pegg",
		"Edgar Wright",
		"Tim Bevan",
		"Eric Fellner",
		"Nira Park",
		"Steven Price",
		"Bill Pope",
		"Paul Machliss",
		"Nina Gold",
		"Robert Sterne",
		"Marcus Rowland"
	],
	"votes": 301124,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzA1MTk1MzY0OV5BMl5BanBnXkFtZTgwNjkzNTUwMDE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Gary King (Simon Pegg), a middle-aged recovering drug addict, resolves to track down his estranged school-friends and complete the \"Golden Mile\", a pub crawl encompassing 12 pubs in their hometown of Newton Haven. The group attempted the crawl as teenagers, but failed to reach the final pub, the World's End.Gary arrives in Newton Haven with Peter Page, Oliver \"O-Man\" Chamberlain, Steven Prince, and Andy Knightley (Nick Frost). At the second pub, named The Old Familiar, the group is briefly joined for a drink by Oliver's sister Sam (Rosamund Pike), over whose affections Gary and Steven had previously rivaled. Gary tries to proposition Sam for sex in the ladies loo and is promptly slapped by her. In the toilets of the fourth pub, The Cross Hands, Gary gets into a fight with a surprisingly strong and agile teenager, and knocks his head off, exposing him as a robot. Gary's friends join him and fight more robots, after which Andy abandons his teetotalism and drinks an order of shots. The group decide to continue the pub crawl to avoid suspicion.Several pubs later, the group runs into Sam again and Gary warns her of the robot invasion. She is convinced after Gary saves her from twin robots impersonating her friends. At the eighth pub, The Mermaid, robots impersonating attractive girls from their youth attempt to seduce the men and steal their DNA. When Sam's childhood crush Adrian appears, she panics and drags the others from the pub, explaining that Adrian had died in a motorcycle crash years previously. When they reach the ninth pub, The Beehive, Guy Shepherd (Pierce Brosnan), who taught the group at secondary school, encourages them to accept their fate and be replaced by robots. Noticing the reappearance of a surgically removed birthmark on Oliver's head, Andy realizes that Oliver has been replaced with a robot. Another fight breaks out, and the group scatters as Gary convinces Sam to leave.Once reunited, the friends accuse each other of having been replaced by robots. Steven, Peter and Andy prove their humanity, but Gary refuses to roll his sleeves up to reveal a scar on his elbow, and instead repeatedly headbutts a pillar to prove that his skull is tougher than those of the robots. The robots close in on the group and capture Peter, but Gary is determined to finish the pub crawl. After having a drink along the way at the tenth and eleventh pubs, The King's Head and The Hole in the Wall, he runs towards the final pub, The World's End. Andy abandons Steven and chases Gary through the streets.At the World's End, Andy confronts Gary. In the quarrel, Andy notices that Gary's wrists are bandaged and marked with a hospital armband: Gary had attempted suicide, explaining why he refused to show his arms earlier. Andy tries to stop Gary from drawing his final pint, but Gary manages to pull the tap lever. The bar lowers into a hidden chamber, where the two are reunited with Steven.A disembodied alien entity called the Network reveals that the robot invasion of the town is one of 2,000 \"penetration points\" on Earth, and that it has been responsible for all of humanity's advances in telecommunications in recent decades. The Network offers the men eternal youth by becoming robots, but they decline, belligerently arguing that humans should be allowed to be free. The Network, defeated, ceases communication and abandons the invasion. Sam arrives to drive the group out of Newton Haven as it self-destructs.Some time later, Andy recounts this story around a campfire in the ruins of London, explaining how the destruction of Newton Haven was accompanied by a worldwide Electro-Magnetic pulse that wiped out modern technology and set humanity back to the Dark Ages. The remaining robots have reactivated and are mistrusted by surviving humans. Andy's marriage has recovered, Steven is in a relationship with Sam, and robot versions of Peter and Oliver have returned to a semblance of their former lives. In the ruins of Newton Haven, the now-sober Gary enters a pub with the younger robot versions of his friends and orders five glasses of water, reprising his speech from the start of the Golden Mile. When the bartender refuses to serve any robots, Gary draws a sword and leads his robot friends into a brawl.",
	"links": [
		"https://www.amazon.com/Worlds-End-Simon-Pegg/dp/B00G0OK8L6"
	]
}