{
	"title": "First Man",
	"release_year": "2018",
	"runtime": "141",
	"tags": [
		"Biography",
		"Drama",
		"History",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"Ryan Gosling",
		"Claire Foy",
		"Jason Clarke",
		"Kyle Chandler",
		"Corey Stoll",
		"Patrick Fugit",
		"Christopher Abbott",
		"Ciarán Hinds",
		"Olivia Hamilton",
		"Pablo Schreiber"
	],
	"staff": [
		"Damien Chazelle",
		"Josh Singer",
		"James R. Hansen",
		"Marty Bowen",
		"Damien Chazelle",
		"Wyck Godfrey",
		"Isaac Klausner",
		"Justin Hurwitz",
		"Linus Sandgren",
		"Tom Cross",
		"Francine Maisler",
		"Nathan Crowley"
	],
	"links": [
		"https://www.amazon.com/First-Man-Ryan-Gosling/dp/B07J253VYL"
	],
	"votes": 205242,
	"cover": "https://m.media-amazon.com/images/M/MV5BYmIzYmViN2UtMDRhYy00OTMwLWI5YzctMTQxYzg2ODMwMTIwXkEyXkFqcGc@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "In 1961, NASA test pilot Neil Armstrong (Ryan Gosling) is flying the X-15 rocket plane. Neil powers the winged jet to the edge of space at 140,000 feet, which exposes the limitations of winged aircraft while travelling to space.\nWhile returning, the plane inadvertently bounces off the atmosphere at 115,000 feet. Neil shows composure during the crisis and uses the Thrusters to turn the plane upside down. He then rides the momentum to re-enter the atmosphere. Although he manages to land the plane in the Mojave Desert, his colleagues express concern that his recent record of mishaps (3 of them in a one-month period) is due to distraction, and he is grounded.\nJoe Walker (Brian d'Arcy James) is Armstrong's fellow X-15 test pilot.Neil's two-and-a-half-year-old daughter, Karen, is undergoing treatment for a brain tumor. Desperate to save her, Armstrong keeps a detailed log of her symptoms and feverishly tries to find possible treatments, but she dies soon afterwards. Neil is distraught.Grief-stricken, Armstrong applies for Project Gemini and is accepted to NASA Astronaut Group 2. Gemini was looking for pilots with a solid background in Engineering. Bob Gilruth (Ciarán Hinds) the first director of NASA's Manned Spacecraft Center, interviews Neil. Neil agrees with Von Braun's approach to landing a space craft on the moon by parking the primary command module in orbit. He is also very straight forward about the loss of his daughter and is not emotional about it.Armstrong, his wife Janet (Claire Foy), and their son Rick (Gavin Warren) move to Houston alongside other astronaut families.Armstrong befriends Elliot See (Patrick Fugit), another civilian test pilot, and Ed White (Jason Clarke) (Neil's friend and neighbor, the first American to walk in space). Project Apollo envisages a series of tech breakthroughs which will need to be mastered to get to the moon. Mission of project Gemini is to prove that spacecraft Undocking and docking is possible in space without crashing.As Armstrong begins training, Deke Slayton (Kyle Chandler) (one of the original Mercury Seven astronauts, who became NASA's first Chief of the Astronaut Office) impresses upon the new astronauts the importance of the Gemini program, as the Soviet Union had reached every milestone in the Space Race ahead of the United States.\nIn 1964, Neil begins training on the multi-axle training facility. The challenge is to stabilize the machine before passing out. Neil is the first to volunteer and after several attempts, manages to bring the machine under control.\nThe training includes classes on advance rocketry.\nThe same year, Armstrong and Janet have a second son, Mark.By 1965, the family has settled in Houston, and Armstrong awaits selection for a crew. The Soviets complete the first extravehicular activity (EVA), though Ed White was scheduled to perform the first EVA during the Gemini 4 mission. The Soviets had one more milestone to their name. On August 19, 1965, the Gemini 5 space craft lift off is planned at Cape Kennedy, Launch Complex 19. With a mission duration of nearly eight days, Gemini 5 successfully demonstrated that astronauts could endure weightlessness for the approximate period of time necessary to fly to the Moon and back.Armstrong is informed that he will be the commander of Gemini 8, with David Scott (Christopher Abbott) as the pilot.\nPrior to the mission, See and Charles Bassett are killed in a T-38 crash, deepening Armstrong's grief at the string of recent losses.\nArmstrong and Scott successfully launch on Gemini 8. Their mission is to prove the docking ability in space but are unable to locate the Agena (their unmanned target). Neil is once again composed and calculates the orbits of the 2 space crafts to determine the magnitude and the duration of the burn required to acquire the Agena.\nThey dock with the unmanned Agena target vehicle (which was launched previously and parked in orbit), but soon afterward, the spacecraft begins to spin at a rapid rate. Neil separates from the Agena, but then the Gemini space craft starts spinning even faster and uncontrollably.\nAfter nearly blacking out, Armstrong activates the RCS (Reentry Control System) Thrusters and safely aborts the mission. Armstrong initially faces criticism, but NASA determines the crew is not at fault. Thruster number 8 on the Gemini spacecraft was found to have malfunctioned. The most probable cause was determined to be an electrical short, most likely due to a static electricity discharge. Power still flowed to the Thruster, even when it was switched off.Later, White reveals that he has been selected for the Apollo 1 mission along with Gus Grissom (Shea Whigham) and Roger Chaffee (Cory Michael Smith).\nDuring a launch rehearsal test on January 27, 1967, a fire kills the Apollo 1 crew (Gus and Roger) in a Pre-launch test, and Armstrong hears the news while representing NASA at the White House.The next year, after nearly being killed ejecting from the Lunar Landing Research Vehicle, Armstrong is selected to command Apollo 11, and Slayton informs him that it will likely be the first lunar landing. As the mission nears, Neil becomes more and more preoccupied and emotionally distant from his family. Just prior to the launch, Janet confronts Armstrong about the possibility that he won't survive the flight and insists that he explain the risks of the mission to their young sons. After telling them about the risks he faces, Armstrong says goodbye to his family and departs.Apollo 11 successfully launches and arrives at the Moon on the fourth day out. Armstrong and Aldrin (Corey Stoll) Undock in the Lunar Module Eagle and begin the landing attempt, but as they descend towards their landing site, Aldrin realizes the area is full of large boulders, forcing Armstrong to take manual control of the spacecraft.\nNeil lands Eagle successfully at an alternative site with less than 30 seconds of fuel remaining. After setting foot on the Moon, Armstrong utters his famous line, \"That's one small step for man, one giant leap for mankind.\" Later he drops Karen's bracelet into Little West crater. With their mission complete, the astronauts return home and are placed in quarantine, where they watch footage of John F. Kennedy's 1962 speech \"We choose to go to the Moon\" on television, and Neil and Janet share a moment of tenderness."
}