{
	"title": "Mission: Impossible - Ghost Protocol",
	"release_year": "2011",
	"runtime": "132",
	"tags": [
		"Action",
		"Adventure",
		"Thriller",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Tom Cruise",
		"Jeremy Renner",
		"Simon Pegg",
		"Paula Patton",
		"Michael Nyqvist",
		"Vladimir Mashkov",
		"Samuli Edelmann",
		"Ivan Shvedoff",
		"Anil Kapoor",
		"Léa Seydoux"
	],
	"staff": [
		"Brad Bird",
		"Bruce Geller",
		"Josh Appelbaum",
		"André Nemec",
		"J.J. Abrams",
		"Bryan Burk",
		"Tom Cruise",
		"Michael Giacchino",
		"Robert Elswit",
		"Paul Hirsch",
		"Nancy Bishop",
		"April Webster",
		"Alyssa Weisberg",
		"Jim Bissell"
	],
	"votes": 533345,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTY4MTUxMjQ5OV5BMl5BanBnXkFtZTcwNTUyMzg5Ng@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "On assignment in Budapest to intercept a courier working for a person of interest code-named \"Cobalt\", IMF agent Trevor Hanaway (Josh Holloway) is killed by an assassin named Moreau (Lea Seydoux).\nHanaway's team leader, Jane Carter (Paula Patton), and newly promoted field agent Benji Dunn (Simon Pegg) extract Ethan Hunt (Tom Cruise) from a Moscow prison. Ethan insists on extracting his source Bogdan (Miraj Grbic) and they are rescued from the prison together.\nEthan knew that as his informer Bogdan would be tortured and killed, so he rescued him and granted him his freedom.\nJane tells Hunt that Hannaway was killed while intercepting a routine courier drop. The courier was carrying Russian nuclear launch codes & these were now in the hands of an assassin. But before being killed by Moreau, Hannaway was also attacked by other parties after the same codes.Hunt knows that IMF has been looking for an extremist, code name Cobalt. Cobalt is known to have threatened a detonation of a nuclear device however he can & with the theft of the launch codes, his identity is of crucial importance. Moreau has worked with him before.\nCobalt was a nuclear strategist for Russian intelligence. Hunt is recruited to lead Carter and Dunn to infiltrate the secret Moscow Kremlin archives and locate files identifying Cobalt. Cobalt will do anything to destroy any records of his identity. Cobalt is already on his way to the Kremlin, which gives Ethan 5 hours to complete his mission.Halfway through the mission, Ethan manages to bypass all security inside the Kremlin and enter the archives room, but he finds the records room empty. Then, someone broadcasts across the IMF frequency, alerting the Russians to Hunt's team. Ethan orders an abort and while exiting the Kremlin, he sees another person coming out with a large briefcase in his hands.\nAlthough Hunt, Dunn and Carter escape, a bomb destroys the Kremlin. Ethan is caught up in the blast and wakes up in a Russian hospital. Russian agent Sidorov (Vladimir Mashkov) accuses Hunt of masterminding the attack, who is now again under Russian arrest. Hunt manages to escape from the hospital and calls in an immediate rescue for himself.The IMF extracts Hunt from Moscow. The Russians have called the attack an undeclared act of war and the US president activates \"Ghost Protocol\", a black operation contingency that disavows the entire IMF.\nHunt and team are to take the blame for the attack but will be allowed to escape from government custody so that they may operate to track down Cobalt. Before Hunt can escape, the IMF's secretary (Tom Wilkinson) is killed by Russian security forces led by Sidorov, leaving Hunt and intelligence analyst William Brandt (Jeremy Renner) to find their own way out.\nBased on Ethan's description, Brandt identifies Cobalt as Kurt Hendricks (Michael Nyqvist), a Swedish-born Russian nuclear strategist who believes the weak must die for the strong to survive, and so plans to start a nuclear war to start the next stage of human evolution.\nHendricks bombed the Kremlin and acquired a Russian nuclear launch-control device, and now needs its codes from the Budapest courier (Moreau) in order to launch a nuclear missile at America.\nThe team gather in one of the supplementary covert IMF sites that the secretary overlooked and plans their next move.The exchange between Moreau and Hendricks's right-hand man, Wistrom (Samuli Edelmann), is due to take place at the Burj Khalifa in Dubai. Ethan has to hack the server room by climbing outside of the Burj Khalifa using magnetic gloves.\nThere, Hunt's team-members separately convince Moreau and Wistrom that they have made the exchange with one another, when actually they never meet each other and only meet members of the IMF team pretending to be Wistrom and Moreau (Their mask machine failed, so they went without masks hoping that Wistrom and Moreau never met each other). The objective was to let Wistrom believe that he has the authentic codes, so that he can lead them to Hendricks. For this, the real codes had to be given to Wistrom as he was checking them live.\nHowever, Moreau identifies Brandt as an agent. While Hunt chases Wistrom only to realize Wistrom is actually Hendricks in disguise. As Hendricks escapes with the codes, Carter detains Moreau.Moreau attempts to kill the inexperienced Dunn, and Carter throws her out a window to her death. Brandt accuses Carter of compromising the mission for revenge against Moreau, but Hunt accuses Brandt of keeping secrets from them, as he has displayed fighting skills atypical of an analyst.\nWhile Hunt seeks more information from Bogdan, Brandt admits he was assigned as security detail to Hunt and his wife Julia (Michelle Monaghan) while on assignment. Julia was killed by a Serbian hit squad, prompting Ethan to pursue and kill them before he was caught by the Russians and sent to prison. Brandt says that he could bear the brunt of failure and that his last day In the field.Bogdan and his arms-dealer cousin inform Hunt that Hendricks will be in Mumbai. Hendricks facilitated the sale of a defunct Soviet military satellite to Indian telecommunications entrepreneur Brij Nath (Anil Kapoor), which could be used to transmit the order to fire a missile.\nBogdan's cousin also informs Sidorov about Ethan's location.While Brandt and Dunn infiltrate the server room to take the satellite offline, Carter gets Nath to reveal the satellite override code.\nBut Hendricks has anticipated Hunt's plan and takes Nath's servers offline after sending a signal from a television broadcasting tower to a Russian nuclear submarine in the Pacific. The submarine fires a nuclear missile on San Francisco. This single missile would look like Russian retaliation for bombing of the Kremlin and would evoke an equivalent response from the US.\nThe only way to stop the missile is via the abort sequence on the launch device that Hendricks is carrying.\nHunt pursues Hendricks and the launch device to an automated parking facility, while the other team-members attempt to bring the broadcast station back online.Hunt and Hendricks fight over the launch-control device before Hendricks jumps to his death with it to ensure that the launch cannot be aborted. Dunn kills Wistrom, allowing Brandt to restore power to the station and enabling Hunt to deactivate the missile. He is confronted by Sidorov, who sees Hunt has stopped the missile, proving the IMF is innocent in the Kremlin bombing.The team reconvenes weeks later. Hunt issues them new assignments. Brandt refuses to accept the mission, but Hunt reveals that Julia's death was staged, as he knew he could not protect her and used her death as a pretext to infiltrate a Russian prison and get close to Bogdan, an IMF source on Hendricks.\nRelieved of his guilt, Brandt accepts his mission while Hunt watches Julia from afar. They share a smile before he goes off on his next mission.",
	"links": [
		"https://www.amazon.com/Mission-Impossible-IV-Ghost-Protocol/dp/B0DLF7V81S"
	]
}