{
	"title": "Escape Plan",
	"release_year": "2013",
	"runtime": "115",
	"tags": [
		"Action",
		"Thriller"
	],
	"rating": 6.7,
	"actors": [
		"Sylvester Stallone",
		"Arnold Schwarzenegger",
		"50 Cent",
		"Vincent D'Onofrio",
		"Jim Caviezel",
		"Faran Tahir",
		"Amy Ryan",
		"Sam Neill",
		"Vinnie Jones",
		"Matt Gerald"
	],
	"staff": [
		"Mikael Håfström",
		"Miles Chapman",
		"Jason Keller",
		"Robbie Brenner",
		"Mark Canton",
		"Remington Chase",
		"Randall Emmett",
		"Alex Heffes",
		"Brendan Galvin",
		"Elliot Greenberg",
		"Anne McCarthy",
		"Kellie Roy",
		"Barry Chusid"
	],
	"votes": 259795,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTk3OTcxMTEyNl5BMl5BanBnXkFtZTcwMDQ4MjQ2OQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Breslin-Clark, a security company that specializes in evaluating the security protocols of super max prisons, was founded and is co-owned by former prosecutor Ray Breslin. Driven by the killings of his wife and kids by an escaped convict he had successfully prosecuted, Breslin has established a reputation as the guy who can escape any jail by posing as an inmate in order to study facilities from within and take advantage of their flaws to escape.CIA agent Jessica Miller offers Breslin and his business partner, Lester Clark, a multimillionaire-dollar contract to test a new, top-secret jail for missing people, provided Ray and his crew are not allowed to know the facility's actual location. Breslin consents despite the fact that this goes against his morals, enabling his arrest as a terrorist-for-hire. His kidnappers poison him and take away a tracking microchip that was inserted in his arm, making it impossible for his coworkers to follow his whereabouts. This throws the plan into a loop.After waking up inside the jail, Breslin discovers that Willard Hobbes, the warden, is not the same warden who was meant to release him in an emergency. He becomes friends with another prisoner, Emil Rottmayer, who says he works as a security specialist for Victor Mannheim, a phony Robin Hood-style thief of the rich.Breslin plans an escape attempt after learning that he is in the middle of an ocean on a huge prison ship. Breslin is informed by Hobbes that he knows who he really is and that he will make sure Breslin is imprisoned for the remainder of his life. Hobbes accepts Breslin's promise to release him in return for information on Mannheim. Hobbes is fed misleading information about Mannheim by Breslin, and when Breslin's employment pay is frozen, his coworkers Abigail Ross and Hush start to doubt Clark. Code-named \"The Tomb,\" the prison is operated by a for-profit company connected to an infamous private security contractor, Hush learns. Regarding Breslin's incarceration, it is also shown that Clark communicates with Hobbes.Breslin and Rottmayer determine they are somewhere in the Atlantic Ocean close to Morocco with the assistance of another prisoner, Javed. In a second escape attempt, Hobbes and his men shoot Javed dead, but Breslin murders a guard called Drake when he attempts to stop them. Mannheim's chopper and the guards are involved in a shootout. With Breslin evacuated to the ship's bottom, Rottmayer joins the helicopter. Breslin arrives to the helicopter as Hobbes is firing at him, shoots multiple leaking barrels of oil, and Hobbes is killed in the explosion.Rottmayer reveals that he is indeed Mannheim and that \"Jessica Miller\" is actually his daughter, who actually recruited Breslin to plan her father's escape when the chopper lands on a beach in Morocco. After being imprisoned in a cargo container, Clark is taken to an unidentified place.",
	"links": []
}