{
	"title": "Den of Thieves",
	"release_year": "2018",
	"runtime": "140",
	"tags": [
		"Action",
		"Crime",
		"Drama",
		"max",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Gerard Butler",
		"Pablo Schreiber",
		"O'Shea Jackson Jr.",
		"50 Cent",
		"Meadow Williams",
		"Maurice Compte",
		"Brian Van Holt",
		"Evan Jones",
		"Mo McRae",
		"Kaiwi Lyman"
	],
	"staff": [
		"Christian Gudegast",
		"Christian Gudegast",
		"Paul T. Scheuring",
		"Gerard Butler",
		"Mark Canton",
		"Alan Siegel",
		"Tucker Tooley",
		"Cliff Martinez",
		"Terry Stacey",
		"David S. Cox",
		"Joel Cox",
		"Nathan Godley",
		"John Papsidera",
		"Kara Lindstrom"
	],
	"votes": 125726,
	"cover": "https://m.media-amazon.com/images/M/MV5BMzYyODcwMDAyM15BMl5BanBnXkFtZTgwOTA4MjIwNDI@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Los Angeles, 2018: A team of robbers led by Ray Merrimen (Pablo Schreiber) make a violent armed attack and hijack an armored truck. A security guard who drops his coffee instigates the shootout accidentally. Police officers arrive on the scene and engage in a shootout with the robbers. Eventually, Merrimen and his crew escape with the empty armored truck, but he reprimands Bosco (Evan Jones) for killing the first guard. In the morning, Detective Nick \"Big Nick\" O'Brien (Gerard Butler) investigates the crime scene. He has been monitoring Merrimen and his crew for a while. Nick is curious as to why Merrimen stole an empty armored truck. Suspecting a local bartender named Donnie for involvement, Nick finds him at the bar and kidnaps him for interrogation.In a flashback, Merrimen is planning to rob the Federal Reserve on Friday of that week by covertly removing about $30 million in old bills with deleted serial numbers before they are shredded. Merrimen has Donnie gain access into the Federal Reserve by posing as a Chinese food deliveryman. In the ceiling of the Bank's bathroom, he stashes an extra bag of food for the day of the big heist.At home, Nick's wife Debbie (Dawn Olivieri) discovers that Nick has been going behind her back seeing other women. Incensed, she leaves with their daughters and files for divorce. Nick spots Donnie and says hello at a restaurant with Merrimen and his crew. At their hideout, Merrimen has one of his crew, Levi (Curtis \"50 Cent\" Jackson), roughly interrogate Donnie. Donnie convinces him that he hasn't told him anything about the robbery. Later, Levi's daughter has a date arrive to pick her up for a school dance. Levi pulls the boy aside to introduce him to Merrimen and the rest of their crew to intimidate him into being on his best behavior with Levi's daughter.Meanwhile, Nick drunkenly crashes a small get-together at the home of Debbie's sister. He obnoxiously signs the divorce papers, and gets belligerent with Debbie's new boyfriend, before he is told to leave. Nick then goes to a strip club and goes home with a stripper; unaware the stripper was hired by Merrimen to examine his phone handset. The next morning, at his daughter's school, Nick makes a desperate unscheduled effort to see his daughter.The day of the heist comes. Merrimen and his crew invade a commercial bank branch and take hostages. They demand USD 10 MM and a chopper within an hour. Nick's team is outside tracking Merrimen's crew, as the chaos unfolds. The L.A.P.D. Police Chief calls and speaks to Joseph, the bank's branch manager, on behalf of Merrimen. To discourage further time-wasting communications, Merrimen has one of the crew take a hostage to a back room and shoot her. The police negotiator then agrees not to communicate again until the money and chopper are about to arrive in over an hour's time. The thieves then blow the vault open and escape through a hole in the floor before Nick's team come in. They also find that the shooting of the hostage was staged. The thieves needed commercial bank cash, so they can make a cash drop-off at the federal reserve: the only way to get inside the federal reserve building.Donnie is hidden inside a cash dolly delivered to the Federal Reserve building by Merrimen, and he slips out during a falsely tripped alarm to collect the targeted old bills that have been earmarked for shredding and he stashes them in bags in the refuse. After escaping the cash count-rooms through the air ducts, Donnie retrieves the bag of food from the bathroom ceiling. Appalled by the cold, old food, the unsuspecting Federal Reserve employee who orders Chinese food daily, tries to get security to stop him, but Donnie is gone. The cash is dispatched from the Federal Reserve building in a waste management truck that removes shredded bills. Nick's team catch up to Donnie and seize him, beating him until he tells them where Merrimen is going.Merrimen, Bosco and Levi try to make their escape with bags from the waste truck. They hit a traffic jam and are blocked. Nick's team spots them and attempts to shoot them as the robbers try to escape. After warning other drivers, the police start to shoot at Merrimen and his gang. Levi and Bosco are shot dead, but Merrimen gets away. Nick gives chase and shoots Merrimen through a fence, wounding him. Nick hops the fence to catch him, but Merrimen refuses to go out quietly. He raises an empty gun to Nick, forcing him to shoot him. As Merrimen lies on the floor dying, Nick kneels by him. He reminds Nick that he kept to his word and dies peacefully. When Nick inspects Merrimen's van, he only finds bags with shredded paper. He also finds that Donnie has escaped custody.Nick later goes to Donnie's bar and sees pictures of him with some of the crew members from the heist. Through flashbacks, it is revealed Donnie masterminded the heist to get all of the cash for himself. The realization hits Nick. After the passage of some time, Donnie is seen in London working at another bar. His crew is nearby having drinks and enjoying the spoils of their victory. A man (Michael Bisping) from a shop across the street comes in. Donnie serves him and asks if he works at the diamond exchange next door. The man says yes, and Donnie gives the man a beer on the house.",
	"links": [
		"https://www.max.com/movies/den-of-thieves/9c128f48-a3d4-4d5b-96d1-578448bba31d",
		"https://www.amazon.com/Den-Thieves-Gerard-Butler/dp/B07BM7143M"
	]
}