{
	"title": "Doctor Strange",
	"release_year": "2016",
	"runtime": "115",
	"tags": [
		"Action",
		"Adventure",
		"Fantasy",
		"amazon"
	],
	"rating": 7.5,
	"actors": [
		"Benedict Cumberbatch",
		"Chiwetel Ejiofor",
		"Rachel McAdams",
		"Benedict Wong",
		"Mads Mikkelsen",
		"Tilda Swinton",
		"Michael Stuhlbarg",
		"Benjamin Bratt",
		"Scott Adkins",
		"Scott Adkins",
		"Zara Phythian"
	],
	"staff": [
		"Scott Derrickson",
		"Jon Spaihts",
		"Scott Derrickson",
		"C. Robert Cargill",
		"Stan Lee",
		"Kevin Feige",
		"Michael Giacchino",
		"Ben Davis",
		"Sabrina Plisco",
		"Wyatt Smith",
		"Sarah Finn",
		"Charles Wood"
	],
	"votes": 818941,
	"cover": "https://m.media-amazon.com/images/M/MV5BNjgwNzAzNjk1Nl5BMl5BanBnXkFtZTgwMzQ2NjI1OTE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In Kathmandu, Nepal, the sorcerer Kaecilius (Mads Mikkelsen) and his zealots enter the secret compound Kamar-Taj and behead its librarian. From the ancient and mystical texts, they steal a ritual from a book belonging to the Ancient One, a sorcerer who has lived for an unknown time and taught all at Kamar-Taj, including Kaecilius, in the ways of the mystic arts. The Ancient One pursues the traitors, and traps Kaecilius in a mirror dimension. But Kaecilius escapes with the pages and some of his followers by opening up a portal out of the mirror dimension.Stephen Strange (Benedict Cumberbatch), an acclaimed neurosurgeon, loses the use of his hands in a car accident. Strange was very proud of his skill, which he had gained after several years of studies and practice. Strange considered himself to be a student of science and had extremely steady hands which allowed him to conduct the most difficult cranial surgeries with utmost precision. After the accident, his surgery required 11 surgical pins to be inserted into his bones and massive nerve damage in both hands. His operation lasted for 11 hours.\nThe recovery is slow and there is still massive tissue damage.Fellow surgeon and former lover Christine Palmer (Rachel McAdams) tries to help him move on, but Strange, firmly believing he can regain use of his hands, instead uses all his resources pursuing experimental surgeries. Strange submits himself to experimental procedures to help speed up the recovery process, but he cannot gain back any meaningful strength in his hands. World's leading experts give up on Strange.Strange learns from his physiotherapist that there was one case in his career, who was paralyzed from the waste down and after a few years he saw the man walking by him on the street. Strange challenges the physiotherapist to fetch the medical file on the person.\nAfter learning of Jonathan Pangborn (Benjamin Bratt), a paraplegic who mysteriously was able to walk again, Strange seeks him out. Pangborn came back from a place from where he was not supposed to. Pangborn says that he even came to meet Strange and Strange refused to see him, as the best doctors do not take on hopeless cases to protect their reputation.\nStrange begs Pangborn and is directed to Kamar-Taj. Jonathan tells strange that he had given up on his body, but in the presence of his guru, he trained his own mind, and thereby healed his body.In Kathmandu, Strange looks for Kamar-Taj for many weeks. Strange is taken in by another sorcerer under the Ancient One, Mordo (Chiwetel Ejiofor). The Ancient One says that the spirit of the body can program the cells to self-heal. Naturally, Strange is skeptical and even dismissive of The Ancient One. She compares him to a glass that is already full and hence cannot learn anymore.\nThe Ancient One shows Strange her power, revealing the astral plane and other dimensions such as the Mirror Dimension. She says that the Universe is only one of an Infinite number, and at the root of reality, mind and matter meet. Some Universes are benign and give life, while others are full of hunger and contain evil forces which are older than time itself.\nAmazed, Strange begs her to teach him, and she eventually agrees despite his arrogance, which reminds her of Kaecilius. Mordo convinces The Ancient One that Kamar-Taj might need a person like Strange if Kaecilius manages to decode the stolen pages and summon the Dark forces.Strange begins his tutelage under the Ancient One (Tilda Swinton) and Mordo, and learns from the ancient books in the library, now presided over by the master Wong (Benedict Wong). He learns to harness energy from the infinite multiverses to power spells that create shields and weapons.\nStrange learns that Earth is protected from other dimensions by a spell formed from three buildings called Sanctums, found in New York City, London, and Hong Kong.\nThe task of the sorcerers is to protect the Sanctums, though Pangborn chose to forgo this responsibility in favor of channeling mystical energy into walking again.\nWong tells Strange about Dormammu, the supreme being of the Dark Dimension, who invades Universes, and bring them into his Dark Dimension. Dormammu is a being of infinite power and endless hunger. He hungers for Earth most of all. The ritual that Kaecilius stole was to contact Dormammu and to summon him from the Dark Dimension.Strange advances quickly over several months, even secretly reading from the text Kaecilius stole from and learning to bend time with the mystical Eye of Agamotto.\nMordo and Wong warn Strange against breaking the laws of nature, comparing his arrogant yearning for power to that of Kaecilius, who believes, after the deaths of his loved ones, that everyone should have eternal life.Kaecilius and his followers use the stolen pages to begin summoning the powerful Dormammu of the Dark Dimension, where time does not exist, and all can live forever. This destroys the London Sanctum and sends Strange from Kamar-Taj to the New York Sanctum. The zealots then attack there, where Strange holds them off with the mystical Cloak of Levitation until Mordo and the Ancient One arrive.Strange and Mordo become disillusioned with the Ancient One after Kaecilius reveals that her long life has come from her own use of Dormammu's power. Kaecilius mortally wounds the Ancient One, and escapes to Hong Kong. The Ancient One tells Strange that he, too, will have to break the rules, to balance Mordo's steadfast nature. She then dies, despite the best efforts of Strange and a bewildered Palmer.Strange and Mordo arrive in Hong Kong to find Wong dead and the Sanctum destroyed, with the Dark Dimension already engulfing Earth. Strange uses the Eye to turn back time and save Wong, before creating an infinite time loop inside the Dark Dimension that traps himself and Dormammu in the same moment forever. After killing Strange many times to no avail, Dormammu reluctantly agrees to leave Earth if Strange undoes the time loop, taking Kaecilius and the zealots with him.Disgusted by Strange and the Ancient One's disregard for the consequences of defying nature, Mordo departs. Strange returns the Eye, which Wong calls an Infinity Stone, to Kamar-Taj, and then takes up residence in the New York Sanctum to continue his studies.\nIn a mid-credits scene, Strange decides to help Thor, who has brought his brother Loki to Earth to search for their father Odin.\nIn a post-credits scene, Mordo confronts Pangborn and takes the energy he uses to walk, stating that Earth has \"too many sorcerers\".",
	"links": [
		"https://www.amazon.com/Doctor-Strange-Theatrical-Benedict-Cumberbatch/dp/B01M4QJGX2"
	]
}