{
	"title": "Pirates of the Caribbean: On Stranger Tides",
	"release_year": "2011",
	"runtime": "136",
	"tags": [
		"Action",
		"Adventure",
		"Fantasy",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Johnny Depp",
		"Penélope Cruz",
		"Ian McShane",
		"Geoffrey Rush",
		"Kevin McNally",
		"Sam Claflin",
		"Astrid Bergès-Frisbey",
		"Stephen Graham",
		"Keith Richards",
		"Richard Griffiths"
	],
	"staff": [
		"Rob Marshall",
		"Ted Elliott",
		"Terry Rossio",
		"Stuart Beattie",
		"Jay Wolpert",
		"Jerry Bruckheimer",
		"Hans Zimmer",
		"Dariusz Wolski",
		"David Brenner",
		"Wyatt Smith",
		"Lucy Bevan",
		"Kathy Driscoll",
		"Francine Maisler",
		"John Myhre"
	],
	"votes": 571670,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjE5MjkwODI3Nl5BMl5BanBnXkFtZTcwNjcwMDk4NA@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1750, 2 Spanish fishermen catch a man in their nets in deep ocean who claims to know the location of the fountain of youth. The man claims to have sailed with Ponce De Leon, who was rumored to have died 200 years ago, searching for the Fountain of Youth. The man's existence is proof that Ponce De Leon found the fountain.\nThey take him to the king, who immediately sets off an expedition in search using the dairy provided by the captured man as guide.Captain Jack Sparrow (Johnny Depp) travels to London to locate the person who has been impersonating him. The impostor has reportedly been recruiting a crew to search for the legendary Fountain of Youth. Jack had acquired Sao Feng's map to find the Fountain.\nFirst Sparrow rescues his former first mate, Joshamee Gibbs (Kevin McNally), who is about to be hanged, though the two are captured. Gibbs steals the map from Jack after Jack had rescued him.Jack is brought before King George II (Richard Griffiths), who wants him to guide an expedition to the Fountain before the Spanish find it. Heading the expedition is Jack's old nemesis, Captain Hector Barbossa (Geoffrey Rush), now a privateer in service to the British Navy after having lost Jack's ship, the Black Pearl, as well as his leg. Jack hates Barbossa for losing the Black Pearl and escapes from the castle.Jack escapes, and is found by his father, Captain Teague (Keith Richards), who warns Jack about the Fountain's tests. The test requires 2 silver chalices from the Ponce De Leon ship.\nJack reaches a group of men who are recruiting a crew under his name. Jack soon discovers that the impostor is Angelica (Penelope Cruz), his former lover and daughter of the ruthless pirate Blackbeard (Ian McShane), who possesses supernatural powers and practices voodoo magic. Blackbeard has used his magic to Zombify all the officers on his ship, to make them more compliant.Angelica knocks out Jack with a tranquilizer dart and takes him captive.\nJack is forced to join Blackbeard's crew and to lead them to the Fountain. Angelica serves as the First mate on Blackbeard's ship. Philip Swift is a captive missionary on Blackbeard's ship. He is kept alive as Angelica stuck her neck out for him due to him being a servant of the Lord. Angelica says that every soul can be saved, and she wants to save Blackbeard's.Jack is livid at being made to serve on Blackbeard's ship, but Angelica convinces him that she and Jack can share the Fountain of Youth, as Blackbeard will be dead.\nBlackbeard intends to use the Fountain's power to circumvent his prophesied fatal encounter with a one-legged man within a fortnight.Meanwhile, Gibbs, who memorized, then destroyed, Sparrow's map, barters with Barbossa, for his life (as Gibbs was headed for the gallows to be hanged), in exchange for leading him and his crew to the Fountain. Barbossa sets sail on the HMS Providence.\nOn the high seas, Barbossa finds that the Spanish have also dispatched their fleet to acquire the Fountain of Youth.Jack tries to entice a mutiny on board Blackbeard's ship by convincing the men that a pursuit of the Fountain of Youth will only lead to their deaths. The crew defeats the officers, but that's when Blackbeard enters the battle and uses magic to defeat the crew and hang all mutineers. Angelica convinces Blackbeard that the expedition needs Jack, and his life is spared.\nJack, in a private audience with Blackbeard, tells him that Angelica cannot be trusted, which Angelica overhears. Jack is forced to help Blackbeard when he tortures Jack by sticking pins into a voodoo doll that looks just like Jack.\nLater, Jack claims to Angelica, that he did the charade, just to ensure that Blackbeard takes them both to the Fountain.Aboard Blackbeard's ship, the Queen Anne's Revenge, Jack learns that the Fountain's water must be drunk simultaneously from two silver chalices once belonging to Juan Ponce De Leon. The person drinking from the chalice containing a mermaid's tear has their life extended, while the other person dies, their years of life drained from their body.\nAngelica says that if Jack helps her, she will help Jack choose any ship from a collection of miniaturized ships (each in its own bottle) in Blackbeard's collection, which includes the Black Pearl. Angelica wants Jack to serve the One-legged man as the victim for her father, so that he can extend his life. Jack tries to convince Angelica that Blackbeard is evil and will kill her at the first available opportunity.At Whitecap Bay, Blackbeard traps a mermaid that Philip Swift (Sam Claflin), a captive missionary on Blackbeard's ship, falls in love with and names Syrena (Astrid Berges-Frisbey).\nBlackbeard then sends Sparrow to retrieve the chalices from De Leon's grounded ship and keeps Sparrow's compass as collateral. Sparrow arrives finding only Barbossa: the Spanish have already taken the chalices.Barbossa's only wants revenge against Blackbeard for having captured the Black Pearl, forcing Barbossa to amputate his own leg to escape. He and Jack plot to defeat Blackbeard, then steal the chalices from the nearby Spanish camp.\nMeanwhile, Syrena, who returns Philip's love, is tricked into shedding a tear when Blackbeard pretends to have killed Philip, which Blackbeard collects, then leaves her to die while forcing Philip to go with him. Sparrow returns with the chalices and Gibbs, who he had reunited with while helping Barbossa. Jack negotiates with Blackbeard to return his confiscated magical compass and to free Gibbs in exchange for the chalices and his leading them to the Fountain. Blackbeard agrees, and Gibbs departs with Jack's compass.At the Fountain, Blackbeard and his crew are attacked by Barbossa and also the Spanish, sent by their king to destroy the Fountain, believing its power is an abomination against God. After an intense battle, Barbossa stabs Blackbeard with a poison-laced sword, but Angelica is also wounded by it. Barbossa claims Blackbeard's magical sword, and assuming command, leaves with Blackbeard's crew. Philip, mortally wounded, escapes and returns to free Syrena. After finding the chalices that the Spaniards tossed into deep water, Syrena gives them to Sparrow, then retrieves the dying Phillip, taking him underwater to heal him.Angelica intends to sacrifice herself for her father, but Sparrow deceives them, and Angelica unknowingly drinks from the chalice containing Syrena's tear, thus killing Blackbeard and saving her. Although they declare their love, Jack, knowing she may avenge her father's death, strands her on an island, intending for a passing ship to pick her up. Jack then finds Gibbs, who used Sparrow's compass to locate the Revenge and retrieve all the captured ships that Blackbeard had magically shrunk and bottled, including the Black Pearl. The two head off, hoping to find a way to return the Pearl to its original size.In a post-credits scene, Angelica, still on the island, finds Blackbeard's voodoo doll of Sparrow, which has washed ashore.",
	"links": [
		"https://www.amazon.com/Pirates-Caribbean-Stranger-Johnny-Depp/dp/B005W6UT1W"
	]
}