{
	"title": "Leave the World Behind",
	"release_year": "2023",
	"runtime": "138",
	"tags": [
		"Drama",
		"Mystery",
		"Thriller",
		"amazon",
		"netflix"
	],
	"rating": 6.4,
	"actors": [
		"Julia Roberts",
		"Mahershala Ali",
		"Ethan Hawke",
		"Myha'la",
		"Farrah Mackenzie",
		"Charlie Evans",
		"Kevin Bacon",
		"Alexis Rae Forlenza",
		"Vanessa Aspillaga",
		"Josh Drennen"
	],
	"staff": [
		"Sam Esmail",
		"Rumaan Alam",
		"Sam Esmail",
		"Sam Esmail",
		"Marisa Yeres Gill",
		"Lisa Roberts Gillan",
		"Chad Hamilton",
		"Mac Quayle",
		"Tod Campbell",
		"Lisa Lassek",
		"Beth Bowling",
		"Susie Farris",
		"Anastasia White"
	],
	"votes": 211643,
	"cover": "https://m.media-amazon.com/images/M/MV5BZjI0YzhjZjAtMzg3ZS00NTFhLWFkYjctMjE5ZGExNTk1MmJkXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "Misanthrope Amanda Sandford (Julia Roberts) arranges an impromptu weekend getaway at a vacation rental to spend quality time together with her husband Clay (Ethan Hawke) and their kids, Archie (Charlie Evans) and Rose (Farrah Mackenzie). The vacation rental home is by the beach and Amanda is looking forward to get away from her New York life.\nWhile shopping for groceries, Amanda sees a man stocking up on large quantities of canned food and water.\nLater, while the family relaxes at a nearby beach, they evade an oil tanker that runs ashore. The authorities say that there has been a problem with a navigational system and there have been reports of many such groundings across the coast.\nWhen they return to the house, they notice the TV and Wi-Fi are not working and a pair of deer stare at them.That night, the owner, George H. (\"G.H.\") Scott (Mahershala Ali), and his daughter, Ruth (Myha'La), arrive at the house. Seeking shelter, G.H. explains that a blackout caused their return. Ruth explains that they have an apartment on the 14th floor in the city and GH could not climb 14 floors due to a knee injury. GH and Ruth are African Americans and Amanda is skeptical about their story. Ruth reminds Amanda that this is their house.\nAmanda is suspicious and doesn't want them to stay. Clay however trusts them and lets them stay the night. GH pays back $1000 to Amanda, which is half of what she paid GH for the entire weekend, as a peace offering.\nIn private, Amanda tells Clay that the story doesn't fit as they didn't hear the car come up the driveway and they haven't seen any IDs, so GH and Ruth are effectively strangers.\nAmanda wants to see GH's ID, but he claims that he left it in his coat pocket at the Symphony Opera which he visited earlier that day. There are no pictures in the home to prove that GH and Ruth live there. GH claims that his wife is on a business trip to Morocco, and she is scheduled to land the next morning.The next morning, Rose is frustrated that the Wi-Fi and TV are still down, which has prevented her from watching the series finale of Friends. Amanda notices four news alerts on her phone about the blackout, the third of which is about hackers, and the final one shows a corrupted message. Rose sees a larger herd of deer motionless in the backyard.\nRuth is getting paranoid, while GH continues to say that it is probably nothing and things will go back to normal soon. Ruth learns that Clay is a Professor of Media Studies, while Amanda is a client relations manager in Advertising.\nGH secretly removes his gun from the liquor cabinet.Attempting to learn about the disruptions and fix the Wi-Fi, Clay drives to town while G.H. heads to his neighbor's house who live a few miles down the road.\nClay's radio picks up intermittent reports of an ongoing Cyberattack on the country leading to an environmental disaster in the South, which is impacting animal migration patterns.\nClay abandons a Spanish-speaking woman seeking help and drives from a drone dropping leaflets written in Arabic, while G.H. searches the neighbor's home and finds a Satellite phone which also does not connect to any network.\nGH discovers the wreckage of a plane crash on the nearby beach, and narrowly avoids a second one.Elsewhere, Rose walks along with Archie in the nearby woods, where they come across an empty shed, and Archie removes a tick from his ankle on the way back.\nReturning to the house, G.H. confides to Amanda the events he witnessed. He theorizes that nationwide satellite connectivity has been disrupted, but he is cut off by a loud, shrill noise.\nAmanda runs out into the woods to bring Rose and Archie back to safety.Amanda recalls the man stockpiling supplies, whom G.H. assumes is Danny (Kevin Bacon), his contractor. Clay returns shaken with the leaflet, which Archie partially translates as \"Death to America\".\nFed up, the Sandfords flee the rental, intending to drive to Amanda's sister in New Jersey, but find the highway jammed with collided self-driving Teslas; they narrowly avoid more incoming cars, and they are forced to return to G.H.'s house.That night Rose still tries to watch the season finale of Friends, while Archie masturbates to pictures of Ruth he had taken when they were by the pool.\nThroughout the night, Ruth asks Clay provocative questions (like if he ever had sex with one of his students), and they later discover flamingos in the pool.\nAmanda and G.H. establish a friendly bond but they are cut off by a second shrill noise, and the power fails. GH had told Amanda about a friend of his who is into defense contracting and hangs out with some of the most evil men on the planet, who called him the previous evening and asked GH to move all of his money around, which involved big numbers. The friend told GH to \"Take care of himself\".\nLater, Rose tells Amanda a story from an episode of The West Wing where God attempts to save a man from a flood with several warnings and escape opportunities.Ruth tells GH that he needs to stop trusting Amanda and Clay so much, and start looking out for himself and her, as the world continues to fall apart around them.The next morning, Archie's teeth inexplicably fall out. Believing it is related to the tick bite, G.H. suggests visiting Danny for medicine (he speculates that it could be Lime disease).\nRose is now missing, and G.H. and Clay take Archie to visit Danny, while Amanda and Ruth search for Rose. At the shed in the woods behind the house, the two are confronted by an even larger herd of deer, which they scare away.\nMeanwhile, G.H. and Clay attempt to convince Danny to help Archie, which results in an armed standoff between G.H. and Danny. Clay intervenes, convincing Danny to help Archie. Clay offers Danny $1000 for some antibiotics for Archie.\nAfterward, Danny tells G.H. that another neighbor may be equipped with an underground bunker and suggests that the noise and Archie's teeth falling out are the results of a microwave weapon. Danny says that the same kind of weapon was tested in Cuba.Shaken, G.H. hypothesizes to Clay and Archie that the country is in a three-stage campaign that will result in a Coup D'Etat. The first stage is to isolate the target by disabling their communications and transportation. Second stage is synchronized chaos via disinformation, which turns people against each other. Third stage is civil war and total collapse of society. GH says that he studied military programs, and this was considered to be the most cost effective way to destabilize a country, if it was dysfunctional enough.At the same time, Amanda and Ruth watch New York City being bombed.\nRose then finds the neighbor's house with the bunker. Inside, a computer message warns of elevated radiation levels across multiple U.S. cities. She finds a DVD of Friends and watches the series finale.",
	"links": [
		"https://www.amazon.com/Digital-Dystopia-Unrav%D0%B5ling-Apocalyptic-T%D0%B5chnologys-ebook/dp/B0CQHX23T3",
		"https://www.netflix.com/title/81314956"
	]
}