{
	"title": "Furiosa: A Mad Max Saga",
	"release_year": "2024",
	"runtime": "148",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon",
		"netflix"
	],
	"rating": 7.6,
	"actors": [
		"Anya Taylor-Joy",
		"Chris Hemsworth",
		"Tom Burke",
		"Alyla Browne",
		"George Shevtsov",
		"Lachy Hulme",
		"Lachy Hulme",
		"John Howard",
		"Angus Sampson",
		"Charlee Fraser",
		"Elsa Pataky",
		"Elsa Pataky"
	],
	"staff": [
		"George Miller",
		"George Miller",
		"Nick Lathouris",
		"George Miller",
		"Doug Mitchell",
		"Tom Holkenborg",
		"Simon Duggan",
		"Eliot Knapman",
		"Margaret Sixel",
		"Nikki Barrett",
		"Colin Gibson"
	],
	"links": [
		"https://www.amazon.com/Furiosa-Mad-Saga-George-Miller/dp/B0CVQ3197P",
		"https://www.netflix.com/title/81610642"
	],
	"votes": 190154,
	"cover": "https://m.media-amazon.com/images/M/MV5BOGM3MTMxMjgtZGEzYS00YTI5LWE5ZGUtZjcwYzUzMDA3YTAxXkEyXkFqcGc@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "Australia is a radioactive wasteland and the Green Place of Many Mothers is one of the last remaining areas with fresh water and agriculture. Raiders discover the Green Place while two children, Furiosa and Valkyrie, are picking peaches. Furiosa tries to sabotage their motorcycles, but the raiders capture her as a prize for their leader, Dementus of the Biker Horde. Furiosa's mother, Mary, pursues them to the Horde's camp, killing all but one raider. The last raider delivers Furiosa to Dementus, but Furiosa mortally wounds him before he can reveal the Green Place's location. Mary sneaks into the camp and rescues Furiosa, but Dementus tracks them down. The mother stays back to buy Furiosa time to escape and gives her a peach pit to remember her by, but Furiosa refuses to leave Mary. Dementus forces Furiosa to watch her mother's crucifixion. Haunted by his family's death, he adopts an unwilling Furiosa as his daughter, hoping she will lead him to the Green Place.Sometime after, Dementus besieges the Citadel, another settlement with fresh water and agriculture. However, the Horde is repelled by the War Boys, the fanatical army of Citadel warlord Immortan Joe. Dementus changes course, using a Trojan Horse strategy to capture Gastown, an oil refinery that supplies the Citadel with gasoline. At peace negotiations, Joe recognizes Dementus's authority over Gastown and increases its supplies of food and water in exchange for the Horde's physician and Furiosa, who has tattooed a star chart to the Green Place on her left arm to find her way home. Afterward, Joe imprisons Furiosa with his stable of \"wives\" inside a vault. After Joe's son, Rictus, shows an attraction toward her, Furiosa devises a plan to escape. One night, Rictus breaks Furiosa out of Joe's vault to rape her, but she slips from his grasp using a wig made from her own hair and disappears.Disguised as a mute teenage boy, Furiosa works her way up the ranks of Joe's men for over a decade. She helps build the \"War Rig\", a heavily armed supply tanker that can withstand raider attacks in the lawless Wasteland. She plans to escape by hiding on the Rig when Joe sends his top driver, Praetorian Jack, on a supply run. Disillusioned by Dementus's callousness, his lieutenant, The Octoboss, goes rogue and launches an air assault on the Rig. His Mortiflyers slaughter the Rig's entire crew and destroy Furiosa's hidden motorcycle, but Furiosa and Jack team up to defeat them. Furiosa tries to carjack the Rig and drive home, but Jack easily thwarts her. However, he recognizes her potential and offers to train her to escape if she helps him rebuild his crew; Furiosa becomes Jack's second-in-command and is promoted to Praetorian. She and Jack bond, and resolve to escape together. They see an opportunity when Joe decides to attack Gastown, which Dementus has mismanaged to near-ruin. Joe orders Furiosa and Jack to collect weapons and ammunition from the Bullet Farm, an allied mining facility.However, Dementus ambushes them when they arrive. Furiosa and Jack barely escape, and Furiosa's left arm is injured. Dementus chases them down and tortures Jack to death. Furiosa escapes her chains by severing her own injured arm, sacrificing her star map to escape. A lone man watches from afar as Furiosa struggles back to the Citadel, where she and Joe's aide, The People Eater, form a strategy. Dementus is lured into a trap and the War Boys crush the Horde in a 40-day war. Having lost her path home, Furiosa shaves her head again, replaces her arm with a mechanical prosthetic, and pursues the fleeing Dementus.After an extended chase, Furiosa subdues Dementus in the desert. Furiosa imprisons Dementus at the Citadel and uses his living body as fertilizer to grow a peach tree from her mother's seed. Joe promotes Furiosa to \"Imperator\" and gives her command of a new War Rig. She meets Joe's five breeder wives in the vault where Joe once held her prisoner. The night before another supply run, the \"Five Wives\" hide in Furiosa's Rig."
}