{
	"title": "300: Rise of an Empire",
	"release_year": "2014",
	"runtime": "102",
	"tags": [
		"Action",
		"Drama",
		"amazon"
	],
	"rating": 6.2,
	"actors": [
		"Sullivan Stapleton",
		"Eva Green",
		"Lena Headey",
		"Hans Matheson",
		"Callan Mulvey",
		"David Wenham",
		"Rodrigo Santoro",
		"Jack O'Connell",
		"Andrew Tiernan",
		"Igal Naor"
	],
	"staff": [
		"Noam Murro",
		"Zack Snyder",
		"Kurt Johnstad",
		"Frank Miller",
		"Mark Canton",
		"Bernie Goldmann",
		"Gianni Nunnari",
		"Deborah Snyder",
		"Tom Holkenborg",
		"Simon Duggan",
		"David Brenner",
		"Wyatt Smith",
		"Lucy Bevan",
		"J. McAlary",
		"Patrick Tatopoulos"
	],
	"votes": 318855,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTEwNTU2MjAwMDdeQTJeQWpwZ15BbWU3MDk2Njc2Njk@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Queen Gorgo (Lena Heady) (wife of Leonidas) of Sparta tells her men about the Battle of Marathon, in which King Darius I of Persia was killed by General Themistocles (Sullivan Stapleton) of Athens. Darius was annoyed by the notion of Greek freedom and attacked Marathon 10 years ago to bring them to heel. This was the beginning of Greece's war with Persia.\nThe Persians outnumber the Greeks 3 to 1. Themistocles mounted a shock attack before Persians could set up camp and rest their shaky knees after a month at sea. Themistocles saw Darius across the sea and shot an arrow at him that pierced his heart.\nDarius' son, Xerxes (Rodrigo Santoro), witnesses his father's death, and is advised to not continue the war, since \"only the gods could defeat the Greeks\". Themistocles knew that he had killed the wrong Persian and that his mistake would haunt Greece forever.While dying Darius tells Xerxes not to repeat his mistake and to leave the Greeks to their ways, as only the Gods can defeat them.\nDarius' finest naval commander, Artemisia (Eva Green), claims that Darius' last words were in fact a challenge and sends Xerxes on a journey through the desert. Xerxes finally reaches a hermit's cave and bathes in an otherworldly liquid, emerging as the \"God-King\". Artemisia assassinates all of Xerxes's allies in the palace.\nXerxes returns to Persia and declares war on Greece.As Xerxes' forces advance towards Thermopylae, Themistocles meets with the council and convinces them to provide him with a fleet to engage the Persians at sea. Themistocles then travels to Sparta to ask King Leonidas for help but is informed by Dilios (David Wenham) that Leonidas (Gerard Butler) is consulting the Oracle, and Gorgo is reluctant to side with Athens, as the dream of a united Greece is not shared by Spartans.\nXerxes heads the land invasion, while Artemisia is in charge of the sea invasion of Greece.Themistocles later reunites with his old friend Scyllas (Callan Mulvey), who infiltrated the Persian troops and learned Artemisia was born Greek, but defected to Persia as her family was sexually assaulted and murdered by Greek Hoplites and she was taken as a sex slave to the Greeks (she served for years in the bowels of a Greek slave ship), who left her for dead in the streets. She was rescued and adopted by the Persians. Her lust for vengeance gained the attention of King Darius and he made her a naval commander after she killed many of his enemies.Themistocles decides to engage the main Persian fleet at sea, while Leonidas engages with Xerxes at the hot gates.\nThemistocles leads his men, which include Scyllas, Scyllas' son Calisto (Jack O'Connell) and Themistocles' right-hand man Aesyklos to the Aegean Sea. They ram their ships into the Persian ships (as the Persian ships are strong at the front, but weak in the middle), charge them, slaughtering several soldiers before retreating from the sinking Persian ships. The following day, the Greeks feign a retreat and lead a group of Persian ships into a crevice, where they become stuck. The Greeks charge the Persian ships from the cliffs above and kill more Persians.\nImpressed with Themistocles' skills, Artemisia brings him onto her ship. Artemisia tells Themistocles that she outnumbers Greeks by 100 to 1 and can sustain her losses for weeks and months. She tells Themistocles that his resistance will only delay the inevitable.\nShe attempts to use sex to seduce him to join the Persians as her second-in-command. He refuses, causing her to push him aside and swear revenge.The Persians spill tar into the sea and send suicide bombers to swim to and board the Greek ships with their flame bombs. Artemisia and her men fire flaming arrows and torches to ignite the tar, but Themistocles manages to kill one of the soldiers, who falls into the tar carrying a torch, causing ships from both sides to explode. Themistocles is thrown into the sea by an explosion and nearly drowns before being rescued by Calisto and stands by Scyllas' side as he succumbs to his injuries. Believing Themistocles to be dead, Artemisia and her forces withdraw. Greek naval forces suffered a crippling blow and were in no position to mount a counterattack. Themistocles needs more ships to fight the Persians.Themistocles learns that Leonidas and the 300 have been killed by Xerxes and returns to Athens to confront Ephialtes (Andrew Tiernan), the deformed Spartan traitor, who reveals that Xerxes plans to attack Athens, and is regretful of his actions, welcoming death. Themistocles spares him instead, so he can warn Xerxes that the Greek forces are gathering at Salamis, and then visits Gorgo in Sparta while she is mourning Leonidas to ask for her help, but she is too overcome with grief. Before leaving, Themistocles returns Leonidas' sword, which he took from Ephialtes, who had earlier stolen it, and urges Gorgo to avenge Leonidas.In Athens, Xerxes' army is laying waste when Ephialtes arrives to deliver Themistocles' message. Upon learning he is alive, Artemisia leaves to ready her troops for battle, against Xerxes' wishes. The Greek ships crash into the Persians ships, and the two armies battle, beginning the decisive Battle of Salamis. Themistocles and Artemisia fight, which ends in a stalemate with both receiving injuries.Gorgo had been narrating the tale to her Spartan army and leads them to assist in the battle alongside other allied Greeks, outnumbering the Persians. Themistocles urges Artemisia to surrender, but she tries to kill him and is stabbed through the stomach. With her dying breath, she sees Xerxes turning his back on her as he retreats. Themistocles and Gorgo take a moment to silently acknowledge one another's alliance as the rest of Artemisia's army charges with Dilios beginning to attack them. The three then charge at the opposing Persians with the rest of the Spartans behind them.",
	"links": [
		"https://www.amazon.com/300-Rise-Empire-Sullivan-Stapleton/dp/B00L8OBCQS"
	]
}