{
	"title": "Jack Ryan: Shadow Recruit",
	"release_year": "2014",
	"runtime": "105",
	"tags": [
		"Action",
		"Drama",
		"Thriller",
		"max"
	],
	"rating": 6.2,
	"actors": [
		"Chris Pine",
		"Kevin Costner",
		"Keira Knightley",
		"Kenneth Branagh",
		"Lenn Kudrjawizki",
		"Alec Utgoff",
		"Peter Andersson",
		"Elena Velikanova",
		"Nonso Anozie",
		"Seth Ayott"
	],
	"staff": [
		"Kenneth Branagh",
		"Adam Cozad",
		"David Koepp",
		"Tom Clancy",
		"David Barron",
		"Lorenzo di Bonaventura",
		"Mace Neufeld",
		"Mark Vahradian",
		"Patrick Doyle",
		"Haris Zambarloukos",
		"Martin Walsh",
		"Deborah Aquila",
		"Elaine Grainger",
		"Lucinda Syson",
		"Tricia Wood",
		"Andrew Laws"
	],
	"links": [
		"https://www.max.com/movies/jack-ryan-shadow-recruit/61b36446-437e-437f-bfd1-326d4aafbe81"
	],
	"votes": 139083,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTY2MDkxNzYwNl5BMl5BanBnXkFtZTgwOTM2MjE5MDE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "After the events of 9/11, Jack Ryan (Chris Pine), studying at the London School of Economics, becomes a Marine second lieutenant. Within 18 months he is posted in Afghanistan, despite being educated and qualified for a desk job at an HQ back home. Ryan is an expert in pattern recognition, but the army is unable to give much importance to his analysis. Ryan is critically injured when his helicopter is shot down by a SAM. Ryan saved 2 fellow soldiers from the crash despite having a broken back.\nRyan is evacuated to a field hospital and from there air-lifted to Kandahar. He has 2 crushed vertebrae and has 90 minutes window for corrective surgery if he wants to walk again.During a lengthy rehab at the Walter Reed hospital back in the states, he attracts the attention of Dr. Cathy Muller (Keira Knightley), a physician, and Thomas Harper (Kevin Costner), an official with the CIA.\nHarper approaches Ryan and offers him a job at the financial intelligence unit of the CIA, that looks into all aspects of terror funding. Harper wants Ryan to complete his PhD and then work for a series of private bank, undercover, to uncover terrorist funding sources. His employers or his loved would not know what he really does for a living.Ten years later, Ryan is working on Wall Street with a cover job as a compliance officer at a stock brokerage, and as a covert CIA analyst, looking for suspect financial transactions that would indicate terrorist activity.When the Russian Federation loses a key vote before the United Nations, Ryan notices that the markets do not respond in the expected way. The UN vote was on a new proposed Turkish oil pipeline that will end soviet dominance on energy supplies in the Eastern bloc.\nRussia is opposed to the pipeline as oil would fall below $79 / barrel & signal the bankruptcy of Russia. US votes in favor of the pipeline & Russia considers it as an act of economic warfare.\nThe US dollar was supposed to weaken after the vote, but instead, it unexpectedly holds its value.Ryan passes his report on to Harper, via a courier in a movie theatre. Muller finds the ticket stub in Ryan's trousers and believes that he is cheating on her.Ryan discovers that trillions of dollars held by Russian organizations have disappeared. A large number of these funds are controlled by Viktor Cherevin (Kenneth Branagh), a Russian tycoon.\nRyan's employer happens to do business with Cherevin, so when Ryan discovers certain accounts are inaccessible to him as auditor, he has reason to visit Moscow and investigate the Cherevin accounts himself. Muller wants to go with him, but he refuses, strengthening her doubts about his infidelity.On arrival he narrowly survives a murder attempt by an assassin Embee Deng (Nonso Anozie) posing as his bodyguard. Embee takes Ryan to his hotel and attacks him in his room, but Ryan manages to thwart the attack and kills Embee instead.\nRyan sends out an SOS and is surprised to learn that his backup is Harper. During their debrief, Ryan explains how Cherevin's shadow investments can make the United States vulnerable.\nMeanwhile, Muller is travelling to Paris and asks Ryan to meet her there on his way back. Ryan is so distracted by the recent events in Moscow, and he sounds very unenthusiastic. Ryan says that he might be able to come to Paris at all.Cherevin has invested huge amounts in the US dollar and is artificially propping the currency up. He is setting the stage for a massive fall, with A staged terrorist attack that would spook and weaken global markets including U.S. debt obligations.\nCherevin would then dump all his US currency inventory onto the market at once, causing the American dollar to collapse. Chinese assets would also suffer due to the country's dollar holdings, which in turn would trigger a new Great Depression. The Russians would recover due to the access to raw materials, but others won't. There will be breadlines and rioting in the US.At his frosty meeting with Cherevin the next day, he is told that the problem company and all of its assets have been sold, thus stopping Ryan's audit. Ryan manages to convince Cherevin to have dinner with him at a restaurant across the street from his office. Ryan tells Harper that they need the algorithm that Cherevin is using to dump his US holdings into the market. He says that if he can get hold of Cherevin's access card, he can break into his office, and steal the files.\nMeanwhile, Ryan's fiance Muller, concerned he may be having an affair, secretly flies to Moscow to meet him. Against protocol for unmarried couples, Ryan reveals that he works for the CIA, to her great relief.\nImprovising on the situation, Harper has Muller agree to be included in a plan to infiltrate Cherevin's offices. Ryan and Muller meet Cherevin at an upscale restaurant across the street from Cherevin's office. Over dinner, Ryan causes a scene and purposely insults Muller. A CIA operative \"runs into\" Cherevin and steals his wallet, which has the access card and gives it to Ryan, when Cherevin escorts Muller to the bathroom.Excusing himself, he gains access to Cherevin's office where he downloads critical files, which once executed will dump all of Cherevin's holdings in US dollars into the market. After the transfer is over, another CIA operative bumps into Cherevin and puts the wallet with his access card back into his coat.\nThe CIA analyze the algorithm and determine that the sell order is set to execute the following day, 9:06 am Eastern Time. $2 Trillion will be dumped. The currency plot will not be successful without the terrorist attack. Both have to be coordinate perfectly. Which means a terrorist attack is set to take place in the US at around 9 am.\nCherevin, alerted to Ryan's infiltration, abducts Muller. Ryan had put an engagement ring on Muller and is able to follow. Ryan stops Cherevin's car and rescues Muller, but Cherevin maintains that Ryan cannot stop his plan.\nMuller, Ryan and the CIA team return to the US.Ryan and the CIA discover Cherevin used a falsified death certificate to place his son, Aleksandr (Alec Utgoff), in the United States as a sleeper agent. Ryan uses his talent for pattern recognition in transaction data to locate Aleksandr's hideout and intended target, Wall Street. He locates a bomb hidden in an improvised police response vehicle (which had a frayed paint job) and gives chase. Aleksandr plan is to drive the van underneath wall street and trigger the blast, which would bring down 6-7 buildings simultaneously.\nUnable to defuse it, he hijacks the vehicle at 9:04 am and crashes it into the East River, killing Aleksandr and preventing the loss of any innocent life.Ryan and Muller are reunited and discuss their future together. Muller decides to stay with him despite his career and the risks he has to take. Cherevin is executed by his co-conspirators in Russia, while Ryan, now married, and Harper are called to the White House to brief the president."
}