{
	"title": "RoboCop",
	"release_year": "2014",
	"runtime": "117",
	"tags": [
		"Action",
		"Crime",
		"Sci-Fi",
		"max"
	],
	"rating": 6.1,
	"actors": [
		"Joel Kinnaman",
		"Joel Kinnaman",
		"Gary Oldman",
		"Michael Keaton",
		"Abbie Cornish",
		"Jackie Earle Haley",
		"Michael Kenneth Williams",
		"Jennifer Ehle",
		"Jay Baruchel",
		"Marianne Jean-Baptiste",
		"Samuel L. Jackson"
	],
	"staff": [
		"José Padilha",
		"Joshua Zetumer",
		"Edward Neumeier",
		"Michael Miner",
		"Marc Abraham",
		"Eric Newman",
		"Pedro Bromfman",
		"Lula Carvalho",
		"Peter McNulty",
		"Daniel Rezende",
		"Francine Maisler",
		"Martin Whist"
	],
	"links": [
		"https://www.max.com/movies/robocop/8ccfb7ce-b6c6-4601-bda8-d4810ed26395"
	],
	"votes": 241364,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjAyOTUzMTcxN15BMl5BanBnXkFtZTgwMjkyOTc1MDE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In the year 2028, multinational conglomerate OmniCorp is at the center of military \"robot soldier\" technology, supplying the US Military with mechanical men that are deployed overseas. OmniCorp wants to sell their products for use in civilian law enforcement in the United States but is suppressed by public opinion, as embodied by the Dreyfus Act. In an attempt to sway tepid public opinion by way of the combination of man and machine, OmniCorp CEO Raymond Sellars (Michael Keaton) tasks his marketing team, in conjunction with scientist Dr. Dennett Norton (Gary Oldman), with the creation of this new law enforcement product. They begin the search for a permanently injured policeman to act as the core of their prototype.Police detective Alex Murphy (Joel Kinnaman) and his partner, Jack Lewis (Michael K. Williams), attempt to arrest crime boss Antoine Vallon (Patrick Garrow), unaware that he has contacts inside the DPD. When Vallon is found he is tipped off by his dirty cops and a gun fight ensues hospitalizing Lewis. As retaliation, the two said dirty cops nearly kill Alex with a car bomb, Norton chooses Alex for the RoboCop program and, with consent from Alex's wife, Clara (Abbie Cornish), has him outfitted with the cybernetic body and software.Alex at first rejects his current condition upon seeing mostly lungs, heart, exposed throat and brain when the armor and Cybernetic components are removed but is convinced by Norton to be strong for his wife and son. Rick Mattox (Jackie Earle Haley), OmniCorp's military tactician, is skeptical of Alex's abilities, saying he will never be as efficient as a fully mechanical robot. Alex proves this true by operating at a slower rate than the drone counterparts due to his natural hesitation when making judgments in the field. In order to improve performance, Norton tampers with his brain, making him believe that his tactical decisions are his own when he is actually executing programs.While preparing for a public press conference to unveil RoboCop, Alex is emotionally overwhelmed and has a seizure while Norton is uploading the police database (including video of his near death) information into his brain. Pressed for time, Norton alters Alex's brain chemistry, lowering his Dopamine levels until he no longer displays any emotions. Under control, Alex attends the press conference, where he ignores his waiting wife and son, and efficiently apprehends a criminal in the crowd. RoboCop is a public-relations success, and drastically reduces the crime rate in Detroit. Public opinion on the Dreyfus Act begins to turn. Norton is told to prevent Alex from seeing his wife and son.Clara manages to confront her husband as he is leaving the station, telling him about his son, David (John Paul Ruttan), having nightmares. Alex leaves, but then overrides his programming and detours from his current case to go to his house. He reviews the CCTV video of his accident and realizes that David saw his body and was traumatized. While watching the CCTV footage Alex overrides the programming in his brain and miraculously raises his Dopamine levels back to normal, reviving his lost emotions towards his family.Alex pursues Vallon for revenge. When Alex arrives at his hideout, Vallon nearly succeeds in killing him but is fatally shot by Alex. At the station Alex kills one of the corrupt cops and arrests (by stun) the other. When Alex is about to arrest the Chief of Police, who was one of Vallon's contacts, Mattox shuts him down by remote control and has him taken back to OmniCorp.Sellars decides to spin this turn of events to his advantage, via television presenter Pat Novak (Samuel L. Jackson), who thanks RoboCop for revealing the fallibility of the police and points out that drones are incorruptible. A repeal of the Dreyfus Act goes underway, with votes overwhelmingly in support of the repeal. Clara goes to the press and angrily demands to see her husband. Sellars, seeing Alex is no longer useful and fearing that the truth of what has been done to him will be exposed, orders Mattox to kill him. Norton reaches the lab first and revives Alex, telling him everything. Alex, feeling betrayed, goes after Sellars.Sellars has the OmniCorp building shut down and armed with drones. Alex gains entry with the help of his former partner Lewis and other police officers. Mattox then reveals an old tactic he had hidden in Alex's programming known as 'Red Assets' which renders hostile acts and apprehension impossible against those identified as such. Lewis appears and shoots Mattox while Alex proceeds to the roof, where Sellars is waiting for a helicopter and has Clara and David as unwitting hostages. Alex's programming prevents him from arresting Sellars as he is also wearing a Red Asset wrist band, but he manages to overcome it with his own will and shoots, killing him.OmniCorp's parent company, OCP, decides to review the drone and RoboCop program. Alex's body is rebuilt in Norton's laboratory, and then he waits for Clara and David, who are coming to visit him. The President vetoes the repeal of the Dreyfus Act based on the testimony of Norton, who confesses everything they had done in the RoboCop program. Pat Novak is outraged by this turn of events, and the film ends with him revealing his true alliance (to his TV show's unseen fourth wall audience) and cursing loudly on live TV, much to the shock of his crew."
}