{
	"title": "Ghost in the Shell",
	"release_year": "2017",
	"runtime": "107",
	"tags": [
		"Action",
		"Crime",
		"Drama",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Scarlett Johansson",
		"Pilou Asbæk",
		"Takeshi Kitano",
		"Juliette Binoche",
		"Michael Pitt",
		"Chin Han",
		"Danusia Samal",
		"Lasarus Ratuere",
		"Yutaka Izumihara",
		"Tawanda Manyimo"
	],
	"staff": [
		"Rupert Sanders",
		"Shirow Masamune",
		"Jamie Moss",
		"William Wheeler",
		"Ehren Kruger",
		"Ari Arad",
		"Avi Arad",
		"Michael Costigan",
		"Steven Paul",
		"Lorne Balfe",
		"Clint Mansell",
		"Jess Hall",
		"Billy Rich",
		"Neil Smith",
		"Lucy Bevan",
		"Liz Mullane",
		"Jan Roelfs"
	],
	"votes": 230035,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzQ0NDcwMDA4Ml5BMl5BanBnXkFtZTgwNDg4OTg1MDI@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In the near future, the vast majority of humans are augmented with cybernetics, enhancing various traits like vision, strength, and intelligence. Hanka Robotics, the world's leading developer of augmentative technology, establishes a secret project to develop a mechanical body, or \"shell\", that can integrate a human brain rather than an AI. Mira Killian (Scarlett Johansson), a young woman who is the sole survivor of the cyber-terrorist attack which killed her parents, is chosen as the test subject after her body is apparently damaged beyond repair. Over the objections of her designer, Dr. Ouelet (Juliette Binoche), Hanka CEO Cutter decides to use Killian as a counter-terrorism operative.A year later, Killian has attained the rank of Major in the anti-terrorist bureau Section 9, working alongside operatives Batou (Pilou Asbæk) and Togusa (Chin Han) under Chief Daisuke Aramaki (\"Beat\" Takeshi Kitano). The team successfully thwarts a terrorist attack on a Hanka business conference, and Killian destroys a rogue mechanical geisha after it murders a hostage.Killian, who has been experiencing hallucinations that Ouelet dismisses as glitches, is becoming increasingly bothered by how little she remembers about her past. After learning that the geisha was hacked by an unknown entity, known only as Kuze (Michael Carmen Pitt), Killian breaks protocol and \"dives\" into its AI for answers.\nThe entity attempts a counter-hack, and Batou is forced to disconnect her. Using the information, she was able to gather, the two trace the hacker to a Yakuza nightclub, where they are lured into a trap. The resulting explosion destroys Batou's eyes, and leaves Killian's body severely damaged. Cutter (Peter Ferdinando) is enraged by Killian's actions and threatens to have Section 9 shut down unless Aramaki keeps her in line.Kuze tracks down Section 9's Hanka consultant, Dr. Dahlin (Anamaria Marinca), and kills her. The team links her murder to the deaths of other senior company researchers and realize that Dr. Ouelet is the next target. Kuze takes control of two sanitation workers and sends them to kill Ouelet. Batou, now with cybernetic eyes, kills one of them while the repaired Killian subdues the other. During interrogation, Kuze briefly speaks through the surviving worker before compelling him to commit suicide. Togusa traces the hack to a secret location, where the team discovers a large number of humans mentally linked together as a makeshift signal network. Killian is captured, and Kuze reveals that he is a failed Hanka test subject from the same project that created Killian, otherwise known as 2571. He urges her to question her own memories before freeing her and escaping.Killian confronts Ouelet, who admits there were 98 test subjects before Killian, but she was the only one to survive the process and that her memories are fake implanted ones. Cutter has decided that Killian is too much of a liability, and orders Ouelet to euthanize her after she returns to Hanka Robotics. Instead, Ouelet gives Killian an address and helps her escape. Cutter kills Ouelet, but blames Killian, saying that she has gone rogue. He subsequently informs Aramaki and the team that Killian must be terminated by any means necessary.Killian follows the address to an apartment occupied by a widowed mother, who reveals that her daughter, Motoko Kusanagi (Scarlett Johansson), ran away from home a year ago and was arrested, before taking her own life while in custody. Unable to process her emotions, Killian leaves and contacts Aramaki, who intentionally allows Cutter to eavesdrop on their conversation. Batou, Togusa, and Aramaki each eliminate Cutter's men trying to ambush them, while Killian follows her memories to the hideaway where Motoko was last seen. There, she and Kuze meet, and recall their past lives as anti-augmentation radicals who were abducted by Hanka for use as test subjects.Cutter deploys a \"spider-tank\" to kill them, and Kuze nearly dies before Killian is able to tear off the tank's motor, losing her left arm in the process. Mortally wounded, Kuze offers to merge his \"ghost\" with Killian's before a Hanka sniper kills him. Batou and the team rescue Killian, while Aramaki executes Cutter with Killian's consent.\nThe next day, Killian, now repaired and embracing her true identity as Motoko, reconnects with her mother before returning to work with Section 9.",
	"links": [
		"https://www.amazon.com/Ghost-Shell-Scarlett-Johansson/dp/B06Y5S477B"
	]
}