{
	"title": "Kick-Ass",
	"release_year": "2010",
	"runtime": "117",
	"tags": [
		"Action",
		"Comedy",
		"Crime",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Aaron Taylor-Johnson",
		"Aaron Taylor-Johnson",
		"Nicolas Cage",
		"Nicolas Cage",
		"Chloë Grace Moretz",
		"Chloë Grace Moretz",
		"Garrett M. Brown",
		"Clark Duke",
		"Evan Peters",
		"Deborah Twiss",
		"Lyndsy Fonseca",
		"Sophie Wu",
		"Elizabeth McGovern"
	],
	"staff": [
		"Matthew Vaughn",
		"Jane Goldman",
		"Matthew Vaughn",
		"Mark Millar",
		"John Romita Jr.",
		"Adam Bohling",
		"Tarquin Pack",
		"Brad Pitt",
		"David Reid",
		"Marius De Vries",
		"Ilan Eshkeri",
		"Henry Jackman",
		"John Murphy",
		"Ben Davis",
		"Eddie Hamilton",
		"Jon Harris",
		"Pietro Scalia",
		"Sarah Finn",
		"Lucinda Syson",
		"Russell De Rozario"
	],
	"votes": 599631,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTMzNzEzMDYxM15BMl5BanBnXkFtZTcwMTc0NTMxMw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Living on Staten Island, New York, Dave Lizewski is a typical adolescent. Drawing inspiration from comic novels, Dave aspires to become a superhero in real life. He equips himself with batons and buys and alters a scuba diving gear. He is struck by a vehicle and stabbed on his first expedition. After he recovers, he has certain bones replaced with metal, which increases his toughness and ability to withstand pain. There is a notion that he is gay because he is not attending school. Consequently, Katie Deauxma, his lifelong obsession, makes an instant attempt to be his buddy. Despite his displeasure with the miscommunication, Dave is grateful for the chance to spend more time with Katie.After saving a guy from a gang attack, Dave resumes his career as a crime-fighter and becomes well-known. He creates a Myspace account and calls himself \"Kick-Ass\" so that people may reach him for assistance. He confronts Rasul, a drug dealer, who has been pestering Katie after she makes a request. Kick-Ass is swiftly overpowered by Rasul's thugs at his house. Hit-Girl and her father, Big Daddy, are two costumed vigilantes who step in before they can murder him. They quickly kill the thugs and take their money. After returning home, Dave decides to quit battling crime since he knows he is in over his head. But Big Daddy and Hit-Girl visit him and offer encouragement.Big Daddy is actually Damon Macready, a former law-abiding officer. He was imprisoned after being set up by Mafia leader Frank D'Amico. His daughter Mindy was left behind after his wife took her own life. Damon prepares himself and Mindy to exact revenge on Frank, despite Marcus Williams, his ex-partner, objecting. By breaking into Frank's warehouses, stealing his money, and damaging his medications, they have been sabotaging his business. Frank targets Kick-Ass because he thinks he is behind the attacks, but he accidentally kills a party performer who is costumed like Kick-Ass. Chris, Frank's son, offers an alternative strategy, adopts the persona of \"Red Mist,\" a new vigilante, and becomes friends with Kick-Ass.Chris intends to expose Kick-Ass by luring him inside Frank's lumber warehouse. But they discover Frank's men dead and the warehouse on fire. After retrieving a concealed camera he had previously installed in the warehouse, Red Mist discovers video footage of Big Daddy murdering the workers and setting the building on fire. Red Mist leaves with Kick-Ass. After seeing the video, Frank finds out about Big Daddy. After the incident, Dave makes the decision to stop becoming Kick-Ass. He clarifies the confusion over his sexual orientation by disclosing his identity to Katie. She becomes his lover after forgiving him. But Red Mist gets in touch with him once more and deceives him into disclosing where Big Daddy and Hit-Girl are.Frank's men apprehend Big Daddy and Kick-Ass after Red Mist shoots Hit-Girl out of a window at one of Big Daddy's safe homes. Despite Chris's objections to letting Kick-Ass go, Frank plans to use a live Internet broadcast to torture and kill his victims. Hit-Girl, who has survived the gunshot, assaults the hideaway and murders all of the gangsters while Kick-Ass and Big Daddy are being pummeled by Frank's thugs. One of the thugs burns Big Daddy alive during the altercation. Before Mindy passes away from his burns, he and Big Daddy say a heartfelt goodbye. Hit-Girl and Kick-Ass decide to finally beat Frank. Before running out of ammunition, Hit-Girl sneaks inside Frank's headquarters and murders a large number of guards and goons.Kick-Ass shows up on a jet pack armed with mini guns and murders the remaining gangsters when Hit-Girl is encircled by them. Frank and Red Mist are then faced by Kick-Ass and Hit-Girl. Red Mist and Kick-Ass battle it out, knocking each other out in the process. A worn-out Hit-Girl is overpowered by Frank. Kick-Ass regains consciousness and uses a bazooka to shoot Frank out of the window, killing him before he can murder her. Just as Kick-Ass and Hit Girl are about to take off on the jet pack, Red Mist regains consciousness, seizes his father's samurai sword, and follows Kick-Ass to finish their battle.Both Dave and Mindy leave their jobs battling crime; Mindy attends Dave's school and Marcus takes on the role of guardian once more. In the meantime, Chris, wearing a new suit, sits in his father's office, getting ready to get revenge on Kick-Ass for killing his father. \"As a great man once said, 'Wait will they get a load of me,'\" he adds, turning to face the camera, before pointing a revolver at the screen.",
	"links": [
		"https://www.amazon.com/Kick-Ass-Aaron-Johnson/dp/B003TOH8AE"
	]
}