{
	"title": "2 Guns",
	"release_year": "2013",
	"runtime": "109",
	"tags": [
		"Action",
		"Comedy",
		"Thriller",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Denzel Washington",
		"Mark Wahlberg",
		"Paula Patton",
		"Bill Paxton",
		"Edward James Olmos",
		"Robert John Burke",
		"James Marsden",
		"Greg Sproles",
		"Fred Ward",
		"Patrick Fischler"
	],
	"staff": [
		"Baltasar Kormákur",
		"Blake Masters",
		"Steven Grant",
		"Andrew Cosby",
		"Randall Emmett",
		"George Furla",
		"Norton Herrick",
		"Clinton Shorter",
		"Oliver Wood",
		"Michael Tronick",
		"Sheila Jaffe",
		"Beth Mickle"
	],
	"votes": 227789,
	"cover": "https://m.media-amazon.com/images/M/MV5BNTQ5MTgzNDg4OF5BMl5BanBnXkFtZTcwMjAyODEzOQ@@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "Criminals Robert Trench (Denzel Washington) and Michael Stigman (Mark Wahlberg) are questioned by U.S. Customs after a meeting with drug lord Papi Greco (Edward James Olmos) in Mexico. Unknown to Stigman, Trench is an undercover DEA agent and reports to his superior, Jessup (Robert John Burke), that he failed to acquire cocaine from Greco that they could use as evidence to convict him. Against Jessup's orders, Trench decides to remain undercover and assist Stigman in robbing $3 million from Greco, so they can prosecute Greco for money laundering. Trench later meets with his lover, Deb Rees (Paula Patton), who is involved with another man as well, while Stigman, an undercover Naval Intelligence Officer, meets with his commanding officer, Harold Quince (James Marsden), who instructs Stigman to kill Trench so the Navy can use the stolen money to fund covert operations.Trench and Stigman are surprised to find $43 million (rather than $3 million) in the vault. After the heist, Stigman follows orders to betray Trench and escape with the money. He suspects Trench is a cop and shoots to wound instead of to kill. Learning of this, Quince attempts to have Stigman killed. Stigman escapes after learning the money will be transferred to a Navy base in Corpus Christi. Meanwhile, a man named Earl (Bill Paxton) aggressively interrogates the bank manager about the money Trench and Stigman stole from him.Trench visits Jessup to tell him what happened, but Earl and his men are there waiting for him. Earl kills Jessup, frames Trench for the murder and lets him go, making a deal that if Trench returns the $43 million, he will be cleared. Trench goes to Stigman's apartment to find out where he took the money, only to have Stigman contact him from a sniper's post across the street. Trench figures out that Stigman is with the military & no longer has the money with him.After escaping a hit squad sent by Quince, Trench and Stigman kidnap Greco and interrogate him in the garage at Deb's house, where they find out Earl, Greco's associate, is a black ops operative, and that Trench and Stigman had been tricked into stealing money from the CIA. Greco also reveals that all the drug cartels were paying protection money to the CIA in exchange for the CIA transferring their drugs from across the border into USA.The garage is attacked by another hit squad, led by Quince. Trench gets suspicious as to how Quince was able to trace Trech and Stigman to Deb's house in the first place. The trio ends up being captured by Greco and taken to his farm in Mexico. After torturing them and receiving a visit from Earl, Greco gives the pair 24 hours to steal the money from the Navy and return it to him, or Deb will die.\nStigman & Trench attack the Naval base at Corpus Christi as that's where Stigman thought that Quince had mentioned he was taking the money.At the base, Trench infiltrates Quince's office, only to discover Quince is Deb's boyfriend, and they had planned to steal the money for themselves. Meanwhile, Stigman asks Admiral Tuway (Fred Ward) for help. Tuway orders Quince's arrest but disavows Stigman to prevent the scandal from tarnishing the Navy's reputation. Quince evades arrest, as does Stigman. Unable to find the money, Trench is too late to prevent Greco from killing Deb. He later realizes that the money is in a motel room that he and Deb frequented and goes to help Stigman, who had returned to Greco's farm alone.There, Stigman is surrounded by Greco's men until both Quince and Earl intervene. Trench arrives in a car filled with money, and then blows up the car, scattering the money everywhere, which leads to a massive shootout. During a standoff among Quince, Earl, Trench, and Stigman, Earl reveals that the CIA has 20 other secret banks, and the loss of the $43 million is only a minor setback. Signaling Stigman with a phrase from an earlier conversation, Stigman shoots Earl, and Trench shoots Quince. Trench and Stigman kill Greco and the duo escapes, but not before Trench shoots Stigman in the leg as payback for shooting him in the desert. While planning to continue to take down the CIA's secret banks and sabotage their black ops operations, Trench reveals to Stigman that he did not blow up all the money and had some stashed away.",
	"links": [
		"https://www.amazon.com/2-Guns-Denzel-Washington/dp/B00FNJ96SU"
	]
}