{
	"title": "Rambo: Last Blood",
	"release_year": "2019",
	"runtime": "89",
	"tags": [
		"Action",
		"Crime",
		"Thriller",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Sylvester Stallone",
		"Paz Vega",
		"Sergio Peris-Mencheta",
		"Adriana Barraza",
		"Yvette Monreal",
		"Genie Kim",
		"Joaquín Cosio",
		"Pascacio López",
		"Óscar Jaenada",
		"Alexander Dimitrov"
	],
	"staff": [
		"Adrian Grunberg",
		"Matthew Cirulnick",
		"Sylvester Stallone",
		"Dan Gordon",
		"David Morrell",
		"Avi Lerner",
		"Yariv Lerner",
		"Kevin King Templeton",
		"Les Weldon",
		"Brian Tyler",
		"Brendan Galvin",
		"Carsten Kurpanek",
		"Todd E. Miller",
		"Carla Hool",
		"Franco-Giacomo Carbone"
	],
	"votes": 111588,
	"cover": "https://m.media-amazon.com/images/M/MV5BMWM5NzVlNzMtMDNhNy00OGMxLTlmYTktOGIwMzRlZmE0ZWVmXkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Eleven years after the events in Burma, Vietnam War veteran John Rambo (Sylvester Stallone) lives in Bowie, Arizona in his deceased father's horse ranch, which he manages with his old friend, Maria Beltran (Adriana Barraza), and her granddaughter, Gabriela (Yvette Monreal). Rambo now breeds and trains horses and leads a peaceful life. Rambo cares about Gabriela. Rambo maintains an underground network of tunnels under the ranch and still has nightmares about his time in Vietnam. Gabriela is looking forward to attending college.Gabriela reveals to Rambo that a friend of hers, Gizelle (Fenessa Pineda), has found Gabriela's biological father, Miguel (Rick Zingale), in Mexico. Against Rambo and Maria's wishes, Gabriela secretly drives to Mexico to ask why Miguel had abandoned Gabriela and her mother years ago. Rambo had argued that men like her father don't change, and only get worse over time. He asks her to wait for answers. Even Maria says that Gizelle is a bad girl, but Gabriela won't listen. But Gabriela is clear that she wants to meet her father. Gizelle leads Gabriela to Miguel's apartment, where he reveals to her that he never really cared for Gabriela or her mother.Gizelle takes a heartbroken Gabriela to a local club, where Gabriela is drugged and kidnapped by the enforcers of a Mexican cartel. Meanwhile, Maria informs Rambo of Gabriela's disappearance to Mexico. Rambo travels to Mexico and interrogates both Miguel and Gizelle about Gabriela's whereabouts. Rambo knows that Gizelle sold Gabriela out when he sees Gabriela's mother's bracelet on Gizelle's wrist.\nRambo is reluctantly led by Gizelle to the club where Gabriela was last seen and confronts El Flaco (Pascacio López), the man who last spoke with Gabriela. A mysterious woman, Carmen Delgado (Paz Vega), tails Rambo as El Flaco leads him to Gabriela's location. Rambo is immediately confronted, beaten, and marked by the cartel, led by brothers Hugo (Sergio Peris-Mencheta) and Victor Martinez (Óscar Jaenada). They take his driver's license, revealing the ranch's location, and a photo of Gabriela, whom Victor recognizes. The cartel vows to mistreat Gabriela further due to Rambo's actions. They put a deep gash on Rambo's face and leave him to die.\nVictor and Hugo start giving heavy drugs to Gabriela as punishment for Rambo's involvement.Carmen takes Rambo back to her home where she cares for him until he fully recovers. Carmen reveals herself to be an independent journalist who has been investigating the Martinez brothers, the kidnappers and murderers of her sister. Rambo later raids one of the brothels, killing several men until he finds a drugged Gabriela. On the way back home, Rambo thanks Gabriela for giving him hope for ten years before she dies from the forced overdose. Enraged, Rambo sends Maria away and rigs the ranch with traps for a confrontation, and later returns to Mexico to ask Carmen's help in finding Victor. Carmen initially refuses, believing that it will solve nothing, but is convinced after Rambo appeals to her grief and frustrations.Rambo raids Victor's home, killing several guards and decapitating Victor. In retaliation, Hugo leads a group of hit-men to Rambo's ranch, where each falls victim to the rigged traps. Saving Hugo for the last, Rambo mutilates him and rips his heart out. In the aftermath, a weakened Rambo sits on the porch of his father's house, vowing to continue fighting and to keep the memories of his loved ones alive. During the credits, Rambo saddles up his horse and rides off into the sunset.",
	"links": [
		"https://www.amazon.com/Rambo-Last-Blood-Extended-Cut/dp/B086H2WZ4S"
	]
}