{
	"title": "The Lost City of Z",
	"release_year": "2016",
	"runtime": "141",
	"tags": [
		"Adventure",
		"Biography",
		"Drama",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Charlie Hunnam",
		"Robert Pattinson",
		"Sienna Miller",
		"Tom Holland",
		"Edward Ashley",
		"Angus Macfadyen",
		"Ian McDiarmid",
		"Clive Francis",
		"Pedro Coello",
		"Matthew Sunderland"
	],
	"staff": [
		"James Gray",
		"James Gray",
		"David Grann",
		"Dede Gardner",
		"James Gray",
		"Dale Armin Johnson",
		"Anthony Katagas",
		"Christopher Spelman",
		"Darius Khondji",
		"John Axelrad",
		"Lee Haugen",
		"Kate Ringsell",
		"Jean-Vincent Puzos"
	],
	"votes": 100633,
	"cover": "https://m.media-amazon.com/images/M/MV5BZmU2ODIyMWItMjU3Zi00ZmVhLWIyNDAtMWE5OWU2ZDExMGFiXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In Cork, Ireland in 1905, Percy Fawcett (Charlie Hunnam) is a young British officer participating in a stag hunt on an Irish baronial estate for the benefit of the visiting Archduke Franz Ferdinand of Austria. A skilled horseman and marksman, he brings down the stag swiftly but is snubbed at the after-hunt party due to his \"humble\" ancestry. Despite his meritocratic credentials, Fawcett is not invited to the supper after the gala.\nFawcett is married to Nina and has a young son.A year later, Fawcett is sent to London to meet with officials of the Royal Geographical Society. Fawcett has had many overseas assignments and hence the RGS is interested in his profile. The governments of Bolivia and Brazil are nearly at war over the location of their mutual boundary. Directly affecting the region's extremely lucrative rubber trade, they have asked the British government to survey it as neither country will accept a map done by the other. Fawcett had done survey work in the British Empire previously and was hence chosen for the job.Fawcett agrees to lead the survey party to restore his family's good name and for the promise of soldierly decoration. Fawcett's father had dishonored himself with his addiction for alcohol and gambling. Fawcett would be gone for several years. Nina informs him that she is pregnant again.On the ship to Brazil, the SS Panama in Apr 1906, Fawcett meets Corporal Henry Costin (Robert Pattinson), who has knowledge of the Amazon rain-forest. Costin was assigned to Fawcett for the survey, but he was addicted to alcohol. Fawcett makes him give up drinking, and together they survey a diverse landscape from the jungles to the mountains of South America.At a large rubber plantation in the jungle owned by the Portuguese nobleman Baron De Gondoris (Franco Nero), the two meet Corporal Arthur Manley (Edward Ashley), who tells them that the British government advises against further exploration as the situation has become far too dangerous.\nGondoris agrees to help Fawcett as peace on the border means that his business would flourish.Fawcett takes several guides and the Amazonian scout Tadjui (who was gifted to Fawcett by Gondoris), to complete the mission in 2 more years. During their trek over the Amazon River, they come under attack from local tribes. Fawcett falls into the water during one of these attacks and is set upon by the piranha. Only quick thinking from Costin saves Fawcett's life.\nTadjui tells Fawcett stories about a city in the jungle covered in gold and full of people. Fawcett dismisses such stories as insane ravings but discovers highly advanced broken pottery and some small stone statues in the jungle that convince him Tadjui's story was true. Tadjui had said that no white man ever found the city.\nTadjui runs away as Fawcett continues his expedition along the Amazon River.Fawcett is praised after his return to England, where his wife, Nina (Sienna Miller), has given birth to their second son. In the Trinity College Library, Nina discovers a conquistador text which tells of a city deep in the Amazon jungle.\nFawcett meets the renowned biologist James Murray (Angus Macfadyen), who agrees to back Fawcett's expedition to the Amazon to find what Fawcett calls \"the Lost City of Z\". Murray is a portly man and insists that he travel along with the expedition for him to fund it.On Feb 6th, 1911, Fawcett attempts to convince the members of the RGS to back the expedition but is publicly ridiculed. RGS is not convinced that savage natives of the Amazon would have the capacity to have a civilization (one that predates the British civilization), that could produce complex outputs such as pottery. Fawcett calls it the bigotry of the Church that has conditioned men to condemn the Amazonians as barbaric and savages.Nevertheless, the RGS backs the expedition to further exploration of the Amazon basin. Nina insists that she should be part of the expedition as she was the one who found the document. Fawcett puts his foot down and says that Nina needs to stay at home for the sake of their kids.In May 1912, Fawcett is back in Amazonia. Murray is unused to the rigors of the deep jungle and slows the party down significantly. Fawcett earns that at the same time, an explorer found the lost city of Machu Pichu in the Andes mountains in Peru.\nThe Fawcett group is attacked while traveling along the river. However, Fawcett makes peace with the natives by singing to them. The tribe is of cannibals, but Fawcett wants to engage with the tribe chief to find the location of the lost city. But Fawcett sees that the tribe had cultivated the jungle and were growing crops.Murray did not agree with Fawcett and ventured off into the jungle alone. He suffers a severe knee injury which becomes infected, and he begins to go mad. On the river, Murray behaves very irresponsibly and causes the raft to lose supplies. Fawcett orders Murray to let go of the raft. Costin saves Murray and brings him to shore.Fawcett sends Murray off with a native guide and the group's last pack animal to find aid. Fawcett's team are forced to abandon the expedition after discovering that Murray poured paraffin on their remaining supplies rendering them useless. Murray did not want the expedition to go ahead without him.Murray survives and accuses Fawcett in front of the RGS trustees of abandoning him in the jungle. Fawcett elects to resign from the society rather than apologize. World War I break out in Europe, and Fawcett goes to France to fight. In the Battle of the Somme, Manley dies in the trenches, and Fawcett is temporarily blinded during a chlorine gas attack. Jack (Tom Holland), Fawcett's eldest son who had long accused Fawcett of abandoning the family, reconciles with his father in the hospital.In 1923, Fawcett is living in obscurity in England. American interest in exploring the Amazon has reached a fever pitch, primarily due to Fawcett's stories of the lost city. John D. Rockefeller Jr. and a consortium of American newspapers finance a new Fawcett expedition. The RGS co-funds the expedition at the last moment as a matter of British pride.Fawcett shows Sir John Scott Keltie (Clive Francis) a compass, informing Keltie that should the lost city be found by Fawcett, the compass will be sent back to England. Percy and Jack intend to go alone this time, traveling as light as they can for up to three years in order to find Z. Fawcett invites Costin along, but he declines. Percy and Jack are attacked by natives and escape only to run into an ambush by a second group of Amazonians.This second tribe give the Fawcetts a fair hearing, but are puzzled by them, noticing that their spirits aren't wholly of their own world but also not wholly of the Amazon. They declare that the spirits of the Fawcetts \"must belong\" somewhere and they will help them find it. Percy and Jack are drugged during a ceremony and carried away.Years later, Nina Fawcett meets with Keltie, now the head of the RGS, claiming she has heard that Percy and Jack are alive and living with tribes-people. The RGS, having sent more than a hundred people to search for Fawcett over the last several years, declines to send another expedition. Keltie advises Nina to come to terms with her husband's death, but she refuses. Nina instead shows Keltie a package, and on opening it, it contains the compass Fawcett had promised to send back if he found the city. As Nina leaves, her reflection in a mirror shows her walking out into what looks like the Amazonian jungle.",
	"links": [
		"https://www.amazon.com/Lost-City-Z-Charlie-Hunnam/dp/B08J98LNZ4"
	]
}