{
	"title": "Terminator Genisys",
	"release_year": "2015",
	"runtime": "126",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Arnold Schwarzenegger",
		"Jason Clarke",
		"Emilia Clarke",
		"Jai Courtney",
		"J.K. Simmons",
		"Dayo Okeniyi",
		"Matt Smith",
		"Courtney B. Vance",
		"Lee Byung-hun",
		"Lee Byung-hun",
		"Michael Gladis"
	],
	"staff": [
		"Alan Taylor",
		"Laeta Kalogridis",
		"Patrick Lussier",
		"James Cameron",
		"Gale Anne Hurd",
		"David Ellison",
		"Dana Goldberg",
		"Lorne Balfe",
		"Kramer Morgenthau",
		"Roger Barton",
		"Ronna Kress",
		"Neil Spisak"
	],
	"votes": 295449,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjM1NTc0NzE4OF5BMl5BanBnXkFtZTgwNDkyNjQ1NTE@._V1_QL75_UX190_CR0,8,190,281_.jpg",
	"description": "Skynet was a computer program designed to automate missile defense. It went online on Aug 29th, 1997. As it became self-aware, Skynet decided that all humanity was a threat to its existence. It launches nuclear strikes against all major human population centers and starts the war between machines and humans. 3 billion people died during the nuclear fire. The event was called Judgement Day.\nThe machines designed infiltration systems that could pass as humans. They were called the Terminators. John Connor became the leader of the resistance and taught humans how to fight back.In 2029, Human Resistance leader John Connor (Jason Clarke) launches a massive final offensive against Skynet. John says that the Skynet has hidden a secret weapon at this facility. He says that the Skynet will deploy this weapon when it fears that it is losing against the humans.\nBefore the Resistance wins the offensive, Skynet activates a time machine and sends back a T-800 Terminator to 1984 to kill John's mother, Sarah Connor (Emilia Clarke). John realizes that the secret weapon is a tactical time machine and Skynet just used it. John knows that Skynet has sent a Terminator back in time to 1984 to kill his mother.\nJohn's right-hand man, Kyle Reese (Jai Courtney), volunteers to travel back in time to protect her. As Kyle floats in the machine's magnetic field, he witnesses John being attacked by another Resistance soldier Alex (Matt Smith). Kyle then has visions from his childhood about events in 2017. The young Kyle repeats a message \"Genisys is Skynet. When Genisys comes online, Judgement Day begins. Go to San Franciso in 2017, and you kill Skynet before it is born\".Upon arrival in 1984, Skynet's T-800 is disabled by Sarah and the Guardian (Arnold Schwarzenegger) called Pops, a reprogrammed T-800 sent to protect her when she was nine years old. An unknown party (the identity files on whom have been erased in Pops, so Skynet cannot target the ones who sent Pops to protect Sarah) had sent Pops to 1973 to protect Sarah after her parents were killed by a T-1000 (Liquid metal, shape changer) sent by Skynet.\nKyle arrives a short time later and is immediately attacked by a T-1000 (Lee Byung-Hun). Sarah and the Guardian join Kyle, when he is pinned down by the T-1000 in a clothing retail store. Sarah and Pops lure the T-1000 out of the store and into their bunker, where they destroy the T-1000 using acid. The T-1000 reactivates the T-800, which is defeated by Kyle using the rail gun.\nSarah knows that she needs to mate with Kyle to give birth to John Connor. Kyle reveals to Sarah that after John sent him back, John himself was attacked by a Terminator.Sarah and the Guardian reveal they have constructed a makeshift time machine similar to Skynet's, and that Sarah plans to travel to 1997 - the year Skynet becomes self-aware. Realizing the time-line has been altered, Kyle is convinced that the future has changed due to the warning he received in his childhood vision.\nHe persuades Sarah to travel to 2017 instead to stop Skynet. Kyle says that he has memories of growing up in a world where the bombs never fell, even though he knows that he was born after Judgement Day. Pops agrees that at the time of his departure, Kyle could have been exposed to a Nexus point. A Nexus point is an event of such importance that it completely changes the future, and in that moment the person can remember both past time-lines.After fighting the T-1000, Pops has sustained exterior skin damage that prevents him from time traveling. He stays in 1984 and plans to meet up with Kyle and Sarah in the future, preparing for their arrival in the meantime.In 2017, Kyle and Sarah materialize in the middle of a busy San Francisco highway and are apprehended by city police. O'Brien (J. K. Simmons) is an alcoholic police detective from the San Francisco Police Department (SFPD) and former Marine. He looks at the footage from the overpass and understands that John and Sarah came out of the energy sphere. He tries to convince his colleagues that John and Sarah were also there in the events of 1984.\nKyle's prints match with the real Kyle in the database, but the real Kyle is only 12 years old.\nWhile being treated for injuries, Sarah and Kyle learn that Skynet is called \"Genisys\", a soon-to-be-unveiled global operating system that is being embraced by the public. Genisys promises to link every device to the network and sync it real time. Danny Dyson (Dayo Okeniyi) (Cyberdyne Systems' president), son of Miles Dyson (Courtney B. Vance), created Genisys.John Connor appears and rescues Sarah and Kyle from police custody at the hospital. John reveals that Kyle is his dad, which means Kyle had sex with Sarah. But the Guardian appears and immediately shoots John, revealing that John is an advanced T-3000 Terminator. While Kyle was being sent back through time, a T-5000 (Matt Smith), the physical embodiment of Skynet disguised as a member of the Resistance, attacked John and transformed him into a Terminator.\nJohn was tasked with ensuring Cyberdyne Systems' survival and traveled back in time to 2014 to assist Danny with the development of Genisys.\nThe trio escape by getting T-3000 trapped in a magnetic MRI machine. John tells Kyle and Sarah that Skynet was working on a technology to infect humans which machine-phase matter. It restructures and rebuilds human tissue at a cellular level. Skynet changed John into a Terminator. Sarah helps Kyle understand that John is now a weapon of Skynet.Unknown to anyone, John has been building his own time machine with Danny, at Cyberdyne.\nAble to escape to a safe house, Sarah, Kyle, and the Guardian make final preparations to destroy Cyberdyne's Genisys mainframe. They head toward Cyberdyne's headquarters with the T-3000 in close pursuit. During an airborne chase, the Guardian dive-bombs into the T-3000's helicopter, causing it to crash. The T-3000 survives the crash and enters the Cyberdyne complex, where it advances the countdown from 13 hours to 15 minutes. Kyle, Sarah and the Guardian plant bombs at key points in the facility while holding off the T-3000.In a final battle, the Guardian traps the T-3000 in the magnetic field of a prototype time machine. Both are destroyed, but just prior to the explosion, the T-3000 throws the remains of the Guardian into an experimental vat of Mimetic Polyalloy located nearby. Kyle and Sarah reach a bunker beneath the facility, and the explosion sets off the bombs, successfully preventing Genisys from coming online. The Guardian appears, upgraded with Mimetic Polyalloy components similar to that of the T-1000, and helps them find a way out of the debris.The trio travels to Kyle's childhood home, where Kyle tells his younger self about Genisys and instructs him to repeat the warning in a mirror - critical insurance that the events lead to their arrival in 2017. Sarah, Kyle and the Guardian drive off into the country.\nA mid-credits scene reveals that the system core of Genisys was located in a protected subterranean chamber and has survived the explosion.",
	"links": [
		"https://www.amazon.com/Terminator-Genisys-Arnold-Schwarzenegger/dp/B0CNQ7MPKD"
	]
}