{
	"title": "The Whale",
	"release_year": "2022",
	"runtime": "117",
	"tags": [
		"Drama",
		"amazon",
		"netflix"
	],
	"rating": 7.6,
	"actors": [
		"Brendan Fraser",
		"Sadie Sink",
		"Ty Simpkins",
		"Hong Chau",
		"Samantha Morton",
		"Sathya Sridharan",
		"Jacey Sink",
		"Allison Altman",
		"Lance Oppenheim",
		"Grace Perkins"
	],
	"staff": [
		"Darren Aronofsky",
		"Samuel D. Hunter",
		"Darren Aronofsky",
		"Jeremy Dawson",
		"Ari Handel",
		"Rob Simonsen",
		"Matthew Libatique",
		"Andrew Weisblum",
		"Lindsay Graham",
		"Mary Vernieu",
		"Mark Friedberg",
		"Robert Pyzocha"
	],
	"votes": 221148,
	"cover": "https://m.media-amazon.com/images/M/MV5BYmNhOWMyNTYtNTljNC00NTU3LWFiYmQtMDBhOGU5NWFhNGU5XkEyXkFqcGc@._V1_QL75_UY281_CR4,0,190,281_.jpg",
	"description": "A morbidly obese English teacher named Charlie teaches online English writing courses to college students in the beginning of 2016. He keeps his webcam off because he feels self-conscious about his appearance. Charlie withdraws and stays in his Moscow, Idaho apartment all the time. Charlie claims he cannot afford medical care, but Liz, his nurse and only friend, supports him by bringing him unhealthy food and paradoxically urging him to go to a hospital for treatment of heart failure. Thomas, a New Life Church missionary who wishes to save Charlie, also pays him a visit. Almost every night, he places an order for pizza through a prearranged routine with delivery man Dan, who leaves the pizza on his porch and takes cash payment from the mailbox. The two never speak to each other in person.After abandoning his teenage daughter Ellie eight years ago when he left his wife Mary for his male lover Alan, Charlie is hoping to get back in touch with her. He discloses that he has been saving for years, and if Ellie spends time with him without her mother's knowledge, he will give her the full $120,000 in his bank account. Although he asks that she write in a notebook he provides, Ellie consents only if he does all of her homework for her. Liz brings Charlie a wheelchair so he can stay mobile as his health deteriorates.Liz, who is upset with Thomas, chastises him when he visits her. She discloses that she is the adopted daughter of the head pastor of New Life and that Alan was her brother. Charlie, who was grieving, turned to emotional eating as a coping mechanism for Alan's suicide due to his religious guilt, which resulted in his morbid obesity. Thomas continues to feel that his goal is to assist Charlie in spite of Liz's protests. Ellie knocks Charlie unconscious one day by putting crushed Ambien in his food. After arriving and smoking marijuana together, Thomas admits to stealing the money from his youth group and fleeing his home because he was unhappy. Ellie surreptitiously records their exchange.Liz brings Mary to see Charlie because she is worried. Liz, enraged at being misled about why Charlie chose not to seek medical attention, storms out when she finds out how much he has saved for Ellie. Charlie and Mary disagree about his choice to leave his family for Alan. Mary is also disdainful of Ellie's sulky attitude, but Charlie acknowledges that he hopes their daughter will show that he did \"one thing right with his life.\" Dan first sees Charlie later that evening after delivering the pizza, and he departs in horror. Charlie consequently has a severe episode of binge eating and sends his students a profanity-filled email instructing them to ignore the classwork and simply write back \"something honest.\"After Ellie sent his confession to his family and former youth group, who have forgiven him and urged him to come home, Thomas pays Charlie a final visit to let him know that he is moving back home. He tries to explain Romans 8:13 to Charlie, but when he blames Alan's death on his sexual orientation, Charlie reprimands him. Charlie reads some of his students' submissions and informs them that he is being fired because of the email he sent during his subsequent class. The students react differently when he turns on his webcam for the first time as a way of returning their candor. Charlie calmly declares that his students' honest writings are more important than academics before hurling his laptop against the refrigerator and destroying it, thus ending the class.Charlie's health is rapidly deteriorating, so Liz comes back to console him. Ellie shows up to angrily confront him about an essay he rewrote for her. Charlie, who believes it to be the most honest essay he has ever read, had substituted an essay she wrote in eighth grade about Moby-Dick for it. As he makes one last attempt at reconciliation, Ellie first chastises him, but at Charlie's insistence, she chooses to read the paper out loud. Charlie gets up and approaches her on his own, something he had attempted but failed to do on her first visit. They exchange smiles as she finishes reading, and Charlie starts to float after being surrounded by a dazzling white light.",
	"links": [
		"https://www.amazon.com/Whale-Darren-Aronofsky/dp/B0DJNZWCR8",
		"https://www.netflix.com/title/81630891"
	]
}