{
	"title": "Passengers",
	"release_year": "2016",
	"runtime": "116",
	"tags": [
		"Drama",
		"Romance",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Jennifer Lawrence",
		"Chris Pratt",
		"Michael Sheen",
		"Laurence Fishburne",
		"Andy Garcia",
		"Vince Foster",
		"Kara Flowers",
		"Conor Brophy",
		"Julee Cerda",
		"Aurora Perrineau"
	],
	"staff": [
		"Morten Tyldum",
		"Jon Spaihts",
		"Stephen Hamel",
		"Michael Maher",
		"Ori Marmur",
		"Neal H. Moritz",
		"Thomas Newman",
		"Rodrigo Prieto",
		"Maryann Brandon",
		"Francine Maisler",
		"Guy Hendrix Dyas"
	],
	"votes": 458048,
	"cover": "https://m.media-amazon.com/images/M/MV5BYzRjNTFmMzQtM2JhZi00ZTI0LTlhMjMtNzQ4YWRhZGVmZWRmXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The star-ship Avalon (From the Homestead company) is transporting over 5,000 colonists (and 238 crew members) to the planet Homestead II, a journey that takes 120 years. This is being done as part of a mass exodus of Earth's population due to Ecocide and the collapse of the biosphere.\nThe colonists and the entire crew are in hibernation pods, but as the ship passes through a large asteroid field, the ship's energy shield (which is automatically directed in the direction of the asteroid barrage) is heavily strained against an oncoming stream of space debris, causing a malfunction (one of large pieces of debris penetrates the energy shield and collides with an unknown part of the ship) that awakens one passenger, mechanical engineer Jim Preston (Chris Pratt), 90 years early his scheduled awakening time.The passengers were supposed to awaken during final approach to the planet, just 4 months before reaching their destination. After a day, Jim realizes that he is the only one awake on the whole ship and that he woke up too soon.\nAll of the ship's functions are governed by ID badges. And Jim's ID badge is of a low-level worker, giving him access to very few areas of the ship. Even his daily food is decided by his seniority. He cannot access the bridge as it requires special authorization.\nAny messages to Earth will take 19 years reach and earliest response is expected in 55 years. Jim is not able to go back to hibernation either. Jim finds the engineering manual for the hibernation pod and tries to fix it. He then tries to break into the bridge, but the entry door is heavily fortified.After a year of isolation (he spends time playing video games, dance off, basketball, spending time in a luxury suite of the ship), with no company except Arthur (Michael Sheen), an android bartender, Jim contemplates suicide by opening the space dock air-lock without having his space suit on, but cannot bring himself to do it.One day he notices beautiful Aurora Lane (Jennifer Lawrence) in her pod. Her video profile reveals she is a writer with a humorous personality. After struggling with the morality of manually reviving Aurora for companionship (which Jim discusses with Arthur), he awakens her, claiming her pod malfunctioned like his. Aurora realizes that Jim has been awake for over a year as he explains all the things he has done to rectify his situation.Aurora, devastated she may grow old and die before the ship reaches Homestead II, attempts a fruitless effort at re-entering hibernation, just as Jim had tried. Eventually, she accepts her situation and begins writing a book about her experiences. Jim and Aurora grow closer (Jim does everything with her that he used to do alone like video games, dance offs, basketball, dinner dates, movies etc), becoming lovers. Jim and Aurora enjoy their time together on the ship and even take space excursions together.\nAurora is a gold class passenger and has access to many amenities (and far better menu options in the cafeteria), that Jim never had access to, like better coffee and the swimming pool.\nAurora says that colony planets are big business and Homestead company made 8 quadrillion dollars from its first colony planet. Homestead gets 20% of everything a colonist makes in their lifetime on the new planet.Over the next year, the two fall in love. Just as Jim intends to propose to Aurora, he inadvertently allows Arthur to reveal the truth to Aurora. She is distraught, alternately berating, shunning, and physically attacking Jim.All this while, the malfunctions on the ship keep growing gradually. At first, they are barely noticeable, but one day Aurora gets trapped in the water in the swimming pool (due to loss of gravity) barely escaping death when gravity is restored just in time.\nSoon after, however, another pod failure awakens Gus (Laurence Fishburne), a Chief Deck Officer.Using Gus' personnel code, the group accesses the ship's bridge (which Jim unsuccessfully tried to breach). They discover multiple cascading failures throughout the ship's systems, but the computer does not reveal the cause. If left unattended, the ship will inevitably fail, causing the passengers and crew to perish.\nGus realizes that Jim awakened Aurora when he checks all 3 pods to see why they malfunctioned; Aurora still blames Jim for stealing her life, claiming it is tantamount to murder. Gus does not condone Jim's actions but understands and tells Aurora that a \"drowning man\" (meaning the suicidal Jim) will grab onto any lifeline.When Gus falls critically ill, the ship's automated medical suite, the Autodoc, diagnoses Pansystemic Necrosis (Progressive Organ Failure) and gives him hours to live. Gus attributes it to his hibernation pod's multiple failures. Before dying, Gus gives Jim and Aurora his ID badge and employee code to access crew-only areas, so he and Aurora can try to repair the ship.Jim and Aurora find hull breaches from the asteroid collision two years earlier. They find a hole in the ship near the fusion reactor. The computer module administering the ship's fusion reactor power plant has been critically damaged due to the asteroid strike, causing the cascading malfunctions as the other systems' computing power was diverted in an attempt to maintain it. They replace the damaged module, but when the computer attempts to vent the reactor to extinguish a runaway plasma reaction, the exterior vent fails. Jim is forced to spacewalk and vent the plasma from outside, using the manual controls in the vent tube.Jim discovers that he must remain in the tube to keep the vent open while Aurora initiates venting from inside the ship. Revealing her enduring feelings for him, she admits she is terrified of losing him and being left alone. Jim improvises a heat shield and survives the venting but is blasted out into space as his tether snaps, and his damaged spacesuit begins losing oxygen. Aurora retrieves a clinically dead Jim from space and resuscitates him in the Autodoc. The Avalon, its reactor repaired, returns to normal operations.After burying Gus in space, Jim learns the Autodoc can function as a hibernation pod for one person, and Jim insists that Aurora use it for the remainder of the voyage. Realizing she would never see Jim again; she chooses to remain awake with him. He presents her with the makeshift engagement ring he made earlier, which she accepts.Eighty-eight years later, the ship's passengers and crew awaken on schedule, shortly before arrival at Homestead II. In the ship's grand concourse, they discover a huge tree with trailing vines, lush vegetation, flying birds, and a small cabin. A recording of Aurora's story describes the wonderful life she and Jim shared on the Avalon.",
	"links": [
		"https://www.amazon.com/Passengers-Jennifer-Lawrence/dp/B01MQVG52J"
	]
}