{
	"title": "50/50",
	"release_year": "2011",
	"runtime": "100",
	"tags": [
		"Comedy",
		"Drama",
		"Romance",
		"max",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Joseph Gordon-Levitt",
		"Seth Rogen",
		"Anna Kendrick",
		"Bryce Dallas Howard",
		"Anjelica Huston",
		"Serge Houde",
		"Andrew Airlie",
		"Matt Frewer",
		"Philip Baker Hall",
		"Donna Yamamoto"
	],
	"staff": [
		"Jonathan Levine",
		"Will Reiser",
		"Evan Goldberg",
		"Ben Karlin",
		"Seth Rogen",
		"Michael Giacchino",
		"Terry Stacey",
		"Zene Baker",
		"Francine Maisler",
		"Annie Spitz"
	],
	"links": [
		"https://www.max.com/movies/5050-one-up/fc9873ce-f4c0-4798-b867-7e144a39a2e1",
		"https://www.amazon.com/50-Jonathan-Levine/dp/B0C4VLJDYT"
	],
	"votes": 344974,
	"cover": "https://m.media-amazon.com/images/M/MV5BNjg3ODQyNTIyN15BMl5BanBnXkFtZTcwMjUzNzM5NQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Adam Lerner (Joseph Gordon-Levitt) is a 27-year-old public radio journalist with an artist girlfriend Rachael (Bryce Dallas Howard), of whom his best friend and co-worker Kyle (Seth Rogen) disapproves. They all live in Seattle. Phil (Peter Kelamis) is Adam and Kyle's boss at work.\nRachael lives with Adam. Adam is physically active and leads a healthy lifestyle. Adam is having a consistent pain in his back, which Kyle believes is from having sex in weird positions. Adam decides to visit the doctor and get the pain checked out.\nAdam tells Kyle that he and Rachael haven't had sex in 3 weeks as she had a yeast infection and then her periods. Adam defends Rachael saying that their relationship is more than about just sex.Adam learns he has Schwannoma Neurofibrosarcoma (a malignant tumor) in his spine and must undergo chemotherapy. Adam's cancer is due to an incredibly rare gene mutation.\nHe sees on the Internet that his chances of survival are fifty-fifty. Adam tells Rachael who promises to be with him throughout the ordeal. Meanwhile, when Kyle hears about the cancer, he wants to vomit. Kyle is optimistic since people keep beating cancer all the time.\nAfter Adam reveals his diagnosis, his overbearing mother, Diane (Anjelica Huston), who already cares for a husband Richard (Serge Houde) suffering from Alzheimer's, wants to move in and care for him. Adam rejects this offer, as Rachael has promised to be the one to take care of him.\nRachael gets Adam a retired racing dog as she read somewhere that having a dog helps accelerate the healing process.\nRachael, however, is \"uncomfortable\" going into the hospital during Adam's chemo treatments.Meanwhile, Adam skeptically begins going to a young and inexperienced therapist, Katherine McKay (Anna Kendrick), at the hospital.\nAlthough their relationship and sessions have a rocky start (Katherine is only 24 years old and Adam feels that she has no experience and hence cannot help a person like him. Katherine is not a doctor yet and is only a trainee at the hospital. Adam is her 3rd patient), he slowly begins to open up to her about his disease and how it is affecting him.The two develop a rapport both in and outside of their sessions, as the lines between doctor-patient and friends begins to blur. She helps Adam understand his mother's situation: loved ones can feel just as much stress as the patient, which allows Adam to repair the rift between him and his mother.During chemo treatments, Adam also befriends Alan (Philip Baker Hall) (stage 3 Lymphoma) and Mitch (Matt Frewer) (prostate cancer), two older cancer patients who are also undergoing chemotherapy. Alan and Mitch prepare Adam by telling him that during Chemo his hair is going to fall out, his testicles are going to shrink, and he will not be able to perform sexually. Adam likes that Alan and Mitch don't get all sorry and sympathetic about cancer. They remain to be matter of fact and are even able to laugh about their situation.\nAlan and Mitch are not convinced that Rachael really care for him. Adam tries to tell them that Rachael drops him and picks him regularly, but the day Alan and Mitch want to meet her, she is late coming into the hospital to pick Adam after his Chemo session.Adam's body starts reacting due to the chemotherapy.\nThroughout Adam's struggle, Kyle attempts to keep Adam's spirits high, which include helping Adam shave his head prior to chemotherapy and suggesting that Adam use his illness as a way to pick up women. Katherine gives Adam names of 2 books to read. Kyle takes the list and approaches the store lady Claire (Laura Bertram) and uses the list as a pickup. Kyle says that he is taking care of his buddy who is suffering from cancer.\nLater, Kyle sees Rachael kissing another man at an art gallery (he was on a date with Claire), and tells Adam that Rachael is cheating on him. Rachael says that Adam's situation has been very stressful for her, and they had problems long before Adam was sick. Adam and Rachael break up.\nKyle encourages Adam to get laid to improve his mental make-up. But Adam finds that girls have nothing but sympathy for him and they cannot treat him like a normal person.After Mitch suddenly dies, Adam's fears become more evident upon hearing that his treatment is not working and that he needs to undertake a risky surgery as a last resort. The night before his surgery, Adam has an argument with Kyle and demands to drive Kyle's car because Kyle is drunk-even though Adam does not have a driver's license.\nAfter nearly causing an accident, Adam breaks down and criticizes Kyle for seemingly not taking his illness seriously. Adam calls Katherine and tells her that he wishes he had a girlfriend like her, but also says he is tired and just wants it to be over.\nThat night, Adam stays at Kyle's and finds a book on surviving cancer, filled with notes and annotations, proving that Kyle does care for Adam and is worried for him. Adam also forgives Rachel, stating he understands that it was not easy for her, but he refuses to take her back.The next day as Kyle drops Adam off at the hospital, Adam embraces Kyle for being a good friend and apologizing for what he said the previous night. As Adam says what could be his final farewells to his family (including telling his father that despite his Alzheimer's, he loves him), he undergoes his surgery. After the surgery, Kyle, Diane, and Katherine are told by the doctor that although the bone degradation was worse than they had thought, the tumor was successfully removed, and Adam should recover.Sometime later, Adam is getting ready for a date, with Kyle encouraging him and cleaning the incision on Adam's back from the surgery. The doorbell rings and Adam lets Katherine inside as Kyle leaves. Katherine asks \"Now what?\", and Adam simply smiles."
}