{
	"title": "Mad Max: Fury Road",
	"release_year": "2015",
	"runtime": "120",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"max",
		"amazon",
		"netflix"
	],
	"rating": 8.1,
	"actors": [
		"Tom Hardy",
		"Charlize Theron",
		"Nicholas Hoult",
		"Zoë Kravitz",
		"Hugh Keays-Byrne",
		"Josh Helman",
		"Nathan Jones",
		"Rosie Huntington-Whiteley",
		"Riley Keough",
		"Abbey Lee"
	],
	"staff": [
		"George Miller",
		"George Miller",
		"Brendan McCarthy",
		"Nick Lathouris",
		"George Miller",
		"Doug Mitchell",
		"P.J. Voeten",
		"Tom Holkenborg",
		"John Seale",
		"Margaret Sixel",
		"Nikki Barrett",
		"Ronna Kress",
		"Colin Gibson"
	],
	"links": [
		"https://www.max.com/movies/mad-max-fury-road/8cde025a-223d-4879-9336-3d5f6c9d0c55",
		"https://www.amazon.com/Mad-Max-Fury-Tom-Hardy/dp/B00XOX9QCS",
		"https://www.netflix.com/title/80025919"
	],
	"votes": 1129172,
	"cover": "https://m.media-amazon.com/images/M/MV5BZDRkODJhOTgtOTc1OC00NTgzLTk4NjItNDgxZDY4YjlmNDY2XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Following a nuclear holocaust, the world has become a desert wasteland and civilization has collapsed. Max Rockatansky (Tom Hardy), a survivor, is captured by the War Boys, the army of the tyrannical Immortan Joe (Hugh Keays-Byrne) and taken to Joe's Citadel. Designated a universal blood donor, Max is imprisoned and used as a \"blood bag\" for a sick War Boy called Nux (Nicholas Hoult). Meanwhile, Imperator Furiosa (Charlize Theron), one of Joe's lieutenants, is sent in her armored truck - a \"war rig\" - with a small unit of War Boys to defend it to collect a large supply of fuel at a nearby community, Gas Town. When she suddenly drives off-route, Joe realizes that his five wives - women selected for breeding - are missing. Joe leads his entire army in pursuit of Furiosa, calling on the aid of Gas Town and another supply community, the Bullet Farm.Nux, one of the War Boys' most skilled drivers, joins the pursuit with Max strapped to the front of his car to continue supplying blood. A battle ensues between the war rig, the scavenger Buzzards gang and Joe's forces. Joe's forces and Furiosa's War Boys fight off the Buzzards. Joe's fleet then turn their attention to halting Furiosa's escape. She drives into a sandstorm, evading her pursuers, except Nux, who attempts to sacrifice himself to destroy the truck. Max stops and restrains Nux, but the car is destroyed.After the storm, Max sees Furiosa repairing her truck, accompanied by the Wives: Capable (Riley Keough), Cheedo (Courtney Eaton), Toast (Zoe Kravitz), the Dag (Abbey Lee), and Angharad (Rosie Huntington-Whiteley), whom is heavily pregnant with Joe's child. Max overpowers Furiosa and steals the truck, but its kill switch disables it. Max reluctantly agrees to accompany Furiosa on their journey. Left behind, Nux is picked up by Joe's army.Furiosa drives through a canyon controlled by a biker gang, the Rock Riders, to barter a deal for safe passage; however, with Joe's forces pursuing, the Rock Riders turn on her, forcing her and the group to flee while the bikers detonate the canyon walls to stop Joe's fleet. Max and Furiosa fight off the Rock Rider's as Joe's car, with Nux now on board, surmounts the blockade and eventually attacks Furiosa's truck, allowing Nux to board. However, as the truck escapes, Angharad falls off in an attempt to protect Max and is run over by Joe's car, mortally wounding her and her child. Joe's medic, the Organic Mechanic, tries to save the child, but it dies. Joe becomes further enraged when he learns the child was a boy.Furiosa explains to Max that they are escaping to the \"Green Place\", an idyllic region of fertile land she remembers from her childhood. Capable finds Nux hiding in the truck, distraught over his failure, and consoles him. That night, the truck gets stuck in mud. Furiosa and Max slow Joe's forces with mines, but Joe's ally, the Bullet Farmer (Richard Carter), continues pursuing them. Nux helps Max free the truck while Furiosa shoots and blinds the Bullet Farmer. Nux hits upon using a nearby dead tree and the war rig's winch to free the rig from the mud. Max walks into the dark to confront the Bullet Farmer and his men, several more explosions are heard and flashes of light are seen in the distance. Max returns, splattered with their pursuers blood carrying guns, ammunition, a boot to replace one Nux lost and a steering wheel which had been lost in the battle in the desert.They drive the truck overnight through swampland and desert, coming across a naked woman the next day. Max suspects a trap, but Furiosa approaches the woman and states her history and clan affiliation. The naked woman summons her clan, the Vuvalini, who recognize Furiosa as one of their own who was kidnapped as a child. Furiosa is devastated to learn that the swampland they passed was indeed the Green Place, now inhospitable. The group then plans to ride motorbikes across immense salt flats in the hope of finding a new home, a journey of at least 160 days. Max chooses to stay behind, but after seeing visions of a child he failed to save, he convinces them to return to the undefended Citadel, which has ample water and greenery that Joe keeps for himself, and trap Joe and his army in the Rock Riders' canyon.The group heads back to the Citadel, but they are attacked en route by Joe's forces. Several of the Vuvalini are killed fighting off the armada and Furiosa is seriously wounded. Joe positions his car in front of the truck to slow it, while Max fights Joe's giant son, Rictus Erectus. Joe captures Toast, but she distracts him long enough for Furiosa to rip off his breathing mask, killing him. Nux sacrifices himself by wrecking the truck, killing Rictus and blocking the canyon, allowing Max, Furiosa, the wives, and the Vuvalini to successfully escape in Joe's car, where Max transfuses his blood to Furiosa to help her survive her injuries. While he does so, he tells Furiosa his name.At the Citadel, the impoverished citizens are overjoyed at the sight of Joe's corpse. Furiosa, the wives, and the Vuvalini are cheered by the people and welcomed by the War Boys. Max walks away, sharing a glance with Furiosa before disappearing into the crowd."
}