{
	"title": "Seeking a Friend for the End of the World",
	"release_year": "2012",
	"runtime": "101",
	"tags": [
		"Adventure",
		"Comedy",
		"Drama",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Steve Carell",
		"Keira Knightley",
		"Melanie Lynskey",
		"Patton Oswalt",
		"Adam Brody",
		"Connie Britton",
		"Roger Aaron Brown",
		"Rob Huebel",
		"Trisha Gorman",
		"Nancy Carell"
	],
	"staff": [
		"Lorene Scafaria",
		"Lorene Scafaria",
		"Steve Golin",
		"Steven Rales",
		"Mark Roybal",
		"Joy Gorman Wettels",
		"Jonathan Sadoff",
		"Rob Simonsen",
		"Tim Orr",
		"Zene Baker",
		"Nicole Abellera",
		"Jeanne McCarthy",
		"Chris L. Spellman"
	],
	"votes": 119480,
	"cover": "https://m.media-amazon.com/images/M/MV5BNDgxYzQ5ZGYtZDAyMS00MWNiLWIwMWMtZmIwODUwODFhYjdlXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "The film opens with an announcement that a seventy-mile-wide asteroid named Matilda is on a collision course with Earth and that a last-ditch effort to destroy it has failed. The world has three weeks until impact, at which time all of humanity will be wiped out. Dodge Petersen (Steve Carell) and his wife Linda listen to the broadcast from the side of the road. Seconds later, Linda flees the vehicle without saying a word to him.Dodge returns to a near empty workplace the next day, where he sells insurance. While everyone around him has reacted differently - from suicide to constant drugs to guilt-free sex - Dodge's life hasn't changed at all. Even his housekeeper, Elsa, continues to show up and clean his apartment despite Dodge's insistence that there is no further need to do so.After attending a friend's party, Dodge returns home to reminisce about his high school sweetheart, Olivia, when he notices his neighbor Penny (Keira Knightley) crying on the fire escape. She admits to him that she has just ended a relationship with her boyfriend Owen (Adam Brody) for making her miss an opportunity to see her family in England. Returning to her apartment, Penny gives Dodge a handful of mail she received for him but kept forgetting to deliver - unknowingly telling him that his ex-wife Linda was having an affair.Dodge storms off into the night, guzzling Codeine-containing cough syrup and a window cleaner humorously named \"Windose\" in an attempt to kill himself. The next morning, however, he regains consciousness with a note on his sweater - reading \"Sorry\" - and a dog tethered to his foot. He takes the dog which he names Sorry home and opens the old mail Penny had been holding. Dodge is surprised to receive a letter from Olivia. The letter explains why she left him and what has happened in her life, ending that he was \"the love of her life.\" On the same night, a riot breaks out inside Dodge's building. Dodge exits his apartment through the fire escape and enters Penny's apartment to rescue her. But he finds Owen there as well. Dodge makes them all exit the building and escape the rioters. Abandoning Owen in the middle of the rioters, Dodge explains to Penny that he knows someone who could get her to England if she helps him find Olivia first. She agrees and the two set off towards Somerset.After running out of gas, Dodge and Penny are picked up by a sympathetic driver in a pick-up (William Petersen) who regales them with his life story. During a pit stop, the driver of the pick-up confronts Dodge, asking him how he's going to kill him. The driver makes light of Dodge's confusion, admitting he had hired an assassin to have himself killed just before getting gunned down. After burying the driver with shovels, he had been carrying for this purpose, Dodge and Penny drive on to a restaurant called Friendly's, a theme restaurant where everyone is friendly. After Penny playfully announces that they are there to celebrate Dodge's birthday, a frenzy of kissing and drinking breaks out between the staff and the customers. Dodge almost ends up getting a blow job from the waitress. Penny and Dodge leave just as an orgy commences and swept away in the spontaneity of the moment, the two make love in the pickup.Later in Camden, Dodge and Penny meet Speck (Derek Luke) after visiting the county lockup when picked up by a highway patrolman for being 15 mph over the speed limit (even though Dodge & Penny were released by the sheriff next day their truck was impounded), an ex-boyfriend of Penny's and military man who appears prepared for the apocalypse. Speck reveals that he owns a satellite phone and lets Penny contact her family. After convincing Speck to loan them one of his fleet of Smart cars, Penny and Dodge finally track down Olivia's whereabouts. Through the journey Dodge & Penny get emotionally close to each other & realize how much the other means to them. Dodge exits the vehicle and starts toward the door, much to Penny's disappointment. A short time later he returns, revealing he had simply left a note. Penny presses him for an explanation, but he gives her none.After affirming their feelings for one another during a mass baptism, Dodge and Penny drive to Somerset County to visit Frank (Martin Sheen), the father whom Dodge has been estranged from for nearly twenty-five years. Their reunion leads to arguing but eventually, they reconcile and the three bond over personal time and dinner. After Penny falls asleep, Dodge carries her outside and it becomes apparent that the pilot that he knew is his father, who is waiting for them in his airplane. Dodge gently rests her in the plane, whispers that she is the love of his life. Dodge then nods to his father and watches as the plane flies away.Dodge returns home to find Elsa once again cleaning his apartment. He scolds her, insisting that she be with her family, but in the end telling her he will see her next Thursday. He turns on the television, only to discover that Matilda is due to arrive prematurely by 1 week. With only sixteen hours left, Dodge goes to Penny's apartment with Sorry and listens to her records until the power goes out. In the dark, he finds Penny standing in the living room. Having told his father to turn around, she asks how he could have possibly left her. He admits that it was the stupidest thing he'd ever done, and the two share one final, tearful reunion.Shortly after, they lie in bed with each other, and they begin to talk of how things might have been had they known each other sooner. Penny is scared to think that in short moments they will all be gone when Dodge calms her and asks where she grew up. Penny tensely tells him of her childhood with her brothers and late sister when they feel Matilda colliding with Earth. Penny panics, telling him that she thought they could have saved each other, but Dodge assures her they did. Their final moments are spent smiling, and the film slowly ends in a white fade.",
	"links": [
		"https://www.amazon.com/Seeking-Friend-World-Steve-Carell/dp/B009GN6EDE"
	]
}