{
	"title": "Transformers: Dark of the Moon",
	"release_year": "2011",
	"runtime": "154",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.2,
	"actors": [
		"Shia LaBeouf",
		"Rosie Huntington-Whiteley",
		"Tyrese Gibson",
		"Josh Duhamel",
		"John Turturro",
		"Patrick Dempsey",
		"Frances McDormand",
		"John Malkovich",
		"Kevin Dunn",
		"Julie White"
	],
	"staff": [
		"Michael Bay",
		"Ehren Kruger",
		"Ian Bryce",
		"Tom DeSanto",
		"Lorenzo di Bonaventura",
		"Don Murphy",
		"Steve Jablonsky",
		"Amir Mokri",
		"Roger Barton",
		"William Goldenberg",
		"Joel Negron",
		"Denise Chamian",
		"Nigel Phelps"
	],
	"votes": 435977,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTkwOTY0MTc1NV5BMl5BanBnXkFtZTcwMDQwNjA2NQ@@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "In final days of the Cybertron war, The Ark spacecraft escapes. Piloted by Autobot leader Sentinel Prime, the ship contained technology to defeat Decepticons & win the war. but it was hit by missiles & crashed on the moon in 1961 & detected by NASA. JFK orders NASA to land on the moon to examine the craft & Apollo 11 does so in 1969.\nIn present day, Major Lennox (Josh Duhamel) is informed by a Ukrainian about Energon readings in the Chernobyl disaster site. Lennox goes with Optimus Prime (Peter Cullen) & discovers a fuel cell from the Ark, and something even more shocking: the Decepticon Shockwave (Frank Welker) and a giant drilling robot at his command.In NEST HQ Prime confronts Secretary of Defense Charlotte who admits knowing of the Autobot spaceship. Optimus takes a team to the moon & retrieves the weakened body of Sentinel Prime, as well as 5 metal 'pillars'.\nSam has graduated from college, has a medal of honor from Obama & new girlfriend Carly (Rosie Huntington Whiteley). He can't find a job & eventually gets one in a tech firm with Bruce Bazos, who hires him as mailman. Sam meets Carly's car collecting, ultra cool boss, Dylan Gould (Patrick Dempsey). Sam is jealous to see Carly flirting with Dylan. Dylan tells Sam that he helped Sam get that job & also gifts Carly a Merc.In the new job, Sam is confronted by worker Jerry Wang who shows him a number of papers and news clippings, talking about the 'Dark Side of the Moon' and that the Autobots are in danger. Jerry is killed & Sam is attacked by machine.\nSam & Carly drive to NEST but Charlotte is not happy. Prime revives Sentinel. Charlotte tells Sentinel that the pillars are locked away, & Sentinel insists there are more than 5 & can be used to open a space time portal.Sam contacts Seymour Simmons (John Turturro), to investigate further. They find that all the people connected to the moon Ark missions are missing or dead. Carly is angry at Sam getting involved in deadly business & goes to Dylan.\nSam also finds that manned Russian Lunar missions were canceled. Sam and Simmons track 2 Cosmonauts & find that before Americans landed on the moon, satellites revealed strange tracks and stacked pillars. Sam realizes that Decepticons have the pillars & need Sentinel to activate them, so they left 5 pillars & Sentinel for Prime to discover them. He speculates an invasion force being planned by Decepticons to subdue Earth.Sam returns to NEST to warn Prime when Sentinel reveals his deal with Megatron to end the war & rebuild Cybertron. He kills Ironhide, destroys NEST & escapes with the 5 pillars. Prime asks Sentinel to stop, but he activates the pillars & Decepticon invasion force lands on Earth.\nSam is worried for Carly & goes to Dylan who reveals that his dad was NASA accountant who fixed the books to stop future Apollo missions. Dylan captures Carly & attaches a Decepticon watch to Sam to spy on Prime's strategy to fight back. Sentinel sends a message to Charlotte to exile Autobots & the humans agree. Prime & Bumblebee say their goodbyes to Sam & depart in a modified shuttle. As the shuttle reaches the outer atmosphere, it is shot down by Decepticons.\nDylan calls Sam to thank him for his help & Simmons traces the call to Chicago.Dylan tells Carly that Decepticons intend to rebuild Cybertron by stripping Earth for resources. Sentinel will bring the entire planet through the space portal to achieve this. Sentinel sets the control pillar in a tall building in Chicago.Sam attacks with NEST team & is almost vaporized by an attack drone when Autobots attack & save them. They had hidden in one of the booster rockets & splashed safely in the ocean.\nAs Prime & Bumblebee create a diversion, Sam & NEST are tasked to destroy the control pillar, heavily guarded by Decepticons.As Sam & a troop of ex NEST agents try to get close the drilling robot attacks & cuts their building in half. It is about to kill them, when Prime intervenes & saves them. The current NEST team para drops into Chicago & helps the people already on the ground. Bit by bit they are getting closer. the smaller Autobots infiltrate the Decepticon mother ship & destroy it from within.\nSentinel activates the central pillar that begins to pull Cybertron into Earth's atmosphere through the space portal. Prime attacks & manages to kill many Decepticons & to disengage the pillar.\nDylan helps the Decepticons to re-engage the pillar.Sentinel now attacks Prime. He is about to kill Prime when Carly convinces Megatron that once Prime is dead & Cybertron is in Earth, Megatron will serve Sentinel. Megatron can't bear this & attacks Sentinel before he has killed Prime. Prime is saved & kills Megatron & then he kills the weakened Sentinel.Sam pushes Dylan into the pillar electrocuting him & destroying the pillar, which in turn destroys Cybertron.\nAs the NEST agents and the Autobots gather, Sam embraces Carly, and with all chances of ever reviving or returning to Cybertron gone, Optimus realizes that the Autobots' only home from now on will be Earth.",
	"links": [
		"https://www.amazon.com/Transformers-Dark-Moon-paramount/dp/B0D6JDKNMT"
	]
}