{
	"title": "Rise of the Planet of the Apes",
	"release_year": "2011",
	"runtime": "105",
	"tags": [
		"Action",
		"Drama",
		"Sci-Fi",
		"max",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"James Franco",
		"Andy Serkis",
		"Freida Pinto",
		"Karin Konoval",
		"Karin Konoval",
		"Terry Notary",
		"Terry Notary",
		"Richard Ridings",
		"Christopher Gordon",
		"Devyn Dalton",
		"Jay Caputo",
		"John Lithgow"
	],
	"staff": [
		"Rupert Wyatt",
		"Rick Jaffa",
		"Amanda Silver",
		"Peter Chernin",
		"Dylan Clark",
		"Rick Jaffa",
		"Amanda Silver",
		"Patrick Doyle",
		"Andrew Lesnie",
		"Conrad Buff IV",
		"Mark Goldblatt",
		"Candice Elzinga",
		"Debra Zane",
		"Claude Paré"
	],
	"links": [
		"https://www.max.com/movies/rise-of-the-planet-of-the-apes-2011/a3db0e5d-d8dd-447a-8ae3-30d98ffb1a00",
		"https://www.amazon.com/Rise-Planet-Apes-James-Franco/dp/B006FLGBGA"
	],
	"votes": 582532,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjllODU1NDItODU1Ni00N2Y2LTg4Y2ItOTJjMTczZDliN2FhXkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "The film opens at Gen Sys (pronounced \"Genesis\"), a genetic therapy pharmaceutical company. A female ape, designated No. 9 (aka \"Bright Eyes\"), has been given the drug ALZ 112, and has shown considerable progress. She is has succeeded in completing the Towers of Hanoi puzzle in 20 moves, which is close to a perfect score of 15. Will Rodman (Franco) talks to his boss, Steve Jacobs (Oyelowo), and convinces him that he has data to enable them to proceed with human trials for the drug. At the board meeting, Will explains that the new drug causes Neurogenesis, which allows the brain to grow new brain cells and heal any number of degenerative brain disorders, such as Parkinson's or Alzheimer's. The only side effect is that the subjects exposed to the drug have a green sparkle to the eyes.Back in the lab, the senior ape caretaker named Robert Franklin (Labine) is puzzled by Bright Eyes aggression. She escapes & breaks into the board room & has to be shot. Jacob orders the entire ape subjects to be killed & kills the project.\nWill & Robert find a baby in Bright Eyes cabin & realize that she was only defending. Will can't kill it & takes it home & calls it Caesar. Will's father Charles (John Lithgow) is currently suffering from Alzheimers. Caesar soon begins to show incredible progress, able to feed himself after only 2 days, and the temporary caring for him soon pushes on to 3 years, with Will setting up a room for him in the attic his home.Charles has been showing signs that his Alzheimers is getting worse. Will then takes a major risk and steals ALZ 112 from Gen-Sys. Giving some to Charles, it appears it is a miracle drug when the next day, Will finds his father sitting at the piano, playing perfectly!\nMeanwhile, Caesar has grown enamored watching the neighbors playing outside, and escapes out the window into their neighbor's backyard. However, his appearance frightens the neighbor's daughter, and her father (David Hewlett) angrily attacks Caesar. Will and Charles manage to rescue Caesar but is injured.Will takes Caesar into a local zoo for treatment. Caesar is treated by a veterinarian there named Caroline Aranha (Frieda Pinto). During the procedure, Caesar implies through sign-language that both Will and Caroline should go out to dinner. Caroline is fascinated.Five years later. Caroline is now living as part of the Rodman family, and Caesar has grown. Will has even started dressing him in a shirt and pants. During a visit to the forest, Caesar is barked at angrily by a dog, and he counters with a primal cry that scares it off. Will notices that Caesar seems sad and confused about just 'what' he is. Will and Carolien drive past Gen-Sys, and Will explains to Caesar about the drug that made him more intelligent, as well as his Mother having died.In the 5 years since he was given ALZ 112, Charles' condition has deteriorated. Will reasons his immune system has developed antibodies and a more aggressive virus is needed. Will takes a risk by going to Jacobs, confessing about his secret experiment with his father, and explains that the drug not only repairs, but makes people smarter. He says he has reworked the virus and needs Jacobs to approve new animal testing.Charles is attacked by a neighbor when he damages their car, Caeser attacks the neighbor & bites his finger off. Now the court orders Caeser into a primate sanctuary. The sanctuary proves to be tough on Caesar during his first days. It is run by a man named John Landon (Brian Cox), with the care of the animals supervised by his short-tempered son Dodge (Tom Felton), and a timid man named Rodney (Jamie Harris). When Caesar flings his food at Dodge and laughs, the young man angrily responds by turning a fire-hose on him, cowering Caesar into a corner of his cage.\nCaesar meets the alpha male of the groups, an ape named Rocket. Rocket beats Caeser. Caesar also meets Buck, and an orangutan, that speaks sign-language, Maurice.The sanctuary also ships 12 apes to Gen-Sys for the testing of the newer version of ALZ 112, which is named ALZ 113. Will is once again in charge of the testing and chooses Koba. He is injected via a hose. The hose comes off & Robert is exposed to ALZ 113. Will takes some of the ALZ 113 home to treat his father. Charles refuses the treatment and dies that night in his sleep.Caeser then befriends Buck & defeats Rocket to become the alpha male. Will finds that Jacobs has greedily pushed the research schedule ahead recklessly. Will is worried of the human effect of ALZ 113. Will quits Gen-Sys. Meanwhile, Robert has been experiencing side-effects from his exposure, with the result being blood from his sinuses when he sneezes.Will then returns to the preserve where he attempts to Bribe John Landon into letting him have Caesar. John is willing to do so, but when Will attempts to coax Caesar to go with him, Caesar refuses. That night Caeser escapes & steals ALZ 113 from Rodman's fridge & gives it to the apes. That night Caeser attacks Dodge & even talks audibly. Caeser kills Dodge when he tries to escape.\nWill visits the preserve & finds it destroyed. Meanwhile, the apes are now making their way across the town. Caesar then designates that they split into two groups. Buck is sent with some apes to the zoo to liberate the other apes, while Caesar goes with another group to Gen Sys.Meanwhile, Robert has gone to Will's home to talk to him but is accosted by Will's short-tempered neighbor. Startled by him, Robert accidentally sneezes on him. Later on, a woman in Robert's building finds him dead. This is then relayed to Jacobs, who has just made his way to work. Upon entering the building, he finds that Caesar and the other apes have taken over the building and freed the 12 ALZ 113 test subject apes. The Police are called in, and Jacobs boards a police helicopter as Caesar and Buck's group rejoin forces, now some 50-60 apes, chimps, orangutans, and gorillas strong. However, the apes seem to be intentionally preventing the deaths of humans they encounter.Will and Caroline have heard about the rampage, and upon hearing that the apes are headed for the Golden Gate Bridge, surmise that Caesar is leading the apes to the Red Oak Forest. The officers are waiting on the bridge to fire on the apes, but Caesar then has his forces split up into two groups: one begins climbing up the suspension cables, while another swings from the underside of the structure to get past them.In the helicopter, Jacobs catches sight of Caesar, and orders the men to shoot at him, reasoning that the death of Caesar will call off the others. However, as the helicopter hovers low to the bridge, Buck leaps onto the helicopter, bringing it down, but at the cost of his own life. Caesar feels sadness over the loss of one of his comrades, and soon finds the remains of the helicopter precariously clinging to the side of the bridge, with Jacobs pleading for help. Instead, Caesar turns away, and Koba pushes the helicopter off, with Jacobs dying upon impact of the water.The apes then proceed onto the forest. Will and Caroline meanwhile, have made their way onto the bridge. Will manage to steal a police car, and heads for the forest. He calls out Caesar's name but is accosted by one of his followers. However, Caesar soon appears, and the others back away. Will attempts to reconcile with his friend, promising that if Caesar comes home with him, he'll protect him. Caesar then shocks Will by holding him close, and audibly whispering to him in a spoken voice, \"Caesar IS home.\" Will then watches as Caesar and several other apes climb up into the trees and survey the forest...and the world beyond.In an aftermath sequence, we see Will's neighbor reporting for duty as a pilot at San Francisco International Airport. As he walks to his plane, he realizes that he is bleeding from his nose. As the camera pans up, we see the digital boards flashing to different destinations...a sign that soon, these places will be infected with ALZ 113, sealing mankind's fate.\nA recurring sub-plot throughout the film is the TV and newspaper reports of a troubled manned Mars probe."
}