{
	"title": "Gangster Squad",
	"release_year": "2013",
	"runtime": "113",
	"tags": [
		"Action",
		"Crime",
		"Drama",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Sean Penn",
		"Ryan Gosling",
		"Emma Stone",
		"Giovanni Ribisi",
		"Holt McCallany",
		"Wade Williams",
		"James Landry Hébert",
		"Ambyr Childers",
		"Josh Brolin",
		"Mick Betancourt"
	],
	"staff": [
		"Ruben Fleischer",
		"Will Beall",
		"Paul Lieberman",
		"Dan Lin",
		"Kevin McCormick",
		"Michael Tadross",
		"Steve Jablonsky",
		"Dion Beebe",
		"Alan Baumgarten",
		"James Herbert",
		"John Papsidera",
		"Maher Ahmad"
	],
	"votes": 223925,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTcwMjAyMTUzMl5BMl5BanBnXkFtZTcwODgxNzk1OA@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "In 1949 post-WWII Los Angeles, gangster Mickey Cohen (Sean Penn) wants the whole west coast. Cohen is a violent man and a boxer by training. He used his lust for violence to climb the ladder at the mob. Cohen had his hands in every illegal business in the city and wanted to own the town. He eliminates witnesses and bribes legal officials. He pulls apart a Chicago mobster with chains tied to pick-up trucks, to warn Easterners away.\"Sarge\" John O'Mara (Josh Brolin) saves a girl newly arrived in Hollywood from sexual assault by Cohen's thugs. O'Mara is new to the city and does not know that the men he beat up belonged to Cohen's organization. Their operation was to sexually assault innocent girls and then push them into full time prostitution. O'Mara is equally brutal and ruthless as he physically tackles the men who attack him, breaking bones, and killing men when needed. The arrested men are out on bail within minutes of arriving at the police station. O'Mara believes that there is a mole in the police, passing information to Cohen.\nCohen pretends to forgive his men (as O'Mara rescued all the prostitutes working for Cohen and ruined his current crop), then burns them in an elevator. He burns the entire building down for the insurance money. Karl Lennox (Holt McCallany) is Cohen's bodyguard.O'Mara is not afraid of the Cohen gang, but almost every other cop warns him from taking on Cohen and his mafia organization.\nChief Bill Parker (Nick Nolte) knows O'Mara has special operations background and training at Camp X during World War II to wage guerrilla warfare and appoints him to choose a team. They will wage \"war\" and destroy the entire enemy operation, off official police books. Bill says that it is impossible to bring down Cohen otherwise as no one will testify against him. Bill doesn't want Cohen to be killed, but to be damaged enough to drive him out of the city.\nCohen has on his payroll Judge Carter (John Aylward) a judge, Eugene W. Biscailuz (Jack Conley) the sheriff of Los Angeles County and Elmer Jackson (Dennis Cockrum) the Burbank Police Chief.John's pregnant wife Connie (Mireille Enos) is at first reluctant (as she believes that John is just looking for another war), then suggests choosing wild cards like himself, not up and comers probably already bribed.\nColeman Harris (Anthony Mackie) is lured by the prospect of cutting off Harlem drug addiction at the source. Wire-tapper Conway Keeler (Giovanni Ribisi) is the only one with a son. Old sharpshooter Max Kennard (Robert Patrick) is followed by his partner \"Christmas\", Navidad Ramirez (Michael Pena), who wants in.Sgt Jerry Wooters keeps in touch with childhood pal Jack Whalen (Sullivan Stapleton), now bodyguard to Cohen and informant. Grace Faraday (Emma Stone) is Cohen's etiquette coach and girlfriend. Wooters meets Grace at a bar and starts a friendship.\nWooters and Grace begin a secret romantic relationship, protected by reluctant Jack.O'Mara and Coleman attack Cohen's illegal casino in Burbank. They encounter 2 cops at the casino. Reluctant to shoot corrupt Berkley cops in Cohen's casino, the duo is captured. Since the duo were mot carrying their police badges, they were mistaken to be agents of the Chicago gang or Dragna, who wanted revenge.Sgt Jerry Wooters (Ryan Gosling), O'Mara's close friend, had refused to join O'Mara.\nDragna (the current mob boss) had questioned Cohen's decision to attack the Chicago mob and unnecessarily risk an inter-city gang war and had warned that one day Cohen will be killed brutally. Cohen tells Dragna that he is old and slow, and that Cohen's gang will not work for him anymore.Cohen's gang attacks the current old boss Jack Dragna (Jon Polito) (a rival mob boss to Cohen) and his wife after Cohen suspects Dragna of attacking his Burbank Casino. In the crossfire a shoeshine boy Pete (Austin Adams) is gunned down, which leaves Jerry distraught. Jerry attempts to shoot Cohen but is stopped by Whalen. Jerry learns from Whalen that Cohen's Burbank casino was hit and immediately knows that this was O'Mara. Whalen also says that 2 men were arrested, and Cohen's men are headed to Burbank to deal with them.Wooters saves O'Mara and Coleman from the cops who arrested them (& who work for Cohen and were protecting the casino) & before Cohen's men get to the station, by pretending to be the man that Cohen sent to pick up his prisoners. Wooters then joins them.Keeler helps to install a wiretap in Cohen's house & realizes that Cohen is planning something very big. In reality Cohen is planning a wire gambling business to control the entire gambling operation of the West coast of US. Keeler finally realizes that Cohen owns the only wire between Chicago & California. Hence, if he sets up the wire gambling business, he will end up controlling the entire West coast within a month. He is 1 week away from setting up his operation.With organization and better planning the unit strikes several successful blows at the heart of Cohen's criminal organization. The media refers to them as \"The Gangster Squad\".\nThe unit takes out Cohen's drug shipment coming from Burbank airport in a daring nighttime operation. Cohen still cannot figure out who is targeting his businesses.After wire-tapping Cohen's house, Keeler deduces the central location of Cohen's wire gambling business, the heart of his empire. The squad successfully burns down the business, but Cohen's men inform him that they didn't take any of his money. Cohen believes they are a group of honest cops working for Bill and believes someone ratted him out and tapped his house. As his men sweep the house for bugs, Grace runs away, fearing Cohen knows of her relationship with Wooters.The Gangster Squad is lured into a trap (by planting false information through the wiretap) in Los Angeles' Chinatown by Cohen's head hit-man Wrevock (Troy Garity), who was also responsible for Pete's death. Wooters interrupts the ambush just in time to save O'Mara, but Wrevock escapes.Karl Lennox (Holt McCallany), Cohen's right-hand man, kills Keeler in the unit's operation. Wooters asks Whalen to get Grace out of town, but Cohen reaches him first, looking for Grace, and kills Whalen. O'Mara's house is later hit by a drive-by, and Connie gives birth to their son under the stress. Chief Parker tells O'Mara, as a result of their failure, that their careers with the LAPD are over.O'Mara gets Connie out of town but refuses to leave with the job unfinished. Grace tells Wooters she is willing to testify against Cohen for Whalen's murder, prompting O'Mara, along with the remaining members of his unit, to go to the Park Plaza Hotel to arrest Cohen.Cohen and his men engage in a firefight with the police unit, with Wooters being wounded in the process after killing Wrevock. Cohen and Lennox escape, but O'Mara pursues them, which results in their vehicle crashing into a fountain. Kennard gets shot by Lennox, but manages to kill him with help from Navidad, before dying from his wounds.O'Mara prepares to arrest Cohen, but Cohen tempts him into fighting each other in a bare-knuckle boxing match, while a crowd of onlookers and journalists gather. O'Mara finally beats Cohen and has him arrested, ending his reign as a crime boss and the spread of the mafia into the Los Angeles area.The Gangster Squad was never mentioned in taking down Cohen, their surviving members remaining a secret. Cohen is sentenced to 25 to life at Alcatraz and is welcomed violently by Whalen's friends. Grace and Wooters continue their relationship, while Navidad and Harris become partners on the force. O'Mara quits to live a quiet life with his wife and son.",
	"links": [
		"https://www.amazon.com/Gangster-Squad-Blu-ray-Josh-Brolin/dp/B07FXPPKN3"
	]
}