{
	"title": "Dredd",
	"release_year": "2012",
	"runtime": "95",
	"tags": [
		"Action",
		"Crime",
		"Sci-Fi"
	],
	"rating": 7.1,
	"actors": [
		"Karl Urban",
		"Olivia Thirlby",
		"Lena Headey",
		"Rachel Wood",
		"Andile Mngadi",
		"Porteus Xandau",
		"Jason Cope",
		"Emma Breschi",
		"Rakie Ayola",
		"Tamer Burjaq"
	],
	"staff": [
		"Pete Travis",
		"John Wagner",
		"Carlos Ezquerra",
		"Alex Garland",
		"Alex Garland",
		"Andrew Macdonald",
		"Allon Reich",
		"Paul Leonard-Morgan",
		"Anthony Dod Mantle",
		"Mark Eckersley",
		"Denton Douglas",
		"Kate Dowd",
		"Sarah Finn",
		"Dennis John Jackman",
		"Mark Digby"
	],
	"votes": 298075,
	"cover": "https://m.media-amazon.com/images/M/MV5BODkyNDQzMzUzOF5BMl5BanBnXkFtZTcwODYyMDEyOA@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The future United States in 2080 is an irradiated wasteland known as the Cursed Earth. On the east coast lies Mega-City One, a violent metropolis with 800 million residents and 17,000 crimes reported daily. Outside the walls of the city is vast desert. Mega-City One is a cursed city stretching from Boston to Washington DC. An unbroken concrete landscape. The city thrives on its mega-structures like the mega-blocks and the mega-highways.\nThere, an addictive new drug called \"Slo-Mo\" has been introduced, which slows the user's perception of time to 1% of normal. The city is breaking down under its own weight. Citizens fear the gangs, who rule with guns and violence.The only force for order is the Judges (from the Hall of Justice), who act as judge, jury and executioner. The entire city is observed by multiple sources of video and audio feeds. The control room uses AI to identify perpetrators and areas of violence and effectively guides the Judges to the sections where they are needed.\nJudge Dredd is shown to be ruthless, but methodical. He refuses to negotiate with criminals, has a cool and composed mind during hostage situations, and has an unflinching aim that allows him to minimize collateral damage while taking out perpetrators.Judge Dredd (Karl Urban) is tasked by the Chief Judge (Rakie Ayola) with evaluating new recruit Cassandra Anderson (Olivia Thirlby), a powerful psychic who failed the aptitude tests to be a Judge at the age of nine. Anderson is an orphan who lost her parents at age 7. Anderson was entered into the academy on special instruction. Even at academy, she was borderline, and her final score was 3 percentile points below a pass.\nChief Judge believes that Anderson's powerful psychic abilities (she is the most powerful psychic that the Academy has come across by a huge margin) can help in the Judges' failing war against crime. Anderson can access the minds and memories of anyone nearby by using her abilities. Dredd's job is to test her in the field and make a report.\nDredd warns Anderson that disobedience, incorrect sentencing, or being disarmed will result in an automatic failure. 1 in 5 Judges don't survive the first day. 12 serious crimes are reported every minute. The Judges Hall has the capacity to respond to about 6% of those.In Peach Trees, a 200-storey slum tower block, drug lord Madeline Madrigal (Lena Headey), also known as \"Ma-Ma\", executes three rogue drug dealers by having them skinned, infused with Slo-Mo and thrown down the atrium from the top floor.\nDredd and Anderson are sent in to investigate and learn of a drug den, which they raid. The block has 75,000 residents, unemployment rate of 96% and the highest crime rate in sector 13. Half the residential levels in the building are classified as slums.\nThey know that Ma-Ma rules the block. She is an ex-prostitute from the S9 pleasure district. She was sliced in the face by her pimp. She quit after she feminized the guy with her teeth. She over her pimp's business and never looked back. Ma-Ma arrived in the block a few years ago and eliminated the 3 gangs who operated from there. Now, she controls all 200 floors of the block. The 3 victims are registered to level 39 and the Judges go there. Anderson is not wearing a helmet as it can interfere with her psychic abilities.\nThey arrest a thug named Kay (Wood Harris), whom Anderson's mind probe reveals to be the one who carried out the drug dealers' execution. Dredd decides to take him in for questioning. In response, Ma-Ma's forces seize the tower's security control room and seal the building, using its blast shields under the pretense of a security test, preventing the Judges from leaving or summoning help.Ma-Ma orders Dredd and Anderson killed, and the Judges fight their way through dozens of armed thugs. Arriving at the 76th floor, the Judges are assaulted by Ma-Ma and her men with Vulcan cannons that rip through the walls, killing numerous residents. The Judges breach an outer wall and are able to call for backup. Meanwhile, Ma-Ma sends her henchman Caleb (Warrick Grier) to confirm the Judges' deaths, but when they meet, Dredd throws Caleb off the tower in full view of Ma-Ma.Angered by the innocent deaths caused during Ma-Ma's assault, Dredd beats Kay for information, deducing she is desperate to prevent him from being interrogated. Anderson intervenes and uses her psychic abilities to read Kay's mind, learning that Peach Trees is the center of Slo-Mo production and distribution. Anderson suggests they hide while awaiting assistance, but Dredd insists, they move up the tower and pursue Ma-Ma.\nJudges Volt (Daniel Hadebe) and Guthrie ( Francis Chouler) respond to Dredd's call, but Ma-Ma's computer expert (Domhnall Gleeson) denies them entry by persuading them the call is part of the security drill. A pair of armed teens confront Dredd and Anderson, allowing Kay to disarm and overtake Anderson. Kay then escapes with her as hostage and brings her to Ma-Ma's base on the top floor.While Dredd works his way towards Ma-Ma, she calls in the corrupt Judges Lex (Langley Kirkwood), Kaplan (Michele Levin), Chan (Karl Thaning) and Alvarez (Edwin Perry). The four relieve Volt and Guthrie from duty and are allowed into the building. Dredd encounters Chan and is suspicious that he does not ask about Anderson's status. Seeing his cover blown, Chan attacks Dredd, who kills him.Meanwhile, Kay tries to execute Anderson with her own weapon, but the pistol's DNA scanner does not recognize him and blows his arm off. Anderson escapes and later encounters Kaplan, whom she promptly kills after reading her mind. Elsewhere, Dredd kills Alvarez but runs out of ammunition, and is shot by Lex in the abdomen. Lex moves in to execute Dredd, but Dredd stalls him long enough for Anderson to arrive and kill Lex.Anderson and Dredd obtain the code to Ma-Ma's apartment from her computer expert and confront her. Ma-Ma tells Dredd that in the case of her death, a device on her wrist will detonate explosives on the top floors, destroying the building. Dredd reasons that the detonator's signal will not reach the explosives from the ground floor, so he forces Ma-Ma to inhale Slo-Mo and throws her down the atrium to her death.In the aftermath, Anderson accepts that she has failed her evaluation by getting disarmed, and leaves. The Chief Judge asks Dredd about Anderson's performance; he responds that she has passed.",
	"links": []
}