{
	"title": "The Lost City",
	"release_year": "2022",
	"runtime": "112",
	"tags": [
		"Action",
		"Adventure",
		"Comedy",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Sandra Bullock",
		"Sandra Bullock",
		"Channing Tatum",
		"Channing Tatum",
		"Daniel Radcliffe",
		"Da'Vine Joy Randolph",
		"Brad Pitt",
		"Oscar Nuñez",
		"Patti Harrison",
		"Bowen Yang",
		"Stephen Lang",
		"Joan Pringle"
	],
	"staff": [
		"Aaron Nee",
		"Adam Nee",
		"Oren Uziel",
		"Dana Fox",
		"Adam Nee",
		"Aaron Nee",
		"Sandra Bullock",
		"Liza Chasin",
		"Seth Gordon",
		"Pinar Toprak",
		"Jonathan Sela",
		"Craig Alpert",
		"Miguel Fernandez",
		"Tricia Wood",
		"Jim Bissell"
	],
	"votes": 163828,
	"cover": "https://m.media-amazon.com/images/M/MV5BZjA4YmZjMWItZGNkNS00ODFkLWEwNjUtNGNhMzViZDRmMzgxXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Dr. Loretta Sage (Sandra Bullock) writes romance-adventure novels centered around a fictional heroine, Dr. Angela Lovemore, and her romantic interest, Dash McMahon. To promote the latest book on Lovemore, her publisher, Beth Hatten (Da'Vine Joy Randolph), insists that Loretta embark on a book tour with Alan Caprison (Channing Tatum), the book's cover model for Dash (a dimwitted cover model for Loretta's novel The Lost City of D), despite her reclusive nature since the death of her husband.Beth has hired Allison (Patti Harrison) as Loretta's social media manager. Allison annoys Loretta as she is always taking pics or making videos of her.After a disastrous start, mostly due to the popularity of Alan's Dash persona (Dash is the crowd favorite, who clearly want sexy. While Loretta is the more intellectual type. When the crowd asks Loretta to rip off Alan's shirt, who does so, but removes his wig as well. she also announces that Alan's character Dash will be killed at the beginning of her next novel), Loretta is taken by Abigail Fairfax (Daniel Radcliffe), a billionaire who realizes that Loretta based her books on actual historic research she did with her late archaeologist husband. He discovered a lost city on a remote Atlantic Island and is convinced the Crown of Fire, a priceless treasure, is located there. When she declines to help decipher an ancient map to the treasure, Fairfax, fearing an active volcano will destroy the site, chloroforms and takes Loretta to the island.Alan, who is secretly enamored with Loretta, witnesses her kidnapping. He recruits Jack Trainer (Brad Pitt), a former Navy SEAL turned CIA operative, to meet him on the island (Jack suggests to Alan to use Loretta's phone (which was with Beth) and locate her smartwatch which indicates that she is in the middle of the Atlantic) and coordinate a rescue.Meanwhile Abigail's local contact Rafi is not happy as he believes Abigail excavating the lost city on the Island is disrespecting the heritage of his people. Loretta tries to stall Abigail by not translating the parchment that seems to have the location of the tomb and thus the crown.\nJack, with no assistance from Alan, breaches Fairfax's compound and frees Loretta, but is shot in the head before they can make it to the airport, forcing Loretta and Alan to escape into the jungle. But Alan panics while driving, throwing Loretta out of the car. When Alan goes to save her, the car falls into a ravine and is destroyed. Loretta had taken the parchment, thereby forcing Abigail to pursue her into the jungle.Meanwhile Beth contacts the local police, who say that the case is out of their jurisdiction. She contacts the FBI who refuse to believe her story. Beth makes her way to the Island herself. From Hawaii, the next scheduled flight to the nearby main island is after 24 hours, so she hitches a ride with Oscar (Oscar Nunez), an eccentric cargo plane pilot, who is enamored with Beth.\nBeth reaches the nearby main island and forces the police there to launch a rescue mission to the island where Loretta was taken.Loretta and Alan spend a day fighting off Fairfax's men (Loretta knows that they are being tracked and she enters a river to remove her tracks. But Rafi is wise and follows her trail even in the water. Lorette finds a waterfall with more cave paintings that depict the location of the crown. She finds more clues, but still not the exact location) before reaching a nearby village, where upon hearing a folk song from a local, Loretta deduces that the crown is hidden in a Cenote (is a natural pit, or sinkhole, resulting from the collapse of limestone bedrock that exposes groundwater) in the jungle. Before they can leave however, Fairfax captures her again, so a chase by Alan to save Loretta ensues. The two are then forced to share the treasure's location with Fairfax.Upon reaching the location, they discover the tomb is not a monument to Taha and Calaman's power, but a hiding place for the queen to grieve for her husband. Her Crown of Fire was made of red seashells gathered by him as a sign of his love for her. The actual treasure of the legend was not a priceless jewel but the inseparable love between the king and queen.Infuriated, Fairfax forces Loretta and Alan into the tomb as the volcano erupts (Rafi believes that the queen's soul is angry for her tomb has been disturbed and this is setting off the volcano), but Rafi (Héctor Aníbal), one of the men, has a change of heart and leaves a crowbar to help them escape before abandoning Fairfax on the island. Beth arrives with the local coast guard and Fairfax is arrested.Loretta's next book, based on her adventure with Alan, is a hit, and they share a kiss at the end of their next book tour.\nIn a mid-credits scene, Jack, having survived the bullet in his head, attends a yoga class alongside Loretta and Alan, surprising them.",
	"links": [
		"https://www.amazon.com/Lost-City-Adam-Nee/dp/B0DCZYFK11"
	]
}