{
	"title": "47 Ronin",
	"release_year": "2013",
	"runtime": "128",
	"tags": [
		"Action",
		"Drama",
		"Fantasy",
		"amazon"
	],
	"rating": 6.2,
	"actors": [
		"Keanu Reeves",
		"Hiroyuki Sanada",
		"Kô Shibasaki",
		"Tadanobu Asano",
		"Min Tanaka",
		"Jin Akanishi",
		"Masayoshi Haneda",
		"Hiroshi Sogabe",
		"Takato Yonemoto",
		"Hiroshi Yamada"
	],
	"staff": [
		"Carl Rinsch",
		"Chris Morgan",
		"Hossein Amini",
		"Walter Hamada",
		"Pamela Abdy",
		"Eric McLeod",
		"Ilan Eshkeri",
		"John Mathieson",
		"Stuart Baird",
		"Denise Chamian",
		"Priscilla John",
		"Ania O'Hare",
		"Travis Hancock",
		"Jan Roelfs"
	],
	"links": [
		"https://www.amazon.com/47-Ronin-Keanu-Reeves/dp/B00J0HCTDK"
	],
	"votes": 173003,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTc0MjE2NzE0OV5BMl5BanBnXkFtZTgwNTU5MjE1MDE@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "Ronin is a Samurai who has failed to uphold his mission. A disgraced being with no place in Japanese society.\nIn late medieval Japan, Kai (Keanu Reeves) is a half-Japanese, half-British outcast who lives in the domain of Ako, ruled by the benevolent Lord Asano Naganori, who found a young Kai lost in the forest and accepted him into his household. Many believed that Kai was raised by the Tengu, daemons of the forest, who taught Kai their fighting ways and mysteries. In time Kai grows up to be an expert tracker of animals in the forest. Despite being scorned by the samurai due to his lowborn status and mixed ancestry, Kai falls in love with Asano's daughter, Mika.Before a visit from Shogun Tokugawa Tsunayoshi, Lord Asano is visited by the Shogun's master of ceremonies, Lord Kira, who becomes attracted to Mika. He arranges a duel for the entertainment of the Shogun between his best warrior, the Lovecraftian Samurai, and one chosen by Oishi, principal counselor to Lord Asano. Ako's champion, Yasuno, is found by Kai to be incapacitated before the duel by the sorceress Mizuki, working for Lord Kira. Mizuki has the power to don the shape of any animal she wishes & uses this ability to spy on Asano's men & domain. Kira is also the head of a province rivaling Ako's & wants to take over Ako's lands. Kai recognizes Mizuki to be a witch, & reports the same to Oishi, who simply dismisses him & does not take him seriously.Kai secretly dons Yasuno's armor and fights the Lovecraftian Samurai, but his disguise is broken, and he is sentenced to punishment. The Sholgun had ordered Kai to be killed, but only relents when Mika intervenes & begs for pardon for Kai. Later that night, Mizuki bewitches Asano into believing Kira is sexually assaulting Mika, causing Asano to attack an unarmed Kira in delirium.While the offense for attacking a Shogunate official is execution, the Shogun allows Asano to die with honor through Seppuku, grants the domain of Ako to Lord Kira, and brands Oishi and his men Ronin. Kira demands Mika's hand in marriage on the spot, but the Shogun grants her one year to mourn the death of her father and forbids the Ronin of Ako from seeking vengeance. To ensure there is no interference, Kira imprisons Oishi in an outdoor pit to break his spirit.Nearly a year later Oishi is released by Lord Kira's men. He reunites with his family and asks his son Chikara to aid him in reuniting the Ronin-including Kai, who has been sold into slavery. Oishi finds Kai in the fighting pits of the Dutch colony of Dejima. In search for swords to arm themselves, Kai leads them to the Tengu Forest, a mystical place he escaped from as a child. Kai instructs Oishi to never draw his sword while in the Tengu temple and continues alone to another room to face the Tengu Master, who once trained Kai in the fighting ways of the Tengu.While Kai fights the Tengu Master in a battle of wills, Oishi watches his men being slaughtered by the Tengu. Oishi follows Kai's advice to never draw his sword and the illusion vanishes when Kai is victorious in his duel, the Ronin are given Tengu swords. Armed with their new weapons, the Ronin plan to attack Kira on his pilgrimage to a shrine as he seeks blessings for his wedding to Mika. The procession is a trap, and the group is ambushed by Kira's forces led by Mizuki and the Lovecraftian Samurai. Several of the Ronin are killed, and Mizuki, believing to have slaughtered them all, takes Oishi's sword and presents it to Lord Kira as a trophy. Mizuki later taunts Mika with their deaths and attempts to manipulate Mika into despair and suicide.Having survived the attack, Oishi and Kai rally the remaining survivors. With help of a band of traveling performers loyal to the memory of Lord Asano, Kai and Oishi infiltrate Kira and Mika's wedding ceremony, giving Mika an opportunity to flee as the Ronin scale the walls and attack Kira's men. As the Ronin are fighting for their lives, the Lovecraftian Samurai is destroyed by a gunpowder explosion, and the battle turns against Kira's men. Kai and Mika attempt to escape together, but are attacked by Mizuki, who takes the form of a dragon. Kai draws on the mystical powers of the Tengu he possesses and ends her life. Oishi emerges with Kira's severed head, and Kira's men surrender.Surrendering themselves to Shogunate authority, the Ronin are sentenced to death as they explicitly violated the Shogun's command to not seek revenge. However, the Shogun finds that they followed the principles of Bushido in their actions, restoring their honor as samurai. Instead of being executed as criminals, the Ronin are commanded to perform Seppuku, dying with their honor restored, and are given the additional honor of burial with their master. As the Ronin prepare for Seppuku, the Shogun pardons Oishi's son from death, so as to preserve such a noble bloodline for the country; the rest stoically take their own lives."
}