{
	"title": "Iron Man Three",
	"release_year": "2013",
	"runtime": "130",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Robert Downey Jr.",
		"Guy Pearce",
		"Gwyneth Paltrow",
		"Don Cheadle",
		"Rebecca Hall",
		"Jon Favreau",
		"Ben Kingsley",
		"James Badge Dale",
		"Stephanie Szostak",
		"Paul Bettany"
	],
	"staff": [
		"Shane Black",
		"Drew Pearce",
		"Shane Black",
		"Stan Lee",
		"Don Heck",
		"Kevin Feige",
		"Brian Tyler",
		"John Toll",
		"Peter S. Elliot",
		"Jeffrey Ford",
		"Sarah Finn",
		"Bill Brzeski"
	],
	"votes": 910727,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjIzMzAzMjQyM15BMl5BanBnXkFtZTcwNzM2NjcyOQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Tony Stark (Robert Downing Jr) recalls a New Years Eve party in 1999 with scientist Maya Hansen (Rebecca Hall), inventor of Extremis, an experimental regenerative treatment intended to allow recovery from crippling injuries. This was also where Tony ran into Yinsen (Shaun Toub) for the first time.\nDisabled scientist Aldrich Killian (Guy Pearce) offers them a place in his company Advanced Idea Mechanics (AIM), but Stark arrogantly rebuffs him. Tony sends Killian to the roof and asks him to wait for him there. Tony forgot all about Killian and unknown to Tony, Killian waited for him the entire night, and his hatred for Tony was cemented that day.\nHansen's work is still incomplete as there is a glitch in her treatment which causes the plants that have received treatment to explode.\nYears later: Stark's experiences during the alien invasion of New York give him panic attacks.Restless, he has built several Iron Man suits, creating friction with his girlfriend Pepper Potts (Gwyneth Paltrow). Tony's latest generation of suits respond to micro implants in his body, and he can summon them from a great distance.\nA string of bombings by terrorist the Mandarin (Ben Kingsley) has left intelligence agencies bewildered by lack of forensic evidence. There have been 9 bombings so far, but no identifiable bomb parts were found on any of the attack sites.\nKillian reaches out to Potts and demonstrates the Extremis technology to her. Turns out Potts knew Killian from before and has a thing for him. Killian claims that the Extremis technology has the ability to re-code human DNA. Potts sees the ability of Extremis to turn humans into weapons and turns down Killian's offer to collaborate.Happy finds Killian suspicious and starts tracking his associate, Eric Savin. Happy follows Eric into a crowded market, where he sees Eric talking and giving a briefcase to a military veteran. Happy confronts the veteran and picks up a hardware capsule from the case, when he is confronted by Eric. Happy punches Eric and breaks his nose, but it repairs instantly.\nThe veteran ingests the capsule and soon starts glowing and eventually blows up.Stark Industries security chief Happy Hogan (Jon Favreau) is badly injured in the attack which is blamed on Mandarin after a video is released with Mandarin taking responsibility for the blast. Once again, no bomb parts were found at the site. Tony recreates the site digitally and finds dog tags.\nTony cannot speak to Happy as he is comatose. Stark overcomes his stupor and issues a televised threat to the Mandarin, who responds by destroying Stark's home with helicopter gunships.\nPotts and Hansen, who had come to warn them, survive the attack.Stark then finds himself in rural Rose Hill Tennessee after his artificial intelligence JARVIS (Paul Bettany) followed a flight plan from Stark's investigation into the Mandarin. Rose Hill was the location of another blast, which had a heat signature to the one where Happy was hurt. Both blasts generated heat more than 3000 degrees, and, in both cases, a military veteran was involved.\nStark's experimental armor lacks sufficient power to return to California, and the world believes him dead.Teaming with Harley (Ty Simpkins), a precocious 10-year-old boy, Stark investigates the remains of a local explosion bearing the hallmarks of a Mandarin attack. He finds that the military veterans involved in both explosions were linked to AIM, Killian's company.\nBy hacking into AIM systems, Tony discovers the \"bombings\" were triggered by soldiers subjected to Extremis, which at this stage of development can causes certain subjects to explosively reject it. After veterans started exploding, their deaths were used to cover up Extremis' flaws by manufacturing a terrorist plot.\nStark witnesses Extremis firsthand when Mandarin agents Ellen Brandt (Stephanie Szostak) and Eric Savin (James Badge Dale) attack him. Stark manages to kill Ellen, but Eric revives himself after being shot by Stark.With Harley's help, Stark traces the Mandarin to Miami and infiltrates his headquarters using improvised weapons. Inside he discovers the Mandarin is actually a British actor, Trevor Slattery, who claims to be oblivious to the actions carried out in his name.\nThe Mandarin is a creation of Killian, who appropriated Hansen's Extremis research as a cure for his own disability and expanded the program to include injured war veterans.Meanwhile Hansen tells Potts that she believes Killian is working for the Mandarin.\nAfter capturing Stark, Killian reveals he is the true Mandarin; he has kidnapped Potts and subjected her to Extremis, intending to infuse her with superhuman abilities and turn her against Stark as leverage to gain Stark's aid in fixing Extremis' flaws. Killian kills Maya when she has a change of heart about the plan.Killian has also manipulated American intelligence agencies regarding the Mandarin's location, luring James Rhodes (Don Cheadle) the former War Machine, now re-branded as the Iron Patriot, into a trap to steal the armor.\nStark escapes and reunites with Rhodes, discovering that Killian intends to attack President Ellis (William Sadler) aboard Air Force One. Remotely controlling his Iron Man armor, Stark saves some surviving passengers and crew but cannot stop Killian from abducting Ellis. They trace Killian to an impounded oil-drilling platform where Killian intends to kill Ellis on live television. The vice president will become a puppet leader, following Killian's orders in exchange for Extremis to cure his own little girl's disability.On the platform, Stark goes to save Potts, and Rhodes saves the president. Stark summons each of his Iron Man suits (which were earlier buried under the debris of his destroyed apartment), controlled remotely by JARVIS, to provide air support. Rhodes secures the president and leads him to safety, while Stark discovers Potts has survived the Extremis procedure. However, before he can save her, a rig collapses around them and she falls to her apparent death. Stark confronts Killian and traps him in an Iron Man suit that self-destructs but fails to kill him. Potts, whose Extremis powers allowed her to survive her fall, intervenes and kills Killian.After the battle, Stark orders JARVIS to destroy each Iron Man suit as a sign of his intention to devote more time to Potts. The vice president and Slattery are arrested. With Stark's help, Potts' Extremis effects are stabilized, and Stark undergoes surgery to remove the shrapnel embedded near his heart. He pitches his obsolete chest arc reactor into the sea, musing he will always be Iron Man, even without his armor.In a present-day post-credits scene, Stark wakes up Dr. Bruce Banner, who fell asleep listening at the beginning of Stark's story.",
	"links": [
		"https://www.amazon.com/Iron-Man-Plus-Bonus-Content/dp/B00EB6ENXO"
	]
}