{
	"title": "Yip Man 2",
	"release_year": "2010",
	"runtime": "108",
	"tags": [
		"Action",
		"Biography",
		"Drama",
		"amazon"
	],
	"rating": 7.5,
	"actors": [
		"Donnie Yen",
		"Xiaoming Huang",
		"Sammo Kam-Bo Hung",
		"Lynn Xiong",
		"Kent Cheng",
		"Darren Shahlavi",
		"Darren Shahlavi",
		"Yu-Hang To",
		"Charles Mayer",
		"Ka-nin Ngo",
		"Calvin Ka-Sing Cheng"
	],
	"staff": [
		"Wilson Yip",
		"Tai-Lee Chan",
		"Hiu-Yan Choi",
		"David Tadman",
		"Edmond Wong",
		"Ann An",
		"Xin Lee",
		"Raymond Pak-Ming Wong",
		"Kenji Kawai",
		"Hang-Sang Poon",
		"Ka-Fai Cheung",
		"Ean Tang",
		"Kwok-Keung Mak"
	],
	"votes": 112068,
	"cover": "https://m.media-amazon.com/images/M/MV5BYzEzYTBmYjgtNjQzMi00YmNiLTkyZGItOGFhMzEzOWY3MjI4XkEyXkFqcGc@._V1_QL75_UX190_CR0,6,190,281_.jpg",
	"description": "Wing Chun master Ip Man (Donnie Yen) and his family move to Hong Kong in the mid-1940s after their escape from Japanese-occupied Foshan. There, Ip desires to open a school to propagate his art, as well as make a living during the difficult times, but he has difficulty attracting students due to his lack of reputation in the city. One day, a young man named Wong Leung (Huang Xiaoming) appears and promptly challenges Ip to a fight, but is easily defeated. Wong leaves humiliated, only to return with some friends to gang up on him. Ip beats them as well. Stunned and impressed by his skills, Wong and his friends become Ip's first students, bringing more disciples to help the school thrive.Wong is later caught posting promotional posters for the school by some Hung Ga students. One of them challenges Wong to a fight and loses, but his friends take Wong hostage in revenge and demand a ransom from Ip. Ip goes to the local wet market as directed, but the meeting ends in a confrontation with a growing mob of Hung Ga students. Ip and Wong fight their way outside to meet Jin Shanzhao, a martial artist and former bandit, who comes to their rescue with his own gang. The students' master and head of the coalition of Hong Kong martial arts clubs, Hung Chun-Nam (Sammo Hung), arrives to break up the fight. Ip introduces himself, and Hung informs him that before setting up a school, he needs to attend a special fighting ceremony to test his worth. Ip, Wong and Jin are subsequently arrested by Officer Fatso for disturbing the peace but are later released on bail. Hung and Fatso are then shown to be acting as reluctant collectors for the martial arts schools (including Hung's) as part of a protection racket headed by Superintendent Wallace, a corrupt officer in the Hong Kong police.\nHung tells IP Man that to open his school Ip would have to attend a ceremony of all martial arts masters in HK and defeat them.Ip attends the ceremony and defeats his first challengers, before striking a draw with the last challenger, Hung. Ip is allowed to keep running his school on the condition that he pay his monthly protection fees, but he declines. Hung thus has his students loiter in front of the Wing Chun School and harass anyone interested, causing a street brawl between them and Ip's disciples. Ip is thus forced to close up and move the school nearer to home. Ip soon confronts Hung, who blames him since he wouldn't pay his protection fees, whereas Ip criticizes Hung's management of his students. Hung insists that he is doing what he must and also insists they finish their fight, but during this encounter, Ip stops Hung from accidentally kicking his son as he suddenly appears, earning respect from him. Ip leaves, and the next day, Hung invites him to a British boxing match he has helped to set up, quietly coming to terms with him.The boxing competition allows for a demonstration by the various martial arts schools to help promote themselves and their Chinese culture. However, the event's star boxer, Taylor \"The Twister\" Miller (Darren Shahlavi), an arrogant, racist and brutal man, openly insults and attacks the students, causing chaos as the masters try to restore order. Hung accepts Twister's challenge to a fight so that he can defend his culture. Although Hung has the upper hand at first due to his wider range of skills, in the second round he suffers a devastating blow that severely disorientates him. As he fights on, he begins to weaken from his asthma and is eventually beaten to death by Twister, as he refuses to concede and allow the man to insult his culture and people. News of Hung's death rapidly spreads throughout the enraged Chinese populace, causing a scandal that spurs Wallace to hold a press conference where he lies that Hung's death was an accident and that he was a weakling who died after a few punches. Twister announces that in order to clear his name he will accept any challenge from the Chinese to participate in a fair, public boxing match, but proceeds to proclaim that he could kill every Chinese boxer in Hong Kong and that he doubts any of the Chinese are brave enough to fight him. Ip Man has already arrived to challenged Twister to a fight.As his wife goes into labor, Ip finishes training and begins his fight with Twister. Ip exchanges blows with the boxer and seems overwhelmed by the westerner's sheer muscle at first, but begins to make a comeback using his more diverse techniques and great speed. He receives an illegal punch from Twister after the second round's bell, and is also told that kicks would not be allowed due to the judges changing the rules during the match. When it looks like the end, Ip remembers Hung's patriotic spirit and is spurred to go on. He changes his strategy and attacks the boxer's arms to disable him. The fight is brought to a climactic finish as Ip Man rains blow after blow into the knocked-down Twister's face, with flashbacks reflecting the latter's killing of Master Hung. While the Chinese celebrate, Wallace is arrested by his superiors for corruption, as Fatso has secretly reported him. Ip then gives a speech to the audience, stating that despite the differences between their race and culture, he wishes for everyone to respect each other regardless of their status. Both the Western and Chinese audience give him a standing ovation while Twister's manager walks away, unhappy at the defeat. Ip goes home and reunites with his family, including his newborn second son, Ip Ching.A final scene shows Ip being introduced to a boy named Bruce Lee who wishes to study Wing Chun in order to \"beat up people he doesn't like\". Ip smiles and simply tells the boy to \"come back when he is older\".",
	"links": [
		"https://www.amazon.com/Ip-Man-2-Legend-Grandmaster/dp/B085W1QVZH"
	]
}