{
	"title": "Jack the Giant Slayer",
	"release_year": "2013",
	"runtime": "114",
	"tags": [
		"Action",
		"Adventure",
		"Fantasy",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Nicholas Hoult",
		"Stanley Tucci",
		"Ewan McGregor",
		"Bill Nighy",
		"Eleanor Tomlinson",
		"Eddie Marsan",
		"Ewen Bremner",
		"Ian McShane",
		"Christopher Fairbank",
		"Simon Lowe"
	],
	"staff": [
		"Bryan Singer",
		"Darren Lemke",
		"Christopher McQuarrie",
		"Dan Studney",
		"David Dobkin",
		"David Dobkin",
		"Ori Marmur",
		"Patrick McCormick",
		"Neal H. Moritz",
		"John Ottman",
		"Newton Thomas Sigel",
		"Bob Ducsay",
		"John Ottman",
		"Nina Gold",
		"Roger Mussenden",
		"Jeremy Rich",
		"Gavin Bocquet"
	],
	"votes": 148400,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjE1NDMxMjI0OV5BMl5BanBnXkFtZTcwMjQyMDExOQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In the Kingdom of Cloister, Jack (Nicholas Hoult), a young farm boy, is fascinated by the legend of Erik, an ancient king who defeated an army of invading giants from a realm in the sky by controlling them with a magical crown (which was crafted from the beating heart of the slain giant). The giants had invaded the Earth by the means of the bean stalk that came from planting a magic bean in the ground. The giants descend upon the Earth & start looting, until Arik with his magic crown orders them back to their abode between heaven and Earth. Years later Erik dies & is buried with the magic crown & the remaining magic beans (the only link between Earth & the giant kingdom). At the same time, Princess Isabelle (Eleanor Tomlinson) becomes fascinated with the same legend.Ten years later, Jack goes into town to sell his horse to support his uncle's farm. There, Jack spots Isabelle and develops a crush on her, after defending her honor from a group of thugs. Meanwhile, Lord Roderick (Who is going to be married to Isabelle) returns to his study, only to find that a monk has robbed him. Roderick had hidden Erik's magic crown in his chambers but finds the beans missing. He orders a lock-down of the city.The monk offers Jack some magic beans he stole from Roderick as collateral for Jack's horse, so that he can escape the lock-down. The monk asks Jack to bring the beans to the abbey for payment. Back at the castle, Isabelle quarrels with her father, King Brahmwell, as she wants to explore the kingdom, but he wants her to stay and marry Roderick. Likewise, Jack's uncle scolds him for being foolish (For accepting beans as collateral against payment for the horse) before throwing the beans on the floor and leaving the house. As Jack collects the beans, one of them falls into the basement.Determined to be free, Isabelle sneaks out of the castle and seeks shelter from the rain, accidentally, in Jack's house. As it rains, one of the beans takes root and grows into a massive beanstalk that carries the house and Isabelle into the sky. Jack tries to rescue her but falls to the ground with Isabelle's bracelet.The next morning, the King's party finds Jack unconscious with Isabelle's bracelet. Jack explains what happened. Roderick realizes that one of the beans got water & grew into a beanstalk.\nJack, Roderick, and Roderick's attendant, Wicke, volunteer to join the king's knights, led by Elmont and his second in-command, Crawe, and climb the beanstalk in search of Isabelle. As they climb, Roderick and Wicke cut the safety rope, intentionally killing some of the knights. At the top, they discover the giants' realm and decide to split into two groups; one with Jack, Elmont, and Crawe, and the other including Roderick and Wicke, but not before Roderick forcibly takes the remaining beans from Jack (although Jack manages to save one for himself).Jack's group is trapped by a giant, who takes everyone prisoner except Jack. Meanwhile, Roderick's group encounters two other giants; one eats Wicke, but before they can do the same to Roderick, Roderick dons the magic crown.Jack follows the giant to their stronghold, where the two-headed giant leader, Fallon, has killed Crawe. There, Jack finds the imprisoned Isabelle and Elmont. As the giants prepare to kill their remaining prisoners, Roderick walks in and enslaves the giants with the crown. He tells the giants they will attack Cloister at dawn and allows them to eat Isabelle and Elmont. Jack rescues Isabelle and Elmont as one of the giants prepares to cook Elmont as a pig-in-a-blanket. The trio makes for the beanstalk, where Jack causes the giant guarding the beanstalk to fall off the realm's edge. Seeing the giant's body, Brahmwell orders the beanstalk cut down to avoid an invasion by the giants.Jack and Isabelle head down the beanstalk, while Elmont stays to confront Roderick. Elmont kills Roderick, but Fallon takes the crown before Elmont can claim it, and Elmont is forced to escape down the beanstalk. Jack, Isabelle, and Elmont all survive the fall after the beanstalk is cut down. As everyone returns home, Jack warns that the giants are using Roderick's beans to create beanstalks to descend down to Earth and attack Cloister.\nThe giants chase Jack, Isabelle, and Brahmwell into the castle, where Elmont fills the moat with oil and sets it on fire. Fallon falls in the moat and breaks into the castle from below. As the siege continues, Fallon captures Jack and Isabelle, but Jack throws the final bean down Fallon's throat, causing a beanstalk to rip apart his body. Jack takes the crown and sends the giants back to their realm.\nJack and Isabelle marry and tell the story of the giants to their children. As time passes, the magic crown is crafted into St Edward's Crown and is secured in the Tower of London.",
	"links": [
		"https://www.amazon.com/Jack-Giant-Slayer-Nicholas-Hoult/dp/B00CIS1OKW"
	]
}