{
	"title": "Inception",
	"release_year": "2010",
	"runtime": "148",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon",
		"netflix"
	],
	"rating": 8.8,
	"actors": [
		"Leonardo DiCaprio",
		"Joseph Gordon-Levitt",
		"Elliot Page",
		"Ken Watanabe",
		"Tom Hardy",
		"Dileep Rao",
		"Cillian Murphy",
		"Tom Berenger",
		"Marion Cotillard",
		"Pete Postlethwaite"
	],
	"staff": [
		"Christopher Nolan",
		"Christopher Nolan",
		"Christopher Nolan",
		"Emma Thomas",
		"Hans Zimmer",
		"Wally Pfister",
		"Lee Smith",
		"Luise Eigner",
		"John Papsidera",
		"Guy Hendrix Dyas"
	],
	"votes": 2591223,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjAxMzY3NjcxNF5BMl5BanBnXkFtZTcwNTI5OTM0Mw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Dominick \"Dom\" Cobb (Leonardo DiCaprio) and business partner Arthur (Joseph Gordon-Levitt) are \"extractors\", people who perform corporate espionage using an experimental military technology to infiltrate the subconscious of their targets and extract information while experiencing shared dreaming. Their latest target is Japanese businessman Saito (Ken Watanabe). The extraction from Saito fails when sabotaged by a memory of Cobb's deceased wife Mal (Marion Cotillard). After Cobb's and Arthur's associate sells them out, Saito reveals that he was actually auditioning the team to perform the difficult act of \"inception\": planting an idea in a person's subconscious.In order to break up the energy conglomerate of ailing competitor Maurice Fischer (Pete Postlethwaite), Saito wants Cobb to plant the idea of dissolving the company into the mind of Fischer's heir, son Robert Fischer (Cillian Murphy). Should Cobb succeed, Saito tells Cobb he will use his influence to clear Cobb of a murder charge, which will allow Cobb to return home and to his children. Cobb accepts Saito's offer. Cobb sets about assembling his team: Eames (Tom Hardy), a conman and identity forger; Yusuf (Dileep Rao), a chemist who concocts the powerful sedative for a stable \"dream within a dream\" strategy; Ariadne (Elliot Page), an architecture student tasked with designing the labyrinth of the dream landscapes; and Arthur. Saito insists on accompanying the team to verify the team's success.When the elder Fischer dies in Sydney, Robert Fischer accompanies the body on a flight back to Los Angeles, which the team uses as an opportunity to isolate Fischer. Cobb sedates him, bringing him into a shared dream with the extractors. Using a \"dream within a dream\" strategy, at each level in the layered dreaming, the person generating the dream stays behind to set up a \"kick\" that will be used to awaken the other sleeping team members who have entered another dream layer deeper. Due to the effects of heavy sedation and multi-layered dreaming, death during the mission will result in entering Limbo, an expanse of infinite raw subconscious. Limbo is a space not dreamed by any one individual but is shared space where one mind can make drastic alterations of any kind.In the first level, Yusuf's rainy downtown dream, the team abducts Fischer; however, Fischer's trained subconscious projections attack, wounding Saito severely. Eames temporarily takes the appearance of Fischer's godfather, Peter Browning (Tom Berenger), to suggest Fischer reconsider his father's will. Yusuf drives the team in a van as they are sedated into the second level, a hotel dreamed by Arthur. Here, the extractors recruit Fischer, convincing him that his kidnapping was orchestrated by Browning and that they are Fischer's subconscious dependency. In the third level, a snowy mountain fortress dreamed by Eames, Fischer is told they are in Browning's subconscious, but they are really going deeper into Fischer's. Yusuf, under assault in the first level, initiates his kick too soon by driving off a bridge, removing the gravity of Arthur's dream world and causing an avalanche in Eames' dream, a kick which all missed. Arthur improvises a new kick using an elevator that will be synchronized with the van hitting the water, while the team in Eames' dream races to finish the job before the new round of kicks.Saito succumbs to his wounds, and Cobb's projection of Mal sabotages the entire plan by killing Fischer, sending them both into Limbo. Cobb and Ariadne enter Limbo to find Fischer and Saito, while Eames remains on his dream level to set up a kick by rigging the fortress with explosives. Cobb reveals to Ariadne that he spent \"50 years\" with Mal in Limbo constructing a world from their shared memories while seemingly growing old together. Returning to the waking world, Cobb and Mal found less than three hours had passed. Convinced she was still dreaming, Mal committed suicide and tried to persuade Cobb to do so too, by incriminating him in her death. Facing a murder charge Cobb fled the U.S., leaving his children behind, ostensibly in the shared care of his mother- and father-in-law, Prof. Stephen Miles (Michael Caine).Through his confession, Cobb attains catharsis and chooses to remain in Limbo to search for Saito. Ariadne pushes Fischer off a balcony, resuscitating him at the mountain fortress, where he enters a safe room to discover and accept the planted idea: that his father wishes him to be his \"own man\", and that splitting up the conglomerate might not be a radical notion. All team members other than Cobb and Saito ride the synchronized kicks back to reality: Ariadne jumps off a balcony in Limbo, Eames detonates the explosives in the fortress, Arthur blasts an elevator containing the team's sleeping bodies up an elevator shaft, and the van in Yusuf's dream hits the water. Cobb eventually finds an aged Saito in Limbo and the two remember their arrangement, presumably shooting themselves and waking to outer-world reality back on the airplane, where the entire team and Robert Fischer have awakened.Upon arriving in Los Angeles, Cobb successfully passes through U.S. customs to his waiting father-in-law, who reunites him with his children. Cobb attempts to determine if he is dreaming or awake by spinning a top but ignores its outcome to instead happily greet his family.",
	"netflix": [
		"belgium",
		"canada",
		"france",
		"germany",
		"india",
		"israel",
		"italy",
		"japan",
		"new-zealand",
		"saudi-arabia",
		"switzerland",
		"turkey"
	],
	"links": [
		"https://www.amazon.com/Inception-Leonardo-DiCaprio/dp/B0047WJ11G",
		"https://www.netflix.com/title/70131314"
	]
}