{
	"title": "Total Recall",
	"release_year": "2012",
	"runtime": "118",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.2,
	"actors": [
		"Colin Farrell",
		"Colin Farrell",
		"Bokeem Woodbine",
		"Bryan Cranston",
		"Kate Beckinsale",
		"Jessica Biel",
		"Bill Nighy",
		"John Cho",
		"Will Yun Lee",
		"Milton Barnes",
		"James McGowan"
	],
	"staff": [
		"Len Wiseman",
		"Kurt Wimmer",
		"Mark Bomback",
		"Ronald Shusett",
		"Dan O'Bannon",
		"Toby Jaffe",
		"Neal H. Moritz",
		"Harry Gregson-Williams",
		"Paul Cameron",
		"Christian Wagner",
		"Debra Zane",
		"Patrick Tatopoulos"
	],
	"votes": 268461,
	"cover": "https://m.media-amazon.com/images/M/MV5BOWYzNDNiYzUtNWMwOS00YmFkLTkzN2UtYmVmOGJlNDdjZWUyXkEyXkFqcGc@._V1_QL75_UY281_CR5,0,190,281_.jpg",
	"description": "At the end of 21st Century, after World War 3 devastates the Earth, the remaining habitable territory is at minimum and is divided into two - the United Federation of Britain (UFB) and the Colony (Australia). Many residents of the Colony travel to the UFB to work in their factories via \"the Fall\", a gravity elevator, which travels through the Earth. A Resistance that operates in the UFB seeks to improve life in the Colony.A factory worker named Douglas Quaid (Colin Farrell) decides to visit Rekall, a company that implants artificial memories. Rekall employee McClane (John Cho) convinces Quaid to be implanted with memories of a secret agent. As Quaid is tested before being implanted, McClane discovers that Quaid has real memories of being a spy. McClane and his co-workers are suddenly gunned down by a SWAT team. Quaid instinctively reacts and kills the officers before escaping.He returns home to his wife Lori (Kate Beckinsale), but Lori attempts to kill Quaid, revealing that she is not his wife of seven years, but an undercover UFB agent who has been monitoring him for the past six weeks. Quaid manages to escape, and Hammond (Dylan Scott Smith), a man claiming to be a former associate, contacts Quaid via a mobile phone embedded in Quaid's hand and directs him to a nearby safe-deposit box. Quaid cuts the phone out of his hand to avoid being traced. In the safe-deposit box, Quaid discovers a recorded message from his former self, leading him to an apartment in UFB.While being pursued, Quaid meets Melina (Jessica Biel), the woman from his recurring dream. She helps him escape and reach the apartment. Once there, Quaid plays a piano to trigger a second recorded message which reveals that Quaid was formerly Carl Hauser, a highly skilled agent working for UFB Chancellor Vilos Cohaagen (Bryan Cranston) & was assigned to infiltrate the resistance & kill Mathias. But After meeting Melina & realizing that he has been fighting for the wrong side, he defects to the Resistance movement, Hauser was captured by the UFB and implanted with false memories.The recording reveals a plot by Cohaagen to use the robotic police force to invade the Colony to provide more living space for UFB, but that Hauser had seen a code that could stop the robotic forces. The code can be recovered from his memory with the aid of the Resistance's leader, Matthias (Bill Nighy). Melina reveals that she was Hauser's lover, but the two got separated when Hauser was captured by the UFB. Melina was shot in the hand during the scuffle & has a scar to show for it. The police soon surround the building, trapping Quaid and Melina. Quaid's friend and colleague from the Colony, Harry (Bokeem Woodbine), arrives and tries to convince Quaid that he is still in a Rekall-induced dream and that killing Melina is the only way to wake up. Quaid is conflicted but decides to shoot Harry instead.Quaid and Melina escape another destructive chase from Lori & travel to meet with Mathias. While Mathias searches the memories of Quaid/Hauser, SWAT teams led by Lori and Cohaagen burst in. Quaid, Melina and Mathias are captured. Cohaagen informs Mathias that Quaid/Hauser was secretly working for him without even knowing it, owing to the alteration of his memories, and that the code was a fake to lure Mathias out of hiding. The whole idea of Qaid/Hauser having defected to the resistance had also been planted in Quaid/Hauser's mind by Cohaagen, Cohaagen kills Mathias and orders Hauser's mind restored, to make Quaid/Hauser loyal again. Cohaagen and Lori then take Melina away. Before Quaid's mind is altered, the mysterious Hammond, posing as a SWAT team member, helps Quaid escape, but Hammond is killed in the process.Cohaagen then launches his invasion of the Colony through the Fall. Quaid arrives at the Fall and manages to sneak aboard. He installs timed explosives within the Fall and searches for Melina. After freeing her, Quaid and Melina manage to climb atop the Fall as it arrives at the Colony. As Quaid and Melina fight the soldiers and Cohaagen, Quaid's explosives detonate. Quaid and Melina jump off the Fall before it plummets beneath the surface with Cohaagen and his army still on board.Waking up in an ambulance, Quaid is greeted by Melina. He notices the absence of a scar on her hand and realizes she is Lori in disguise. Quaid fights Lori and kills her. He and Melina then reunite as an advertisement for Rekall plays in the background.",
	"links": [
		"https://www.amazon.com/Total-Recall-Colin-Farrell/dp/B005LAII3A"
	]
}