{
	"title": "Tomb Raider",
	"release_year": "2018",
	"runtime": "119",
	"tags": [
		"Action",
		"Adventure",
		"Fantasy",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Alicia Vikander",
		"Dominic West",
		"Walton Goggins",
		"Daniel Wu",
		"Kristin Scott Thomas",
		"Derek Jacobi",
		"Alexandre Willaume",
		"Tamer Burjaq",
		"Adrian Collins",
		"Keenan Arrison"
	],
	"staff": [
		"Roar Uthaug",
		"Geneva Robertson-Dworet",
		"Alastair Siddons",
		"Evan Daugherty",
		"Graham King",
		"Tom Holkenborg",
		"George Richmond",
		"Stuart Baird",
		"Tom Harrison-Read",
		"Michael Tronick",
		"Susie Figgis",
		"Gary Freeman"
	],
	"votes": 229849,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTIwNWU2NTEtMDQ0Yi00MjFkLThhN2UtMjJhOGVjN2UyYzFkXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Following the disappearance of her father Richard Croft (Dominic West), Lara Croft (Alicia Vikander) makes a living as a bike courier. Terry (Duncan Airlie James) is Lara's martial arts club operator.\nRichard was an expert on Himiko. He had recorded tapes that detailed his research on the mythical figure of Himiko. Himiko was the first Queen of Japan and a powerful sorceress. She ruled her empire through dark magic. She spread death and destruction through the mere touch of her hand. An army of her own generals bound and gagged Himiko and dragged her to an Island in the middle of the Devil's Sea. There, she remains entombed beneath the mountains. Richard records that he found a map, that records the exact location of Himiko on the Island.Lara participates in a fox hunt for the prize money of 600 Pounds. She has to hang a punctured paint bucket on her bike and evade a group of \"hounds,\" or other bikers. If she can evade till the paint runs out, she wins.\nWhen Lara is arrested after a bike accident involving a police car, Richard's business partner Ana Miller (Kristin Scott Thomas) posts her bail and warns her that if she does not claim her inheritance, her father's estate will be sold off. Richard went missing 7 years ago in Japan, and even the Tokyo police stopped looking for him 5 years ago. Yet, Lara refuses to accept that Richard is dead.Lara reluctantly accepts and she arrives at her father's company to sign the papers. She gains access to her father's office via a key left by him in a puzzle box with the lawyer. There she finds a recorded message from Richard detailing his research into Himiko, the mythical Queen of Yamatai who was said to command the power over life and death. All the stories about her end with rivers running red with blood. The bloodshed only ended when her own generals buried her alive in a tomb. Richard identified the Island as Yamatai. She finds an email from Richard to Lu Ren, wiring him $20,000 to hire a boat to Yamatai.\nRichard warns Lara to destroy all of his research but Lara decides not to so she can investigate further.Not yet having received her inheritance, Lara is forced to pawn the jade pendant her father gave her, for a measly sum of 8000 pounds.\nLara travels to Hong Kong where she hires Lu Ren (Daniel WuDaniel Wu), captain of the ship Endurance, to sail into the Devil's Sea to the island of Yamatai (Lara finds the coordinates written in code in Richard's diary). Lu Ren says that Richard hired his father's boat, and even he has been missing ever since he went with Richard.\nOn the way over, Lara studies all of Richard's research on where the tomb is located, and the coded doors and traps used to prevent anyone from getting near her. Inside the tomb are trials of Himiko, including the Chasm of Souls, The Faces of Himiko, and her army of 1000 handmaidens.The ship capsizes in a violent storm and Lara is washed ashore where she is knocked unconscious. She is revived by Mathias Vogel (Walton Goggins), the leader of an expedition to locate Himiko's tomb. The expedition has been funded by a shadowy organization called Trinity that seeks control over the supernatural, to harness and turn Himiko's power into weapons. Vogel takes Lara prisoner, claiming that he killed her father and intends to use Richard's research (which Lara practically delivered to him by bringing it to the Island) to continue his expedition. Lara escapes with the help of Lu Ren, who also survived the storm and has been put to work with the local fishermen digging for Himiko's tomb. She evades capture, and escapes as she goes over a waterfall, but is seriously wounded in the process and passes out from her injuries.Lara regains consciousness after nightfall and is forced to kill a Trinity guard when she is nearly discovered. She follows a mysterious figure wandering the island and discovers that the figure is her father, who has himself been held captive on Yamatai. After convincing him that she is real, Richard treats her injuries and despite his protests, Lara sets off to recover his research from Vogel's camp. Richard is livid that Lara didn't follow his instructions to destroy his research.\nMeanwhile, using Richard's diary, Vogel has found the entrance to Himiko's tomb but is not able to unlock the door.\nLara makes contact with Lu Ren and he, along with the fishermen, stage distractions, allowing Lara to infiltrate the Trinity camp and recover her father's research.\nIn the ensuing chaos, Richard makes his way to Himiko's tomb but is captured by Mathias, who persuades Lara to open the tomb, something she has prepared for since she was a child. Lara aligns the dials of the tomb one by one and at that point, the entrance to the tomb self-destructs and falls away, allowing them to enter the tomb which has not been seen for over two thousand years.\nRichard realizes that the tomb has not been designed to keep people out, but to trap people from escaping the tomb.The party navigates a series of booby traps and locate Himiko's sarcophagus. Two Trinity soldiers attempt to remove her corpse but become infected by Himiko's \"power,\" which is actually a disease so potent that mere physical contact triggers immediate bodily disintegration.\nLara concludes that Himiko entombed herself for the protection of her people and she was never dragged in there by her Generals. She sacrificed herself to protect the world.\nVogel shoots the infected soldier, concluding that he cannot remove Himiko's body; he instead settles for detaching a finger which he seals in a pouch.\nIn the confusion, Lara and Richard overpower the remaining soldiers, though Vogel escapes and Richard becomes infected. Knowing there is no cure, he proposes destroying Himiko's tomb to prevent the virus from spreading across the world. Lara gives chase to Vogel as Richard sets off a bomb, killing himself and sealing the tomb. Lara confronts Vogel and the two fight and she force-feeds him Himiko's finger before kicking him down a deep chasm just as the infection takes over. She is rescued by Lu Ren and the fishermen, who then commandeer a Trinity helicopter to escape Yamatai.Lara returns to London, where she formally accepts her inheritance and inadvertently discovers that Trinity's front company is actually owned by Croft Holdings. She proceeds to investigate Trinity further among her father's files and begins to suspect that Ana Miller is one of their agents who manipulated her into accepting her inheritance in order to have Lara sign over control of Croft Holdings' business operations to her when Richard Croft stopped cooperating with Trinity. Having witnessed Trinity's ruthlessness firsthand, she prepares for her next adventure to thwart their future plans.",
	"links": [
		"https://www.amazon.com/Tomb-Raider-Nick-Frost/dp/B07B7J6PWZ"
	]
}