{
	"title": "The Greatest Showman",
	"release_year": "2017",
	"runtime": "105",
	"tags": [
		"Biography",
		"Drama",
		"Musical",
		"amazon"
	],
	"rating": 7.5,
	"actors": [
		"Hugh Jackman",
		"Michelle Williams",
		"Zac Efron",
		"Zendaya",
		"Rebecca Ferguson",
		"Austyn Johnson",
		"Cameron Seely",
		"Keala Settle",
		"Sam Humphrey",
		"Yahya Abdul-Mateen II"
	],
	"staff": [
		"Michael Gracey",
		"Jenny Bicks",
		"Bill Condon",
		"Peter Chernin",
		"Laurence Mark",
		"Jenno Topping",
		"John Debney",
		"Joseph Trapanese",
		"Seamus McGarvey",
		"Tom Cross",
		"Robert Duffy",
		"Joe Hutshing",
		"Michael McCusker",
		"Tiffany Little Canfield",
		"Bernard Telsey",
		"Nathan Crowley"
	],
	"votes": 318573,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjI1NDYzNzY2Ml5BMl5BanBnXkFtZTgwODQwODczNTM@._V1_QL75_UY281_CR1,0,190,281_.jpg",
	"description": "P. T. (Phineas Taylor) Barnum (Hugh Jackman) and his troupe performs a show at the circus (\"The Greatest Show\"). As the song continues, the background turns to black, with Barnum singing alone, leading to a flashback to Barnum's childhood where he and his father Philo (Will Swenson), a tailor, worked for the Hallett family (Benjamin (Fredric Lehne) & Hannah (Kathryn Meisle)). Philo and Phineas would travel frequently to the Hallett family own to take measurements and to deliver the final outfits.Phineas Barnum becomes infatuated with their daughter, Charity (Michelle Williams). Benjamin slaps Phineas and warns him to stay away from Charity.\nThough Charity is being sent to finishing school, Barnum reassures her they will not be separated. The two keep in touch through letters until they meet again in adulthood (\"A Million Dreams\"), eventually marrying and raising two daughters, Caroline (Austyn Johnson) and Helen (Cameron Seely), in New York City (\"A Million Dreams\" reprise). Benjamin had warned that Charity would tire of Barnum's life of having nothing and would soon return to his world of riches and comfort.\nThey live a humble life; though Charity is happy, Barnum dreams of more. He feels that he has failed Charity by giving her an ordinary life. Barnum is an amazing storyteller and regales his daughters with new stories every night.Barnum loses his job as a clerk at a shipping company after the company goes bankrupt when all of their dozen trading ships sink in a typhoon in the South China Sea. Barnum had ideas like using gliders in the shipping business, which nobody else had even thought of.\nTaking a risky bet, he takes out a large loan of $10,000 from a bank, deceiving the bank into accepting his former employer's lost ships as collateral. He uses this loan to buy Barnum's American Museum in downtown Manhattan, an attraction showcasing various wax models.\nInitially, sales are slow; on the suggestion of his children to showcase something \"alive\", Barnum searches for \"freaks\" to serve as performers for his museum (\"Come Alive\").\nBarnum adds \"freak\" performers, such as bearded lady Lettie Lutz (Keala Settle), Lord of Leeds (Daniel Everidge) a fat man (who weighed 500 pounds), Strongman (Timothy Hughes), Captain Constentenus (Shannon Holtzapffel) the Tattooed Man, Dog Boy (Luciano Acuna Jr.), Mishay Petronelli (Caoife Coleman) as the Albino Twins, Chang (Danial Son) and Eng Bunker (Yusaku Komori) the Siamese Twins, Deng Yan (Natasha Liu Bordizzo) a Chinese acrobat and blade specialist and dwarf man Charles Stratton (Sam Humphrey).\nThis garners higher attendance, but also protests and poor reviews from well-known critic James Gordon Bennett (Paul Sparks). This prompts Barnum to rename his venture \"Barnum's Circus\". The performers are harassed by the locals, but Barnum stands up for them and protects their rights.\nWith his new riches, Barnum purchases the abandoned mansion where he and Charity used to play as kids. He buys ballet shoes for Caroline and enrolls her in class, like she always wanted. But soon Barnum finds that the upper-class society has not yet accepted them, and even Caroline is made fun of in her ballet class.Searching for ways to further his reputation among the upper class, Barnum meets playwright Phillip Carlyle (Zac Efron) and convinces him to join his venture (\"The Other Side\"). Barnum believes that producing plays with Carlyle will give him respectability and acceptance. Carlyle agrees for a 10% partnership in the circus.\nCarlyle is enchanted with Anne Wheeler (Zendaya), an African American trapeze artist, but he hides his feelings. The public protests against Barnum and his circus grows.\nDuring a trip Carlyle arranged for Barnum and his troupe to meet Queen Victoria (Gayle Rankin), Barnum meets Jenny Lind (Rebecca Ferguson), a famed Swedish singer, whom he convinces to perform in America, with him serving as her manager.\nBarnum offers Lind 20% off the gate receipts. Barnum says that people come to him to live in fantasy and for once, he would like to give them something real.Lind's first American performance is a rousing success (\"Never Enough\"). While Barnum gains favor with the aristocratic patrons (as the whole of New York's high society attends the show), he begins to distance himself from his original troupe, refusing to socialize with them. For Lind's performance, they are made to stand in the gallery, which comes as a shock to Carlyle.\nDejected, they decide to stand against their local harassers (\"This Is Me\").\nBarnum throws out Charity's parents when they come to congratulate him on his success.Carlyle and Wheeler attend the theatre together one night, only to run into Carlyle's parents, who insult Wheeler's lowly status, causing her to leave. Carlyle chases her and tries to convince her that they can be together, but she rejects him despite her feelings towards him (\"Rewrite the Stars\").\nAs Barnum takes Lind on a U.S. tour (for which he has to take out a heavy loan. Barnum risks everything as his original theatre is beginning to falter as people come to see him and he is not there), Charity feels isolated from her husband as she stays home with their daughters (\"Tightrope\").\nWhile on tour, Lind begins falling in love with Barnum. When he refuses her advances, she calls off the tour and kisses him at the end of her last show, which is photographed by the press (\"Never Enough\" reprise).Barnum returns home to find his circus on fire, caused by a fight between the protesters and the troupe. Carlyle, who had tried to save Anne not knowing she had already escaped, is rescued amid the chaos by Barnum but suffers severe burns. Most of the sets and props are destroyed. Word of Lind's cancellation and Barnum's public intimacy also reaches New York, resulting in his mansion being foreclosed upon and Charity taking Caroline and Helen back to her parents' home.Depressed, Barnum retreats to a local pub, where his troupe find him there and persuade him to rebuild the circus. Barnum has an epiphany that causes him to realize the circus was for his friends and family rather than for himself (\"From Now On\").\nMeanwhile, the injured Carlyle wakes in a hospital with Wheeler by his side and they share an intimate moment together.Barnum leaves and finds his estranged wife, and they decide to mend their relationship. Faced with the financial difficulty of rebuilding the circus, the recovering Carlyle steps in, offering to use his earnings from his share of the circus's profits to rebuild it under the condition of becoming partners, which Barnum happily accepts.\nAs rebuilding the circus in its original location would be too expensive, Barnum rebuilds it as an open-air tent circus by the docks. The new, revamped circus is a huge success, and Barnum gives full control of the show to Carlyle so he can focus on his family (\"The Greatest Show\" reprise).",
	"links": [
		"https://www.amazon.com/Greatest-Showman-The-UHD/dp/B07B6CCJ4L"
	]
}