{
	"title": "Star Trek Into Darkness",
	"release_year": "2013",
	"runtime": "132",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.7,
	"actors": [
		"Chris Pine",
		"Zachary Quinto",
		"Zoe Saldana",
		"Benedict Cumberbatch",
		"Leonard Nimoy",
		"Karl Urban",
		"Simon Pegg",
		"John Cho",
		"Anton Yelchin",
		"Bruce Greenwood"
	],
	"staff": [
		"J.J. Abrams",
		"Roberto Orci",
		"Alex Kurtzman",
		"Damon Lindelof",
		"Gene Roddenberry",
		"J.J. Abrams",
		"Bryan Burk",
		"Alex Kurtzman",
		"Damon Lindelof",
		"Michael Giacchino",
		"Dan Mindel",
		"Maryann Brandon",
		"Mary Jo Markey",
		"April Webster",
		"Alyssa Weisberg",
		"Amelia Brooke",
		"Scott Chambliss"
	],
	"votes": 499505,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTk2NzczOTgxNF5BMl5BanBnXkFtZTcwODQ5ODczOQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The USS Enterprise is sent to Planet Nibiru to observe a pre-warp civilization. Captain James T. Kirk (Chris Pine) and Spock (Zachary Quinto) attempt to save the inhabitants from an imminent volcano eruption which would wipe out the civilization. When Spock's life is jeopardized, Kirk breaks the Prime Directive, exposing the Enterprise to the planet's civilization during Spock's rescue. A number of indigenous people begin to worship the ship as it leaves. Called back to Earth, Kirk is demoted to First Officer and Admiral Christopher Pike re-assumes command of the Enterprise. In London, Starfleet agent John Harrison (Benedict Cumberbatch) bombs a secret \"Section 31\" installation. In San Francisco, Pike and his first officer attend an emergency meeting of high-ranking officers at Starfleet headquarters. The meeting is attacked by a gunship piloted by Harrison, who kills Pike. Kirk destroys the gunship, but Harrison flees.With Pike dead, Admiral Alexander Marcus authorizes Kirk to hunt down Harrison, who has used trans warp beaming and fled to the Klingon home world of Kronos. Since Kronos lies deep in Klingon territory and the Federation is on the brink of war with the Klingon Empire, the Enterprise is supplied with 72 long-range prototype photon torpedoes and is ordered to fire them at Harrison's location once he is found. Thinking that the torpedoes could be dangerous to the ship, Montgomery \"Scotty\" Scott refuses to take them aboard and tenders his resignation (which Kirk accepts), whereupon Pavel Chekov is promoted to Chief Engineer. Admiral Marcus' daughter, scientist Carol Marcus (Alice Eve), joins the crew under a false identity.Arriving at the Klingon home world, the Enterprise's warp core malfunctions. With repairs underway, Kirk, Spock and Uhura use a previously commandeered trader ship to reach Kronos. After being detected by Klingon patrol ships, the three are forced to land. Despite Uhura's attempts to negotiate, the Klingons prepare to kill the trio. Harrison wipes out the Klingons in a show of superhuman strength and confronts the landing party, but surrenders after learning the precise number of photon torpedoes aimed at him.Returning to the Enterprise, Harrison reveals his real identity: Khan Noonien Singh, a genetically augmented superhuman, who has been in Cryo sleep for 300 years after his unsuccessful war to have his superhuman comrades rule the Earth. He advises Kirk to examine the 72 prototype torpedoes and also tells him a set of spatial coordinates. Kirk orders Leonard McCoy to examine the torpedoes, and contacts Scotty on Earth to check the coordinates. The torpedoes are found to each contain a genetically engineered human in Cryo sleep - the remaining members of Khan's colleagues. Khan explains that Admiral Marcus awakened him to use his superior intellect and savagery to develop advanced weapons for a war with the Klingons, keeping his colleagues as hostages. He also says that now Marcus wants to kill Khan to erase every trace of his association with a known war criminal. Kirk realizes that the Enterprise's warp core had been sabotaged on Admiral Marcus' orders, making the covert operation to kill Khan a one-way ticket.Scotty arrives at the coordinates and finds a secret Starfleet shipyard, which he infiltrates. The Enterprise's warp core is repaired, but the ship is soon confronted by an unregistered Federation battleship, the USS Vengeance - a massive vessel built for combat which dwarfs the Enterprise. Admiral Marcus reveals himself as the commander of the Vengeance, demanding Kirk hand over Khan. Kirk refuses, and the Enterprise warps toward Earth, to have Khan stand trial.In Earth's orbit, the Enterprise is attacked by the Vengeance. With the Enterprise severely damaged, Kirk offers to hand over Khan and the 72 bodies in Cryo sleep in exchange for the lives of his crew. Marcus refuses, beams his daughter to the Vengeance, and orders the destruction of the Enterprise-when the Vengeance suddenly suffers a complete power outage, caused by Scotty who had boarded the ship at the secret shipyard. As the Enterprise weapons are too damaged to continue the fight and knowing that Khan was the designer of the Vengeance, Kirk allies himself with Khan and boards the ship. They reunite with Scotty and take the bridge. Meanwhile, Spock contacts Spock Prime to learn of Khan's history and how to defeat him. Khan betrays Kirk and takes control of the Vengeance, killing Admiral Marcus. Khan negotiates with Spock, beaming Kirk and his boarding party back to the Enterprise in exchange for the 72 Cryo torpedoes.Khan plans to destroy the Enterprise, but Spock reveals that real - and armed - torpedoes were beamed to the Vengeance, keeping the Cryo pods on the Enterprise. The torpedoes incapacitate the Vengeance and anger Khan, who believes that his 72 colleagues have been killed. Both ships start descending towards Earth's surface. At the cost of his life, Kirk re-aligns the warp core, enabling the crew to regain control of the Enterprise. The Vengeance crashes into downtown San Francisco but does not kill Khan. Khan tries to escape in the chaos but is pursued by Spock. McCoy discovers that Khan's blood may reanimate Kirk and Uhura prevents Spock from killing Khan, capturing him instead.In the aftermath, Kirk is revived and returns to duty as Captain of the Enterprise. Khan is sealed into his Cryo pod and stored away with the rest of his crew. As the film ends, a restored Enterprise is re-christened and departs for a 5-year mission of exploration.",
	"links": [
		"https://www.amazon.com/Star-Trek-Into-Darkness-John/dp/B01LT90AMS"
	]
}