{
	"title": "Booksmart",
	"release_year": "2019",
	"runtime": "102",
	"tags": [
		"Comedy",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Kaitlyn Dever",
		"Beanie Feldstein",
		"Jessica Williams",
		"Jason Sudeikis",
		"Lisa Kudrow",
		"Will Forte",
		"Victoria Ruesga",
		"Mason Gooding",
		"Skyler Gisondo",
		"Diana Silvers"
	],
	"staff": [
		"Olivia Wilde",
		"Emily Halpern",
		"Sarah Haskins",
		"Susanna Fogel",
		"Katie Silberman",
		"Chelsea Barnard",
		"David Distenfeld",
		"Jessica Elbaum",
		"Megan Ellison",
		"Dan The Automator",
		"Jason McCormick",
		"Jamie Gross",
		"Brent White",
		"Allison Jones",
		"Katie Byron"
	],
	"votes": 133381,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjEzMjcxNjA2Nl5BMl5BanBnXkFtZTgwMjAxMDM2NzM@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Amy (Kaitlyn Dever) and Molly (Beanie Feldstein) are two high school seniors who have been best friends since childhood but are considered pretentious by their peers. It's the last day of high school and both girls are headed for Ivy league colleges in the following school year. Molly is the class president and takes her job way too seriously. Jordan Brown is their principal and Miss Fine their class teacher. Nick is the class VP and a jock.Amy has been out for two years and has a crush on a girl named Ryan (Victoria Ruesga); Molly urges Amy to attempt to forge a relationship with her before they graduate. On the eve of their high school graduation, Molly overhears classmates talking about her in the bathroom. She confronts them and tells them she got into Yale, but they reveal that despite partying they too got into good colleges. Stunned, a panicking Molly rages while all her classmates celebrate the end of final year. Molly angrily tells Amy they should have enjoyed their time in high school more. She proposes they go to a graduation party held by Nick (Mason Gooding) at his aunt's house; though initially reluctant, Amy accepts.The pair quickly realize that neither of them knows the address of Nick's party. Molly calls Jared (Skyler Gisondo), a wealthy classmate who likes her, but she considers him a total loser. He brings them to his unattended party on a yacht, where they encounter his drug-crazed friend, Gigi (Billie Lourd), who makes them eat some strawberries. Amy suggests that they go home, having fulfilled their plan to party before graduation, but Molly calls a \"Malala\" (their code for unconditionally doing what the other wants to do), and Amy consents to continue with the night. The girls call a Lyft and are shocked to be picked up by their principal, Jordan Brown (Jason Sudeikis).After the girls accidentally play pornography through his car speakers, Brown drops them off at what they think is Nick's aunt's house. It turns out to be their classmate George's (Noah Galvin) house, who's hosting a murder mystery party. They encounter Gigi again, who reveals that the strawberries they ate on the yacht were drugged. Amy and Molly soon experience a bad trip and hallucinate that they are George's sister's fashion dolls. They escape George's house and get the location of the party from a pizza delivery man Pat (Mike O'Brien) (they are tracking Nick's party on you tube and figure out that they have been ordering pizza from this one shop all night). Amy accidentally leaves her phone in his car. Molly's phone is nearly dead, lasting just long enough to call their teacher, Miss Fine (Jessica Williams), who gives them a change of clothes and a ride to Nick's party.When they arrive, Amy goes to talk to Ryan and Molly goes to talk to Nick, on whom Gigi got her to confess she has a crush. Amy finds Ryan making out with Nick; embarrassed and heartbroken, Amy wants to leave. She finds Molly and calls her own \"Malala\", but Molly refuses to grant it, thinking she has a chance with Nick. This sends Amy into a rage, and she reveals she is taking a gap year to travel to Botswana, as she resents how Molly always tries to control her life. The two loudly argue in front of their classmates, and Amy runs to the bathroom, finding Hope (Diana Silvers), her classmate, already in there. They are at first combative towards each other, but then Amy kisses Hope. They start to have sex, but Amy vomits on her, ruining the moment. Cops show up, and the party-goers scatter. Molly, unable to find Amy, is driven home by Triple A (Molly Gordon), a popular student with a reputation for promiscuity, and the two bond over the stereotypes that both have suffered from.Molly wakes up on graduation day regretting what happened between her and Amy. She discovers on her phone everyone is talking about how cool Amy was for creating a diversion at the party, allowing everyone else to escape the police, and getting herself arrested. Molly visits Amy in jail and apologizes for her manipulative actions, leading to the pair's reconciliation. Molly learns the pizza driver is a serial killer and they trade that information to get Amy out of jail. They take Jared's car to graduation where Molly kisses Jared onstage and gives an improvised valedictorian speech, receiving a standing ovation.A few days later, as Molly helps Amy prepare for her trip to Botswana, Hope comes to the door and gives Amy her number. Molly subsequently drives Amy to the airport, where they share a tearful goodbye. As Molly drives away, Amy jumps in front of her car, saying she has time to hang out before her flight; she suggests they get pancakes, and Molly ecstatically accepts.",
	"links": [
		"https://www.amazon.com/Booksmart-4K-UHD-Kaitlyn-Dever/dp/B08YJM2Z7K"
	]
}