{
	"title": "Horrible Bosses",
	"release_year": "2011",
	"runtime": "98",
	"tags": [
		"Comedy",
		"Crime",
		"amazon"
	],
	"rating": 6.9,
	"actors": [
		"Jason Bateman",
		"Charlie Day",
		"Jason Sudeikis",
		"Steve Wiebe",
		"Kevin Spacey",
		"Lindsay Sloane",
		"Michael Albala",
		"Jennifer Aniston",
		"Jennifer Hasty",
		"Reginald Ballard"
	],
	"staff": [
		"Seth Gordon",
		"Michael Markowitz",
		"John Francis Daley",
		"Jonathan Goldstein",
		"Brett Ratner",
		"Jay Stern",
		"Christopher Lennertz",
		"David Hennings",
		"Peter Teschner",
		"Lisa Beach",
		"Sarah Katzman",
		"Shepherd Frankel"
	],
	"votes": 473217,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzYxNDI5Njc5NF5BMl5BanBnXkFtZTcwMDUxODE1NQ@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Nick Hendricks (Jason Bateman) come to work at a wealthy financial firm at 6:00 am. Nick's boss Dave Harken (Kevin Spacey) has held Nick's promotion for 8 years & Nick has been working 16-hour days to get it. Harken reprimands Nick for being two minutes late that morning.\nMeanwhile, Dale Arbus (Charlie Day) is engaged to Stacie (Lindsay Sloane). At work Dale repels constant sexual harassment by his boss Julia Harris (Jennifer Aniston). Elsewhere, Kurt Buckman (Jason Sudeikis) loves his job. He is the acting second-in-command at Pellitt Chemicals owned by the warm and generous Jack Pellitt. Kurt is hated by Jack's rude, son Bobby Pellitt (Colin Ferrell). Bobby snorts cocaine, at work. Jack suffers an immediate heart attack, killing him.That evening all 3 friends meet at a local bar where they trade horror stories about their bosses. Nick's promotion is in the bag. Kurt is unsure of Bobby. Dale says finding a job is difficult because he is a wrongfully labeled sex offender (after taking a drunken leak on a vacant playground next to a bar one night and getting busted by the cops).\nNext Day, Dave berates Nick for being a drunk before promoting himself to Nick's coveted job. Dave would also blackball Nick from the industry if he decided to quit.Bobby teases Kurt and reveals he intends to sell the company, collect the profits and retire on a tropical beach. He tells Kurt to fire all the fat and disabled people starting with the obviously pregnant \"Large Marge\".\nDale is called into Julia's office. She is practically naked, save for a pair of panties and a lab-coat. She implores that Dale have sex with her. Dale threatens to quit, until Julia brings up that he is a sex offender and nobody else would ever hire him.That evening the three meet again. Kurt and Nick joke about their desire to kill their bosses. Next day Dale finds Stacie in Julia's office, Julia called her up and offered some free dental work as a wedding gift. With Stacie passed out in the dentist's chair, Julie goads Dale into having sex with her ON TOP of Stacie. Dale refuses again.\nThat evening the three meet at Kurt's house. Dale explains that he already has a plan. Dale has gone on Craigslist and hired a \"Wet Work\" specialist. But he turns out a gigolo for fetishists and that \"Wetwork\" is a code-name for a man who urinates on other men for arousal.In Kurt's car he calls directory assistance & asks for directions to the most dangerous part of town. They find a bar & ask for killers-for-hire. The three are run out of the bar by the patrons, and just before leaving they're confronted by Dean \"Motherf****r\" Jones (Jamie Foxx). Jones explains that he just finished a ten-year stint in prison and can help take care of their problem for $30,000. The three reject his offer as too expensive. Jones lowers his asking price to $5,000. The three withdraw all of their collective savings and meet Jones the next night. Jones changes the details of the plan, saying that instead of having him kill their bosses, the three should kill each other's bosses, and that for the low $5K fee, he will act as their murder consultant. The three are clearly upset but they feel threatened by Jones and accept the arrangement.Next day Nick meets with Dale and Kurt and the three of them head to Bobby's house first. As Bobby leaves, the three sneak in but make a mess. Kurt steals Bobby's cell phone with all his schedules, addresses, etc. The three head over to Harken's mansion to look for more dirt on him and to learn his routine. Dale, who is still reeling from the cocaine he inhaled at Bobby's is told to sit in Kurt's car and act as a lookout. Inside, Nick and Kurt look for anything they can use to kill Harken but find that his wife (Julie Bowen) is much younger and more attractive than Harken, which excites Kurt.Unbeknownst to Dale, Harken is taking his nightly walk around the neighborhood. Dale tosses his peanut butter and jelly wrapper out the window. Harken lifts it up but soon inhales a few peanut particles and goes into Anaphylactic shock. Upstairs, Nick and Kurt watch as Harken keels over in the street. Dale takes Harken's EpiPen and repeatedly stabs him in the chest and neck. Nick and Kurt watch in horror as they think Dale is stabbing Harken to death; they both escape, but not before dropping Bobby's cell phone in the master bedroom. Harken's wife arrives. She thanks Dale for saving Harken's life while Harken accuses Dale of being there to sleep with his wife and threatens to kill him. The three escapes, now knowing that Harken has a severe peanut allergy.Dale loads up on peanuts and Nick buys rat poison, which he intends to mix into Bobby's cocaine. Afterward the three head in three separate directions. Dale will kill Harken, Kurt will kill Julia, and Nick will kill Bobby.\nKurt watches as Julia drives home and seductively undresses in her front window. She eats various sexually suggestive foods before inviting Kurt into her home where the two have sex. Nick watches as Bobby exits his home with a couple of hookers. He waits for the most opportune moment to sneak in and tamper with Bobby's cocaine.Harken searches for residue of any man that might have been in his room with his wife. He finds Bobby's phone and heads out. With Harken gone, Dale sneaks into Harken's house, up to his shower and intends to put peanuts in all of his shampoos and soap. Harken arrives at Bobby's house and shoots Bobby twice, killing him. Nick and Dale witness the killing and are freaking out. Nick peels out in his Prius and blows through a couple red traffic lights and is photographed by traffic light cameras.The three fear that their DNA is all over Bobby's apartment and agree that their only course of action is fleeing the country. The three are quickly arrested by the police. At the police station, the interviewing officers ask why Nick was photographed fleeing a crime scene at such a high rate of speed. Nick fibs, saying that he was drag-racing. Police don't have enough evidence to keep them at the station. As they leave, the arresting officer tells them that they're going to send crime scene examiners to Bobby's apartment. This freaks out Kurt who had playfully rubbed all of Bobby's brushes up and down his butt.Kurt finds police waiting outside his apartment. Finding no other recourse, the three return to see \"Motherf****r\" Jones. They tell him about Harken murdering Bobby. Jones tells them to get Harken to confess to the crime and to record it. The three agree that this is the best course of action.\nThey sneak back into Harken's house, where Harken's wife has thrown a surprise party for him. She recognizes Dale & invites them in. The three make their way into the crowd and wait for Harken to arrive. Harken arrives soon and heads into his private office and is followed by Dale and Nick while the ever-horny Kurt sneaks off with Harken's wife.In his home office, Nick and Dale confront the psychopath Harken. They successfully goad him into confessing for Bobby's murder, which excites them both, until they realize that Kurt, and the tape recorder, are not in the room. Harken walks over to his safe, takes out his revolver and tells them that he will kill them next. The three regroup and head out to Kurt's car. Harken jumps into his SUV and heads after them. Harken crashes into them repeatedly, prompting Kurt's Onstar like service to alert him. \"Gregory\" asks if they need assistance, to which Kurt says 'yes'.Gregory calls the police, making the three freak-out. They tell him not to call the police because they're already wanted by the cops. Hearing this, Gregory remote shuts off the car, explaining that he is required by law to not aid fleeing fugitives. The three are soon broad sided by Harken's SUV. Harken steps out, with his gun drawn, and orders the three to get out of the car. He explains that he would love to kill them, like he did Bobby, but he would rather frame them for Bobby's murder. He shoots himself in the leg, wipes his prints and tosses the gun to Dale, who catches it bare-handed. Once Police arrive Dale drops the gun and Harken tells his falsified story.In the midst of the stories, Kurt reveals that his tape recorder must have been recording the whole time. He pulls it out and plays it aloud for all to listen. Instead of Harken's confession he plays the mistakenly recorded sounds of him and Harken's wife having sex in Harken's bathroom, followed by the sound of the car chase, but no confession. \"Gregory\" chimes in from Kurt's car and explains that he had been monitoring and recording Kurt's call ever since the first collision of the car chase. He plays back Harken's confession. Harken is soon cuffed, along with the others, and is dragged to jail.In the epilogue, Harken has just been sentenced to 25-to-life in prison. In his absence Nick has been promoted to Harken's job as President of the company. He arrives to work at a reasonable hour and has nothing but good things to say about his new boss, Company CEO Lou Sherman (Bob Newhart) who isn't nearly as domineering or aggressive as Harken was; that is until Nick hears the pleas of Lou's assistant trapped in his trunk.Kurt returns to his regular job at the Chemical Company where \"Large Marge\" has taken over Bobby's position. He playfully jokes with her, asking when her due date is, causing her to ask \"Due Date?\" (She's fat, not pregnant).However, in the final scene, Dale is back at work at the nasty Julia's office as usual and on this day he's finally agreed to fulfill her nasty fantasies. He tells her that he's sedated the patient in the dentist's chair and that he wants to watch her fondle the patient. She immediately pulls the patients pants down and is about to do more when the patient begins to giggle. The patient pulls back the oxygen mask revealing himself to be Kenny Sommerfeld, who is delighted to be making a buck in such a naughty situation. More so Dale has Julia look out the window where she sees video-pirate \"Motherf****r\" Jones video-taping her encounter. Dale blackmails Julia, explaining that in exchange for keeping the video secret he will require an all-expenses paid two-week honeymoon vacation and no more sexual advances in the office. Overpowered, Julia agrees.",
	"links": [
		"https://www.amazon.com/Horrible-Bosses-Jason-Bateman/dp/B005LJITKI"
	]
}