{
	"title": "The Lorax",
	"release_year": "2012",
	"runtime": "86",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"amazon",
		"netflix"
	],
	"rating": 6.4,
	"actors": [
		"Zac Efron",
		"Taylor Swift",
		"Danny DeVito",
		"Ed Helms",
		"Betty White",
		"Rob Riggle",
		"Jenny Slate",
		"Nasim Pedrad",
		"Joel Swetow",
		"Michael Beattie"
	],
	"staff": [
		"Chris Renaud",
		"Dr. Seuss",
		"Cinco Paul",
		"Ken Daurio",
		"Janet Healy",
		"Christopher Meledandri",
		"John Powell",
		"Claire Dodgson",
		"Steven Liu",
		"Ken Schretzmann",
		"Yarrow Cheney"
	],
	"votes": 132589,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTU1MTAwMjk1NF5BMl5BanBnXkFtZTcwMDI5NDc4Ng@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Twelve-year-old Ted Wiggins lives in Thneedville, a walled city where all vegetation is artificial. Ted, smitten with a teenage girl named Audrey, learns of her dream to see a real tree. Determined to impress her, he seeks out a way to find one. His grandmother, Norma, tells him about the Once-Lee, a reclusive man who knows the truth about what happened to the trees. Ted ventures outside Thneedville, discovering a barren, polluted wasteland. There, he meets the Once-Lee, who agrees to share the story of the trees, but only over multiple visits.As Ted tries to leave town for another visit, he encounters Aloysius O'Hare, the greedy mayor of Thneedville and owner of a bottled air company. O'Hare, whose business thrives on the lack of fresh oxygen, warns Ted to stay away from the Once-Lee, fearing the return of trees could threaten his monopoly. Undeterred, Ted continues his visits.The Once-Lee tells Ted how, as a young inventor, he discovered a beautiful forest of Truffula trees. He chopped down one to create a product called a Thneed. This act summoned the Lorax, the guardian of the forest, who warned the Once-Lee about the consequences of harming the trees. Initially, the Once-Lee heeded the Lorax's plea and harvested Truffula tufts sustainable. However, after his greedy relatives arrived, they convinced him to cut down more trees for profit. The forest was soon destroyed, leading to widespread pollution and the disappearance of the Lorax, who left behind a stone platform engraved with the word \"Unless.\" The Once-Lee's business collapsed, leaving him in isolation and regret.The Once-Lee gives Ted the last remaining Truffula seed, urging him to plant it and restore the trees. Returning to Thneedville, Ted is pursued by O'Hare, who uses the town's surveillance system to track him. With the help of Audrey and his family, Ted escapes and heads to the center of town to plant the seed. O'Hare rallies the townspeople against him, claiming trees are dangerous and unnecessary. In a dramatic act, Ted uses a bulldozer to break a section of the city's wall, revealing the devastated landscape outside. The sight inspires the townspeople, who turn against O'Hare and exile him.Ted plants the Truffula seed, and over time, the land begins to heal. As the forest regrows, the Lorax returns, symbolizing hope and a renewed connection between humanity and nature.",
	"links": [
		"https://www.amazon.com/Dr-Seuss-Lorax-Danny-DeVito/dp/B008K3HRF0",
		"https://www.netflix.com/title/70208102"
	]
}