{
	"title": "The Pale Blue Eye",
	"release_year": "2022",
	"runtime": "128",
	"tags": [
		"Crime",
		"Horror",
		"Mystery",
		"netflix"
	],
	"rating": 6.6,
	"actors": [
		"Christian Bale",
		"Harry Melling",
		"Simon McBurney",
		"Timothy Spall",
		"Toby Jones",
		"Harry Lawtey",
		"Fred Hechinger",
		"Joey Brooks",
		"Charlotte Gainsbourg",
		"Lucy Boynton"
	],
	"staff": [
		"Scott Cooper",
		"Scott Cooper",
		"Louis Bayard",
		"Christian Bale",
		"Scott Cooper",
		"John Lesher",
		"Tyler Thompson",
		"Howard Shore",
		"Masanobu Takayanagi",
		"Dylan Tichenor",
		"Francine Maisler",
		"Stefania Cella"
	],
	"votes": 127836,
	"cover": "https://m.media-amazon.com/images/M/MV5BN2EyM2QyZWUtMzUzOC00YTU4LTg4OGEtZWIwNWZiZjRjY2I3XkEyXkFqcGc@._V1_QL75_UY281_CR18,0,190,281_.jpg",
	"description": "In 1830, alcoholic retired detective Augustus Landor (Christian Bale) is asked by the military to investigate the hanging of Cadet Leroy Fry (Steven Maier) at the United States Military Academy at West Point, New York. Landor is a widower who lives alone since his daughter Mathilde ran off a few years previously.After Fry was hanged, his heart was removed from his body (later when his body was being kept at the academy for an autopsy). The guard protecting Fry's body was relieved of duty at 2 30 am in the morning, by someone claiming to be an officer. The guard didn't see their face but noticed that the bars on their left shoulder were missing.\nIn the morgue, examining the corpse, Landor finds a small fragment of a note clutched tightly in Fry's hand. Also, marks on Fry's neck and fingers suggest that he did not hang himself but was murdered.With the officers' (Superintendent Thayer (Timothy Spall) & Captain Hitchcock (Simon McBurney)) permission, Landor enlists the help of Edgar Allan Poe (Harry Melling), another cadet at the academy who has expressed an interest in the case (Landor had met Poe at Patsy's (Charlotte Gainsbourg) tavern and saw first-hand how passionate he was about the case). Poe tells Landor that Cadet Loughborough (Charlie Tahan) was Fry's roommate and the 2 had a falling out.Poe and Landor deduce from the writing on the note fragment that it was summoning Fry to a secret meeting. The sender of the note wanted to hide his identity and is most likely Fry's murderer. Poe thinks that a mystery woman had summoned Fry for a dalliance. After a cow and a sheep are found in the area, butchered and with their hearts removed, it is deduced that the murder could be linked to black magic rituals. in particular, rituals related to attaining immortality.Landor asks Poe to get close to the doctor Daniel Marquis's son Artemus, who is also a cadet at the academy. Poe learns that Artemus was very close to Fry. At the funeral, Mrs. Fry (Orlagh Cassidy) gives Landor Fry's diary. This diary was mailed to her by cadet Ballinger, who was a friend of Fry. The diary has many coded pages, and Landor spends many hours trying to decipher the writings of Fry.Poe is attracted to Daniel's daughter Lea, but is beaten up by Ballinger, who is also interested in Lea. Only Landor's intervention saves Poe from Ballinger.\nAnother cadet, Ballinger (Fred Hechinger), goes missing and is later found hanged, with both his heart and his genitals removed. A third cadet, Stoddard (Joey Brooks), who was a colleague of the two victims, then disappears, and it is presumed by Landor that this man had reason to believe he was next in line to be killed.Landor and Poe begin to suspect the family of Dr. Daniel Marquis (Toby Jones), who was first brought into the investigation to perform the autopsy on Fry. Particular suspicion is placed on his son Artemus (Harry Lawtey) and his daughter Lea (Lucy Boynton) (who suffers from random seizures). Daniel is married to Mrs. Julia Marquis (Gillian Anderson).While visiting Dr. Marquis's house, Landor finds an old officer's uniform; a man impersonating an officer had been involved in the mutilation of Fry's body. Landor confronts Dr. Marquis, who admits that he had resorted to black magic to cure Lea of her seizures, and initially she appeared to improve.\nPoe is enchanted by Lea and volunteers to do whatever she wants. But he is drugged and wakes to find that Artemus and Lea are about to cut out his heart, in accordance with the ritual to cure Lea. Landor manages to arrive in time to rescue Poe, but the building catches fire and Lea and Artemus die.Thinking that the case is now solved, the military thanks Landor for his service. However, Poe, recovering from his near-death experience, notices that the handwriting on the note fragment found in Fry's hand matches that of Landor. Threading together all the information that he has gathered, it becomes apparent that Landor was in fact the killer of the cadets. Poe confronts Landor with his conclusion.It transpires that two years previously, Landor's daughter Mattie was sexually assaulted by Fry, Ballinger, and Stoddard after attending her first ball. Traumatized by the experience, she later committed suicide by jumping off a cliff. Landor did not disclose this to anyone but pretended that Mattie had run away.Distraught, Landor set out to avenge his daughter. He left the note for Fry, luring him to a lonely spot before hanging him. But a patrol happened to walk by, so Landor was forced to leave the body there. Lea and Artemus later stole the heart for their ritual. After killing Ballinger, Landor mutilated his corpse to make it appear that the cadet had been murdered by the same \"madman\" who had desecrated Fry's body. Landor had learned about Ballinger's involvement in the sexual assault from Fry's diary.Poe tells Landor he has two notes with handwriting samples that can link Landor directly to the murders, but before leaving, Poe burns them. Landor is later seen standing at the cliff where his daughter jumped to her death. He lets her hair ribbon float away in the wind, saying \"Rest, my love\".",
	"links": [
		"https://www.netflix.com/title/81444818"
	]
}