{
	"title": "Men in Black³",
	"release_year": "2012",
	"runtime": "106",
	"tags": [
		"Action",
		"Adventure",
		"Comedy",
		"amazon"
	],
	"rating": 6.8,
	"actors": [
		"Will Smith",
		"Tommy Lee Jones",
		"Josh Brolin",
		"Jemaine Clement",
		"Emma Thompson",
		"Michael Stuhlbarg",
		"Mike Colter",
		"Nicole Scherzinger",
		"Michael Chernus",
		"Alice Eve"
	],
	"staff": [
		"Barry Sonnenfeld",
		"Etan Cohen",
		"Lowell Cunningham",
		"Laurie MacDonald",
		"Walter F. Parkes",
		"Danny Elfman",
		"Bill Pope",
		"Don Zimmerman",
		"Ellen Chenoweth",
		"Bo Welch"
	],
	"votes": 392366,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTU2NTYxODcwMF5BMl5BanBnXkFtZTcwNDk1NDY0Nw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Boris the Animal, last surviving member of the predatory Boglodyte race, escapes from the inescapable LunarMax prison on Earth's moon intent on going back in time to kill Agent K (Tommy Lee Jones), who on July 16 1969, caused the loss of one of Boris' arms and arrested him. On Earth, K learns of the escape after investigating a spaceship crash in the New York City streets and a Chinese restaurant teeming with alien life. While K won't reveal any details to Agent J (Will Smith), he confesses his regret at not having killed Boris in 1969. Meanwhile Boris has reached Earth & attacks the son, Jeffery Price, of the fellow inmate for a device that will allow him to travel back in time & kill K before he took away his arm.Boris arrives at that restaurant (as it has his favorite dish) & attacks J & K. Both escape, but not before Boris tells K that he is already dead. K is very afraid. Late that night when the two agents are in their respective apartments, K calls J seemingly to tell all but remains silent and J hangs up on him. K then makes preparation for an ambush and sets to wait when all traces of him and his apartment disappear. The next morning J goes to talk with K and discovers the world is different. At MIB headquarters, J learns that all other MIB personnel remember K as having been killed in action in the year 1969.Agent O (Emma Thompson), the new Chief after Zed's passing, deduces from J's insistence of his reality and knowledge of details about Agent K that a fracture has occurred in the space-time continuum. She deduces Boris time-jumped to 1969 - knowledge of time-travel having been restricted to prevent such an occurrence - and killed K, resulting in a different future reality and an imminent Boglodyte invasion of Earth, now vulnerable due to the absence of the protective ArcNet which, in J's version of reality, K had installed in 1969. Through electronics-shop owner Jeffrey Price, J acquires the same time-jump mechanism as Boris, but his query about how he can remember K when nobody else can merely results in Jeffrey informing him that he must have 'been there'. J's plan is to arrive on July 15th & kill the younger Boris, so that the elder Boris who went back to kill K, wont even exist. As the doomed Earth is being invaded, J jumps off the Chrysler Building to reach time-travel velocity and arrives in 1969 the day before Boris is supposed to kill K.With some inevitable challenges upon his arrival - including his lack of resources and his skin color - J goes to Coney Island to intercept Boris while he is there to commit a historically recorded murder. Turns out the younger Boris was at Coney Island to find Griffin, the creator of the Arcnet which is a device that can save Earth from a Boglodyian invasion. But a 29-year-old Agent K (Josh Brolin) interrupts and arrests J. After fruitless questioning at MIB headquarters because J had been advised not to interact with the young Agent, K has J placed inside a large Neuralyzer. At the last second, after J confesses the truth of his mission, K aborts the procedure. As a wary team, they follow clues of Boris' trail to a bowling alley then to Andy Warhol's Factory, where they meet the prescient alien Griffin, who occupies 5-dimensions and possesses the ArcNet. Griffin tells them the Boglodytes destroyed his planet, and that he does not wish the Earth to suffer the same fate. Griffin then warns the two agents of Boris' impending arrival with the intent to kill him and leaves just before Boris arrives. Agent K narrowly escapes his own demise at the hands of Boris.\nThe elder Boris arrives, meeting up with his younger self and both agree to get the ArcNet and kill K so that the invasion will be imminent.The Agents later locate Griffin at Shea Stadium, where he gives them the ArcNet and instructs K it has to be placed onto the Apollo 11 lunar rocket launch occurring in less than six hours in Cape Canaveral, Florida. Boris arrives and snatches Griffin and the Agents pursue to rescue him from a certain fate.\nUpon arriving at Cape Canaveral, the agents and Griffin are arrested by military police. A colonel, however, allows them to continue their mission after Griffin uses his precognitive power to show the colonel how important the agents are.At the launch pad, J and K confront both the 1969 and 2012 incarnations of Boris and the battle ensues on the rocket scaffolding as the ignition blastoff counts down. The elder Boris impales J with his spikes before they both fall off the pad; however, J uses the time-jump to travel back to the beginning of the fight and avoid the spikes before pushing the elder Boris off the scaffolding, falling to the pad below. Meanwhile, as K battles the younger Boris, he disconnects a hose causing it to spray liquid hydrogen on Boris' left arm, freezing it and causing it to shatter. K then plants the ArcNet on the top of the rocket in the last seconds before blastoff. The elder Boris is incinerated to death in the blastoff and the protective shield deploys as the rocket leaves Earth's atmosphere.The Colonel congratulates K returning from the launch pad. As J watches from the distance, the younger Boris surprises them and kills the Colonel. The younger Boris tries to goad K into arresting him, but the junior agent instead shoots the young Boris this time, killing him. A young boy named James exits a military vehicle looking for his father, who happens to be the Colonel. He pulls out a pocket watch revealed earlier to have been passed down to Agent J by his father, and J realizes that the young boy is actually his younger self (Explaining Jeffrey's revelation that he was there; he was present when Boris altered history by killing K). Unwilling to reveal his father's death, K Neuralyzes James, telling him his father is a hero. It was then J realized why K wouldn't tell him about why he regretted arresting Boris in the first place.With the time-line restored, J returns to the present day, where he meets his partner at a diner. There, he shows K his father's pocket watch and thanks him. As they leave the diner, Griffin, a few seats away, tells the viewers all is well with the world, except for an imminent asteroid impact on Earth if this is the time-line where K forgot to leave a tip. But when K returns to leave his tip, the asteroid collides with an orbiting satellite instead of the Earth, thus it is safe for now.",
	"links": [
		"https://www.amazon.com/Men-Black-Tommy-Lee-Jones/dp/B0011E7JBW"
	]
}