{
	"title": "Gravity",
	"release_year": "2013",
	"runtime": "91",
	"tags": [
		"Drama",
		"Sci-Fi",
		"Thriller",
		"amazon"
	],
	"rating": 7.7,
	"actors": [
		"Sandra Bullock",
		"George Clooney",
		"Ed Harris",
		"Orto Ignatiussen",
		"Phaldut Sharma",
		"Amy Warren",
		"Basher Savage"
	],
	"staff": [
		"Alfonso Cuarón",
		"Alfonso Cuarón",
		"Jonás Cuarón",
		"Alfonso Cuarón",
		"David Heyman",
		"Steven Price",
		"Emmanuel Lubezki",
		"Alfonso Cuarón",
		"Mark Sanger",
		"Richard Hicks",
		"David Rubin",
		"Lucinda Syson",
		"Andy Nicholson"
	],
	"votes": 869661,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTU3OTIxNTU2OV5BMl5BanBnXkFtZTgwODgyMzgwMDE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "At 600 Kms above the Earth's surface, the temperature fluctuates between +258 and -148 degrees Fahrenheit. There is no air to carry sound. No air pressure and no oxygen. Life in space is impossible.Dr. Ryan Stone (Sandra Bullock) is a Mission Specialist on her first space shuttle mission aboard the Space Shuttle Explorer on STS-157. She is accompanied by veteran astronaut Matt Kowalski (George Clooney), who is commanding his final expedition. Stone and Kowalski are conducting a spacewalk to service the Hubble Space Telescope. It is a normal day, with plenty of playful banter between Stone, Kowalski and Mission Control, as they go about their job in fixing the Hubble. Mission Control is not receiving any data from the Hubble and part of Stone's mission is to fix the communications component on the telescope. Kowalski is also testing the new jet-packs which promise greater range and endurance. Kowalski has been on the spacewalk for 5 hours, and the battery is only 30% drained.\nOther crew are Shariff Dasari (Phaldut Sharma) the flight engineer on board the Explorer and The Captain (Amy Warren). Stone finds out the the communication component is working fine, and hence now has to check the communications panel, which will take an additional hours, which was not scheduled.Mission Control in Houston warns the team about a Russian missile strike on a defunct satellite, which has caused a chain reaction forming a cloud of space debris going around the planet at 50,000 MPH. Mission control orders that the mission be aborted. Shortly after, communications with Mission Control are lost (as the debris takes out many satellites in orbit that were supporting communications), though the astronauts continue to transmit, hoping that the ground crew can still hear them.High-speed debris strikes the Explorer and detaches Stone from the shuttle, leaving her tumbling through space. For a few moments Stone is all alone in space as she tries to gather her bearings and ascertain her position, which is difficult since even the GPS system is down.\nKowalski soon recovers Stone using his jet-pack (Stone has only 8% Oxygen left), and they make their way back to the space shuttle. Kowalski knows that the debris will hit them again in 90 minutes at its current velocity.\nThey discover the shuttle has been damaged far beyond usability and the rest of the crew is dead. They use the Thruster pack (the MMU) to make their way to the International Space Station (ISS), which is in orbit only about 1,450 meters away. Kowalski estimates they have 90 minutes before the debris field completes an orbit and threatens them again.On their way to the ISS, the two discuss Stone's life back home (she is a doctor back on Earth and loves listening to the radio) and the death of her young daughter. Just as they reach the ISS, Stone's Oxygen tank flat-lines. As they approach the substantially damaged but still operational ISS, they see its crew has evacuated in one of the Soyuz modules and that the parachute of the other capsule has accidentally been deployed, rendering it useless for returning to Earth. However, Kowalski suggests the remaining Soyuz be used to travel to the nearby Chinese space station Tiangong (100 km (60 mi) away) and board one of its Shenzhou modules to return safely to Earth.\nOut of air and maneuvering power in Kowalski's jet-pack, the two try and grab onto the ISS as they fly by. Stone's leg gets entangled in Soyuz's parachute cords and then grabs a strap on Kowalski's suit. Despite Stone's protests, he detaches himself from the tether to save her from drifting away with him, and she is pulled back towards the ISS. As Kowalski floats away, he radios her additional instructions and encouragement. Kowalski says that while the Soyuz cannot re-enter the Earth, but it can still get Stone to the Chinese Tiangong station, which has the Shenzhou capsule, with a re-entry procedure identical to the Soyuz.\nKowalski tells Stone not to come for him, and to focus on trying to make it back to Earth.Nearly out of oxygen, Stone manages to enter the ISS via an airlock. She cannot re-establish communication with Kowalski or Earth, and concludes that she is now the sole survivor of STS-157. She must hastily make her way to the Soyuz to escape a fire. Stone manages to Undock the Soyuz from the ISS.\nAs she maneuvers the capsule away from the ISS, the tangled parachute tethers prevent Soyuz from separating from the station. She spacewalks to release the cables, succeeding just as the debris field completes its orbit and destroys the station. Stone aligns the Soyuz with Tiangong but discovers the craft's Thrusters have no fuel.After a brief communication with a Greenlandic Inuit fisherman and listening to him cooing a baby, Stone resigns herself to being stranded and shuts down the oxygen supply of the cabin in order to commit a painless suicide. As she begins to lose consciousness, Kowalski appears outside and enters the capsule. Berating her for giving up, he tells her to use the Soyuz's landing rockets to propel the capsule toward Tiangong. Stone realizes that Kowalski's return was not real, and she gains new strength and the will to live on from her realization. She restores the flow of oxygen and uses the landing rockets to navigate toward Tiangong.Unable to dock the Soyuz with the Chinese station, Stone ejects herself via explosive decompression and uses a fire extinguisher as a makeshift Thruster to travel to Tiangong. Space debris has knocked Tiangong from its trajectory, and it begins rapidly Deorbiting. Stone enters the Shenzhou capsule just as Tiangong starts to break up on the upper edge of the atmosphere, Undocking the capsule just in time. As the capsule re-enters the Earth's atmosphere, Stone hears Mission Control over the radio tracking the capsule.The Shenzhou capsule re-enters the atmosphere successfully, despite damage during its descent, and lands in a lake. Radio communication from Houston informs Stone that she has been tracked on radar and that rescue crews are on their way. Stone opens the hatch but is unable to exit due to water rushing in. She takes a deep breath and holds it until the capsule sinks, allowing her to swim through the hatch. She sheds her Sokol space suit that is weighing her down, and crawls onto the beach before standing up triumphantly and walking away.",
	"links": [
		"https://www.amazon.com/Gravity-Sandra-Bullock/dp/B00HJ92QTI"
	],
	"netflix": [
		"belgium",
		"brazil",
		"canada",
		"japan",
		"mexico",
		"netherlands",
		"turkey"
	]
}