{
	"title": "The Lego Movie",
	"release_year": "2014",
	"runtime": "100",
	"tags": [
		"Action",
		"Adventure",
		"Animation",
		"amazon"
	],
	"rating": 7.7,
	"actors": [
		"Chris Pratt",
		"Will Ferrell",
		"Will Ferrell",
		"Will Ferrell",
		"Elizabeth Banks",
		"Elizabeth Banks",
		"Will Arnett",
		"Will Arnett",
		"Craig Berry",
		"Craig Berry",
		"Alison Brie",
		"David Burrows",
		"David Burrows",
		"Anthony Daniels",
		"Charlie Day",
		"Amanda Farinos"
	],
	"staff": [
		"Phil Lord",
		"Christopher Miller",
		"Phil Lord",
		"Christopher Miller",
		"Dan Hageman",
		"Kevin Hageman",
		"Roy Lee",
		"Dan Lin",
		"Mark Mothersbaugh",
		"Pablo Plaisted",
		"David Burrows",
		"Chris McKay",
		"Mary Hidalgo",
		"Grant Freckelton"
	],
	"votes": 393486,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTg4MDk1ODExN15BMl5BanBnXkFtZTgwNzIyNjg3MDE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The film opens with a prologue set 8.5 years before the film's events. In the Lego universe, an elderly wizard named Vitruvius attempts to protect the \"Kragle\", a powerful super-weapon, from the evil Lord Business. He fails to do so, and is blinded by Business in the process, but warns Lord Business of a prophecy he has envisioned where a chosen hero called the \"Special One\" will find the Piece of Resistance, an legendary artifact capable of destroying the Kragle.8 and a half years later, Emmett Joseph Brickowski is an ordinary construction worker outcast with no special qualities, who lives in a Utopian metropolis known as \"Bricksburg\", the capitol city of the Lego world. The city is owned by the energy company Octan, and run by its founder, President Business, whom Emmet admires. One day after work, he comes across a mysterious hooded figure, who is searching for something after hours at Emmet's construction site. The figure is then revealed to be an attractive punk-woman whom Emmet develops a crush on. When he investigates what she is doing, she runs off, causing Emmet to fall into a deep hole and finds the mysterious Piece of Resistance in an underground mine-shaft. Confused, he is compelled to touch it, causing Emmet to fall into a shock where he experiences vivid visions and passes out.He awakens in a dark police station, with the Piece of Resistance now stuck to his back, in the custody of Bad Cop, Lord Business' right-hand lieutenant (whose head sometimes turns his head around to reveal his other counterpart, Good Cop). There, Emmet learns Business' plans to destroy the world with the Kragle, and Bad Cop accuses Emmet of stealing the Piece. Bad Cop then has Emmet taken to a melting chamber where he is to be dissolved to death by an army of robot policemen, but he is saved by the punk-woman. The woman gives her name as \"Wyldstyle\", and takes Emmet on a motorcycle ride out of the city. Pursued by Bad Cop's Robo-SWAT force, Wyldstyle takes Emmet to a Western-themed world and brings him to her mentor Vitruvius, who explains that he and Wyldstyle are \"Master Builders\" capable of building anything they need, both with great speed and without instruction manuals. They also explain that many years ago, President Business rose to power as a dark crime-lord by his crime organisation Octan, his disapproval of such anarchic creativity (which he hated for it causing vandalism of his property) resulting in him capturing many of them and being obsessed with rules and limitations. As the \"Special\", Emmet is destined to defeat him, yet Wyldstyle and Vitruvius are disappointed to find Emmet displays no creativity.Lord Business plans to use the Kragle (really a tube of Krazy Glue with some of the logo's letters scratched off) to freeze the universe \"perfectly\" into a permanent position, so time can stop the way he wants it to be. Bad Cop tracks down Emmet and Wyldstyle, who are rescued by her superhero boyfriend, Batman. He takes them to a meeting of the remaining Master Builders at a colourful realm known as \"Cloud Cuckoo Land\", where Vitruvius calls them in for an assembly meeting, where he lets Emmet give a speech. There they meet a spaceship-obsessed astronaut named Benny and a cat-unicorn hybrid named Princess Unikitty. Unimpressed with Emmet, they refuse to fight Lord Business with him. Bad Cop and his forces attack and capture all the Master Builders except for Emmet and his friends in a submarine. The submarine explodes due to a leak, but they are saved by a cyborg pirate named Captain MetalBeard, who believes Emmet has the right ideas to stop Lord Business.Emmet believes the Master Builders' weakness is that their individual creativity prevents them from working together. He devises a team plan to infiltrate Lord Business' headquarters, but security picks up their actions and the plan fails. As Emmet and his allies are captured and imprisoned, Vitruvius attempts to fight back but is killed by Lord Business; with his dying words he admits the prophecy was made up. Business throws the Piece of Resistance out of his lair and into the abyss at the edge of the universe, sets his headquarters to self-destruct, and leaves with the Kragle while leaving Bad Cop behind. Vitruvius' spirit tells Emmet that even if the prophecy is not real, Emmet can still save the world. Emmet, tied to the self-destruct mechanism's battery, sacrifices himself for his friends, flinging himself off the edge of the universe and into the abyss where he is presumed dead.Inspired, the Master Builders escape in Benny's spaceship and rally with the help of a reformed Bad Cop. Wyldstyle broadcasts a speech to the citizens of the universe to convince them to be more creative and fight back. Soon, Lego mini-figures across the universe are building their own creative weapons, vehicles, robots and other machines. The Master Builders lead the charge against Business, causing him to become lividly infuriated.Meanwhile, Emmet falls down a deep vortex in the abyss until he finally hits the surface where he falls unconscious. When he awakens, he finds himself in the real-life human world, where the events of the story are being played out within the imagination of an 8.5-year-old boy, Finn. His father \"The Man Upstairs\" (whom Emmet recognises from his vision) then appears and chastises his son for ruining his father's Lego set by mixing characters with the wrong play-sets, and originating hodgepodge creations. Finn argues that Lego are for children, but his father prefers to Krazy Glue his perceived perfect creations together permanently, as this is how adults play with Lego. In the Lego world, Lord Business' forces gain the upper hand. Realising the father will glue all the Lego in place, Emmet wills himself to move and falls off the table, gaining his strong sentience and Finn's attention. Finn returns Emmet to the Lego set with the Piece of Resistance (revealed to be the glue gun's lid), where Emmet builds a massive robot to assist his friends before confronting Lord Business. In the real world, Finn's father looks at his son's creations again, thinks more deeply about them, and finds himself impressed. Realising his son based the evil Lord Business on him, the father has a change of heart and allows his son to play with his Lego however he sees fit. In the Lego world, Emmet convinces Lord Business that Business, too, is special, as is everyone because they all have individual creative talents. Moved by Emmet's speech, an emotionally reformed Business destroys the Kragle with the Piece and unfreezes his victims using a glue remover.With the world saved, Emmet celebrates with his friends, and Wyldstyle, whose real name is revealed to be Lucy, becomes his girlfriend with permission from Batman. However, alien Duplo beings beam down, announcing their intentions to invade, due to the father allowing Finn's little sister to play with his Lego set as well (to the shock of both Finn and Emmet). Then at the end, they are captured by the Duplo toys.",
	"links": [
		"https://www.amazon.com/Lego-Movie-Chris-Pratt/dp/B00IDI7WP2"
	]
}