{
	"title": "The Wolverine",
	"release_year": "2013",
	"runtime": "126",
	"tags": [
		"Action",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Hugh Jackman",
		"Will Yun Lee",
		"Tao Okamoto",
		"Rila Fukushima",
		"Hiroyuki Sanada",
		"Svetlana Khodchenkova",
		"Brian Tee",
		"Hal Yamanouchi",
		"Ken Yamamura",
		"Famke Janssen"
	],
	"staff": [
		"James Mangold",
		"Mark Bomback",
		"Scott Frank",
		"Hutch Parker",
		"Lauren Shuler Donner",
		"Marco Beltrami",
		"Ross Emery",
		"Michael McCusker",
		"Lisa Beach",
		"Suzanne Crowley",
		"Priscilla John",
		"Sarah Katzman",
		"François Audouy"
	],
	"votes": 502034,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzg1MDQxMTQ2OF5BMl5BanBnXkFtZTcwMTk3MjAzOQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1945, Logan (Hugh Jackman), the Wolverine (before his conversion to Adamantium claws), is held in a Japanese POW camp near Nagasaki. As the city comes under attack from allied bombers, a young Japanese officer named Yashida frees allied POWs against military protocol. Yashida frees Logan as well, but Logan knows that the city is being attacked by B-29s and they cannot outrun what's coming. Yashida refuses to commit ritual suicide like his other officers.\nDuring the atomic bombing of Nagasaki, Logan rescues Yashida (Haruhiko Yamanouchi) and shields him from the blast. Yashida sees firsthand how Logan's body heals after being completely seared from the blast. Yashida also finds that Logan is immortal.In the present day, Logan lives as a hermit in Yukon, tormented by hallucinations of Jean Grey (Famke Janssen), whom he was forced to kill at the end of X-Men: The Last Stand. He is located by Yukio (Rila Fukushima), a mutant with the precognitive ability to foresee people's deaths, on-behalf of Yashida, now the CEO of a technology corporation. Yashida, who is dying of cancer, wants Logan to accompany Yukio to Japan so that he may repay his life debt.Yashida is one of the richest businessmen in Japan & had helped rebuild the nation after the war. His conglomerate reaches every section of the Japanese society. The Yakuza are mobsters and mercenaries for hire, who have made several assassinations attempts on Yashida.\nIn Tokyo, Logan meets Yashida's son, Shingen (Hiroyuki Sanada), and granddaughter, Mariko (Tao Okamoto). There, Yashida offers to transfer Logan's healing abilities into his own body, thus saving Yashida's life and alleviating Logan of his immortality, which Logan views as a curse. Yashida says that Logan's ability to heal can be passed on.\nLogan refuses and prepares to leave the following day. Yashida pleads with Logan and says that Mariko is in danger. Logan witnesses Shingen slapping Mariko after an argument and then saves Mariko from committing suicide.\nShingen meets Yashida and is told that Mariko will take Yashida's place as the head of Yashida Industries. Shingen retorts that he will never allow that to happen.\nThat night, Yashida's physician Dr. Green (Svetlana Khodchenkova) (aka Viper) introduces something into Logan's body, but Logan dismisses it as a dream.The next morning, Logan is informed that Yashida has died. At the funeral, Shingen wants Logan to leave. Yukio claims that she never saw Yashida's death coming and was puzzled by his sudden demise.\nYakuza gangsters attempt to kidnap Mariko, but Logan and Mariko escape together into the urban sprawl of Tokyo with the helping of a hidden assassin who helps kill the Yakuza. Logan is shot and his wounds do not heal as quickly as they should. After fighting off more Yakuza on a bullet train, Logan and Mariko hide in a local love hotel. Logan is convinced that it is Shingen trying to kill Mariko.\nMeanwhile, Yashida's bodyguard Harada (Will Yun Lee) meets with Dr. Green who, after demonstrating her mutant powers on him, demands he find Logan and Mariko. Dr Green tells Harada that Logan is now weak as she had put a device in him. She also reminds Harada that it was Yashida's wish that Logan be brought to Dr Green.Logan and Mariko travel to Yashida's house in Nagasaki, and the two slowly fall for each other. Meanwhile, Yukio has a vision of Logan dying, and goes to warn him. Unknown to Logan Yurio is in touch with Mario and knows her location.\nBefore Yukio arrives, Mariko is captured by Yakuza. After interrogating one of the kidnappers, Logan and Yukio confront Mariko's fiance, corrupt Minister of Justice Noburo Mori (Brian Tee). Mori confesses that he conspired with Shingen to have Mariko killed because Yashida left control of the company to Mariko, and not Shingen.Mori also reveals that ever since Yashida was diagnosed with cancer, he was stockpiling Adamantium in his lab & was trying to prolong his life. He left the company to Shingen, who bore the huge costs of Yashida's obsessions & hid it from the board. He thought he would be rewarded by control of the company, once Yashida passed away, but Yashida decided to leave everything to Mariko, who would never have married Mori once the will was read 3 days after Yashida's death.Mariko is brought before Shingen at Yashida's estate when ninjas led by Harada attack and whisk her away. Shingen is stabbed with a poisoned pen by Dr Green, who reveals herself as a viper mutant to Shingen.\nLogan and Yukio arrive later and find a warning left by Dr Green to come and get Mariko. Using Yashida's X-ray machine, discover a robotic parasite attached to Logan's heart, suppressing his healing ability. Logan cuts himself open and extracts the device. During the operation, Shingen attacks but Yukio holds him off long enough for Logan to recover and kill him.Logan follows Mariko's trail to the village of Yashida's birth, where he is captured by Harada's ninjas. Logan is placed in a machine by Dr. Green, who reveals her plans to extract his healing factor and introduces him to the Silver Samurai, an Electro-mechanical suit of Japanese armor with energized swords made of Adamantium. Mariko escapes from Harada, who believes he is acting in Mariko's interests by keeping her away from Logan, and manages to free Logan from the machine. Harada sees the error of his ways (and that Logan is the one trying to protect Mariko) and is killed by the Silver Samurai while helping Logan escape.Meanwhile, Yukio arrives and kills Dr. Green as Logan fights the Silver Samurai. The Silver Samurai severs Logan's Adamantium claws and begins to extract Logan's healing abilities, revealing himself to be Yashida, who had faked his death. Yashida starts to regain his youth, but Mariko intervenes and stabs Yashida with Logan's severed claws while Logan regenerates his bone claws and finishes off Yashida. Logan collapses and has one final hallucination of Jean, in which he decides to finally let go of her.Mariko becomes CEO of the Yashida Corporation and bids farewell to Logan as he prepares to leave Japan. Yukio vows to stay by Logan's side as his bodyguard, and they depart to places unknown.In a mid-credits scene, Logan returns to the United States two years later and is approached at the airport by Magneto and Professor Xavier, who warn him that a grave new threat to the mutant race is coming (foreshadowing X-Men: Days of Future Past)",
	"links": [
		"https://www.amazon.com/Wolverine-Hugh-Jackman/dp/B00G70JQZC"
	]
}