{
	"title": "Underworld: Awakening",
	"release_year": "2012",
	"runtime": "88",
	"tags": [
		"Action",
		"Fantasy",
		"Thriller"
	],
	"rating": 6.3,
	"actors": [
		"Kate Beckinsale",
		"Michael Ealy",
		"India Eisley",
		"Stephen Rea",
		"Theo James",
		"Sandrine Holt",
		"Charles Dance",
		"Kris Holden-Ried",
		"Jacob Blair",
		"Adam Greydon Reid"
	],
	"staff": [
		"Måns Mårlind",
		"Björn Stein",
		"Len Wiseman",
		"John Hlavin",
		"J. Michael Straczynski",
		"Allison Burnett",
		"Gary Lucchesi",
		"Tom Rosenberg",
		"Len Wiseman",
		"Richard S. Wright",
		"Paul Haslinger",
		"Scott Kevan",
		"Jeff McEvoy",
		"Deborah Aquila",
		"Tricia Wood",
		"Claude Paré"
	],
	"votes": 162449,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjAxMjc0ODk0OF5BMl5BanBnXkFtZTcwMTc5NDQwNw@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "6 months after the events of Underworld: Evolution, a program is launched by humans to study and potentially harness the powers of Vampires and Lycans. However, this soon escalates into an all-out genocide and shortly after the Purge begins.Vampire Selene (Kate Beckinsale) is captured by humans during \"The Purge,\" a massive crusade of war to exterminate vampires and Lycans after mankind learns of their existence. Humans call them \"Non-Humans\" and \"The infected.\" Selene had decided to escape town with Michael Corvin her Lycan lover. However, the human hunting squads catch up with them and shoot Michael with a Silver Bullet. Michael falls into the waters at the docks, as Selene is captured.Due to her enhanced vampire like traits, Selene is imprisoned in cryogenic suspension. Dr Jacob Lane is the chief scientist working on a cure against the virus that infects humans and turns them into Vampires.12 years later, human governments had committed genocides to vampires and Lycans, killing everything. Surviving populations were reduced to being scavengers and guerrillas, and 90% of the vampire race was annihilated.Selene is freed from cryogenic suspension and escapes the medical corporation Antigen. The corporation is trying to make an antidote for the virus that creates vampires and Lycans. The scene indicates that Selene is \"allowed\" to escape antigen to find \"Subject 2\". Selene in turn was looking for Michael and returns to the docks where she last saw him. She realizes that 12 years have passed since that incident.\nDetective Sebastian is assigned to investigate the disturbance at Antigen labs. Dr Lane informs Sebastian that a test subject tried to escape the facility and was put down.Selene starts to have strange visions after her escape, which she follows, believing them to be linked to her lover, the vampire-Lycan hybrid Michael Corvin, who was injured when Selena was captured. The visions lead her into a building where she runs into David (Thee James), a fellow vampire.\nSick and weakened Lycans also appear at the same time; they are hunting the subject with whom Selene is connected. Selene fights her way through the Lycan pack.Following her vision, she discovers not Michael, but a young girl called only \"Subject 2,\" also known as Eve (India Eisley). Selene, David and the girl drive away using a stolen van, only to be attacked once again by a trio of Lycans. David and Selene kill two while the third smashes its way into the rear of the vehicle and bites the girl's shoulder. Eve partially transforms and rips the creature in half, revealing her hybrid traits.Eve is revealed to be a hybrid. David, noting that Eve (Subject 2) has been injured by the Lycans and is somehow not healing. Selene drinks a sample of Eve's blood to understand her story so far. She finds that during her own escape from the facility, the girl found Selene's cryogenic tank and deactivated it. That is why Selene could escape.\nEve confirms that she is Selene's daughter. Eve is rapidly growing weaker, so David decides to take the pair to his coven.David's father, Thomas (Charles Dance), does not welcome Selene and Eve, stunning Selene with the news that Michael died 12 years ago, and that Selene was the cause for the destruction of the vampire race. Upon being given some vampire blood, Eve heals extremely quickly.Dr. Jacob Lane (Stephen Rea), director of Antigen, is revealed to be a Lycan alongside his son, Quint (Kris Holden-Ried). The \"antidote\" the corporation has been working on for many years is actually to make Lycans immune to the deadly effects of silver and to enhance their physical abilities. Eve's hybrid genetic code is required to achieve this, so Lane sends Quint with other Lycans to the vampire coven to recapture her. But as they do not feel welcome in the coven, due to the fact that the girl is noticeably different from Vampires, Lycans and even Hybrid, Selene prepares to leave.Meanwhile, expecting a human attack at any moment, David rallies the vampires & arms them. Unexpectedly, Lycans arrive instead, and numerous vampires are slaughtered. Selene encounters a gigantic \"super Lycan\", who is later revealed to be Quint, his body changed by injections using Eve's blood. Selene is knocked unconscious under a pile of rubble. She later Awakenens and finds that Eve has been turned over to the Lycans by Thomas in exchange for their departure. David is mortally wounded during the battle. Selene decides to save Eve but first revives David using her immortal blood, given to her by Alexander Corvinus. Then Selene figures that Antigen is the Lycan hideout.Able to survive in sunlight, Selene enlists the help of Detective Sebastian (Michael Ealy), a human who tried to investigate Antigen earlier. Sebastian agrees to help save Eve, admitting he was married to a nurse who was bitten at work and became a vampire, until she was killed by authorities during the Purge; they forced her to out into the day, into direct daylight, and she was burned to death. Sebastian confirms that the Lycans have been traced to Antigen, the corporation dedicated to killing off vampires. They also run the facility from which Selene has escaped.Antigen is actually run by Lycans, who have been posing as humans in order to trick the world's governments into believing the Lycans are extinct. The director of Antigen, Dr. Jacob Lane, is trying to perfect the Lycan race and needs the DNA of Selene's daughter to do so. The \"Super-Lycan\" Selene faced earlier is Quint, Lane's son and the prototype for Lycan modifications. Selene and Sebastian assault Antigen to stop Lane and save Selene's daughterSelene destroys part of Antigen's headquarters using explosives and silver gas, forcing Dr. Lane to move Eve out of the building to perform an operation to create more of the antidote. Selene escapes from the Lycans in the building. In the process, she finds Michael Cryogenically frozen in a laboratory. She shoots his cell to let him out. Escaping in a van, Dr. Lane is intercepted by Sebastian and then by Selene, who causes the van to crash. Quint arrives, transforms into his super Lycan form, and fights Selene.Eve awakens on her stretcher, frees herself from the van, and engages Dr. Lane in a fight, who has injected himself with the super Lycan formula used on Quint. Sebastian and the revived David aid Eve in her fight until she kills Dr. Lane by ripping his throat out.\nMeanwhile, Quint corners Selene in a small cement guardroom but is forced to revert to his human form to get to her, only for Selene to shove an activated silver-based grenade into Quint's body. He heals instantly, trapping the grenade inside. Panicking, he half-changes back to Lycan form, but it is too late, and he explodes.Selene goes to find Michael but finds an empty cryogenic cell with Eve sharing his vision and learns he is on the roof. Selene, Eve, and David run to the roof only to find Michael has gone. Selene narrates, concluding that she will find Michael and take back the world from the humans and Lycans, so the vampires can rebuild themselves as the humans declared war.",
	"links": []
}