{
	"title": "Ride Along",
	"release_year": "2014",
	"runtime": "99",
	"tags": [
		"Action",
		"Comedy",
		"Crime",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Ice Cube",
		"Kevin Hart",
		"Tika Sumpter",
		"John Leguizamo",
		"Bruce McGill",
		"Bryan Callen",
		"Laurence Fishburne",
		"Dragos Bucur",
		"Gary Owen",
		"Jacob Latimore"
	],
	"staff": [
		"Tim Story",
		"Greg Coolidge",
		"Jason Mantzoukas",
		"Phil Hay",
		"Matt Manfredi",
		"Matt Alvarez",
		"Larry Brezner",
		"Ice Cube",
		"Will Packer",
		"Christopher Lennertz",
		"Larry Blanford",
		"Craig Alpert",
		"Victoria Thomas",
		"Chris Cornwell"
	],
	"links": [
		"https://www.amazon.com/Ride-Along-Ice-Cube/dp/B00JE59KDU"
	],
	"votes": 124085,
	"cover": "https://m.media-amazon.com/images/M/MV5BNjU4NzYzOTY1MF5BMl5BanBnXkFtZTgwMTAyNTc1MDE@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "\"Omar\" has undercover investigator James Payton working on a passport fraud enterprise. He is told to quit the investigation by his lieutenant after a gunfight with the smugglers, but he doesn't.Ben Barber, a small, jittery security guard from high school who enjoys playing video games, submits an application to the Atlanta City Police Academy. He requests James' approval to wed his sister, Angela. He demands that Ben \"ride along\" with him first to demonstrate his worthiness for her. If successful, he will provide his blessing and suggest him to the academy.After bringing Ben to the station, James requests that dispatch provide him with all of the 1-26s that are phoned in, and he assigns Ben to handle them. James discovers the link between Serbia and \"Omar\" by questioning informant Runflat, and he learns that a cargo is scheduled to arrive that night. After leaving the park, James brings Ben to the nearby shooting range, where he discovers that the shop has been handed Zastava M92s. A intoxicated \"Crazy Cody\" is causing trouble at the Sweet Auburn Curb Market when Ben and James arrive after a 1-26 is called in. James arrests him when Ben fails to restrain him.Before Angela calls, Ben requests to be escorted home. She informs him about his trying day after he shares it with her. According to Cody, James's poker buddy, 1-26s are code for tricky situations for beginners. Ben is unhappy and will not go home when he witnesses Cody joking with James, Santiago, and Miggs at the police station. Instead, he receives a 1-26 for causing a commotion at a strip club. James and Ben are there when two men engage in a Mexican standoff. Another prank call is believing; Ben plays around. They are tipped off about a weapons transaction with Omar's men after James subdues them. Concerning the 1-26s, Ben approaches James.In the vehicle, Santiago calls James to inform him that Runflat has handed himself in. Another hint, according to Ben, is that Runflat's brother informed him in the park that Runflat had recently been released from prison. To find out the location of the gun trade, they speak with J, Runflat's other brother. J discloses the time and location of the sale, and Ben unintentionally shoots her during the exchange.James decides to abandon Ben in the car and sneak into the warehouse with Santiago and Miggs. They show out to be corrupt police officers who work for Omar, and they betray him. Ben notices that James is now restrained. James is made fun of and criticized by Santiago for being egotistical and insolent. Since no one has ever seen the actual Omar, Ben poses as Omar at the start of the transaction.Having managed to mislead them, Ben ruins the agreement. The real Omar shows up just as he and James are ready to depart. Numerous guys belonging to Omar are murdered in the ensuing gunfight. Because of his gaming, Ben demonstrates his quick reactions and fighting expertise. Before the warehouse blows up, James and Ben steal the money from the transaction. Santiago, Miggs, and Omar manage to get away without them knowing.When Santiago and Miggs get to Angela's, they bind her. Through Ben's headset, Ben's other players overhear the altercation while she was engaged in one of his interactive games. A gamer calls Ben at the hospital when he is receiving treatment for a gunshot wound to his leg. The gamer informs James that something is happening at the flat. James and Ben use Omar's money to sneak away to Angela's after spotting several police officers coming at the hospital.James hurts Miggs before he and Santiago fight. Angela knocks Santiago unconscious just before he is ready to shoot him. After a scuffle in which Omar knocks Ben unconscious, he grabs Angela and the money bag and walks away. James approaches Omar after they have gone. Ben kicks him after sliding over a vehicle just as Omar is ready to shoot him. Omar is wounded when James shoots him twice. After Omar, Miggs, and Santiago are taken into custody by the police, James ultimately grants Ben his approval.Ben and Angela are involved in a scene throughout the credits, and Ben is just a few weeks away from receiving his police academy degree. The neighbor's dog is killed when Ben blows up the BBQ at James's, sending it flying into the bushes."
}