{
	"title": "Enola Holmes 2",
	"release_year": "2022",
	"runtime": "129",
	"tags": [
		"Action",
		"Adventure",
		"Crime",
		"netflix"
	],
	"rating": 6.8,
	"actors": [
		"Millie Bobby Brown",
		"Henry Cavill",
		"David Thewlis",
		"Louis Partridge",
		"Susan Wokoma",
		"Adeel Akhtar",
		"Sharon Duncan-Brewster",
		"Helena Bonham Carter",
		"Sofia Stavrinou",
		"John Parshall"
	],
	"staff": [
		"Harry Bradbeer",
		"Jack Thorne",
		"Harry Bradbeer",
		"Nancy Springer",
		"Millie Bobby Brown",
		"Paige Brown",
		"Robert Brown",
		"Alex Garcia",
		"Daniel Pemberton",
		"Giles Nuttgens",
		"Adam Bosman",
		"Orla Maxwell",
		"Michael Carlin"
	],
	"votes": 104258,
	"cover": "https://m.media-amazon.com/images/M/MV5BZjRjZjZhNzUtMDQyMC00OWZmLWIzMjQtZDM2OWRhNzgwOGU2XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Enola Holmes sprints through the crowded streets of Victorian London, pursued by two police officers. As they manage to corner her in a back alley, Enola addresses the audience to explain the situation.Some time earlier, having solved the case of the disappearance and attempted murder of Lord Tewkesbury of Basilweather, Enola makes arrangements to start her own detective agency. She rents a small space in London, sends out advertisements in the papers, and is fully equipped to begin. However, none her of potential clients are interested in having a young girl take their cases, and the Tewkesbury disappearance is commonly thought to have been solved by Enola's elder brother, the ever-famous Sherlock Holmes. Sherlock himself, although on a constant streak of cracked cases, has allegedly been stumped recently by a brilliant string of crimes. Enola's mother, Eudoria Holmes, has been making her own trouble, dropping small, relatively harmless explosives into mail pillars packed with fliers to promote women's suffrage, as well as other protest activities. Meanwhile, Tewkesbury has established himself in the House of Lords as a voice for positive change, and has gained popularity among both the government and the people as a champion of reform. He has also been writing to Enola, and sends her an invitation to join him for an upcoming ball. Enola has lingering feelings for the young lord, but, recalling her mother's old lessons to find her own path and reject what society would put to her, she decides to ignore his letters. As the months drag on, Enola's business seems to have proven a failure. She finishes packing her things to move out, but her agency is entered by her first real client; a ten-year-old match girl named Bessie. She followed one of Enola's old advertisements stating she specializes in finding missing persons, and has come to ask her to locate her sister.Bessie takes Enola to her tenement in the slums, where she and her sister, Sarah, live in a small room in the building that houses all of the local match girls. She describes Sarah to Enola, who notes the lack of resemblance. Bessie and Sarah's friend, Mae, explain that Sarah took the younger girl in. Enola investigates the room, finding several potted plants, some of which have died, science books, as well as a collection of makeup, unusual for a single girl of her status. She also finds that Sarah liked to leave cheese out for the rats, Bessie claiming she's soft on them. As Enola looks around, she spots a partially burned paper, the only remaining fragment reading \"12 March\". Mae does not want Enola to investigate, and tries to get her to leave, but Bessie insists on hiring the lady detective. Bessie tells Enola she last saw Sarah a week prior at the match factory, having a fight with the Foreman, who claimed she had stolen something from his office. The only thing she left behind for Bessie was the meager money she had earned from her two jobs; the match factory, and washing glasses at a pub called The Stag Antlers. Bessie tries to give Enola the money, but Enola refuses to take any payment until she has solved the mystery.\nBessie takes Enola, in disguise, to Lyon's Match Factory with her with the rest of the working girls. As the enter, with Enola having given a fake name, the foreman, Mr. Crouch, checks them for signs of typhus, which has broken out among the girls working at the factory. Bessie shows Enola Sarah's workstation, and the detective sees that the girls' wages are docked for any mistakes. She sneaks into Crouch's office, and finds and old pack of matches dipped in red phosphorus, unlike the white they are currently using. She also breaks into the safe and finds a thread of red hair in a ledger, where several pages have been torn out. She hides upon hearing Mr. Lyon, the owner of the company, and his son William having a meeting with another wealthy man, Lord McIntyre, and his assistant regarding the \"theft\". As they leave, narrowly missing Enola herself, Lyon takes the other man on a tour of his factory, showing off his hard working ladies, many of whom know someone who is dying or has died from typhus over the past two years as it's swept through the match girls. At the end of the day, Enola deduces from Bessie that Mae helped Sarah sneak into Crouch's office before by starting a fire at her station, and decides to follow her that evening.Mae, despite her efforts to not be followed, leads Enola to a thriving theater downtown, The Paragon. A young woman swings to the stage on a trapeze, and Enola recognizes Mae with the dancing girls. After the performance, Enola goes backstage and is confronted by Mae with a knife, and warns her that a \"posh\" girl like her should not get involved. After demonstrating her abilities by turning the tables and pinning Mae, Enola demands to know what was in the pages Sarah stole from Lyon, having already deduced from the makeup in her apartment that Sarah and Mae both performed at the theater, and lied about it to Bessie. Mae is called back to stage, and reveals it was only a prop knife. Enola bribes the stage manager to show her Sarah's makeup station. He tells her that Sarah had an admirer, a gentile man that sent her flowers and letters, and Sarah was keen on him. Enola finds one of the hidden letters, containing a poem signed with what looks like a poppy. She begins to suspect that Sarah may have run away with, or is running away from, a lover. As she makes her way home for the night, Enola realizes she is being followed by a man with using a cane with a metal tip. She evades him, and runs into Sherlock, who has just been thrown out of a pub. They are surprised to see eachother, and Sherlock is heavily inebriated, which he excuses as being a part of his latest case. Enola helps her brother back to his home at 221B Baker Street, and is awed to finally be inside the famous, if extremely messy, apartment. Sherlock tells her not to touch anything, before passing out, and she decides to look around. She finds evidence of his current case, a tangled web of a map displaying dozens of connected crimes.The next morning, Sherlock is most displeased to see she has moved several of his papers, and asks her to leave. She suggests that he get a flatmate to prevent him from descending into the level of disorder and drunkenness in which he has recently found himself. While they argue, Sherlock deduces that she has worked in a match factory based on her appearance, as well as her general state. Nnoting the mark on her neck from Mae's \"knife\", he asks if she is in danger. He tells her not to get herself into trouble to prove herself, and says that his offer for her to become his ward is still open. Insisting that she does not need his approval or help, Enola leaves. She goes to the park fuming, but is interrupted by the arrival of Tewkesbury, on his daily walk to the House of Lords. They awkwardly share pleasantries, Enola complimenting him on his work, and noting that is now considered quite an eligible bachelor by the society papers, though he tells her not to believe it. He says he has seen her in this park every so often on his way to the Lords, and she brushes it off saying that she likes to enjoy her breakfast there sometimes. When asked why she did not reply to his letters, she says she was merely busy starting her business. He offers to help financially if she needs it, but she refuses. Tewkesbury tells her she knows where to find him, and continues on his way. Enola relaxes, and tells the audience that she does not, in fact, come to the park all the time when Tewkesbury is on his commute, even if she has all his usual routes memorized. Suddenly inspired, Enola looks over the poem from Sarah's lover, and finds a coded address in the words. Following it, she discovers a flat, the door broken open. Going upstairs, she finds the apartment in ruins, containing evidence of a red-headed woman and a gentleman having lived there. Looking around, she finds Mae on the bed with a knife lodged in her stomach, barely alive. Enola tries to perform first aid, but the young woman bleeds out. Shocked, Enola gathers her senses and realizes that Mae indicated her pocket before she died, and discovers a piece of sheet music titled \"The Truth of the Gods\". Inspector Lestrade enters, followed soon after by his superior, Superintendent Grail, who's cane makes the same clanging sound Enola heard following her the previous night. Grail and Lestrade start to suspect Enola murdered Mae after finding blood on her hands and the evidence she tried to hide. Not trusting Grail, Enola runs from the police and manages to make it back to Sherlock's flat before Lestrade comes to inquire about her whereabouts. Sherlock successfully hides her, and afterwards the siblings trade case details. The elder Holmes explains that a series of masterful financial thefts have occurred all over London and are being siphoned into a single account that is so far untraceable, and whoever is behind it is a genius that is clearly enjoying themselves. The only clue he has is a vague description of a man stealing a document from the treasury office. Holmes strictly instructs Enola to hide in his flat while he goes out to investigate. While he is gone, Enola does research, and finds an article about and imminent ball being held by Mr. Lyon to combat typhus amongst the match makers. Recalling her conversation with Tewkesbury, she realizes that the flower on Sarah's note is not a poppy, but is actually a Sweet William. Suspecting this is symbolic of Mr. Lyon's son William Lyon, she decides to infiltrate the ball.Enola successfully makes it into the party, but is not allowed to speak with William without a chaperone. Frustrated, she is approached by Lord McIntyre's personal assistant, Mira Troy, who offers her a fan, which can be used to speak secret languages. The only way she might get close to Lyon's heir without an escort is by dancing, a skill that Enola was never taught by her renegade mother.\nEnola spots Tewksbury among the ball guests, and takes him into a bathroom, demanding an impromptu dance lesson from the bewildered lord. He reluctantly agrees when she tells him a girl's life may be in the balance, and as they make their way through the steps, they express their mutual concern for eachother, since he has noticed her keeping tabs on him. Enola picks up the dance, and they grow closer together, but are interrupted by a knock on the door. Tewkesbury gives Enola a dance card and exits via the window. As he leaves, he flourishes a fan in a code he promises she will eventually learn. Enola is able to get William to sign her dance card, and his writing matches the note, confirming he was indeed Sarah's lover. Another woman at the ball, Lady Cicely, approaches Tewkesbury to dance, to Enola's annoyance.Meanwhile, Sherlock has finally deciphered his own puzzle, using a book of dances as the key. He parcels out only a message congratulating him, signed with a name: Moriarty. The ball guests begin the next dance, and Enola takes the opportunity to speak with William about Sarah. He becomes scared when she speaks of this, revealing he knows Sarah's sister Bessie, and begs her to leave it be, for their own safety. Enola refuses, so he tells her to meet him later to explain. When she does, she finds Tewkesbury there, trying to look after her, and they argue. Enola has begun to assume that Tewkesbury's interests lay solely in finding a wife amongst his plentiful admirers, which he vehemently denies. William arrives and recognizes Twekesbury, however they do not have time to talk, as the police enter and arrest Enola. She slips Tewkesbury her evidence before she is taken away to Scotland Yard, and is questioned by Grail. Enola deduces that he has been following her and Mae, and on behalf of someone else. He demands to know where Sarah is, but Enola doesn't know. He threatens to find out from Bessie instead. Sherlock is told about Enola's arrest, and goes to the station to have her freed. Grail refuses, despite Sherlock's deductions from the apartment crime scene suggesting it was in fact Grail and his personal officers that murdered Mae while looking for Sarah. Unfortunately Grail has a cutting edge piece of technology that proves Enola's guilt; fingerprinting, which show Enola's fingerprints on the knife. Sherlock knows this to be impossible, since his sister never touched the weapon, and so he goes to ask his mother's friend and Judo instructor Edith for help.The next day, Enola is taken to prison, where she is liberated by Eudoria and Edith, who whisk her away in a carriage. The hasty mother-daughter reunion is secondary to keeping the pursuing officers at bay using smoke bombs, and Enola explains the case so far to Eudoria. Mrs. Holmes gives her some advice right before Grail manages to derail their carriage. The three women defend themselves handily before escaping under the cover of one final explosion. Eudoria advises Enola to take advantage of the resources and allies she has to help her solve the case. She mentions that Tewkesbury, with his brave moral crusading in the government, has earned her unambiguous approval, before leaving again.Enola returns to London to find Bessie, and sends her to stay somewhere else for her safety. Taking another look around the tiny flat, she notices red and white match heads sprinkled in the plants and on the cheese Sarah was feeding to the rats, noting that everything that has touched the white phosphorus is dead, while the more expensive red phosphorus is not nearly as volatile. Sh recalls more such experiments from Sarah and William's apartment in town, and the pieces come together. The white phosphorus that the match factory has been using for the past two years is toxic, and is killing the girls. To cover it up, the factory owners are blaming it on typhus, and Sarah has proof. Enola finds Tewkesbury and asks him for his help, apologizing for dismissing him earlier. Tewkesbury tries to assure her he has no time or interest in finding a wife, since he is kept far too busy with politics to think about anything else. Enola expresses her support for him, and fills him in on the case. He offers any help he can give. They are once again interrupted by a knock at the door, and Enola hides while Tewkesbury answers to find the woman from earlier, Cicely, who says she must speak with him on an urgent matter. He promises to talk later and she leaves. Worried what Enola might think, he explains that she came to confide in him about a conspiracy to do with factory laws. He tries to put his feelings for Enola into words, but she is too distracted by her own thoughts. She figures out that all this time, Cicely, who also went to the ball without a chaperone, is in fact Sarah Chapman in disguise. She runs outside to try and catch up, but Sarah is gone. Tewkesbury frustratedly follows, and asks if she heard anything he was saying. She did, and asks him what the fan flourish he gave her at the ball meant. He admits it meant 'I love you'. Enola remembers Cicely/Sarah giving William the same flourish at the ball, and realizes that they were really lovers, and were working together with Mae to expose William's own father. The pair invited Tewkesbury to the ball because he is the only man in government they could trust to help them. Enola confesses that she loves Tewkesbury as well, and asks him to help her finish this case. They go to the match factory and sneak in, where Enola runs into Sherlock, who has deduced that the epicenter of his case is also Lyon's Match Factory. They find William dead upstairs, seemingly killed under some form of questioning. They discover a scrap of sheet music in his hand, matching the one Enola found on Mae, \"The Truth of the Gods\". Tewkesbury suggests that \"The Gods\" could be a reference to the upper balcony of a theater, and they rush to the Paragon. On the way, Tewkesbury, expecting trouble asks Enola to trade his dance lesson for a fight lesson from her. She teaches him the basics, and they share a kiss. When they make it to the theater, Sarah is there to meet them, the documents she and William stole proving Lord McIntyre and Henry Lyon conspired to hide the true cause of death among the match girls having been hidden under the seats in the balcony. The others tell her William has been killed, but there is no time to mourn, as Grail and his men arrive with Bessie held hostage to demand the papers. Bessie fights back and gets away, and the group scatters. Grail pulls a gun and shoots Sherlock in the shoulder before pursuing Enola upstairs, meanwhile Tewkesbury waylays Sargent Beeston, Grail's right hand man, but struggles to hold his own against the burly policeman hand to hand. Sherlock takes on the final two men, but sees Beeston draw his saber against Tewkesbury, and throws him his cane sword to even the odds. Enola plays cat and mouse with Grail to make him waste his bullets, and she succeeds in protecting Sarah and Bessie by luring Grail onto the suspended catwalks high above the stage. Grail grabs a knife from the dressing rooms and follows Enola, who runs out of catwalk high above the stage. Grail stabs Enola with the knife, which distracts Tewkesbury long enough for Beeston to disarm and subdue him. However, the knife was Mae's retractable prop knife, and Enola turns the tables on Grail. In desperation, he uses an iron hook on a rope as an improvised weapon and strikes Enola in the head, and he takes the papers from her while she is stunned. Remembering her childhood lessons on cause and effect, she spots the theater's pulley system and jumps from the catwalk, grabbing the end of the rope Grail was using. The hook snags on Grail and Enola uses him as a counterweight to lower herself to the ground safely, crushing him against the ceiling, then dropping him to the floor. Meanwhile, Tewkesbury summons all his remaining strength to deliver a single, devastating blow to Beeston's weak point while his guard is down, and the officer goes down. Sherlock also manages to neutralize the other two men, and the group reunites on the stage. Lastrade arrives with more officers to take away Grail and his paid off men, having been summoned by Sherlock earlier, and proving Enola's innocence. Lord McIntyre also arrives with Miss Troy, called by Lastrade. McIntyre demands Sarah be arrested for theft and blackmail, but Sarah never blackmailed McIntyre or Lyon. Sherlock's mysterious new foe has done so, someone fond of mind games and close enough to take advantage of the situation caused by Sarah, Mae, and William: Mira Troy, AKA Moriarty. She was the one paying Grail and his men to find Sarah, and under her orders they interrogated both Mae and William, who died rather than give her up. She blames Grail's blunt methods for their deaths, but nevertheless she found it thrilling to play the game. Moriarty applauds both Sherlock and Enola for their work, saying they must play again, and is arrested. However, Lord McIntyre takes the papers and burns them, erasing the evidence of his effective murder of hundreds of match girls, which devastates Sarah.Several days pass, and Enola meets with Sarah and Bessie, who tell her that without evidence, the match factories will stay in operation without consequence. Enola goes with them to the factory, and they tell the girls their only option now is to stand up for themselves and leave the factory until the toxic white phosphorus is removed. Afraid of losing precious income, they are hesitant, but eventually stand together and leave the factory en mass.Some time later, Sherlock goes to see Enola, who has reopened her detective agency out of Edith's upper office, and shows her a newspaper article. Tewkesbury has used his influence to testify against Lord McIntyre, who has been arrested. He also offers to take her in as his ward and apprentice at Baker Street. While flattered and grateful, she declines, preferring to stay close to the working people and let Sherlock handle the high-profile cases. She does however tell him that he should find a companion to help him and ease his loneliness. They promise to check in on eachother from time to time, and make plans to meet soon. Tewkesbury arrives to court Enola and the two leave together. Sherlock thanks Edith for her help, before reading in the paper that Moriarty has escaped police custody. Enola and Tewkesbury walk through London and Tewkesbury tells her he got them an invitation to a ball. Given her experiences at her last ball, she suggests finding an alternative activity.A few days later, at a scheduled time, Sherlock opens his door to find not his sister, but a Doctor John Watson, who was told he was looking for a flatmate. Realizing Enola's ruse, he shows the man inside.",
	"links": [
		"https://www.netflix.com/title/81406219"
	]
}