{
	"title": "Faster",
	"release_year": "2010",
	"runtime": "98",
	"tags": [
		"Action",
		"Crime",
		"Drama",
		"amazon",
		"netflix"
	],
	"rating": 6.4,
	"actors": [
		"Dwayne Johnson",
		"Billy Bob Thornton",
		"Maggie Grace",
		"Mauricio Lopez",
		"Jim Gaines",
		"Tom Berenger",
		"Jan Hoag",
		"Courtney Gains",
		"Michael Irby",
		"Josh Clark"
	],
	"staff": [
		"George Tillman Jr.",
		"Tony Gayton",
		"Joe Gayton",
		"Tony Gayton",
		"Liz Glotzer",
		"Martin Shafer",
		"Robert Teitel",
		"Clint Mansell",
		"Michael Grady",
		"Dirk Westervelt",
		"Sarah Finn",
		"David Lazan"
	],
	"votes": 112743,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTMyOTQ5MTAxOF5BMl5BanBnXkFtZTcwOTYzMDg5Mw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "On leaving prison James \"Jimmy\" Cullen (Dwayne Johnson) retrieves his 1970 Chevrolet Chevelle, a gun, and a list of names before heading to an telemarketing office in Bakersfield, California and killing a man named Prescott Ashton (Courtney Gains).\nHe then visits Roy Grone (Mike Epps), who gave him the car and gun, and forces him to give him more names. Meanwhile, Cullen is tracked by detectives Cicero (Carla Gugino) and Humphries (Billy Bob Thornton); a hit-man known as \"Killer\" (Oliver Jackson-Cohen) is also hired to kill Cullen.\nHumphries is shown to be a desperate heroin addict, who doesn't even have the money to cover a single hit. Humphries is just a couple of weeks away from retirement. Cicero is a competent officer and hates Humphries. Retirement means full pension and benefits for Humphries and his family.\nCicero figures out from the office CCTV video that Prescott knew the man who killed him.Cullen locates the second person on his list, Kenneth Tyson (John Cirigliano), who films his own personal snuff films. After finding and killing Tyson, Cullen gets into a gunfight with Killer in the hallway but manages to escape.\nThis affects Killer philosophically, and, after proposing marriage to his girlfriend, Lily (Maggie Grace), begins to take the task personally. Killer is shown to be a perfectionist. He has polio as a kid, but then took control of his life, got surgery in his legs, and conquered every physical challenge thrown at him. He has never failed at anything that he has set his mind to.\nThe killer is obsessed that Cullen was faster than him and he had no fear.Humphries and Cicero investigate Cullen's past and discover he was double-crossed during a robbery. Cullen was the driver, and Gary was in the crew. Cullen was great at driving and is able to escape with the crew. But then the bank robbery crew was ambushed by another crew. It was a setup, and the snuff event was filmed on camera.\nCicero remembers him from a video of his older half-brother Gary's (Matt Gerald) death filmed by Tyson, which depicts an unidentified man shooting Cullen in the head; he narrowly survives, and has a metal plate surgically implanted in his skull. The killer's faces were never seen in the video and hence the case was closed.\nCicero deduces that Cullen is going after everyone in that video.Cullen visits his former girlfriend, Nan Porterman (Jennifer Carpenter) who knows he is killing those involved from the video of Gary's death. After revealing that she aborted their unborn child and has begun a new life by having a family, she wishes him well.\nAt a strip club in Nevada, Cullen stabs bouncer Hovis Nixon (Lester Speight) for his role in Gary's death, but he manages to survive. Soon, both Humphries and Killer get word that Nixon is in the hospital. Knowing Cullen will go back to finish him off, they converge there.Cullen enters the hospital and kills Nixon while he is in surgery. Humphries attempts to unsuccessfully bring down Cullen but is spared when the latter sees his badge.\nWhile driving away from the hospital, Cullen encounters Killer where they get into a high-speed chase on the freeway, culminating in Killer shooting Cullen in the neck.\nKiller receives a call from his handler that the client wants to pull the job, but Killer refuses to relent.Cullen goes to his mother to get his neck wound stitched.\nEventually Cullen comes to believe that his father arranged to have him, and Gary killed after they refused to share the money that they stole in that bank robbery. However, Cullen finds out that his father died 3-4 years before.\nMrs. Cullen (Annie Corley) says that Cullen's father was not capable of killing his own son Gary. Mr Cullen was cruel to Cullen, as he knew that Cullen was born out of wedlock, when Mrs Cullen cheated on him. Cullen sees a family photo that focuses on Gary's girlfriend, and it is shown that Gary's girlfriend is now Humphries' wife.The last man on his list is a traveling evangelist named Alexander Jerrod (Adewale Akinnuoye-Agbaje); after concluding his service, he is confronted by Cullen, but is spared after revealing that he has turned his life around and begging for forgiveness. Cullen is then confronted by Killer. Killer says that Cullen is not done, as there is still the one who hired him.Cicero eventually learns the true identity of the man who shot Cullen. She finds all the victims were police informants who never did any serious prison time. Their cases were dealt by Humphries.She hurries to the church where Humphries is already on the scene. As Killer and Cullen confront each other, Humphries walks in and shoots Cullen in the head, revealing it was he who shot him in the video. He offers Killer the money for completing the job, but Killer declines, telling Humphries to never contact him again.Humphries calls his wife, Marina (Moon Bloodgood), who is revealed to have been his informant, while she was still Gary's girlfriend. Suddenly, he is shot and killed by Cullen, who survived due to his metal plate. Cicero arrives on the scene after Cullen leaves, and she covers up Humphries' involvement.Cullen scatters Gary's ashes in the sea and drives off into the sunset, while Killer returns home to Lily; simultaneously, Jerrod begins a sermon on forgiveness.",
	"links": [
		"https://www.amazon.com/Faster-Dwayne-Johnson/dp/B004Q3NBXU",
		"https://www.netflix.com/title/70140907"
	]
}