{
	"title": "Rise of the Guardians",
	"release_year": "2012",
	"runtime": "97",
	"tags": [
		"Action",
		"Adventure",
		"Animation",
		"amazon"
	],
	"rating": 7.2,
	"actors": [
		"Hugh Jackman",
		"Alec Baldwin",
		"Isla Fisher",
		"Chris Pine",
		"Jude Law",
		"Dakota Goyo",
		"Khamani Griffin",
		"Kamil McFadden",
		"Georgie Grieve",
		"Emily Nordwind",
		"Emily Nordwind"
	],
	"staff": [
		"Peter Ramsey",
		"David Lindsay-Abaire",
		"William Joyce",
		"Nancy Bernstein",
		"Christina Steinberg",
		"Alexandre Desplat",
		"Joyce Arrastia",
		"Leslee Feldman",
		"Christi Soper",
		"Patrick Marc Hanenberger"
	],
	"votes": 195352,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTkzMjgwMDg1M15BMl5BanBnXkFtZTcwMTgzNTI1OA@@._V1_QL75_UX190_CR0,7,190,281_.jpg",
	"description": "The spirit of winter, Jack Frost (Chris Pine), is lifted with no previous memory from the depths of a frozen pond by the Man in the Moon, only to discover that no one can see, hear, or touch him. Three-hundred years later, at the North Pole, Nicholas St. North, better known as Santa Claus (Alec Baldwin), becomes aware that Pitch Black, the Boogeyman (Jude Law), has returned and is threatening the children of the world. After alerting fellow Guardians the Tooth Fairy/Toothiana (Tooth for short) (Isla Fisher), the Easter Bunny/E. Aster Bunnymund (Hugh Jackman), and the Sandman (Sandy for short) to the problem, North learns that Jack has been selected by the Man in the Moon as the new recruit. Jack, frustrated and hurt by centuries of isolation, declines the invitation, but North persuades him to cooperate by explaining their mission and the looming threat.Meanwhile, Pitch and his nightmare minions raid Tooth's palace, taking all the children's teeth and the memories stored within. He also captures Toothiana's helper fairies, but a single fairy, Baby Tooth, is rescued by Jack. Resentful that he himself is not believed in, Pitch plans to destroy children's faith in the Guardians and thereby weaken them by preventing Toothiana from doing her work. To avert this, the Guardians travel the world collecting teeth, promising Jack that when they find Pitch, they will help him regain his own baby teeth, and through them the memories of his past life. On the expedition, a young boy named Jamie Bennett (Dakota Goyo) is delighted to discover the Guardians in his room; he believes in all of them except for Jack, whom he cannot see. Pitch learns of the Guardians' resistance and attacks Jack and Sandy. Despite Jack's efforts to save him, Sandy is overwhelmed and seemingly killed by Pitch.The dejected Guardians rally by helping Bunnymund prepare his eggs for Easter. This is cause with the defeat of Sandman, the kids are already losing their faith & are being overwhelmed by nightmares & the next day is Easter & is one of quickest way to restore the kids faith.\nAlthough slightly complicated by the intrusion of Jamie's sister (who accidentally stepped into one of Santa's wormholes to emerge at the North Pole, while the Guardians were busy fighting Pitch), Sophie, the preparation goes smoothly.Jack takes Sophie home, but afterward a mysterious female voice lures him to Pitch's lair, where Tooth's fairies and the teeth are being held. Pitch keeps him distracted with the promise of his teeth's memories, while Jack's absence allows the nightmares to raid Bunnymund's domain, shattering all the eggs.After facing the disappointed Guardians, a despondent Jack departs in disgrace to Antarctica. There, Pitch tempts him to join forces, but Jack refuses, claiming that he does not want to be feared. In retaliation, Pitch threatens to kill Baby Tooth unless Jack relinquishes the source of his power, his staff. Pitch breaks the staff, and he throws both Jack and Baby Tooth down into an ice crevasse, where Baby Tooth convinces Jack to unlock his memories in an attempt to counter his despair. Long ago, his memories teach him, he was a mortal teenage boy who died saving his little sister from falling through the ice of the pond in which he awakened at the film's start.Because of that sacrifice, the Man in the Moon changed him into a spirit and chose him as a Guardian. Inspired by the revelation, Jack restores his staff and returns to help the Guardians.\nDue to the power of Pitch's nightmares, only one child (Jamie) still believes. Jack races to the boy first and strengthens Jamie's wavering faith in the Guardians, but by creating snow in Jamie's room, he causes the boy to believe that Jack Frost is real. Jamie is finally able to see him, much to Jack's delighted surprise. The weakened Guardians arrive to confront Pitch, while Jamie gathers his friends to support them. Pitch's seemingly overwhelming power proves no match against the children's faith, which allows the Guardians to battle the Boogeyman. Sandman is resurrected by this belief and joins the fight, leaving Pitch defeated, the children's faith restored, and Jack with believers of his own. Pitch is conquered by his own fear, and the nightmares drag him away into his lair.At this victory, Jack accepts his place as the Guardian of Fun and resolves to protect the world's children with his new friends.",
	"links": [
		"https://www.amazon.com/Rise-Guardians-Peter-Ramsey/dp/B079HRR6XV"
	]
}