{
	"title": "Deadpool",
	"release_year": "2016",
	"runtime": "108",
	"tags": [
		"Action",
		"Comedy",
		"max",
		"amazon"
	],
	"rating": 8.0,
	"actors": [
		"Ryan Reynolds",
		"Ryan Reynolds",
		"Morena Baccarin",
		"T.J. Miller",
		"Ed Skrein",
		"Karan Soni",
		"Michael Benyaer",
		"Stefan Kapicic",
		"Brianna Hildebrand",
		"Style Dayne",
		"Kyle Cassie"
	],
	"staff": [
		"Tim Miller",
		"Rhett Reese",
		"Paul Wernick",
		"Simon Kinberg",
		"Ryan Reynolds",
		"Lauren Shuler Donner",
		"Tom Holkenborg",
		"Ken Seng",
		"Julian Clarke",
		"Ronna Kress",
		"Sean Haworth"
	],
	"links": [
		"https://www.max.com/movies/deadpool/e1c2d169-c23b-4961-a2ee-f00d23a1117d",
		"https://www.amazon.com/Deadpool-Ryan-Reynolds/dp/B01BHDDR6M"
	],
	"votes": 1166002,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzY3ZWU5NGQtOTViNC00ZWVmLTliNjAtNzViNzlkZWQ4YzQ4XkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "Wade Wilson ambushes Ajax and a convoy of his men on an expressway. Throughout the ambush, Wilson shows the viewer the events leading to how he became Deadpool.2 years ago, Wade Wilson (Ryan Reynolds) is a former special forces operative who works as a mercenary in New York City. Wilson was dishonorably discharged as a Canadian special forces operative.\nHe meets escort Vanessa Carlysle (Morena Baccarin) at a local bar run by his friend Weasel, and they become romantically attached. Vanessa is a hooker and they both connect by competing to see who got the worse childhood. Wade hires Vanessa as a prostitute, but then takes her to a fair to spend time with her. Later that night, they have sex.\nOne year later, Wade proposes to her, and she accepts, but he suddenly collapses. Wade is diagnosed with terminal cancer in his lungs and though Vanessa remains by his side, he does not want her to watch him die.A recruiter (Jed Rees) from a secret program approaches Wade, offering an experimental cure for his cancer. The recruiter offers to give Wade powers that nobody else has, and to make him into a superhero. Although Wade initially refuses, he decides to leave Vanessa and undergo the procedure. At a laboratory, Wade meets Ajax (Ed Skrein) and Angel Dust (Gina Carano), whom he instantly resents.\nWade sees many such terminal patients at the lab, who have been experimented upon with varying results and different mutations. Ajax reveals that his lab is privately funded and not under any sort of Government jurisdiction. Ajax and Angel were patients as well.Ajax injects Wade with a serum designed to awaken latent mutant genes. The serum reacts differently with everybody. With Ajax, it gave him enhanced reflexes and scorched nerve endings which means that he does not feel any pain.\nThen Ajax has him subjected to days of torture (with a new method of torture each day, each more painful than the last one) to induce stress and trigger the mutation, but without success. Wade discovers Ajax's real name, Francis Freeman, and mocks him for it.In response, Ajax straps Wade into an airtight chamber which raises and lowers the oxygen level to keep Wade constantly on the verge of asphyxiation - leaving him over the weekend but not before Ajax reveals to Wade their true purpose: to make super-powered slaves to be sold to wealthy customers.\nWhile inside the chamber, Wade develops a healing factor that cures his cancer but leaves him severely disfigured as a side-effect with tumor-like scars over his entire body. Wade escapes from the chamber and attacks Ajax but relents when told that his disfigurement can be cured, and he is the only one who can fix it for Wade. Ajax subdues Wade, impales him with a re-bar and leaves him for dead in the burning laboratory.\nBy the next morning, the lab is destroyed, but Wade survived due to his healing abilities.Wilson survives due to his new healing abilities and attempts to return to Vanessa, but is afraid of her suffering because of his appearance, and stays away from her.\nAfter consulting his best friend Weasel (T. J. Miller), Wade decides to hunt down Ajax and have his disfigurement cured. He becomes a masked vigilante, takes the alias \"Deadpool\" (from Weasel picking him in a dead pool, which is basically a bar bet with odds on favorite for being most likely to be killed that day. Weasel always bet on Wade, and always lost), and moves into the home of an elderly blind woman named Blind Al (Leslie Uggams).\nDeadpool chooses a red color costume, based on Al's suggestion, so that his enemies cannot see him bleed and has a deadpan sense of humor.Over the course of the next year, he questions and kills many of Ajax's associates until one, the recruiter, reveals Ajax's whereabouts.\nFollowing a string of leads, Deadpool tracks down Ajax to a convoy of cars on an expressway. Dopinder (Karan Soni) is a taxi driver who befriends Deadpool on the way.He kills all the escorts, corners Ajax and demands a cure to his disfigurement. The confrontation is interrupted by two X-Men, Colossus (Stefan Kapicic) (an X-Men who can transform his entire body into organic steel) and Negasonic Teenage Warhead (Brianna Hildebrand) (A teenage X-Men trainee who can generate atomic bursts from her body), who have been trying to recruit Deadpool to join them. Colossus says that Deadpool had been warned before about reckless use of his powers.\nDeadpool refuses to go with Colossus.Taking advantage of the distraction, Ajax escapes. Deadpool is livid and breaks his hands and legs when he tries to attack Colossus. Colossus handcuffs Wade to his wrist and begins dragging him away, planning to take him to Charles Xavier / Professor X back at the X-Mansion. Deadpool cuts off his hand and escapes. His hand slowly regenerates overnight.Ajax knows that Wade will come for him when he heals, and he has no leverage on Wade.\nAjax goes to Weasel's bar and learns about Vanessa. Weasel calls Wade and tells him Vanessa is in danger. Wade goes to the strip club where she works but hesitates before he can face her. In the meantime, Ajax kidnaps Vanessa. He and Angel Dust tell Deadpool to meet them on a decommissioned Helicarrier in a scrapyard. Deadpool prepares for battle but knows that he will need help.\nMeanwhile Ajax tells Vanessa that Wade is still alive, and she has been kidnapped because he still has feelings for her.Deadpool convinces Colossus and Negasonic to help him as he holds them responsible for allowing Ajax to escape, and the trio takes a cab to the scrapyard. While Colossus and Negasonic battle Angel Dust and several soldiers, Deadpool fights his way through Ajax's henchmen, and eventually engages him.\nAfter Angel Dust defeats Colossus, Negasonic attacks her, but accidentally destroys the equipment holding the Helicarrier upright. As the Helicarrier tips over, Colossus carries Negasonic and Angel Dust to safety, while Deadpool saves Vanessa.Ajax survives and attacks Deadpool but is subdued and reveals there is no cure for Wade's disfigurement. Despite objections from Colossus, Deadpool kills Ajax. Vanessa then angrily berates Wilson for leaving her, but she reconciles with him after she sees his disfigured face and learns the real reason why he never came back to her.In a post-credits scene, Wade tells the audience that the film is over and announces a sequel featuring Cable."
}