{
	"title": "Godzilla x Kong: The New Empire",
	"release_year": "2024",
	"runtime": "115",
	"tags": [
		"Action",
		"Adventure",
		"Fantasy",
		"max",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Rebecca Hall",
		"Brian Tyree Henry",
		"Dan Stevens",
		"Kaylee Hottle",
		"Alex Ferns",
		"Fala Chen",
		"Rachel House",
		"Ron Smyck",
		"Chantelle Jamieson",
		"Greg Hatton"
	],
	"staff": [
		"Adam Wingard",
		"Terry Rossio",
		"Adam Wingard",
		"Simon Barrett",
		"Jeremy Slater",
		"Alex Garcia",
		"Eric McLeod",
		"Mary Parent",
		"Brian Rogers",
		"Antonio Di Iorio",
		"Tom Holkenborg",
		"Ben Seresin",
		"Josh Schaeffer",
		"Sarah Finn",
		"Krista Husar",
		"Tom Hammock"
	],
	"links": [
		"https://www.max.com/movies/godzilla-x-kong-the-new-empire/e8dfef9b-fa41-4041-8230-7dd832116f2e",
		"https://www.amazon.com/Godzilla-x-Kong-New-Empire/dp/B0CXDBP7K8"
	],
	"votes": 101646,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTY0N2MzODctY2ExYy00OWYxLTkyNDItMTVhZGIxZjliZjU5XkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "Three years after defeating Mechagodzilla, Kong has established his new territory in the Hollow Earth and searches for more of his kind. On Earth's surface, Godzilla continues to maintain order between humanity and giant monsters, known as \"Titans\" by killing Scylla in Rome and resting in the Colosseum afterwards.\nThe Monarch organization believe that so long as Kong and Godzilla operate on different planes, there will be peace. From time to time, Kong does come to the surface, specifically when he needs medical attention. On one instance his tooth is infected, and he needs a replacement, which is administered by Trapper. Kong returns back to Hollow Earth, whenever his work is done. Monarch know that Kong almost lost his life during his last confrontation with Godzilla and want to keep them apart.A Monarch observation outpost stationed in the Hollow Earth picks up an unidentified signal. On the surface, the signal causes Jia (Kaylee Hottle), the last known survivor of the Iwi tribe from Skull Island, to experience hallucinations and visions, causing her adoptive mother, Dr. Ilene Andrews (Rebecca Hall), to worry.\nAndrews approaches pod-caster Bernie Hayes with her data and wants his help to understand what the signals mean. After analysis, Bernie speculates that the signal has coincided with specific titan events on the surface in the past. As such, the signal represents a distress call to Godzilla.\nAlso sensing the signal, Godzilla leaves Rome and attacks a nuclear plant in France to absorb the radiation. Godzilla then heads to the Titan Tiamat's lair in the Arctic. Tiamat is the largest single source of energy on the planet. Godzilla rips Tiamat apart and enters its lair to absorb the entire store of energy.\nMonarch believes Godzilla is strengthening himself for an oncoming threat.When a sinkhole opens near his home, Kong discovers an uncharted region where a tribe of his species has survived, including a juvenile named Suko.\nAfter an initial confrontation, Kong forces Suko to lead him to the tribe's lair, and the two slowly bond on their journey. Suko tries to kill Kong by luring him into the path of different monsters, but Kong defeats them all relatively easily. This gives Suko the confidence that Kong is strong enough to face the dangers ahead.\nThe tribe's tyrannical leader, the Skar King, battles Kong with the aid of an ancient ice-powered Titan, Shimo, whom the Skar King controls with pain using a crystal. Shimo's breath was responsible for the last ice age on the planet.\nShimo's ice breath damages Kong's right arm, causing frostbite, but with Suko's help, Kong manages to escape, though he loses his ax in the process.Andrews and Jia, alongside Titan veterinarian Trapper (Dan Stevens) and conspiracy pod-caster Bernie Hayes (Brian Tyree Henry), travel to the Hollow Earth to locate the source of the signal. They find the Monarch outpost destroyed.\nAs the group ventures forward to the source of the signal, they discover a temple (behind an organic bio-luminescent camouflaged barrier) that leads them to a subterranean section that houses a surviving Iwi tribe, who communicate telepathically with each other. Inspecting some ruins, they surmise that the signal was a telepathic distress call sent by the Iwi.While observing Jia socializing with the Iwi, Andrews voices her fears to Trapper that Jia may choose to stay with her people and that Andrews would have to accept it.\nInside a temple, Andrews uncovers hieroglyphics displaying the past and future: the Skar King once attempted to conquer the surface world and waged war against Godzilla's species, but Godzilla defeated him and trapped him and his tribe deep within the Hollow Earth.\nOnce Kong entered Hollow Earth, the Iwi people knew that it was only a matter of time that Skar King and Kong would come face to face. And there was a possibility that Skar King would defeat Kong and would escape to the surface via the portals. Hence the Iwi had been sending distress signals to attract the attention of Godzilla and Jia.\nThe prophecy also indicates that Jia would be the key to reawakening Mothra. Mothra is in charge of protecting the jump points between Hollow Earth and Surface Earth and maintaining peace between the 2 domains.Sensing Jia, Kong locates the temple and is fitted by Trapper with a prototype exoskeleton arm brace to strengthen and heal his frostbitten limb. The prototype exoskeleton arm brace was stored at Outpost One and hence was quickly accessible.\nUnbeknownst to them, one of the Skar King's loyalists has followed them and informs the Skar King, who assembles his invasion force for Earth. Jia successfully awakens the reborn Mothra.Godzilla absorbs cosmic radiation from Tiamat's lair, evolving him and turning his dorsal plates magenta. Hoping to lure Godzilla to the Hollow Earth to assist him, Kong surfaces in Cairo and calls out to Godzilla. Despite Kong's attempts to communicate, an irate Godzilla attacks him, and a brief fight ensues until Mothra arrives with Jia and convinces Godzilla to help Kong.The trio then heads down to Hollow Earth to face the Skar King along with Shimo and his army. The fight drags Godzilla, Kong, Shimo and the Skar King to Rio De Janeiro, where Shimo begins to induce another ice age at the Skar King's command. Shimo fires his ice breath into the sky, covering the sky and blotting out the sun.\nDespite numerous attempts neither group is able to gain ascendancy over the other and the city of Rio is destroyed in the battle.\nThe factions are evenly matched until Suko arrives with Kong's ax and destroys the crystal controlling Shimo. With the pain gone, Shimo now listens to Godzilla, who points him in the direction of the Skar King.\nShimo and Kong then freeze and shatter the Skar King.After undoing Shimo's ice age with his atomic breath, Godzilla returns to rest in the Colosseum. Jia reunites with Andrews and alleviates her fears by choosing to stay with her adopted mother. Mothra restores the protective barrier of the Iwi's home and then departs. Kong returns with Shimo and Suko to Hollow Earth, where he becomes the ape tribe's new leader."
}