{
	"title": "The Best Exotic Marigold Hotel",
	"release_year": "2011",
	"runtime": "124",
	"tags": [
		"Comedy",
		"Drama",
		"Romance",
		"amazon"
	],
	"rating": 7.2,
	"actors": [
		"Judi Dench",
		"Bill Nighy",
		"Maggie Smith",
		"Tom Wilkinson",
		"Patrick Pearson",
		"Hugh Dickson",
		"James Rawlings",
		"Penelope Wilton",
		"Liza Tarbuck",
		"Paul Bhattacharjee"
	],
	"staff": [
		"John Madden",
		"Ol Parker",
		"Deborah Moggach",
		"Graham Broadbent",
		"Peter Czernin",
		"Thomas Newman",
		"Ben Davis",
		"Chris Gill",
		"Michelle Guish",
		"Seher Latif",
		"Alan Macdonald"
	],
	"votes": 100289,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjIwNjkwMDI2NV5BMl5BanBnXkFtZTcwNDc1ODIyNw@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Recently widowed housewife Evelyn (Judi Dench) must sell her home to cover huge debts left by her late husband. Evelyn struggles with ordering basic services on the phone, as all call centers are now based in India.\nGraham (Tom Wilkinson), a high-court judge who had spent his first eighteen years in India, abruptly decides to retire and return there.\nJean (Penelope Wilton) and Douglas (Bill Nighy) seek a retirement they can afford, having lost most of their savings through investing in their daughter's internet business. Jean is a very negative person and criticizes everything. She was specifically angry that after all his 30 years of civil service, Douglas could only afford a cheap looking home in a retirement colony in the UK.Muriel (Maggie Smith), a retired housekeeper prejudiced against Indians and every other person of color under the sun, needs a hip replacement operation which can be done far more quickly and inexpensively in India. Muriel is assigned an Indian Dr. Ghujarapartidar (Paul Bhattacharjee) for her surgery and is told that the wait for her surgery would be more than 6 months. Dr. Ghujarapartidar tells Muriel about a scheme where her surgery will be outsourced and she will get treated immediately. But the surgery will be in India.\nMuriel packs one month worth of pickled onions, pickled eggs and biscuits with her as she does not trust the food.Madge (Celia Imrie) is hunting for another husband (and hates babysitting for her daughter's family in the UK. She wants a life of her own), and Norman (Ronald Pickup), an aging Lothario, is trying to re-capture his youth.\nThey each decide on a retirement hotel in India, based on pictures on its website. The groups gather at the London airport and realize that they are all headed to the same hotel in India. The flight from London lands in Delhi, but the connecting flight to Jaipur is canceled and the whole group is stranded. Graham takes charge as he has been to India before and gets the group on a state transport bus to Jaipur. From the center of the city, the group hires a few Tuk-Tuks to take them to the hotel.When the group finally arrives at the picturesque hotel, despite its energetic young manager Sonny (Dev Patel) (who is the manager and also the Chief Executive Supervising Officer), the hotel is very dilapidated, and Sonny is trying to renovate it with the limited funds he has. Sonny tries to defend saying that the building has character and outlasted many wars in his history. He offers to refund the guests in full in 3 months. Young Wasim (Honey Chhaya) is the hotel's other worker and very old.Evelyn starts on an online blog of her experiences in India. The endless stream of exotic dishes from Sonny's kitchen sends all guests to the toilets.\nJean remains ensconced in the hotel, while her husband Douglas explores the sights. Graham, finding that the area has greatly changed since his youth, disappears on long outings every day. Graham is looking for houses in a particular area and finds that they have been demolished long ago and the families have long since moved. Graham indulges in a bit of gully cricket.\nMuriel, despite her racist attitudes, starts to appreciate her doctor (Bhuvnesh Shetty) for his skill and the hotel maid Anokhi (Seema Azmi) for her good service.\nMuriel wanted to return to England after the surgery but needs physiotherapy to be able to get back on a place.Evelyn gets a job (after reading an advertisement in the newspaper) advising the staff of a call center how to interact with older British customers. Sonny struggles to raise funds to renovate the hotel and is dating his girlfriend, Sunaina (Tena Desae), despite his mother's disapproval. Sunaina works in the same call center that Evelyn has joined. Jay (Sid Makkar) is Sunaina's brother and the manager of the call center.Madge joins the Viceroy Club (Mr Dhurana (Denzil Smith) is the secretary) seeking a spouse and is surprised to find Norman there. She introduces him to Carol (Diana Hardcastle). He admits he is lonely and seeking a companion, and the two begin a relationship.\nSonny is trying to find investors who can fund the renovation of the hotel.Graham confides in Evelyn that he is trying to find the Indian lover he was forced to abandon as a youth. Graham says he and Manoj were found in bed together and the disgrace for Manoj was absolute. His father was fired, and his family was ostracized. Graham says that he just let it happen and didn't put up any kind of fight. He eventually returned to England.\nSocial-climber Jean is attracted to Graham, and makes a rare excursion to follow him, but is humiliated when he explains he is gay. Graham reunites with his former lover, who is in an arranged marriage of mutual trust and respect. Graham dies of a heart condition.Evelyn and Douglas grow increasingly close. Douglas' wife is angry, and he bursts out that he is tired of defending his wife's negative attitude, and it is clear just how unhappy their marriage has become. Muriel reveals that she was once housekeeper to a family who had her train her younger replacement and now, she feels that she has lost purpose in her life.Sonny's more successful brothers each own a third of the hotel, and plan to demolish it. One of the brothers is settled in Delhi and the other in Canada.\nHis mother Mrs. Kapoor (Lillete Dubey) agrees and wants him to return to Delhi for an arranged marriage.Jean and Douglas prepare to return to England. Now that the hotel is closing, Madge prepares to return to England and Norman agrees to move in with Carol. Madge, after encouragement from Carol and Muriel, decides to keep searching for another husband.Sonny, encouraged by Evelyn, finally tells Sunaina that he loves her and confronts his mother, who first forbids the match but then is persuaded by the old man and she finally gives the couple her blessing. She asks Sunaina to take good care of her \"favorite son\".\nBefore the remaining guests can leave, Muriel reveals that the hotel can make a profit and that Sonny's investor has agreed to fund his plans as long as Muriel stays on as assistant manager. All the guests agree to stay.On their way to the airport, Jean and Douglas's taxi gets caught in a traffic jam and a rickshaw driver says that he can only take one of them. Jean sees it as a sign that it's time to split with Douglas and tells him goodbye and leaves. He winds up at the wrong hotel spends the rest of the night wandering the streets.\nHe returns to the hotel just as Evelyn is leaving for work and asks when she'll be back; she says about 5 PM. He asks her how she wants her tea.A closing montage with a voiceover shows Muriel checking in customers in an elegant, renovated lobby, Madge dining with a handsome older Indian man, and Norman and Carol living happily together. Sonny and Sunaina are shown riding a motorbike and passing Douglas and Evelyn on another bike.",
	"links": [
		"https://www.amazon.com/Best-Exotic-Marigold-Hotel/dp/B008VVT51U"
	]
}