{
	"title": "Aquaman",
	"release_year": "2018",
	"runtime": "143",
	"tags": [
		"Action",
		"Adventure",
		"Fantasy",
		"max",
		"amazon"
	],
	"rating": 6.8,
	"actors": [
		"Jason Momoa",
		"Amber Heard",
		"Willem Dafoe",
		"Patrick Wilson",
		"Nicole Kidman",
		"Dolph Lundgren",
		"Yahya Abdul-Mateen II",
		"Temuera Morrison",
		"Ludi Lin",
		"Michael Beach"
	],
	"staff": [
		"James Wan",
		"David Leslie Johnson-McGoldrick",
		"Will Beall",
		"Geoff Johns",
		"James Wan",
		"Rob Cowan",
		"Peter Safran",
		"Rupert Gregson-Williams",
		"Don Burgess",
		"Kirk M. Morri",
		"Anne McCarthy",
		"Kellie Roy",
		"Bill Brzeski"
	],
	"links": [
		"https://www.max.com/movies/aquaman/7b5168e8-da4e-4b49-bd29-091bc899ef2b",
		"https://www.amazon.com/Aquaman-Jason-Momoa/dp/B07PPK1BXZ"
	],
	"votes": 527285,
	"cover": "https://m.media-amazon.com/images/M/MV5BOTk5ODg0OTU5M15BMl5BanBnXkFtZTgwMDQ3MDY3NjM@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1985 Maine, lighthouse keeper Thomas Curry (Temuera Morrison) rescues Atlanna (Nicole Kidman), the princess of the underwater nation of Atlantis, during a storm. Thomas brings Atlanna inside his house and tends to her wounds. She gains consciousness a few days later. Atlanna was fleeing an arranged marriage in her Kingdom. They eventually fall in love and have a son named Arthur (Jason Momoa), who is born with the power to communicate with marine lifeforms.\nAtlanna is forced to abandon her family and return to Atlantis, entrusting to her loyal advisor Nuidis Vulko (Willem Dafoe) (Atlantis' counselor, who was a mentor of Arthur Curry when he was young) the mission of training Arthur.\nUnder Vulko's guidance, Arthur becomes a skilled warrior but is rejected by the Atlanteans for being a half-breed and ultimately leaves Atlantis behind.In the present, one year after Steppenwolf's invasion, Arthur confronts a group of pirates attempting to hijack a Russian Naval nuclear submarine. Arthur carries the submarine to the surface, kills the pirates and rescues all the sailors, who had locked themselves in the aft compartment.\nThe leader of the pirates, Jessie Kane (Michael Beach), dies during the confrontation while his son, David (Yahya Abdul-Mateen II), vows revenge upon Arthur. Arthur defeats David in battle, impales Jessie on a pipe and leaves both Jessie and David to die when one of Jessie's bullets punctures the submarine's hull. David begs Arthur to help save Jessie, but Arthur walks away. Jessie sacrifices himself by exploding a grenade, to force David to leave and save himself.\nDavid's grandfather was one of the first frogmen in the Navy and served in WWII. He was considered very stealthy and was nick-named Manta, in honor of his skill.David later targets Atlantis, with another attack submarine) at the behest of Orm (Patrick Wilson) (who seeks to unite the seven underwater kingdoms to declare war on the surface world out of the belief that humanity polluted the seas), Arthur's younger half-brother and Atlantis' king who uses the attack as a pretext to declare war on the surface.\nTurns out this is why David and Jessie were stealing a nuclear submarine, so they could attack Atlantis and give an excuse to Orm to declare war on the surface dwellers.\nKing Nereus was reluctant to declare war and tells Orm that the 4 of the 7 ocean Kingdoms (Atlantis, Xebel, the Fishermen, the Brine, the Deserters, the Lost Nation and the Trench) need to agree for war. Nereus also knows that if the 4 Kingdoms agree with Orm, he will be declared Ocean Master.King Nereus (Dolph Lundgren) of Xebel swears allegiance to Orm's cause (He was not very keen initially, but agrees once David had attacked Atlantis), but his daughter Mera (Amber Heard) (Mera possesses Hydrokinetic and Telepathic powers that allow her to control her aquatic environment and communicate with other Atlanteans), who has been betrothed to Orm, refuses to aid them and journeys to the surface to ask Arthur for help, earning his trust by saving Thomas from a tidal wave sent by Orm as a message to the surface dwellers, that the oceans have declared war on them.\nMera tells Arthur that the only way to stop the war is for Arthur to claim his rightful place on the throne of Atlantis. He is the first born of Queen Atlanna.Arthur reluctantly accompanies Mera to a rendezvous with Vulko, who urges Arthur to find the Trident of Atlan, a magic artifact that once belonged to Atlantis' first ruler in order to reclaim his rightful place as king. Arthur will be able to press his claim to the throne with the trident in his possession. They are ambushed by Orm's men and Mera and Vulko escape without having been seen, while Arthur is captured.Orm visits Arthur in captivity and announces that Atlanna was executed for the crime of having a half-breed son, blaming Arthur and the surface for her death. He offers Arthur an opportunity to leave forever, but Arthur instead challenges him to a duel in a ring of underwater lava. Orm gains the upper hand and nearly kills Arthur before Mera rescues him.\nTogether, Arthur and Mera journey to the Sahara Desert where the trident was forged and unlock a holographic message that leads them to Sicily, Italy, where they retrieve the trident's coordinates.\nMeanwhile, Orm provides David with a prototype Atlantean battle suit to kill Arthur, imprisons Vulko upon learning of his betrayal, and coerces the remaining kingdoms of Atlantis to pledge their allegiance to him and his campaign against the surface.After modifying Orm's technology, a fully armored David rechristens himself as Black Manta and ambushes Arthur and Mera in Sicily, injuring Arthur before being thrown off a cliff to his apparent death. Mera nurses Arthur's wounds as they journey to the trident's whereabouts (in the middle of the ocean) and encourages him to embrace his destiny as a hero.\nArriving at their destination, Arthur and Mera are attacked by a legion of amphibious monsters known as The Trench but manage to fend them off and reach a wormhole that transports them to an uncharted sea located at the center of the Earth. There, they are unexpectedly reunited with Queen Atlanna, who was sacrificed to the Trench for her crimes but managed to escape and reach the uncharted sea, where she has been stranded ever since.Arthur faces Karathen, the mythical leviathan that guards the trident, and voices his determination to protect both Atlantis and the surface, proving his worth and reclaiming the trident, which grants him control over the seven seas.\nOrm and his allies lead an army against the crustacean forces of the Kingdom of the Brine with the intent of completing Orm's surface battle preparations. As Orm declares himself Ocean Master, Arthur, and Mera, with the assistance of Karathen and the Trench, intervene and lead an army of marine creatures in a battle against him.\nOrm's followers renounce their obedience to him and embrace Arthur as the true king upon learning he wields the trident.Orm has no option but to challenge Arthur in 1 to 1 battle, as only Arthur's death can give him the throne. But this time, Mera advises Arthur to choose the surface, an element that is alien to Orm.\nArthur defeats Orm in combat but chooses to spare his life and Orm accepts his fate after discovering Arthur has found and rescued Atlanna. Atlanna returns to the surface to reunite with Thomas while Arthur ascends to the throne with Mera by his side.In a mid-credits scene, David is rescued by Dr. Stephen Shin, a scientist obsessed with finding Atlantis, and agrees to lead Shin there in exchange for his help in his revenge on Arthur."
}