{
	"title": "Filth",
	"release_year": "2013",
	"runtime": "97",
	"tags": [
		"Action",
		"Comedy",
		"Crime",
		"amazon",
		"netflix"
	],
	"rating": 7.0,
	"actors": [
		"James McAvoy",
		"Jamie Bell",
		"Eddie Marsan",
		"Imogen Poots",
		"Brian McCardie",
		"Emun Elliott",
		"Gary Lewis",
		"John Sessions",
		"Shauna Macdonald",
		"Jim Broadbent"
	],
	"staff": [
		"Jon S. Baird",
		"Jon S. Baird",
		"Irvine Welsh",
		"Mark Amin",
		"Christian Angermayer",
		"Jon S. Baird",
		"Will Clarke",
		"Clint Mansell",
		"Matthew Jensen",
		"Mark Eckersley",
		"Kahleen Crawford",
		"Janet Hirshenson",
		"Dan Jackson",
		"Jane Jenkins",
		"Mike Gunn"
	],
	"links": [
		"https://www.amazon.com/Filth-James-McAvoy/dp/B00JWKDF1K",
		"https://www.netflix.com/title/70298426"
	],
	"votes": 116921,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjE2NTgyMzM0NV5BMl5BanBnXkFtZTgwNzkwNDE1MzE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Bruce Robertson (James McAvoy) is a Detective Sergeant in Edinburgh, Scotland who suffers from borderline personality disorder; He is a scheming, manipulative, misanthropic man who spends his time indulging in drugs, alcohol, sexually abusive relationships, and \"the games\" - his euphemism for the myriad foul plots he hatches directed at workmates. Robertson also delights in systematically bullying and taking advantage of his mild-mannered friend Clifford Blades (Eddie Marsan), a member of Robertson's masonic lodge whose wife, Bunty, he repeatedly pranks calls and asks for phone sex.Dougie Gillman (Brian McCardie) is Robertson's other colleague who is more akin to the third Reich than an average Scottish policeman. Peter Inglis (Emun Elliott) is Robertson's main rival for the promotion & is certified gay. Ray Lennox (Jamie Bell) is the department rookie and a junkie. Gus Bain (Gary Lewis) is old and not too sharp, but still is a rival that Robertson takes seriously. Amanda Drummond (Imogen Poots) is an ass kisser and has probably had sex with half the department. Bob Toal (John Sessions) is the department head and has ambitions to become a screen writer.Bob is member of the same masonic lodge & is concerned about this pervert who is prank calling Blades's wife. Bob indicates to Robertson that finding & apprehending this pervert will be another brownie point for him towards his promotion.\nRobertson's main goal in life is to gain promotion to Detective Inspector, the path to which appears to open when he is assigned to oversee the investigation into the murder of a Japanese student. The murder is a hate crime, by a group of white students and his wife is a witness.\nWhile Bunty is not aware that Roberston is the pervert, but she is attracted to him when Robertson advises her to indulge the pervert in his fantasies in order to apprehend him. Bunty is not sexually satisfied with Blades.Robertson leans on a prostitute to elicit info on the Neo Nazi gang who killed the Jap student & believes that the case is solved, but Bob has moved on since the press has lost interest. He wants Robertson to hand over the case to Drummond.He slowly loses his grip on reality as he works the case, however, suffering from a series of increasingly severe hallucinations. These hallucinations become worse over time, and Robertson descends into insanity. It is ultimately revealed through dream-like exchanges with Dr. Rossi (Jim Broadbent), his psychiatrist, that he is on medication for bipolar disorder and is wracked with guilt over a tragic accident that led to the death of his younger brother during his childhood.Robertson continues taking drugs to push on with the investigation & deliberately keeping Drummond out of it. He starts collecting DNA samples of the suspects (including a hardened criminal called Gorman) by visiting the brothels that they have been to. Robertson then cleverly exposes the fact that Peter Inglis is Gay. Bob hates gays, and hence there goes Peter's chance of a promotion.It also becomes clear that Carole (Shauna Macdonald), his wife, had left him for another man some time prior to the film's events and is denying him access to his daughter, Stacey, developments which sparked his desperate bid for promotion and also led him to start dressing as his wife when off duty in order to \"keep her close\" to him. So, it turns out that it was Robertson himself dressed as Carole, who was out that night when the Jap student was killed. Robertson knew who the killers were exactly.Robertson goes to England for a drug & sex trip with Blades. Meanwhile Bob assigns Amanda to take the lead on the murder investigation. She figures that there is a blonde witness (actually Carol), and also wants to bring in Gorman for questioning. Bob is also angry that Robertson has done nothing to solve the Blades case. Robertson decides to frame Blades as the prank caller and then proceeds to have sex with Bunty. Blades is jailed. Peter Inglis commits suicide after he is suspended from the force.While wandering the streets on such an occasion, Robertson is captured by a gang led by Gorman (Martin Compston) - who are responsible for the murder - and badly beaten. However, he manages to kill Gorman by throwing him out a window and is found by his colleagues. Robertson not only misses out on the promotion as a result of the events but is in fact demoted to Constable and is reassigned to uniform, while rookie Ray Lennox is promoted to Detective Inspector.\nAfterwards, Blades receives a tape of Robertson apologizing. Robertson then prepares to commit suicide by hanging himself, but is interrupted by Mary, a woman whose husband Robertson attempted to save, and her son knocking on his front door. He then breaks the fourth wall and addresses the audience repeating his catchphrase - \"Same rules apply\" - and laughs as the chair breaks under him."
}