{
	"title": "I Am Number Four",
	"release_year": "2011",
	"runtime": "111",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Alex Pettyfer",
		"Timothy Olyphant",
		"Dianna Agron",
		"Teresa Palmer",
		"Callan McAuliffe",
		"Kevin Durand",
		"Jake Abel",
		"Jeff Hochendoner",
		"Patrick Sebes",
		"Greg Townley"
	],
	"staff": [
		"D.J. Caruso",
		"Alfred Gough",
		"Miles Millar",
		"Marti Noxon",
		"Jobie Hughes",
		"Michael Bay",
		"Trevor Rabin",
		"Guillermo Navarro",
		"Vince Filippone",
		"Jim Page",
		"Deborah Aquila",
		"Tricia Wood",
		"Tom Southwell"
	],
	"votes": 247804,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjI0NDI1MTMyM15BMl5BanBnXkFtZTcwMDMzMTcyNA@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "An alien from planet Lorien (Alex Pettyfer) was sent to Earth as a child alongside eight others to escape an invading race, the Mogadorians, which destroyed their home planet. He is protected by a Warrior/Guardian, Henri (Timothy Olyphant), and has developed superpowers due to his extraterrestrial nature, such as enhanced strength, speed and agility, telekinesis, resistance to fire and heat, and the power to generate light from his hands.The Mogadorians, led by the Commander (Kevin Durand) eventually discover about the nine toddlers and come to Earth in search of them. These Loriens can only be killed in a particular sequence, with three of them having already been slain. John is Number Four. Knowing this, he and Henri move from Florida to Paradise, Ohio, where John befriends conspiracy theorist Sam Goode (Callan McAuliffe), a dog named Bernie Kosar, and falls in love with amateur photographer Sarah Hart (Dianna Agron) who is in his class at Paradise high school. Sarah's ex-boyfriend, school athlete Mark James (Jake Abel) is a bully who often torments both John and Sam.Henri keeps a box given by John's father when they were escaping the planet. Henri treasures the box above everything else & has promised to give it to John, when the time is right. Henri reveals to John that John was chosen by Lorien's as a guardian & thus has the special powers which he has inherited from his parents.Sam tells John that his dad was a conspiracy theorist & who has now been missing for many years. He worked at the Paradise steel plant & was building some sort of a landing platform for alien craft, at the time of his disappearance in New Mexico. We see that Henri is checking out internet reports on Sam's dad at home. Henri even investigates at the abandoned steel plant, where Sam's dad used to work, & finds the shell of a blue rock in a secluded and hidden spot.During the spring carnival, Mark and his friends capture John and Sarah, whom they believe are in a relationship, and follow them into the woods, where they attempt to beat John up. However, he uses his powers to fend them off and rescue Sarah. Sam witnesses the events, and John tells him his true origin. Shortly thereafter, Mark's father, the local sheriff, interrogates Henri on John's whereabouts when his son and his friends were attacked, and notices that Henri has a high-tech surveillance system.Henri tells John that too many people are suspicious of them, in addition to Johns random displays of power, caused by his difficulty in controlling them, and that they must leave. However, John tells him he can't because he's in love with Sarah. Henri attacks John & John fights back & almost beats Henri. Henri explains that John was saved for a higher purpose, to defeat the Mogadorians. Very few Loriens can, & John is one of them. The next day, Henri gives John his father's box.\nThe Mogadorians start searching for John. Another alien from Lorien, Number Six (Jake Abel), decided to go after the Mogadorians instead of running away from them after her Guardian was murdered.The Mogadorians eventually locate John and manipulate two conspiracy theorists into capturing Henri. When John and Sam go to rescue him, they are attacked but manage to fend Mogadorians off. However, Henri is mortally wounded and dies after John and Sam escape with some Lorien artifacts, including a blue rock that acts as a tracking device to locate other Loriens. Sam's father, a conspiracy theorist who disappeared while hunting aliens in Mexico, has another. While Sam searches for it, John tries to say goodbye to Sarah at a party, only to discover that the Mogadorians have framed him and Henri for the murders of the conspiracy theorists, as well as being terrorists due to their cutting-edge technology. Mark sees John and calls his father, who corners John and Sarah. He saves her from a fall, revealing his powers in the process, and they escape to their high school.Meanwhile, The Commander also arrives at Paradise, blocking the exits with trucks. He is confronted by Mark and his father, and, after injuring the latter, he forces the former to show him where John is hiding, Mark then takes him to the school, which he knows is Sarahs hideout.There, John, Sarah, and Sam are attacked by the Commander and his soldiers, who have brought two giant monsters to hunt the trio. They are saved by Number Six and John's \"dog,\" Bernie Kosar, who reveals his true form as a good Chimera, which can shape-shift, and was sent by his parents to protect him. Bernie Kosar eventually shape-shifts back to a beagle with a very wounded paw. John and Number Six, who can make herself invisible and block energy-based attacks, fight the Mogadorians. They eventually defeat them all, including the Commander, whose energy grenades are overheated by John and explode, destroying his body.On the following day, John, Number Six, Sam, and Bernie Kosar, the shape-shifting Chimera, unite their blue rocks and discover the location of the other four surviving Loriens. They set to find them and rally them together to protect Earth from the Mogadorians, leaving Sarah and a repentant Mark, who has redeemed himself by lying to his father about John's whereabouts and returning to John a box belonging to his father.",
	"links": [
		"https://www.amazon.com/Am-Number-Four-Alex-Pettyfer/dp/B004Z2TUGE"
	]
}