{
	"title": "Man on a Ledge",
	"release_year": "2012",
	"runtime": "102",
	"tags": [
		"Action",
		"Crime",
		"Thriller",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Sam Worthington",
		"Elizabeth Banks",
		"Jamie Bell",
		"Mandy Gonzalez",
		"William Sadler",
		"Barbara Marineau",
		"J. Smith-Cameron",
		"Anthony Mackie",
		"Patrick Collins",
		"Genesis Rodriguez"
	],
	"staff": [
		"Asger Leth",
		"Pablo F. Fenjves",
		"Lorenzo di Bonaventura",
		"Mark Vahradian",
		"Henry Jackman",
		"Paul Cameron",
		"Kevin Stitt",
		"Deborah Aquila",
		"Ross Meyerson",
		"Julie Tucker",
		"Tricia Wood",
		"Alec Hammond"
	],
	"votes": 159287,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTc5MTE4MzY2N15BMl5BanBnXkFtZTcwNjMwNDc3Ng@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In New York City, Nick Cassidy (Sam Worthington) checks in to the Roosevelt Hotel under the false name of Walker, goes to his hotel room on the 21st floor. He orders a hearty meal with champagne, then proceeds to clean all fingerprints from the cutlery, and tidies up the room.\nNick climbs on the ledge after writing a note on the desk notepad, apparently ready to commit suicide.It is shown that Nick was in prison just a month ago and his application for appeal of his conviction was denied. Nick was being treated brutally in prison by the other inmates on account of being an ex-cop, and he had his arm fractured. Mike Ackerman (Anthony Mackie) is the only person who visits Nick in prison and was his ex-partner. Mike informs Nick that his father just passed away.\nNick was given a 25-year sentence but escaped from the Sing Sing Correctional Facility one month earlier, after being allowed to attend his father's funeral. At the funeral Nick got into a fight with his brother Joey, when Joey accused Nick of killing their father the day he went to prison.\nNick heads to a container storage facility where one container has emergency supplies for Nick, including fake identities, and cash.Back in the present, The crowd below calls the police, with Dante Marcus (Titus Welliver) controlling the crowd, while Jack Dougherty (Edward Burns) tries to talk with Nick. Marcus is careful not to reveal himself to Nick. Suzie Morales (Kyra Sedgwick) is the journalist covering the event.However, Nick will only speak to negotiator Lydia Mercer (Elizabeth Banks), who is on a leave of absence, after failing to save a suicidal policeman. Lydia arrives at the hotel room and manages to acquire Nick's fingerprints from a cigarette they share. Dougherty has them analyzed and discovers that Nick is an ex-policeman, arrested for stealing the $40 million Monarch diamond from businessman & jewelry store owner David Englander (Ed Harris).\nLydia hates Suzie for blaming her for the death of the policeman in her previous case.Nick, however, maintains his innocence and accuses Englander of framing him for the theft of the diamond, as Englander lost his fortune in a bad real estate business deal and was too proud to sell the diamond.Nick claims that Englander framed Nick for stealing the diamond, collected a check for $ 40 million from Insurance & emerged out of the debt hole that he had dug himself into.\nUnknown to the police, Nick is merely distracting them while his brother, Joey (Jamie Bell), and Joey's girlfriend, Angie (Genesis Rodriguez), break into Englander's jewelry store vault across the street, to steal the diamond and prove Nick's innocence.\nCassidy must use double meaning phrases to provide instructions to Joey and Angie through an earpiece while speaking to Lydia. Joey and Angie are shown to be flirting with each other throughout the duration of the heist.Meanwhile, Dougherty informs Marcus of Nick's identity, and Marcus orders the jewelry store's security to check the vault. Joey and Angie are able to evade them (with due warning from Nick) but don't find the diamond. They set off the alarms, tricking Englander into retrieving the diamond and ambush him, stealing the diamond at gunpoint.\nMeanwhile, Nick's ex-partner, Mike Ackerman (Anthony Mackie), arrives at the hotel with evidence that Nick is planning something (Mike went to the storage container and found Nick's, Walker's and his own file in Nick's container) and demands to be allowed into the hotel room. Lydia does not trust him, and Dougherty backs her up. Ackerman claims he has found bomb schematics in Nick's prison cell and is convinced that he will detonate an explosive somewhere.While the crowd is evacuated by the bomb squad, Lydia, believing in Nick's innocence, calls Internal Affairs and discovers that three of the cops employed by Englander were suspected of being corrupt: Ackerman, Marcus and a deceased officer called Walker.Joey and Angie enter the hotel and hand the bag containing the diamond to the hotel concierge. The concierge pockets the diamond while placing the bag onto the rack.Englander calls Marcus, one of the men who helped him frame Nick, and has him capture Joey and Angie, but they have already given the diamond to a hotel concierge. Nick attempts to escape through the hotel roof, pursued by a tactical team. The concierge aids him by handing him a disguise containing the diamond.\nOn the roof Marcus has Lydia arrested for obstruction. Englander brings Joey and Angie, threatening to throw Joey off the roof, if Nick does not give him the diamond. Nick turns it over, and Englander leaves.Meanwhile, Lydia escapes custody and rushes back to the roof. Marcus attempts to force Nick to jump off the roof, but Ackerman arrives and shoots Marcus, who wounds Ackerman. Nick rushes to Ackerman's side, and Ackerman apologizes for his part in the setup. Marcus survives, as he is wearing a bulletproof vest.\nAs he prepares to kill Nick, Lydia arrives and shoots him. Englander mocks Nick as he leaves the area. Nick jumps from the roof onto an airbag set up earlier by the police and catches up to Englander. With the assistance of a crowd member, Nick evades capture and pulls the diamond from Englander's jacket, publicly proving his innocence. Englander is then arrested for insurance fraud.Nick is cleared of all charges and released from custody. He meets Joey, Angie, and Lydia at a bar owned by Nick's father, Frank Cassidy (William Sadler), who had faked his death and pretended to be the hotel concierge in the caper.\nLydia asks Nick to \"explain everything\" to her as Joey proposes to Angie with a diamond ring, presumably stolen from Englander's vault. She accepts, and they all celebrate together.",
	"links": [
		"https://www.amazon.com/Man-Ledge-Sam-Worthington/dp/B0087UPMXU"
	]
}