{
	"title": "Fall",
	"release_year": "2022",
	"runtime": "107",
	"tags": [
		"Action",
		"Thriller"
	],
	"rating": 6.4,
	"actors": [
		"Grace Caroline Currey",
		"Virginia Gardner",
		"Mason Gooding",
		"Jeffrey Dean Morgan",
		"Jasper Cole",
		"Darrell Dennis",
		"Bamm Ericsen",
		"Julia Pace Mitchell",
		"Evie Mann",
		"Joseph Mann"
	],
	"staff": [
		"Scott Mann",
		"Jonathan Frank",
		"Scott Mann",
		"David Haring",
		"James Harris",
		"Mark Lane",
		"Scott Mann",
		"Tim Despic",
		"MacGregor",
		"Robert Hall",
		"Colin Jones",
		"Scott Daniel"
	],
	"links": [],
	"votes": 110944,
	"cover": "https://m.media-amazon.com/images/M/MV5BYmZjYjAxMDEtOTE2My00MmM5LTkyYjctOWRjMjgyM2JhMDI0XkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "Best friends Becky and Hunter are climbing a mountain with Becky's husband Dan, who loses his footing and falls to his death. A year later, Becky has given up climbing and become an alcoholic shut-in. She has estranged herself from her father, James, because he suggested that Dan was not the right man for her. Just before the anniversary of Dan's death, Hunter invites her to climb the decommissioned 2,000 foot (600 m) B-67 TV Tower in the desert, where she can scatter Dan's ashes as a form of healing. Becky refuses initially, then changes her mind and agrees to go, so that she can finally move on from Dan's death.The next day, Hunter and Becky arrive and successfully climb a severely corroded ladder to a tiny platform at the top of the tower, where Becky scatters the ashes, finally letting Dan go. As they begin their descent, however, the ladder breaks, stranding them several hundred feet above the next intact section and almost 2,000 feet above the ground. Moreover, the backpack with their water and a small Quadcopter drone has fallen onto a communications dish, just beyond the reach of their rope.Despite the remote location, Hunter is confident at first that emergency services will notice the crash of the ladder, but help never arrives. They try to use their cellphones but suspect that radio interference from the communications dish is blocking the signal. Hunter tries sending a message for help by packing her phone in one of her shoes and dropping it out of range of the interference, but the phone is destroyed upon impact with the ground before the message transmits.The pair later notice two men camping in an RV nearby and try to get their attention, but to no avail. They wait until dark and fire a flare gun they found in an emergency box on the pole. The men see it, but instead of helping them, they steal Hunter's vehicle and drive off.As the night falls, Becky notices a tattoo on Hunter's ankle: \"1-4-3,\" a numeric code Dan used to tell Becky that he loved her. Hunter tearfully admits to a four-month affair that ended shortly before Becky and Dan's wedding, but Becky is unmoved by her apologies. The next day, in penance, Hunter climbs to retrieve the backpack but nearly falls to her death. She injures her hand in the process, but successfully ties the rope to the bag, and Becky is forced to use all her remaining strength to pull both Hunter and the backpack up. Becky uses the tower's aviation obstruction lighting warning light to charge the drone and sends it to a nearby diner a few miles away with a written message for help, but it is struck by a truck and destroyed.At night, Becky is delirious from the lack of food and water, but in a brief lucid moment, when she asks Hunter for her shoe to pad it with her phone inside, Becky realizes Hunter had actually fallen onto one of the communication dishes and was killed; Becky has been hallucinating her presence since then. The next day, Becky is awakened by a vulture gnawing at her wounded leg and kills it to eat. Her strength partially restored, Becky climbs down to the dish where Hunter's body lies and types a text message to her father. She then puts the phone into Hunter's shoe for protection, shoves it into a hole in the corpse's abdomen, and pushes it off the tower. Hunter's body cushions the impact and the message transmits. Becky's father alerts emergency services, who then rush to the tower. She is rescued and reunited with her father. (thanks to Wikipedia)"
}