{
	"title": "Kantara",
	"release_year": "2022",
	"runtime": "148",
	"tags": [
		"Action",
		"Adventure",
		"Drama",
		"amazon",
		"netflix"
	],
	"rating": 8.2,
	"actors": [
		"Rishab Shetty",
		"Rishab Shetty",
		"Kishore Kumar G.",
		"Achyuth Kumar",
		"Sapthami Gowda",
		"Manasi Sudhir",
		"Prakash Thuminad",
		"Shanil Guru",
		"Deepak Rai Panaje",
		"Pramod Shetty",
		"Ranjan Saju"
	],
	"staff": [
		"Rishab Shetty",
		"Manish Bhavan",
		"Bhawan Manish",
		"Rishab Shetty",
		"Chaluve Gowda",
		"Vijay Kiragandur",
		"B. Ajaneesh Loknath",
		"Arvind Kashyap",
		"K M Prakash",
		"Pratheek Shetty",
		"Dharani Gangeputhra"
	],
	"votes": 104433,
	"cover": "https://m.media-amazon.com/images/M/MV5BY2VkZjk5ZjMtM2ExOS00ZDA1LTg1ZDEtYTliNGZiYTc4ZWZiXkEyXkFqcGc@._V1_QL75_UY281_CR11,0,190,281_.jpg",
	"description": "In 1847, there lived a king (Vinay Biddappa) that had a great kingdom as well as a loving wife (Pragathi Rishab Shetty) and child, but could not find peace. He sets out on a journey to discover true happiness and comes upon a stone in a forest occupied by Panjurli Daiva, a deity that protects the villagers that reside in the forest. He donates vast amounts of his land to the villagers in exchange for taking the stone with him. Panjurli warns the king that his family and successors should keep their word and not reclaim the land, which will incur the wrath of Panjurli's companion, the ferocious Guliga Daiva.In 1970, the King's successor asks a Bhoota Kola performer, who is possessed by Panjurli to make the locals hand over the land to him, which the performer refuses and states he will die vomiting blood if he tries to. The successor now lives in the city and knows that the value of the land has increased multi-fold. He needs to money to reclaim his lost royal status and lifestyle. The successor raises doubt on performer's possession by Panjurli, to which the performer replies he would vanish if he is possessed, after which he runs into the forest and is indeed never seen again. As warned, the king's successor dies mysteriously, vomiting blood a few months later on the steps of the court, where he was going to argue the land case.In 1990, Murali (Kishore), a forest officer, is tasked with converting the villagers' land into a forest reserve. However, he is challenged by Shiva (Rishab Shetty), a Kambala athlete from the Kaadubettu village and the missing performer's son. Shiva is backed by his patron and the village's landlord, Devendra Suttooru (Achyuth Kumar), who is the king's successor in the present. Although Shiva is continually asked to perform the Bhoota Kola, he refuses due to the trauma of his father's disappearance.\nSudhakara (Pramod Shetty) is Suttoo's PA. Sudhakara had rigged the results of the Kambala buffalo races to ensure that Shiva came in 2nd and Suttoo's buffaloes came first. Shiva beats up Sudhakara publicly and forces Suttoo to declare him the winner with a medal and motorbike as the prize. Kamala (Manasi Sudhir) is Shiva's mother.\nShiva and his friends (Lacchu (Ranjan Saju), Raampa (Prakash Thuminad)) hunt wild boars on the forest land, while the villagers get supplies for Bhoot Kola from the forest. Murali objects to all of this and wants to fence off the forest area at the earliest. Devendra knows that Murali is tasked with identifying and fencing off the forest reserve. He tries to cozy upto Murali, but Murali is not a compromising type of person.Shiva's cousin Guruva (Swaraj Shetty) takes his place at the hoot Kola. Murali and his staff start erecting a fence along the earmarked forest reserve. Shiva falls in love with a woman named Leela (Sapthami Gowda) and uses his connections with Devendra to appoint her as a forest guard. Leela also falls for Shiva and they both have sex.\nThe villagers try to stop the fencing but the police and forest guards (including Leela) brutally suppress them, creating a rift between Leela and Shiva even though she was following orders and could do nothing about the situation. Murali wants the villagers to relocate their village outside of the forest area.\nMeanwhile Devendra helps launch a legal defense by gathering all the property papers of the villagers, to prove that the village is not an encroachment on the forest land. Devendra is helped by his lawyer (Naveen D Padil).\nShiva continues to help DEvendra by helping him cut down trees inside the forest and transporting the wood outside to Devendra's mills.As the feud between Murali and Shiva intensifies, Murali decides to arrest Shiva and his friends and heads to their hideout along with Devendra's henchman Surendran (Deepak Rai Panaaje). However, Shiva and his friends who were cutting down a tree accidentally destroy Murali's jeep in the process, and thinking they killed everyone inside, go into hiding. A few days later, they return to the village to meet their families; Shiva makes up with Leela and tells her that he will surrender. However, they are caught by the police and forest guards the morning after. Guruva asks Devendra to bail Shiva, but Devendra tries to bribe him to act as if Panjurli orders the villagers to give him their land in the next Bhoota Kola. Guruva refuses and Devendra kills him; learning that Murali has figured out his ulterior motive, Devendra decides to set Shiva against him.\nMurali finds out that Devendra has got all the villagers to transfer their land in his name, and now Devendra is the one responding to the court notices on evacuation of the village. Murali figures out a way to declare the reserve forest boundary which will make all of Devendra's papers null and void.Having learned about Guruva's death, Shiva meets Devendra, who lies about Murali being Guruva's killer. Enraged, Shiva goes to kill Murali, but learns from his friend Mahadeva the blacksmith that Devendra himself killed Guruva. Shiva is attacked by Devendra's henchmen, but manages to escape and meet the villagers, whom Murali has told about Devendra's land seizure. After Shiva reveals that Devendra killed Guruva, he and Murali set aside their grudge and unite the village. Devendra and his henchmen attack, leading to an intense battle where several of the villagers are killed. After nearly dying in the fight, Shiva hits his head against Panjurli's stone, gets possessed by the Guliga Daiva, and kills Devendra and his henchmen.A few months after the battle, Shiva performs the Bhoota Kola where he is possessed by Panjurli. He, Murali, and the villagers join hands in a symbolic gesture and blesses the villagers and he then disappears into the forest after meeting what seems to be his father's spirit. The film ends with Shiva and Leela's son asking Sundara about his father's disappearance and Sundara narrating the same.",
	"links": [
		"https://www.amazon.com/Kantara-Legend-Rishab-Shetty/dp/B0B8L6RXBH",
		"https://www.netflix.com/title/81656709"
	]
}