{
	"title": "Knock at the Cabin",
	"release_year": "2023",
	"runtime": "100",
	"tags": [
		"Horror",
		"Mystery",
		"Thriller",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Dave Bautista",
		"Jonathan Groff",
		"Ben Aldridge",
		"Nikki Amuka-Bird",
		"Rupert Grint",
		"Abby Quinn",
		"Kristen Cui",
		"McKenna Kerrigan",
		"Ian Merrill Peakes",
		"Denise Nakano"
	],
	"staff": [
		"M. Night Shyamalan",
		"Paul Tremblay",
		"M. Night Shyamalan",
		"Steve Desmond",
		"Michael Sherman",
		"Marc Bienstock",
		"Ashwin Rajan",
		"M. Night Shyamalan",
		"Herdís Stefánsdóttir",
		"Jarin Blaschke",
		"Lowell A. Meyer",
		"Noemi Katharina Preiswerk",
		"Douglas Aibel",
		"Naaman Marshall"
	],
	"votes": 121979,
	"cover": "https://m.media-amazon.com/images/M/MV5BMzU1ODIzYjAtNjUzNi00YmNjLWI5ZDAtNDgzOWY3MDU1OThlXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "Seven-year-old Wen (Kristen Cui) is vacationing with her fathers, Eric (Jonathan Groff) and Andrew (Ben Aldridge), at a remote cabin in rural Pennsylvania. Wen is super connected to nature. She collects various types of grasshoppers and gives them names and records everything she observes about them.She is approached by a stranger named Leonard (Dave Bautista), who explains that he needs Wen and her parents' help to save the world. Leonard's arms are heavily tattooed. Wen says that she will learn to take care of animals when she grows up. Leonard notices that Wen calls her dads by their first name, so as not to create confusion in the house. Additionally, Wen understands that she has a unique situation of having 2 fathers, and it does not bother her that others at school judge her and treat her differently.Wen had a broken lip when she was born and tells Leonard that it took a lot of doctors to fix it.\nWen gets scared when Leonard says that she and her parents will have to make some tough decisions and runs back into the house. She warns her parents and shuts the doors of the house. Leonard and his 3 associates knock on the door 7 times.Leonard says that he and his associates want to come in and talk. Wen is scared and says that Leonard and his friends are carrying weapons.\nAndrew and Eric are not able to call the police as the phone lines have been cut. Andrew bluffs that he has a gun, while it is in the back of their truck.\nLeonard and three other individuals break in with makeshift weapons and tie them up. Struggling to fight them off, Eric sustains a concussion.Leonard and his companions-Sabrina (Nikki Amuka-Bird), Adriane (Abby Quinn), and Redmond (Rupert Grint)-claim that they have no intention of harming the family.Leonard cleans up the house of all the debris from the breaking in. While Sabrina is a nurse, and she takes care of Eric and bandages his wounds. Redmond is the only one who is overtly aggressive towards the family. Sabrina says that she used most of her life's savings to come to Pennsylvania to talk to Eric and Andrew.\nLeonard is from Chicago and is a 2nd grade teacher and a part time bartender. Redford is from Medford Massachusetts and works for a gas company. Adrianne was a line cook at a Mexican restaurant in Dupont Circle, DC. She has 2 cats Riff and Raff.\nEric and Andrew believe that they are being subject to a hate crime against the gays. Andrew and Eric had adopted Wen from a Chinese orphanage. Eric is a devout Catholic.Leonard says that, in the past week, they have been driven by visions to find the family. They foresee an impending apocalypse in which oceans will rise, a pandemic will spread, and the sky will fall. The only way to prevent this is for the family to sacrifice one of their own. If they do not make a choice, they will be the last people standing as the rest of humanity (7 billion plus people) will perish.Leonard says that for every no from the family, the intruders will unleash one disaster upon humanity.\nWhen the family refuses, the intruders sacrifice Redmond by fatally striking him with their weapons. Eric sees a figure of light as Redmond dies. On television, news reports show devastating mega-tsunamis.\nLeonard then says that the family will have until the next morning to reflect and decide their next step.\nAndrew believes Redmond is Rory O'Bannon, a man who had been arrested after assaulting Andrew in a bar, years prior. He thinks Rory tracked him down for revenge. Leonard, Sabrina, and Adriane grapple with guilt, but reveal that Redmond's death has unleashed the first judgment of humanity.\nWen tries to escape via the basement in the evening but is caught and brought back by Leonard.The next day, the intruders sacrifice Adriane. Meanwhile, a deadly variation of the flu virus spreads across the world.\nEric says that he believes that he saw a person in the light before Redmond was executed. Andrew shuts him down by saying that he has a concussion and has extreme sensitivity to light. Andrew claims that the TV news reports are just Pre-programmed shows.Andrew escapes and gets to his gun in the car. he shoots at Sabrina with his gun until she flees. As Leonard is being held at gunpoint, Sabrina breaks in and is fatally shot by Andrew. Leonard decapitates Sabrina, and afterwards Andrew finds Redmond's wallet and proves to Leonard that he was Rory. Andrew confronts Leonard in the bathroom, but Leonard overtakes him and grabs Andrew's gun. A TV broadcast reveals that hundreds of spontaneous plane crashes have occurred around the world.Realizing their time is nearly over, Leonard informs the family that after his death, they will only have a few minutes to make a decision. He then slits his throat. Upon his death, lightning causes fires and more planes to crash. Eric now believes the events are real, and that the intruders represent the Four Horsemen of the Apocalypse. Not wanting Wen to grow up in a destroyed world, he offers himself as the sacrifice and envisions an older Andrew and an adult Wen thriving in the future. He feels that their family was chosen to make the sacrifice because their love is so pure. Andrew reluctantly shoots and kills Eric.Andrew and Wen find the visitors' truck with belongings that corroborate their stories. They drive to a crowded diner, where they watch news reports confirming that the disasters have subsided, before driving off.",
	"links": [
		"https://www.amazon.com/Knock-at-Cabin-Dave-Bautista/dp/B0B8TVPW45"
	]
}