{
	"title": "Mortal Engines",
	"release_year": "2018",
	"runtime": "128",
	"tags": [
		"Action",
		"Adventure",
		"Fantasy",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Hera Hilmar",
		"Robert Sheehan",
		"Hugo Weaving",
		"Jihae",
		"Ronan Raftery",
		"Leila George",
		"Patrick Malahide",
		"Stephen Lang",
		"Colin Salmon",
		"Mark Mitchinson"
	],
	"staff": [
		"Christian Rivers",
		"Fran Walsh",
		"Philippa Boyens",
		"Peter Jackson",
		"Philip Reeve",
		"Deborah Forte",
		"Peter Jackson",
		"Amanda Walker",
		"Fran Walsh",
		"Tom Holkenborg",
		"Simon Raby",
		"Jonathan Woodford-Robinson",
		"Amy Hubbard",
		"Liz Mullane",
		"Ann Robinson",
		"Dan Hennah"
	],
	"votes": 143749,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzY1MDA2OTQ0N15BMl5BanBnXkFtZTgwMTkzNjU2NTM@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "Following a cataclysmic conflict known as the Sixty Minute War, the remnants of humanity regroup and form mobile \"predator\" cities. Under a philosophy known as \"Municipal Darwinism\", larger cities hunt and absorb smaller settlements in the \"Great Hunting Ground\", which includes Great Britain and Continental Europe. In opposition, settlements of the \"Anti-Traction League\" have developed an alternative civilization consisting of \"static settlements\" (traditional, non-mobile cities) in Asia led by Shan Guo (formerly China), protected by the \"Shield Wall\". Relics of modern technology such as toasters, computers, and smartphones are valued as \"Old-Tech.\"The city of London captures a small mining town called Salzhaken, absorbing its population and resources, under orders of Lord Mayor Magnus Crome (Patrick Malahide). A masked woman among the Salzhakens is Hester Shaw (Hera Hilmar), who seeks to assassinate Thaddeus Valentine (Hugo Weaving), Head of the Guild of Historians. Tom Natsworthy (Robert Sheehan), a teenage Apprentice Historian, is sent to London's \"Gut\" to collect Old-Tech for London's Museum, accompanied by Valentine's good-nature daughter Katherine (Leila George). Tom tells Katherine that Earth civilizations destroyed each other with quantum weapons called MEDUSA, traces of which can be found all over the planet. Parts of his collection at the museum had started to go missing and so Tom had created a hidden stash of secret weapon parts, which he intended to destroy at first available opportunity. Tom has a sinking feeling that Valentine is collecting the weapon parts.Hester attempts to kill Valentine but Tom intervenes, pursuing Hester to a waste chute. Hester escapes, but not before telling him that Valentine murdered her mother and scarred her face. When Tom informs Valentine of this, he pushes Tom down the chute. A London citizen Bevis is a hidden witness to Valentine pushing Tom down the chute. Valentine tells Katherine that Tom fell into the chute, while fighting Hester.Valentine informs Magnus that he is collecting tech to build an \"energy\" device to solve their power problems. But it is clear he is hiding something.Tom and Hester are forced to work together to traverse the Great Hunting Ground, finding refuge in a town called Scuttlebug, but the owners lock them in a cell and intend to sell them as slaves. Hester confides that Valentine killed her archaeologist mother Pandora after stealing a piece of Old-Tech she found in a dig in the Dead Continent of Americas, whilst young Hester escaped with a necklace her mother gave her. Meanwhile, Valentine frees Shrike (Stephen Lang), a reanimated cyborg known as a \"Stalker\", from an offshore prison to hunt down and kill Hester.At the slave market of Rustwater, Tom and Hester are rescued by Anti-Traction League agent Anna Fang (Jihae). During the chaos, Tom and Hester are pursued by Shrike, whom Hester reveals she knows. Hester explains that Shrike had found and raised her when she was 8 yrs old and was escaping Valentine, and Hester promised to allow him to turn her into a Stalker like himself, but she left after discovering that London was in the Great Hunting Ground. In London, Katherine grows estranged from her father, especially after learning from the Apprentice Engineer Bevis Pod (Ronan Raftery) that Valentine pushed Tom down the chute and learns that Valentine's energy project in the re-purposed St Paul's Cathedral is more than it seems.Hester and Tom travel on Anna's airship the Jenny Haniver to the airborne city Airhaven, meeting with other members of the Anti-Traction League. Tom figures out what Pandora discovered is MEDUSA, a super-weapon that can destroy cities in an instant. Anna figures that London will attack the Shield wall the protects Asian cities from Europe. Once the wall falls, all Asian cities will be up from grabs.Shrike catches up with them and Airhaven is destroyed in the ensuing fire. Following a fierce skirmish, Shrike is mortally wounded, realizing that Hester is in love with Tom. Before perishing, he makes peace with Hester and frees her of her promise. Hester, Tom, and Anna then travel to the Shield Wall with the surviving Anti-Tractionists. On London, Valentine kills Crome in a coup and drums up support from Londoners by vowing to destroy the Shield Wall with MEDUSA and lead them to a new Hunting Ground in Asia. Anna convinces Governor Kwan (commander of the shield wall) to launch the Anti-Tractionist fleet against London, but MEDUSA destroys the fleet and blasts a hole through the Shield Wall. Hester discovers that her mother's necklace hides a \"crash drive\" with a kill switch for MEDUSA. Hester, Tom, Anna, and the remaining Anti-Tractionists lead a raid against London, braving the city's anti-aircraft defenses.Hester and Anna infiltrate St Paul's, and though Valentine mortally wounds Anna during a sword duel, Hester disables MEDUSA with the crash drive. Still determined to destroy the Shield Wall, Valentine orders his henchmen to kill the city's control crew and ram it into the Wall. With Katherine's help, Tom uses the Jenny Haniver to destroy London's engine. Valentine attempts to flee but Hester pursues and fights him aboard his airship, where he reveals he is her father. Tom rescues Hester and shoots down Valentine's ship, where it is crushed when it is run over by London's slowing tracks - finally killing Valentine in the process. The surviving Londoners, led by Katherine, make peace with the Anti-Tractionists, whilst Tom and Hester travel in the Jenny Haniver to see the world.",
	"links": [
		"https://www.amazon.com/Mortal-Engines-UHD-Hugo-Weaving/dp/B08DRQLV65"
	]
}