{
	"title": "Oppenheimer",
	"release_year": "2023",
	"runtime": "180",
	"tags": [
		"Biography",
		"Drama",
		"History",
		"amazon"
	],
	"rating": 8.3,
	"actors": [
		"Cillian Murphy",
		"Emily Blunt",
		"Matt Damon",
		"Robert Downey Jr.",
		"Alden Ehrenreich",
		"Scott Grimes",
		"Jason Clarke",
		"Kurt Koehler",
		"Tony Goldwyn",
		"John Gowans"
	],
	"staff": [
		"Christopher Nolan",
		"Christopher Nolan",
		"Kai Bird",
		"Martin Sherwin",
		"Christopher Nolan",
		"Charles Roven",
		"Emma Thomas",
		"Ludwig Göransson",
		"Hoyte Van Hoytema",
		"Jennifer Lame",
		"John Papsidera",
		"Ruth De Jong"
	],
	"votes": 792941,
	"cover": "https://m.media-amazon.com/images/M/MV5BN2JkMDc5MGQtZjg3YS00NmFiLWIyZmQtZTJmNTM5MjVmYTQ4XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1945, the first atomic bomb is successfully tested -- a triumph for J. Robert Oppenheimer, director of the Manhatten Project at Los Alamos. The politicians take further decisions about the use of the bomb away from Oppenheimer and the other scientists on the project. President Harry S. Truman orders the atomic bombings of Hiroshima and Nagasaki. Oppenheimer wanted Truman to brief Stalin before using it in Japan, but Truman does no such thing. The Soviets are threatened, and Oppenheimer believes that this started the nuclear arms race.Though publicly praised, Oppenheimer is haunted by the mass destruction and fatalities. He later meets Truman, and after expressing his personal guilt, Truman berates Oppenheimer as he considers himself responsible for the decision to use the bomb. Oppenheimer urges restricting further nuclear weapons development, which Truman dismisses.Rear Admiral Lewis Strauss is a retired Naval officer and high-ranking member of the U.S. Atomic Energy Commission (AEC). Strauss had recruited Oppenheimer as a scientific advisor to the AEC, after the war was over.As an advisor to the United States Atomic Energy Commission (AEC), Oppenheimer's stance generates controversy, while Teller's hydrogen bomb receives renewed interest in the middle of the burgeoning Cold War. Oppenheimer says that a Hydrogen presented insurmountable technical difficulties and should not be pursued. He instead tries to convince the AEC to control the spread of nuclear weapons around the world.AEC Chairman Lewis Strauss (Robert Downey Jr.) resents Oppenheimer for having publicly humiliated him by dismissing his concerns about exporting radioisotopes (which helped other nations build the Atomic bomb) and for recommending negotiations with the Soviet Union after they successfully detonated their own bomb. Oppenheimer suggested that US and Soviets should offer concessions to each other not to pursue a Hydrogen bomb as if US builds one, Soviets will have no choice to build one as well.\nDespite Oppenheimer's objections, Truman green-lights the H-bomb program.\nStrauss believed that Oppenheimer collaborated with the Russians during the Manhattan project, and this is how they were able to produce a bomb in such a short period after the war.Strauss also believes that Oppenheimer denigrated him during a conversation Oppenheimer had with Einstein in 1947.In 1954, wanting to eliminate Oppenheimer's political influence, Strauss secretly orchestrates a private security hearing before a Personnel Security Board concerning Oppenheimer's Q clearance. However, it becomes clear that the hearing has a predetermined outcome. Strauss claims that he was the Chairman of the AEC, but the charges against Oppenheimer were brought by William L. Borden (David Dastmalchian), a lawyer and executive director of the JCAE who wrote to the FBI.\nStrauss claims that Borden was a rabid anti-Communist and had access to Oppenheimer's security file on which he based his claims. It is strongly indicated that Strauss provided Oppenheimer's security file to Borden and used Borden to bring Oppenheimer down.Oppenheimer's past communist ties are exploited, and Groves' and other associates' testimony is twisted against him.\nOppenheimer brought his brother to work on the Manhattan project, and he was a known Communist. This also goes against Oppenheimer. Teller testifies that he lacks confidence in Oppenheimer and recommends revocation. Groves supports Oppenheimer. The entire review was done behind closed doors, as an administrative process, with no public hearing and no burden of proof on the prosecution. Roger Robb (Jason Clarke) served as special counsel to the AEC at Oppenheimer's security hearing and was appointed by Strauss. He had full access to Oppenheimer's file while Oppenheimer's attorney didn't have access to his client's file. The board revokes Oppenheimer's Q clearance, damaging his public image and limiting his influence on nuclear policy.In 1959, during Strauss' Senate confirmation hearing for Secretary of Commerce, Hill testifies about Strauss' personal motives in engineering Oppenheimer's downfall, resulting in the Senate voting against his nomination.In 1963, President Lyndon B. Johnson (Hap Lawrence) presents Oppenheimer with the Enrico Fermi Award as a gesture of political rehabilitation. A flashback reveals Oppenheimer and Einstein's 1947 conversation never mentioned Strauss. Oppenheimer instead expressed his belief that they had indeed started a chain reaction-a nuclear arms race-that would one day destroy the world.",
	"links": [
		"https://www.amazon.com/Oppenheimer-Cillian-Murphy/dp/B0CKRXGGQB"
	]
}