{
	"title": "A Dangerous Method",
	"release_year": "2011",
	"runtime": "99",
	"tags": [
		"Biography",
		"Drama",
		"Romance",
		"amazon"
	],
	"rating": 6.4,
	"actors": [
		"Michael Fassbender",
		"Keira Knightley",
		"Viggo Mortensen",
		"Vincent Cassel",
		"Sarah Gadon",
		"André Hennicke",
		"Arndt Schwering-Sohnrey",
		"Mignon Remé",
		"Mareike Carrière",
		"Franziska Arndt"
	],
	"staff": [
		"David Cronenberg",
		"Christopher Hampton",
		"John Kerr",
		"Jeremy Thomas",
		"Howard Shore",
		"Peter Suschitzky",
		"Ronald Sanders",
		"Deirdre Bowen",
		"James McAteer"
	],
	"votes": 109103,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTU5Mjk3NjgxMl5BMl5BanBnXkFtZTcwMDM5MjA5Ng@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "A look at how the intense relationship between Carl Jung (Michael Fassbender) and Sigmund Freud (Viggo Mortensen) gives birth to psychoanalysis.\nSabina (Keira Knightley) is a mentally disturbed patient brought to the Swiss clinic of Carl for treatment in 1904. She is amazed that Dr Carl just wants to talk instead of beating her like all the other doctors. Sabina was hit by her father during childhood & she has visions of his hand still as after he had hit her, she had to kiss his hand.Sarah Jung (Carl's wife) is pregnant & fully supportive of Carl's experimental treatment (cure by talking). Sabina wanted to be a doctor herself & Carl engages her in his research work, as a means of keeping her busy & to treat her. Sabina sits in Jung's research interviews & shows a flair for details.Her treatment continues & she reveals that she was sexually excited when her father hit her or spanked her & now any kind of violence turns her on. Jung is following a treatment predicted by Dr Sigmund Freud, who strangely has not published any material on it. Carl wants to meet Freud.\nIn 1906 Carl finally has his meeting & tells Freud that he has had enormous success with Sabina, who is now enrolled in medical school. Freud tells Carl that Psychoanalysis as a treatment is under attack because of his predominantly sexual nature of root causes. But Freud is adamant that he is right & his methods will be under attack for the next 100 years.Carl discusses with Sabina who expresses her desire to be a psychoanalyst herself.\nFreud refers Otto Grouse to Carl, as he is not able to devote his time to Otto. He warns Carl of Otto's erratic behavior. Otto is a polygamist & has been institutionalized by his father as he considers Otto's transgressions as a insult to Otto's wife. Otto is a psychoanalyst himself & tries to convince Carl that as part of being a doctor, sleeping with his patients is part of the healing process, if so required.Otto & Carl discuss Sabina who has already expressed her desire to be Carl's lover owing to the fact that her illness was sexual in nature & that she has never had a sexual experience.\nOtto has sex with a female attendant & escapes the facility. Carl has sex with Sabina. At the next meeting with Freud, Carl suggests exploring telepathy & other forms of mysticism, but Frued wants to keep his theory based on scientific facts alone. Then Freud finds out rumors about Carl having sex with a patient, but Carl denies it. Carl wants to stop but Sabina is adamant. she is hooked.As the news spreads, Carl is forced to admit that he was having sex with Sabina only when she was not his patient & then he agrees to take her back as a patient, but only under the condition that he could see her in his offices alone. Sabina is devastated, she thought Carl was in love with her. Sabina writes to Freud, who in turn checks with Carl, & Carl still denies any sexual encounter with Sabina. Sabina asks Carl to tell the truth to Freud as she wants Freud to accept her as patient. Carl accepts his lie to Freud & admits that he was having sex with Sabina. Freud apologizes to Sabina.\nFreud & Carl travel to US to attend the congress of psychiatry. Freud no longer trusts Carl as he used to.After returning, Sabina is referred to by the dean for her doctoral thesis to Carl. Carl & Sabina engage in a lot of thought-provoking discussion on sexual origins of psychiatric disorders, but Carl also resumes sexually abusing Sabina (with her consent). As the thesis is completed, Sabina decides to go to Vienna to meet Freud, & Carl begs her not to.Sabina accepts a few of Freud's patients. The rift between Freud & Carl grows & Freud says that he is disappointed by Carl's lies about his relations with Sabina, when he was having sex with her. 2 yrs later, Sabina is married & pregnant & meets Carl who is now mentally unstable after his violent break up with Freud. Sabina realizes that Carl is now also disturbed by his memories of Sabina & the release that his sexual encounters with her provided him.Freud was hunted by Nazis & died in London in 1939. Sabina returned to Russia & became a renowned psychoanalyst. She & her 2 daughters were shot by the Nazis in 1941. Carl had a nervous breakdown & emerged after WWII as a leading psychologist. He died peacefully in 1961.",
	"links": [
		"https://www.amazon.com/Dangerous-Method-Keira-Knightley/dp/B09KGB8WSH"
	]
}