{
	"title": "Contraband",
	"release_year": "2012",
	"runtime": "109",
	"tags": [
		"Action",
		"Adventure",
		"Crime",
		"amazon"
	],
	"rating": 6.4,
	"actors": [
		"Mark Wahlberg",
		"Giovanni Ribisi",
		"Kate Beckinsale",
		"Robert Wahlberg",
		"Caleb Landry Jones",
		"Jason Mitchell",
		"Paul LeBlanc",
		"Ben Foster",
		"Michael J. Taylor",
		"John Russ Broussard"
	],
	"staff": [
		"Baltasar Kormákur",
		"Aaron Guzikowski",
		"Arnaldur Indriðason",
		"Óskar Jónasson",
		"Tim Bevan",
		"Eric Fellner",
		"Baltasar Kormákur",
		"Stephen Levinson",
		"Clinton Shorter",
		"Barry Ackroyd",
		"Elísabet Ronaldsdóttir",
		"Sheila Jaffe",
		"Tracy Kilpatrick",
		"Tony Fanning"
	],
	"votes": 126873,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjE3NzY5NTg0OF5BMl5BanBnXkFtZTcwODk4MzgxNw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Chris Farraday (Mark Wahlberg) is an ex-smuggler who works installing security alarms and lives a peaceful life with his wife, Kate (Kate Beckinsale), and their two little sons in New Orleans. One day, Chris and Kate learn that her brother Andy (Caleb Landry Jones) was smuggling drugs in a cargo ship, but was forced to drop them into the ocean in order to avoid arrest during a surprise inspection by the U.S. Customs. Andy's boss, ruthless mobster Tim Briggs (Giovanni Ribisi), is infuriated and wants Andy to repay him the drug's worth in money.Chris meets with Briggs, who threatens to kill Chris' family if Andy doesn't pay $700,000 in two weeks. Chris realizes that the only way to raise the money is to run contraband and joins the crew of a cargo ship where his father Bud (William Lucking), currently in prison, used to run contraband, in order to buy $10,000,000 in fake bills in Panama and smuggle them into the U.S. with the help of Andy and Chris' old friend Danny Raymer (Lukas Haas). While Chris is gone, Briggs and a couple of his thugs break into Chris's house and scare his wife and kids. When one of the kids pushes the thugs, a thug accidentally fires off his pistol to the wall. Chris asks his best friend, Sebastian Abney (Ben Foster), to take care of his family.In Panama, the Chief Engineer gives Chris extra time (at Panama City Port to buy the fake bills & to get back to the ship before it departs) by sabotaging the ship's pitch propeller, drawing suspicion from Captain Camp (J. K. Simmons). However, Chris discovers that the bills are useless, not starch-free paper, and refuses to accept them. The only one who can provide them good ones is crime lord Gonzalo (Diego Luna). Meanwhile, Briggs attacks Kate in her house, after which she accepts Sebastian's offer that she and the children move to his apartment. At this point it is revealed that Sebastian and Briggs are working together. Briggs calls Andy and threatens to kill one of his nephews if Andy doesn't use the buy money intended for the fake bills to acquire a stash of cocaine. Andy runs off with the buy-money while Chris is negotiating with Gonzalo, leading an infuriated Gonzalo to force Chris and Danny to participate in an armored car heist. Chris and Danny are assigned with the job of driving in front of the armored car, forcing it to stop and becoming vulnerable to the robbers. However, Gonzalo and his men are killed in a firefight with the police.Chris and Danny make it back to Gonzalo's warehouse, where they then escape in a van loaded with the fake money, and also a Jackson Pollock painting which was stolen in the armored car heist. Sebastian began working with Briggs against Chris, after a Scottish gangster Jim Church (David O'Hara) threatens to kill Sebastian if Sebastian doesn't repay the money Sebastian borrowed to save his fledgling construction business. When Sebastian calls Chris, Chris tells Sebastian he might drop the drugs bought by Andy in the ocean. Sebastian tells Briggs to scare Kate, in order to make sure that Chris doesn't dump the drugs into the ocean. That same night, Briggs rams Chris's house with his truck. Sebastian comes in and pretends to rescue Kate, scaring off Briggs. Sebastian tells Kate to get in his truck, but Kate knows he's been drinking and she doesn't want her kids in the car with him. So she grabs the kids and drives off.At the Panama City freight yard, a crew member of the ship has a container standing by for Chris to drive the contraband-loaded van into. The crew member also bribes a freight-yard supervisor to delay the loading of three containers in order to give Chris time to make it to the ship. Chris assaults Andy for stealing the money and spending it on cocaine. Andy reveals to Chris that Briggs was going to kill Chris's son if Andy refused the offer. Kate calls Chris and tells him what Briggs did to her and what he said. Chris is surprised that Briggs knew the idea of Chris dumping the drugs.First, Chris suspects Andy of being disloyal, but after Andy persistently tells Chris he didn't say anything, Chris figures out it was Sebastian. Chris calls Sebastian and threatens to kill him. Kate leaves a friend's house and goes back to Sebastian's apartment to retrieve some personal items. Sebastian, under the influence, tries to force himself on her. Kate resists him and runs to the bathroom and locks the door. Kate then persists on calling Chris, informing him of what Sebastian tried to do. Sebastian tells Kate not to call Chris, telling her he needs to complete his mission and Kate calling him would ruin everything. Kate begins to call Chris, and Sebastian rams his shoulder to the door, busting it open and sending Kate flying towards the wall, with her head bashing against the wall. Sebastian panics, thinking the unconscious Kate is dead, and wraps her in plastic, preparing to dispose of her body.Sebastian throws Kate's unconscious body in a hole, where the next morning Sebastian will have his construction workers fill the hole, covering up the evidence of Kate's supposed death.\nAfter leaving Panama, Sebastian contacts Captain Camp and admits that Chris is smuggling on his ship, promising him a share if he makes sure Chris doesn't throw it overboard. Chris does not give up the location of the stash on the ship, so the captain calls U.S. customs and reports that Chris is running drugs on the ship. However, when the Customs Agents meet the ship in port, they cannot find the drugs, and they find no contraband in Chris's possession. Knowing that Camp is a Germophobe who had brought his own carpet cleaner aboard ship, Chris hides the bricks of cocaine in the water-tank of the carpet cleaner. Chris does this while the captain is eating a meal in the mess-hall.After Andy is discharged off the ship, Briggs and his thugs chase Andy. After Andy is cornered, Briggs throws Andy in a van. Meanwhile, Chris has devised a plan to set up the rude, obnoxious Camp for drug possession. Camp leaves the vessel to go home, unknowingly carrying off the drugs. After Customs has excused Chris, Chris meets Briggs in a desolate area of the cargo yard where Briggs threatens to kill Andy, after which Chris breaks Briggs's car window and throws him out of the car and severely beats him up for everything he did to his family. Chris tells Andy to run while Briggs's thugs hold Chris at gunpoint. Chris takes Briggs to Camp's house, having made a duplicate key to the house while on the ship, and knowingly activates Camp's security system. Chris opens the carpet cleaner and pulls out the stash of drugs. The volatile Briggs compliments Chris on his smuggling skills and sits in Camp's living room tasting the cocaine. Chris asks permission to go to the bathroom and sneaks out in the Captain's car. Camp awakens with the noise, and comes into the living room, startled to see Briggs. When the police arrive, Chris is long gone and both Briggs and Camp are arrested.Chris goes to Sebastian's construction site and brutally beats him up, demanding Kate's location. When Sebastian tells Chris that she's dead, he tries calling her cellphone and hears the ringtone in a building foundation where cement is being poured and rescues her moments from death. Sebastian is arrested, and meets Bud in prison, where Bud gives a group of inmates an approving nod, as they surround Sebastian. His fate is left unknown.Andy retrieves the fake bills, which Chris had dumped into the ocean in order to avoid being caught by U.S. Customs. At a police auction, Andy purchases the van that was used in the escape.\nChris meets with Church, who offers him $2.5 million for the fake currency but Chris demands $3 million; Church agrees to meet Chris's price. In a friendly conversation, Church asks Chris if he knows anything about the painting that was stolen in Panama telling him that it's worth over $140 million, or $20 million on the black market.As Chris and Andy leave the meeting with Church, the painting is seen in the van having gone unnoticed by the Customs Police. Chris tells his buddies that the painting is worth at least $20 million. It is presumed that they sell the painting on the black market and split the money among themselves.",
	"links": [
		"https://www.amazon.com/Contraband-Baltasar-Korm%C3%A1kur/dp/B0DLRL7LVY"
	]
}