{
	"title": "Captain Phillips",
	"release_year": "2013",
	"runtime": "134",
	"tags": [
		"Action",
		"Biography",
		"Crime",
		"amazon"
	],
	"rating": 7.8,
	"actors": [
		"Tom Hanks",
		"Barkhad Abdi",
		"Barkhad Abdirahman",
		"Catherine Keener",
		"Faysal Ahmed",
		"Mahat M. Ali",
		"Michael Chernus",
		"David Warshofsky",
		"Corey Johnson",
		"Chris Mulkey"
	],
	"staff": [
		"Paul Greengrass",
		"Billy Ray",
		"Richard Phillips",
		"Stephan Talty",
		"Dana Brunetti",
		"Michael De Luca",
		"Scott Rudin",
		"Henry Jackman",
		"Barry Ackroyd",
		"Christopher Rouse",
		"Francine Maisler",
		"Paul Kirby"
	],
	"votes": 498014,
	"cover": "https://m.media-amazon.com/images/M/MV5BMWYyNjI3ZjEtNGE5ZS00MDgxLWIzNGEtZTgzNDVlZjZjYWU5XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "On Mar 28th, 2009, Richard Phillips lives in Underhill, Vermont. He is married to Andrea (Catherine Keener). They have 2 kids Dan (John Magaro) and Mariah (Gigi Raines).\nRichard reaches Oman to take command of his ship. Shane Murphy (Michael Chernus) is the first officer, Mike Perry (David Warshofsky) the chief engineer, Ken Quinn (Corey Johnson), helmsman, and crew members John Cronan (Chris Mulkey), William Rios (Mark Holden), Ian Waller (Angus MacInnes), Ethan Stoll (Louis Mahoney) and Andrew (Vincenzo Nicoli).Richard Phillips (Tom Hanks) takes command of the MV Maersk Alabama, an unarmed container ship from Port of Salalah in Oman, with orders to sail through the Gulf of Aden to Mombasa, round the Horn of Africa. The ship is carrying 2400 tons of commercial cargo and 200 tons of food aid, 166 tons of freshwater, 250 metric tons of fuel loaded.\nWary of pirate activity off the coast of Somalia, the captain orders strict security precautions on the vessel and carries out practice drills. All orders all the pirate cages and the door to be properly locked.Somalian pirates are based in the village of Eyl. Pirate Muse is ordered into the sea by his boss, a local Somali faction leader. His gang includes Hufan (Ibrahim Maalim), Assad (Mohamed Ali), Adan Bilal (Barkhad Abdirahman), Walid Elmi (Mahat M. Ali) and Nour Najee. The pirates use a natural stimulant called Khat to maintain their high energy levels and desire to put themselves into danger.\nMost ships travel across the Somalian basin in a protected convoy, but Muse notices that the Alabama is travelling alone.During a drill, the vessel is chased by Somali pirates in two skiffs; Phillips succeeds in outrunning them when one gives up after hearing Phillips on the radio calling for immediate military air support (a bluff) and the other loses engine power after running into the rough water Captain Phillips created with his ship's propellers.\nThe skiffs retreat to their mother ship. Muse is livid and orders a ladder to be welded together and the engine to be fixed before the following morning.Back on the Alabama the crew knows that the pirates will return and are afraid. Most of them say that they don't get paid enough for the risks of the job. Richard counters that this is what they signed up for on the Somalian Basin route. He promises to follow the union rules and offload unwilling crew at Mombasa, but before that, there is nothing that can be done.The next day one of the skiffs returns with four heavily armed pirates led by Abduwali Muse (Barkhad Abdi); they are carrying a ladder they had hastily welded the night before.\nDespite the best efforts of Phillips and his crew, the pirates board and take control of the Maersk Alabama, capturing Captain Phillips (he was in the bridge) after he cuts the ship's engine power and tells the crew to hide in the ship's engine room. Phillips offers Muse the contents of the ship's safe ($30,000), but under orders from his boss Muse's plan is to ransom the ship and crew in exchange for millions of dollars of insurance money from the shipping company.\nMuse is livid when he cannot get the ship underway, and he demands that Richard produces the ship's crew to follow Muse's commands. Muse guesses that the crew is hiding in the engine room and controlling the ship from there.Shane manages to cut the ship's emergency power, plunging the lower decks into darkness. As Muse, the pirate captain, attempts to search the engine room, the crew members overpower him.\nThe Alabama crew negotiates with the other three pirates on the bridge via radio. Richard is also on the bridge with Bilal who has badly injured feet (he cut his feet on glass shards planted by the crew intentionally as they knew that the pirates are bare foot).\nRichard talks to Muse and offers him the ship's lifeboat, since the pirates don't have their skiff anymore, along with $30,000 in the ship's safe.\nThe crewmen arrange to trade Phillips for Muse and the ship's lifeboat for the pirates to escape. But the pirates take Muse & force Phillips onto the lifeboat and launch it, intending to hold the captain for ransom.As the lifeboat heads for the shore, tensions flare between the pirates as they run low on the stimulant herb Khat, lose contact with their mother ship, and are later intercepted by the U.S. Navy destroyer USS Bainbridge. Richard uses the first aid kit to treat Bilal's foot.\nMuse is under orders from the faction leader to bring Richard as he is their only card to earn some money after the botched ship hijacking. Muse reveals that he hijacked a Greek ship last year and earned $6 million.\nIn the meantime, the Bainbridge's captain Frank Castellano (Yul Vazquez) is ordered to prevent the pirates from reaching the mainland by whatever means necessary. This means that Richard is dispensable if there is a chance of him reaching the mainland.\nCastellano sends food and supplies to the lifeboat and asks for proof of Richard's life. Muse produces Richard, who tells Castellano that he is in seat 15. Richard knows that the US Navy is not there to negotiate. Najee is not happy with the way Muse is leading the negotiations and wants to act tough. Muse demands $10 million for Richard's release.Once additional U.S. Navy ships arrive (The USS Boxer and the USS Haliburton), Phillips attempts to negotiate with Muse, who asserts that he has come too far and will not surrender. Richard says that the Navy will sink the lifeboat rather than let it reach Somalia.That night, Phillips is able to escape and swims towards the Navy ships. The navy cannot identify the swimmer as Phillips, and therefore they take no action. The pirates fire shots at him; he swims back to the lifeboat. The further agitated pirates are also unaware that a SEAL Team has parachuted in to intervene. Muse stops Najee from killing Richard.A SEAL helicopter buzzes the lifeboat, pushing the pirates into a state of panic. Muse holds Richard at gun point and displays him to the helicopter, to get them to withdraw.\nWhile three SEAL marksmen get into positions to fire a simultaneous shot at each of the pirates on the lifeboat, Castellano and the SEALs continue to try to negotiate with the pirates, eventually taking the lifeboat under tow. Castellano says the elders of Muse's tribe are also on board to help with the exchange.\nEventually, Muse agrees to board the Bainbridge, believing he will join his clan elders in negotiating Phillips's ransom. In the lifeboat, one of the more agitated pirates, Najee (Faysal Ahmed), catches Phillips writing a goodbye note to his wife. When he tries to take the note away, Phillips attacks Najee, but is quickly restrained and beaten.Najee decides to take full control; the pirates tie Phillips up and blindfold him, and the Bainbridge crew stop the tow. As Phillips is about to be executed, the three SEAL marksmen finally get three clear shots and simultaneously kill the pirates. On board the Bainbridge, Muse is taken into custody and arrested for piracy. Phillips is rescued and treated. He is in shock and disoriented, but he thanks the rescue team for saving his life.Richard returned to his family on April 17th, while Muse was convicted of piracy and is serving a 33 year prison sentence in Indiana.",
	"links": [
		"https://www.amazon.com/Captain-Phillips-Tom-Hanks/dp/B00HQLF35I"
	]
}