{
	"title": "The King's Speech",
	"release_year": "2010",
	"runtime": "118",
	"tags": [
		"Biography",
		"Drama",
		"History",
		"amazon"
	],
	"rating": 8.0,
	"actors": [
		"Colin Firth",
		"Geoffrey Rush",
		"Helena Bonham Carter",
		"Derek Jacobi",
		"Robert Portal",
		"Richard Dixon",
		"Paul Trussell",
		"Adrian Scarborough",
		"Andrew Havill",
		"Charles Armstrong"
	],
	"staff": [
		"Tom Hooper",
		"David Seidler",
		"Iain Canning",
		"Emile Sherman",
		"Gareth Unwin",
		"Alexandre Desplat",
		"Danny Cohen",
		"Tariq Anwar",
		"Nina Gold",
		"Eve Stewart"
	],
	"links": [
		"https://www.amazon.com/Kings-Speech-Colin-Firth/dp/B0BZ6TSHR6"
	],
	"votes": 712603,
	"cover": "https://m.media-amazon.com/images/M/MV5BMzU5MjEwMTg2Nl5BMl5BanBnXkFtZTcwNzM3MTYxNA@@._V1_QL75_UY281_CR1,0,190,281_.jpg",
	"description": "Prince Albert, Duke of York (later King George VI), \"Bertie\" (Colin Firth), the 2nd son of King George V, speaking at the close of the 1925 British Empire Exhibition at Wembley Stadium, with his wife Elizabeth (Helena Bonham Carter) by his side. His stammering speech unsettles the thousands of listeners in the audience. The prince tries several unsuccessful treatments and gives up, until the Duchess persuades him to see Lionel Logue (Geoffrey Rush), an Australian speech therapist in London. In their first session, Logue requests that they address each other by their Christian names, a breach of royal etiquette. Logue is unorthodox in his approach & Albert is not convinced it will be of any help. Logue makes a recording of Bertie with full music in background (so Bertie can't hear himself) & gives it to Bertie.In 1934, King George V (Michael Gambon) declares Bertie's older brother unfit for the throne & demands Bertie to improve his speech. He plays Logue's recording & finds himself speaking perfectly. He returns to Logue & he gently probes the psychological roots of the stammer.The Prince reveals some of the pressures of his childhood: his strict father; the repression of his natural left-handedness; a painful treatment with metal splints for his knock-knees; a nanny who favored his elder brother-David, the Prince of Wales--deliberately pinching Bertie at the daily presentations to their parents so he would cry and his parents would not want to see him, and--unbelievably--not feeding him adequately (\"It took my parents three years to notice,\" says Bertie); and the early death in 1919 of his little brother Prince John. Logue & Bertie become friends.On 20 January 1936 George V dies, and David, the Prince of Wales (Guy Pearce) accedes to the throne as King Edward VIII, & wants to marry Wallis Simpson (Eve Best), an American divorcee, which would provoke a constitutional crisis. Bertie confronts David, who only accuses Bertie of having designs of his own & makes fun of his speech impediment. Even Logue suggests that Bertie can be King, & this causes a rift in their friendship as Bertie is not thinking in that way.When King Edward VIII does in fact abdicate to marry, Bertie becomes King George VI. Feeling overwhelmed by his accession, the new King realizes that he needs Logue's help and he and the Queen visit the Logues' residence to apologize. When the King insists that Logue be seated in the king's box during his coronation in Westminster Abbey, Dr Cosmo Gordon Lang, the Archbishop of Canterbury (Derek Jacobi), questions Logue's qualifications.This prompts another confrontation between the King and Logue, who explains he had begun by treating shell-shocked soldiers in the last war. When the King still isn't convinced about his own strengths, Logue sits in St. Edward's Chair and dismisses the Stone of Scone as a trifle, the King remonstrates with Logue for his disrespect. The King then realizes that he is as capable as those before him.Upon the September 1939 declaration of war with Germany, George VI summons Logue to Buckingham Palace to prepare for his radio speech to the country. As the King and Logue move through the palace to a tiny studio, Winston Churchill (Timothy Spall) reveals to the King that he, too, had once had a speech impediment but had found a way to use it to his advantage. The King delivers his speech as if to Logue, who coaches him through every moment. As Logue watches, the King steps onto the balcony of the palace with his family, where thousands of Londoners, gathered to hear the speech over loudspeakers, cheer and applaud him.A final title card explains that, during the many speeches King George VI gave during World War II, Logue was always present. It is also explained that Logue and the King remained friends, and that, \"King George VI made Lionel Logue a Commander of the Royal Victorian Order in 1944. This high honor from a grateful King made Lionel part of the only order of chivalry that specifically rewards acts of personal service to the Monarch.\""
}