{
	"title": "Elysium",
	"release_year": "2013",
	"runtime": "109",
	"tags": [
		"Action",
		"Drama",
		"Sci-Fi",
		"amazon",
		"netflix"
	],
	"rating": 6.6,
	"actors": [
		"Matt Damon",
		"Jodie Foster",
		"Sharlto Copley",
		"Alice Braga",
		"Diego Luna",
		"Wagner Moura",
		"William Fichtner",
		"Brandon Auret",
		"Josh Blacker",
		"Emma Tremblay"
	],
	"staff": [
		"Neill Blomkamp",
		"Neill Blomkamp",
		"Bill Block",
		"Neill Blomkamp",
		"Simon Kinberg",
		"Ryan Amon",
		"Trent Opaloch",
		"Julian Clarke",
		"Lee Smith",
		"Francine Maisler",
		"Alejandro Reza",
		"Philip Ivey"
	],
	"votes": 475042,
	"cover": "https://m.media-amazon.com/images/M/MV5BNDc2NjU0MTcwNV5BMl5BanBnXkFtZTcwMjg4MDg2OQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 2154, two classes of people exist: the very wealthy, who live on a huge and luxurious Stanford torus-style space station called Elysium, and the poor who live on an overpopulated, devastated Earth. While residents on Earth are policed by ruthless robots, Elysium's citizens live in comfort and regularly use bed-sized medical devices called Med-Bays to keep them free of disease and injury.Max Da Costa (Matt Damon), a former car thief and parolee, lives in the ruins of Los Angeles and works at an assembly line for Armadyne Corp, the military company that supplies arms and weapons to Elysium. An accident at the plant exposes Max to a lethal dose of radiation, giving him only five days to live. Meanwhile, when a caravan of illegal immigrants from Earth attempts to reach Elysium and its Med-Bays, Elysian Secretary of Defense Jessica Delacourt (Jodie Foster) orders vicious sleeper agent M. Kruger (Sharlto Copley) to shoot down the shuttles. Disapproving of her methods, Elysian President Patel (Faran Tahir) reprimands her and dismisses Kruger from service. Delacourt, vowing to protect Elysium and her own power, bargains with Armadyne's CEO John Carlyle (William Fichtner) to write a program that can override Elysium's central computer and make her President. Carlyle creates the program in his office on Earth and uploads it to his brain for safekeeping, encrypting it with a lethal denial system.Max, knowing his only chance for survival is a Med-Bay, seeks help from notorious smuggler Spider (Wagner Moura), with the assistance of his friend Julio (Diego Luna). Spider agrees to get Max to Elysium only if he helps him steal valuable financial information from Carlyle, who is preparing to leave Earth. Recognizing Max's weakened condition, Spider has his doctors implant Max with a powered exoskeleton, giving him superhuman strength, as well as an implant in his brain that can store data. Max, Julio and a team of Spider's men intercept Carlyle's ship, and Max downloads the data (including the program) to his own brain. However, due to the encryption of Carlyle's brain data the information appears unusable.Delacourt secretly deploys Kruger to rescue Carlyle and recover the program. In the ensuing firefight, nearly all of Max's allies are killed, Carlyle is mortally wounded, and an injured Max retreats to the house of Frey (Alice Braga), a childhood friend whose daughter, Matilda, has leukemia. After learning that Max intends to smuggle himself to Elysium, Frey begs him to take Matilda with him so that she can be cured, but Max refuses. With Max on the run, Delacourt orders an airspace lock-down over Los Angeles to buy her enough time to recover Carlyle's program.When Max returns to Spider to extract the information from his head and collect his reward, Spider deciphers Carlyle's program and realizes it can be used to make all of Earth's residents, legal citizens of Elysium. However, the airspace lock down prevents Spider from launching a ship for Max. Instead, Max bargains with Kruger to be taken to Elysium, who unbeknownst to Max has captured Frey and Matilda as hostages.With the lock-down lifted, Kruger's ship departs for Elysium. A scuffle ensues, resulting in Kruger losing most of his face to a grenade blast and causing the ship to crash land on Elysium. Max, Frey and Matilda are arrested and taken to Delacourt, who has a team prepare to download the data from Max's brain, while Kruger's men take their severely disfigured leader to the Armory. The extraction team discovers the encryption mechanism Carlyle has used, and it is revealed that downloading the data for use will kill Max. Delacourt coolly consents and heads off to find Kruger's team.Kruger is placed into a Med-Bay, which reconstructs his destroyed face. Delacourt chastises Kruger's recklessness, but Kruger kills Delacourt, planning to steal the program for himself to rule Elysium. Kruger has his men install a superior military-grade version of Max's exoskeleton onto himself, and goes on a rampage through Elysium looking for Max. At the same time, Kruger's men exterminate most of the leaders of Elysium. Meanwhile, Max escapes from his confinement and frees Frey and Matilda. Realizing that Med-Bays only work for Elysian citizens, Max resolves to use Carlyle's program to make everyone a citizen. He frees Frey and Matilda and tells them to head for the surface to find a Med-Bay, then meets with Spider, who secretly came aboard Elysium during the chaos, and heads for the main computer core. However, they are ambushed by Kruger. During the fight, Max tears the interface that connects Kruger's brain to his exoskeleton directly out of his skull. Defiantly, Kruger tethers himself to Max's suit and arms a grenade with the intent of killing both himself and Max, however Max rips the tether off, damaging his own suit, and hurls Kruger over a ledge to his death.Spider and Max reach Elysium's main data center where Spider realizes that activating the program will initiate Carlyle's encryption and kill Max. Max, who already knows, speaks with Frey one last time over a radio, then activates the program himself. As he dies, the computer core is rebooted, registering every Earth resident as a citizen of Elysium. President Patel, who has just broken into the computer core with a security team, finds his orders to arrest Spider refused, as the robotic guards now recognize Spider as a citizen. A Med-Bay cures Matilda and, since a massive number of new citizens on Earth are now recognized by Elysium's main computer as being in need of medical treatment, a fleet of medical ships are automatically dispatched to Earth to begin their work.",
	"links": [
		"https://www.amazon.com/Elysium-Matt-Damon/dp/B00G3HSF7O",
		"https://www.netflix.com/title/70251536"
	]
}