{
	"title": "Contagion",
	"release_year": "2011",
	"runtime": "106",
	"tags": [
		"Drama",
		"Thriller",
		"amazon"
	],
	"rating": 6.8,
	"actors": [
		"Matt Damon",
		"Kate Winslet",
		"Jude Law",
		"Gwyneth Paltrow",
		"Tien You Chui",
		"Josie Ho",
		"Daria Strokous",
		"Griffin Kane",
		"Yoshiaki Kobayashi",
		"Laurence Fishburne"
	],
	"staff": [
		"Steven Soderbergh",
		"Scott Z. Burns",
		"Gregory Jacobs",
		"Michael Shamberg",
		"Stacey Sher",
		"Cliff Martinez",
		"Steven Soderbergh",
		"Stephen Mirrione",
		"Carmen Cuba",
		"Howard Cummings"
	],
	"votes": 318838,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTY3MDk5MDc3OV5BMl5BanBnXkFtZTcwNzAyNTg0Ng@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Day 2.\nBeth Emhoff (Gwyneth Paltrow) is coughing. she is in airport when John Neal (John G. Beck) calls saying she just had sex with him and left without saying goodbye. Beth gets on a flight.\nPeople start getting sick & dying all over the world. Its spreading via the cough & is highly infectious. In Minnesota, Beth comes home to her husband Mitch (Matt Damon) and son Clark (Griffin Kane) and hugs her 10-year-old son. Beth has just returned from a business trip to HK & has met John in Chicago on her way to Minneapolis.DAY 3\nDr. Ellis Cheever (Laurence Fishburne) works at Centers for Disease Control and Prevention (CDC) in Atlanta. Roger the janitor knows Ellis & his son has ADHD.\nMeanwhile, Mitch goes to pick up from Clark from school from what they think is a fever. Mitch tells Clark he will beat it by Thanksgiving.\nAllen (Jude Law) is a blogger & Conspiracy theorist, who starts to investigate these deaths.DAY 4\nBeth gets sick & has a seizure. Mitch calls 911. She dies in hospital. The doctor explains that she might have picked something in China, but no one knows what happened.\nAt home, Clark dies in his bed, silently.DAY 5\nIn Switzerland, Dr. Leonora Orantes (Marion Cotillard), works at WHO. She briefs her team on the new virus & mentions Beth as the start for investigation.\nTwo medical morticians do the autopsy on Beth, opening up her skull. They notice something strange about her brain. One of the men asks if he should take a sample. \"Actually, I want you stand away from the table!\" The other technician tells him. The technician tells his partner to call EVERYONE.DAY 6\nMitch is taken back to the hospital and put under quarantine watch. His teenage daughter from his previous marriage, Jory, arrives. For some reason Mitch is not infected.\nDr. Erin Mears (Kate Winslet) is being briefed by Cheever on her job on the mysterious virus outbreak. She is to investigate and contain cases of infection in Minnesota, where Beth died. Mears notes that the virus is a contagion of touch. So, the littlest things people touch are harbors for infection. The problem, Mears says, is the carriers and the number they will potentially infect, the R-naught number. Flu is usually one person. Polio, before vaccine, was between four and six. Until they know more, this virus' R-naught number could be much greater.\nTwo doctors, Hextall and David inspect samples taken from Beth's. Hextall says they need to send it to Dr. Sussman. Sussman is another doctor in a less secure bio medical facility then theirs. Allen confronts Hextall when he is leaving & says that the virus is a profiling drug created by the Big Pharma.DAY 7\nCheever is met by Homeland Security agent Lyle Haggerty who thinks virus might be a terrorist action. Someone could try to convert the Avian flu into a weapon but Cheever counters that by saying, \"They don't need to. The birds are doing it for us.\"\nA news report states that the school Clark attended is being closed after three nurses and two other children die. A panic starts to form.\nMears goes to Beth's office & understands that Eric, her co-worker drove Beth home from airport. Mears calls Eric & quarantines him.Mitch finds out from Doctors that Beth infected John & he is also dead. Mitch is bitter that Beth cheated on him with her ex-boyfriend.\nHextall and Eisenberg brief Cheever about the virus sample from Beth's body. It latches onto the host cell, taking over completely. Traces of bat and pig in the virus DNA code so it originated from an infected bat. Understanding the severity of the issue, Cheever orders Sussman to be shut down and their secure lab is the only place where research will be done. Hextall calls Sussman and tells him to shut down and destroy his samples.DAY 8\nCheever briefs the CDC. The numbers of infected reach 80,000+ and could reach as high as 267,000. Allen continues to blog about the virus and how the government is conspiring with the drug companies to turn a profit on tragedy. He claims that a drug is available to treat the virus, but it is being suppressed by the CDC.\nDr Orantes visits HK to traces the roots of the virus as Beth took the flight from HK to US. After hearing several workers at a casino got sick where Beth attended, Orantes gets tapes of the security footage. Meanwhile, Dr. Sussman defies orders and runs some further tests on the virus samples.DAY 12\nHextall briefs Cheever on Sussman's findings. He was able to make a stable cultured version of the virus by growing it in a particular bat cell line they didn't have. Cheever is outraged that Sussman defied orders. Realizing he might publish his results; Cheever asks what he wants. Hextall says he just wants credit for his work. He could have given the work to drug companies and made a fortune, but he gave it to the CDC instead.\nThe news report on the virus, now called MEV-1 and crediting Sussman for discovering the findings. govt states that it will take months for a vaccine to be ready.\nAllen is contacted by a news source. They want him to continue his investigations on MEV-1 and the government's alleged involvement with the problem. Allen agrees.\nMitch & Mears talk & Mitch offers his blood for developing the vaccine as he seems to be immune, but Mears knows that Plasma vaccines are tricky.\nIn security footage of Beth in the HK casino, she is asked by a man, a Japanese businessman who died on a bus, to blow on his chip for good luck. She does so.\nShe also infects many other people who later turn up dead soon afterwards.DAY 14\nMears wakes up in hotel room coughing & knows she is infected. She tells Cheever. The funeral home refuses to accept Beth & Clark's bodies for burial as they could be infectious.\nOrantes realizes that Beth is \"Patient Zero\" for the entire outbreak. Orantes has a liaison Feng in HK, whose village is infected. now Feng decides to hold Orantes hostage to get the vaccine when it is first produced.\nCheever cannot get to Mears as the Govt goes into panic & grounds air traffic & public transport in Minneapolis. Cheever knows his town of Chicago is next on the quarantine list.\nMeanwhile, Allen is blogging. He is sick with the virus. He shows he is taking the homeopathic remedy Forsythia and dips it into his water and drinks it. He tells his audience that if he is here tomorrow then it worked.\nCheever calls wife Aubrey & tells her to leave Chicago (As Chicago is about to be shut down as well) & come to Atlanta. Aubrey tells one of her friends & the panic grows.DAY 18\nRiots break out all over the country as supplies for Forsythia run short. Mitch & Jory decide to leave the state, but the state borders are shut down. No one can get in or out. Allen has been running around town in a bio suit seeing the destruction. He gets home to see Lorraine, begging for the medicine he says helps, because she is pregnant. Allen says he has none due to a break-in, but he will get her some as soon as possible.\nMeanwhile in Minnesota, Dr. Mears is being told she cannot be moved out. She is in hospital. Mears dies & they don't even have body bags as they ran out.\nDr. Cheever goes on TV talking about the virus and its implications. Allen is also on via satellite and when it is his turn to speak, he goes on the attack, blaming the CDC and WHO for being in bed with the drug companies. Allen surmises that up to 1 billion people could actually be infected and/or die before it is over. He also reveals that Aubrey's friend posted on Facebook about him warning her to leave Chicago. Cheever is then charged by department of homeland security for leaking sensitive information.DAY 21\nEisenberg gets an email in the lab. A sample of a mutated & more deadly strain of the MEV-1 virus has arrived from Africa. The death toll is rising into the hundreds of thousands all over the continent. Eisenberg and Hextall begin animal trials with monkeys to test vaccine variants. None work.\nWe see the world practically abandoned at this place. Empty streets, airports, gyms etc. We see posters of Allen posted around the cities. One says prophet. The other says Profit (probably signifying he too is in it for the money).\nWe see a shrine for Lorraine. She and her child died. Allen looks at it stoically. Allen did nothing to save her.DAY 26\nMitch sees riots & looting in his neighborhood. 911 can't help. He is helpless.\nDAY 29\nJory meets Andrew who (like all boys) wants to have sex with her. Mitch intervenes & drives Andrew off with a shotgun.\nHextall notes to Cheever even with a complete vaccine it would take months for it to be viable for use. Hextall notices the monkey treated with vaccine #57 has no symptoms. Deciding to be proactive, she injects herself with the vaccine. She seems to be fine and goes to the hospital to visits her infected father. She tells him she has given herself the vaccine and spending time with him is the test to see whether it may protect humans. Her father cries, proud of his daughter and her work.\nIn News: The cure has been fast-tracked for approval and production. The first batch can be ready in about 90 days. The current death toll worldwide from the virus is estimated to be 26 million.DAY 131\nAubrey is attacked at home by looters looking for vaccine. Cheever thinks that Aubrey was touched & infected, though she denies it.\nAllen goes to see his news contact. Allen is still adamant that the vaccine should not be used. He has 12 million people who listen to him every day. He is being arrested for securities fraud and manslaughter (probably for Lorraine) among other things. (he tipped off a hedge fund for advertising the use of Forsythia.DAY 133\nHaggerty goes on television doing a vaccine lottery. Cheever finds Hextall on a computer and tells her to take a break. Hextall says she cannot, not when he is being investigated. Mitch and Jory watch the lottery. Her birthday didn't come up, so she is stuck in isolation for 144 days. She relates her woes to Andrew via text messaging.HK, in Sun Feng's village, the captive Orantes has been teaching an art class. Feng pulls her away and tells her that the authorities have caved into his demands and it's time to make the exchange. 100 vaccine shots for Orantes. At the airport, her contact reveals the vaccines they handed over were placebos and he gives her the real one. This kind of action has happened a lot lately all over the world with desperate people holding doctors and other VIPs for ransom in order to receive the vaccine, but governments don't cater to terrorists.In a police interrogation room, the lead detective tells Allen they looked at his blood work. He was never sick with the virus; he has no antibodies to it. And now he has millions of people against the vaccination that could save them, instead using a drug that probably doesn't work at all. They are going to charge Allen with fraud put him in jail and his money he made ($4.5 million) will be locked away too. Allen apparently has posted bail with help from his millions of followers. A smug Allen leaves the police station.Cheever is presented two doses by Haggerty. One for him, one for his wife. Cheever says his wife will want to do them together. Instead, he gives one to Roger's son. Cheever puts on the vaccine bracelet to keep the charade going. He goes home and gives the other shot to his wife.DAY 135\nThings finally seem to be slowly getting back under control as worldwide looting and anarchy begins to wear off. Hextall and Eisenberg are seen in the lab putting the MEV-1 virus into long-term liquid nitrogen storage next to some other nearly eradicated virus cultures, hopefully never to be seen again.Mitch goes to a nearly deserted shopping mall, being stopped at several checkpoints to make sure he is immune by scanning his vaccination bracelet.\nJory finds a box in her room from her father telling her to be ready at 8:00 pm. Inside there is a dress. There is a knock on the door. It is Andrew, who got the vaccine and is now sporting his vaccination bracelet proudly - they can finally be near each other. The two of them begin to dance. Mitch goes downstairs to take pictures of Jory and Andrew. Mitch watches them dance. In that moment, there is hope for the future.A final flashback occurs. We finally see what caused the global epidemic. A construction crew from Beth's company AIMM was cutting down trees in a forest in China. That caused some bats to fly out. One bat was infected with the virus. It grabbed a piece of banana and perched above a pig's pen. It dropped the banana piece which we are to assume had the virus on it. A pig eats it and is eventually slaughtered at market for food. A chef handles the dead pig, touching the inside of the infected pig's mouth with his bare hands. He goes out to dining room and poses in a picture with Beth holding hands, transferring the virus to her and starting the chain of events.A title card states it is Day 1....",
	"links": [
		"https://www.amazon.com/Contagion-Marion-Cotillard/dp/B006IVBSBU"
	]
}