{
	"title": "The Beekeeper",
	"release_year": "2024",
	"runtime": "105",
	"tags": [
		"Action",
		"Crime",
		"Thriller",
		"amazon"
	],
	"rating": 6.4,
	"actors": [
		"Jason Statham",
		"Emmy Raver-Lampman",
		"Bobby Naderi",
		"Josh Hutcherson",
		"Jeremy Irons",
		"David Witts",
		"Michael Epp",
		"Taylor James",
		"Phylicia Rashad",
		"Jemma Redgrave"
	],
	"staff": [
		"David Ayer",
		"Kurt Wimmer",
		"David Ayer",
		"Bill Block",
		"Chris Long",
		"Jason Statham",
		"Jared Michael Fry",
		"David Sardy",
		"Gabriel Beristain",
		"Geoffrey O'Brien",
		"Daniel Hubbard",
		"Ben Munro"
	],
	"votes": 128731,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzg3YjVmZGYtOTc5MC00MDdiLTllOTYtZWQ0ODQ1MmMyNTExXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In rural Massachusetts, Eloise Parker is a retired school teacher living a lonely life, but shares a warm friendship with Adam Clay, a quiet beekeeper living in her barn. Eloise falls for a phishing scam that bankrupts her and steals her life savings, including more than $2 million from her charity. A devastated Eloise shoots herself. Adam discovers her body and is arrested by FBI agent Verona Parker, Eloise's daughter. After being cleared and released, Adam contacts a mysterious group called the Beekeepers to track down the scammers as he wants to exact revenge for Eloise's death.They trace it to a nearby call center run by Mickey Garnett. Adam storms the call center and burns it down. Mickey's boss Derek Danforth orders Mickey to kill Adam, who dispatches Mickey's men at the barn and amputates some of Mickey's fingers with a handsaw. Mickey escapes and calls Derek, but is caught and dragged off a bridge by Adam, who threatens Derek over Mickey's phone.Derek informs Wallace Westwyld, a former CIA director-turned-security director for Derek's tech firm Danforth Enterprises, of Adam's threat. Recognizing Adam as a former Beekeeper, Wallace alerts current CIA director Janet Harward, who dispatches Anisette, an active Beekeeper, to kill him, but Adam repels Anisette's ambush at a gas station near Springfield and burns her to death; the Beekeepers promptly declare neutrality. Wallace organizes an ex-special forces protective team led by Pettis and briefs them on the Beekeepers-an elite clandestine human intelligence organization that operates outside governmental checks and balances, tasked with protecting the United States and the global system, akin to worker policing and how beekeepers maintain bee colonies. Like worker bees, Beekeepers technically continue to work for the organization until death, but Adam considers himself retired and views his pursuit of Derek as personal.Verona and her partner Matt Wiley, who have been investigating Adam's chaos, anticipate his next target is the Nine Star United Center in Boston, which oversees Derek's global scam call centers. FBI deputy director Jackson Prigg authorizes an FBI SWAT deployment to secure the area, but they are beat there by Pettis's team, who order them out. However, Nine Star executive Rico Anzalone's refusal to obey Pettis and evacuate the Nine Star employees causes confusion that enables Adam to incapacitate the FBI SWAT team, kill Pettis and his men, and interrogate Anzalone. Verona, Wiley and the Boston Police Department arrest Anzalone and the Nine Star employees, but Adam disarms Wiley and escapes. Investigating Nine Star, Verona and Wiley learns that Derek is the son of Jessica Danforth, former Danforth Enterprises CEO and current U.S. President, who they fear Adam will kill next, owing to the behavior of worker bees to kill their queen bee if it produces an \"inferior son\".Verona, Wiley and Prigg join the Secret Service Counter Assault Team and Derek's mercenary security detail, led by veteran Beekeeper-killer Lazarus, to secure a party at the Danforths' coastal mansion, where Derek believes he will be safe as Beekeepers would not harm close associates of the President. Adam sneaks in regardless and, after being spotted by Verona, fights his way through mercenaries and CAT agents to reach the Danforths in their office, killing Lazarus in a brutal knife-fight and injuring Wallace when he orders Adam to stand down. Meanwhile, Prigg confronts Derek, who admits to misusing Wallace's CIA algorithms to organize scams and rig Jessica's election by flipping the necessary swing counties in her favor. A horrified Jessica announces that she will expose Derek's crimes to the public even if it adversely affects her position, prompting an enraged Derek to shoot Prigg and take Jessica hostage just as Adam, Verona and Wiley enter the room. When Derek tries to execute Jessica, Adam shoots him, saving her life, and flees through a window. Verona gives chase and holds Adam at gunpoint, but ultimately decides to leave him. Adam retrieves his hidden scuba set at the beach and disappears into the sea.",
	"links": [
		"https://www.amazon.com/Beekeeper-Jason-Statham/dp/B0CQCDMY2V"
	]
}