{
	"title": "Elemental",
	"release_year": "2023",
	"runtime": "101",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy"
	],
	"rating": 7.0,
	"actors": [
		"Leah Lewis",
		"Mamoudou Athie",
		"Ronnie Del Carmen",
		"Shila Ommi",
		"Wendi McLendon-Covey",
		"Catherine O'Hara",
		"Mason Wertheimer",
		"Ronobir Lahiri",
		"Wilma Bonet",
		"Joe Pera"
	],
	"staff": [
		"Peter Sohn",
		"John Hoberg",
		"Kat Likkel",
		"Brenda Hsueh",
		"Peter Sohn",
		"Denise Ream",
		"Thomas Newman",
		"David Juan Bianchi",
		"Jean-Claude Kalache",
		"Stephen Schaffer",
		"Natalie Lyon",
		"Kevin Reher",
		"Don Shank"
	],
	"votes": 137216,
	"cover": "https://m.media-amazon.com/images/M/MV5BNjU2MjE1OGItZjdmYS00ZmIyLTljNjYtOWI5ZGRkZjM4NDEwXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Fire elements Bernie and Cinder Lumen immigrate to Element City where they face xenophobia from other classical elements. After the birth of their daughter Ember, they set up their Blue Flame which represents their traditions and start their own convenience store called the Fireplace. Several years later, Bernie intends to retire and give Ember the store once she can control her fiery temper. One day, when Bernie allows Ember to run the shop on her own, she becomes overwhelmed by the customers and rushes to the basement. Her fiery outburst breaks a water pipe, flooding the basement and summoning Wade Ripple, a water element and city inspector, who notes the faulty plumbing. Despite Ember's attempts to stop him, Wade travels to City Hall and reluctantly files a report of his findings with his air element employer, Gale Cumulus, who will have the Fireplace shut down.Wade brings Ember to Cyclone Stadium to persuade Gale to reconsider the shutdown of her father's store. Wade mentions to Ember that he was investigating a leak in the city's canals before ending up at the Fireplace, and suggests to Gale that he and Ember can track the source of the leak from the store. Gale offers to forgive the violations as long as they find and seal the leak by the end of the week. While searching the canals, Ember and Wade discover a hole in a dam that allows wave runoff from ships to flood the city's plumbing, so they close the hole with sandbags. The two spend time together in the city and learn more about each other. The sandbags eventually fail, so Ember melts the sand into glass to form a sturdier seal. Ember visits Wade's family at a luxury apartment, where she uses her fire to fix a broken glass pitcher, impressing Wade's mother Brook, who recommends her for a glassmaking internship. While playing \"the Crying Game\", Wade makes Ember cry by admitting he has feelings for her. Gale calls Wade and approves Ember's glass seal, thus saving the Fireplace from closure. Ember then realizes that she does not want to take over the store.Bernie announces his intention to retire and hand the Fireplace to Ember. The next evening, Wade takes Ember to Garden Central Station to see Vivisteria flowers, a species that can thrive in any environment, which she was denied seeing in childhood. With the station now flooded, Gale provides Ember with an air bubble for safety while Wade pushes her underwater through the station. Afterward, Ember and Wade realize that they are able to touch without harming each other and share a dance, but Ember remembers her duty to the Fireplace and her family's prejudice against water elements, and breaks up with Wade. While Ember is about the take over the Fireplace during a party, Wade appears and declares his love for her, while also accidentally revealing that she caused the broken pipe. Ember rejects Wade, though Cinder senses genuine affection. Disappointed, Bernie refuses to give Ember the store and calls off his retirement.Soon after, the new seal on the dam breaks and Firetown floods. After saving the Blue Flame, Ember and Wade become trapped in a room in the Fireplace, causing Wade to evaporate from the enclosed heat. After the flood recedes, a grief-stricken Ember confesses to Bernie that she does not want to run the Fireplace and expresses her love for Wade. Realizing that Wade has condensed within the stone ceiling, Ember plays the Crying Game to get him to drip back into his normal form. Ember and Wade embrace and share their first kiss.Months later, Bernie has retired and the Fireplace is now run by friends of his. Ember and Wade, now a couple, leave Element City so that Ember can start her internship.",
	"links": []
}