{
	"title": "Dune: Part Two",
	"release_year": "2024",
	"runtime": "166",
	"tags": [
		"Action",
		"Adventure",
		"Drama",
		"amazon",
		"netflix"
	],
	"rating": 8.5,
	"actors": [
		"Timothée Chalamet",
		"Zendaya",
		"Rebecca Ferguson",
		"Javier Bardem",
		"Josh Brolin",
		"Austin Butler",
		"Florence Pugh",
		"Dave Bautista",
		"Christopher Walken",
		"Léa Seydoux"
	],
	"staff": [
		"Denis Villeneuve",
		"Denis Villeneuve",
		"Jon Spaihts",
		"Frank Herbert",
		"Cale Boyter",
		"Tanya Lapointe",
		"Patrick McCormick",
		"Mary Parent",
		"Hans Zimmer",
		"Greig Fraser",
		"Joe Walker",
		"Francine Maisler",
		"Patrice Vermette"
	],
	"links": [
		"https://www.amazon.com/Dune-Part-Two-Denis-Villeneuve/dp/B0CWPL9J66",
		"https://www.netflix.com/title/81602836"
	],
	"votes": 511484,
	"cover": "https://m.media-amazon.com/images/M/MV5BNTc0YmQxMjEtODI5MC00NjFiLTlkMWUtOGQ5NjFmYWUyZGJhXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Following the destruction of House Atreides by House Harkonnen, Princess Irulan, the daughter of Padishah Emperor Shaddam IV, journals about her father's betrayal of the Atreides. On Arrakis, Stilgar's Fremen troops accompany Paul Atreides and his pregnant Bene Gesserit mother, Lady Jessica, to Sietch Tabr. Some Fremen suspect they are spies, while Stilgar and others see signs of the prophecy that a mother and son from the \"Outer World\" will bring prosperity to Arrakis.The Fremen accept Paul but Stilgar tells Jessica she must succeed Sietch Tabr's dying Reverend Mother by drinking the Water of Life-a drug fatal for males and untrained women. She uses her Bene Gesserit training to transmute the liquid and survive, inheriting the memories of all past Reverend Mothers. The liquid prematurely awakens the mind of her unborn daughter, Alia, allowing Jessica to communicate with her. They agree to focus on convincing the more skeptical northern Fremen of the prophecy. Chani and her friend, Shishakli, correctly believe the prophecy was fabricated to manipulate the Fremen, but Chani begins to respect Paul after he declares that he only intends to fight alongside the Fremen, not to rule them.Paul and Chani fall in love as Paul immerses himself in Fremen culture: learning their language, becoming a Fedaykin fighter, riding \"the largest sand-worm ever seen\", and raiding Harkonnen spice operations. Paul adopts the Fremen names \"Usul\" and \"Muad'Dib\". Due to the continuing spice raids, Baron Vladimir Harkonnen replaces his nephew, Rabban, as Arrakis's ruler with his cunning and psychopathic younger nephew, Feyd-Rautha. Lady Margot Fenring, a Bene Gesserit, is sent to evaluate Feyd-Rautha as a prospective Kwisatz Haderach and secure his genetic lineage.Jessica travels south to unite with Fremen fundamentalists who believe most strongly in the prophecy. Paul remains in the north, fearful that his visions of an apocalyptic holy war will come to pass if he goes south as a messiah. During a raid on a smuggler spice harvester, Paul reunites with Gurney Halleck, who leads Paul to the hidden atomic warhead stockpile of House Atreides. Feyd-Rautha unleashes a devastating attack on the northern Fremen, destroying Sietch Tabr, burning Shishakli alive, and forcing Paul and the survivors to journey south. Upon arrival, Paul drinks the Water of Life and falls into a coma. This angers Chani, but Jessica compels her to mix her tears with the liquid, which awakens Paul. Now possessing a partial clairvoyance across space and time, Paul sees an adult Alia on water-filled Arrakis. He also sees a singular path to victory among all possible futures, and that Jessica is Baron Harkonnen's daughter.Paul meets with the southern Fremen war council, galvanizing Stilgar and the crowd by demonstrating his ability to discern their deepest thoughts. He declares himself the Lisan al Gaib and sends a challenge to Shaddam, who arrives on Arrakis with Irulan and the Sardaukar. Shaddam chastises the Harkonnens for their failures and cuts the Baron's life support. Meanwhile, the Fremen launch an offensive, using atomics and sand-worms to overpower the Sardaukar. Paul executes the Baron and captures Shaddam and his entourage. Meanwhile, Gurney leads an assault on Arrakeen, intercepting and killing Rabban.Paul challenges Shaddam for the throne and, to Chani's dismay, demands to marry Irulan. Previously summoned by the Baron, the Great Houses arrive in orbit, ready to invade the planet, but Paul threatens to destroy the spice fields with atomic weapons if they intervene. Feyd-Rautha volunteers to be Shaddam's champion, and Paul kills him in a duel despite being stabbed twice.Irulan agrees to Paul's request for marriage on the condition that her father lives. Shaddam surrenders, but the Great Houses reject Paul's ascendancy, so he orders the Fremen to attack the orbiting fleet. As Stilgar leads the Fremen onto the captured Sardaukar ships, Jessica and Alia reflect on the beginning of Paul's holy war.Chani refuses to bow to Paul and departs alone on a sand-worm."
}