{
	"title": "The Girl with the Dragon Tattoo",
	"release_year": "2011",
	"runtime": "158",
	"tags": [
		"Crime",
		"Drama",
		"Mystery",
		"max",
		"amazon"
	],
	"rating": 7.8,
	"actors": [
		"Daniel Craig",
		"Rooney Mara",
		"Christopher Plummer",
		"Stellan Skarsgård",
		"Steven Berkoff",
		"Robin Wright",
		"Yorick van Wageningen",
		"Joely Richardson",
		"Geraldine James",
		"Goran Visnjic"
	],
	"staff": [
		"David Fincher",
		"Steven Zaillian",
		"Stieg Larsson",
		"Ceán Chaffin",
		"Scott Rudin",
		"Søren Stærmose",
		"Ole Søndberg",
		"Trent Reznor",
		"Atticus Ross",
		"Jeff Cronenweth",
		"Kirk Baxter",
		"Angus Wall",
		"Laray Mayfield",
		"Sabrina",
		"Donald Graham Burt"
	],
	"links": [
		"https://www.max.com/movies/girl-with-the-dragon-tattoo/e51c8366-7aed-4af9-bc7e-f7e8188ac7da",
		"https://www.amazon.com/Girl-Dragon-Tattoo-Daniel-Craig/dp/B007FH9GA6"
	],
	"votes": 501594,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTczNDk4NTQ0OV5BMl5BanBnXkFtZTcwNDAxMDgxNw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In Stockholm, Sweden, journalist Mikael Blomkvist (Daniel Craig), co-owner of Millennium magazine, has just lost a libel case brought against him by corrupt businessman Hans-Erik Wennerström (Ulf Friberg). Meanwhile, Lisbeth Salander (Rooney Mara), a brilliant but damaged researcher and hacker, compiles an extensive background check on Blomkvist for business magnate Henrik Vanger (Christopher Plummer), who has a special task for him. In exchange for the promise of damning information about Wennerström, Blomkvist agrees to investigate the disappearance and assumed murder of Henrik's great-niece, Harriet, 40 years before. After moving to the Vanger family's compound, Blomkvist uncovers a notebook containing a list of names and numbers that no one has been able to decipher.Harriet disappeared in 1966 when the entire Vanger family had gathered on a Swiss island for the annual board meeting. there was an accident on the only approach bridge connecting the island to the mainland, blocking traffic for 24 hrs. Harriet disappeared during that time. One of the family members is the killer.\nSalander, who is under state legal guardianship due to diagnosed mental incompetency, is appointed a new guardian, lawyer Nils Bjurman (Yorick van Wageningen), after her previous guardian has a stroke. Bjurman abuses his authority to extort sexual favors from Salander and then violently sexually assaults her, not realizing she has a hidden video camera in her bag. At their next meeting, she stuns him with a Taser, sexually assaults him with a dildo, and marks him as a sexual predator with a tattoo on his chest and stomach. She then blackmails him into writing her a glowing progress report and giving her full control of her money.Blomkvist moves into a cottage on the Vanger estate. Vanger tells him that his three brothers (Harald, Richard & Gottfried) were all members of the Swedish Nazi Party. Of the three, only Harald is still living. Harriet was Gottfried's daughter & MArtin was her brother. Martin now lives on the island & is head of the Vanger group of companies. Gottfried's wife Isabella is alive & was a terrible mother to Harriet. Harald had daughter Cecilia (Who no longer speaks to Harald). Cecilia has a sister Anita who lives in Paris. Inside Harriet's Bible, Blomkvist finds a list of five names alongside what appear to be phone numbers. He visits police inspector Morell (Björn Granath), who informs him that his investigation team had been unable to decipher them. Using a series of photographs taken during the Children's Day parade, Blomkvist believes that Harriet may have seen someone that day who may have killed her. Gottfried had died one yr before Harriet's disappearance at a cottage on the island by drowning in a nearby lake. Harriet used to visit the cottage often with Anita.Blomkvist realizes that a woman took photos at the parade of Sep 1966 of the side of the street, where Harriet saw someone that made her leave suddenly. He traces the woman & finds the picture that reveals the hazy outline of a man.\nBlomkvist's daughter visits him and notes that the numbers from the notebook are Bible references. Blomkvist tells Vanger's lawyer Dirch Frode (Steven Berkoff) that he needs help with his research, and Frode recommends Salander based on the work she did researching Blomkvist himself. Blomkvist hires Salander to further investigate the notebook's content. She uncovers a connection to a series of murders of young women that occurred from 1947 through 1967, with the women either being Hebrew or having Biblical names; many of the Vangers are known anti-Semites. Together, using the clue that Salander discovered, they connect all but one of the names on Harriet's list to murdered women between 1945 and 1955. They are all Hebrew names, leading Blomkvist and Salander to suspect that the murders were motivated by anti-Semitism.During the investigation, Salander and Blomkvist become lovers. Henrik's brother Harald (Per Myrberg) identifies Martin (Stellan Skarsgård), Harriet's brother and operational head of the Vanger empire, as a possible suspect.\nBlomkvist is shot at by a man in deer hunting costume. Inspector Morell finds the last missing name on the bible list. That lady was also brutally murdered in Jan 1965, & used to be Gottfried's secretary. Gottfried died in the lake, shortly thereafter.\nSalander's research uncovers evidence that Martin and his deceased father, Gottfried, had committed the murders. She gets access to Vanger's corporate records & figures out that the murders took place only in locations where the company had a office. The only people who consistently traveled to each of the locations on the murder dates were Martin & his father Gootfried.Blomkvist breaks into Martin's house to look for more clues, but Martin catches him and prepares to kill him. Martin brags about having killed women for decades, but denies killing Harriet. Salander arrives, subdues Martin and saves Blomkvist. While Salander tends to Blomkvist, Martin flees. Salander, on her motorcycle, pursues Martin in his SUV. He loses control of his vehicle on an icy road and dies when it catches fire. Salander nurses Blomkvist back to health, and tells him that she tried to kill her father when she was 12. After recovering, Blomkvist deduces that Harriet is still alive and her cousin Anita (Joely Richardson) likely knows where she is. He and Salander monitor Anita, waiting for her to contact Harriet. When nothing happens, Blomkvist confronts her, correctly deducing that Anita is Harriet herself. She explains that her father and brother had sexually abused her for years, and that Martin saw her kill their father in self-defense at the cottage. Her cousin Anita smuggled her out of the island and let her live under her identity. Anita died in a car accident 20 yrs ago. Finally free of her brother, she returns to Sweden and tearfully reunites with Henrik.As promised, Henrik gives Blomkvist the information on Wennerström, but it proves to be worthless. Salander hacks into Wennerström's computer and presents Blomkvist with damning evidence of Wennerström's crimes. Blomkvist publishes an article which ruins Wennerström, who flees the country. Salander hacks into Wennerström's bank accounts and, travelling to Switzerland in disguise, transfers two billion euros to various accounts. Wennerström is soon found murdered. Salander reveals to her former guardian that she is in love with Blomkvist. On her way to give Blomkvist a Christmas present, however, Salander sees him and his longtime lover and business partner Erika Berger (Robin Wright) walking together happily. Dismayed, she discards the gift and rides away."
}