{
	"title": "This Means War",
	"release_year": "2012",
	"runtime": "103",
	"tags": [
		"Action",
		"Comedy",
		"Romance",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Reese Witherspoon",
		"Chris Pine",
		"Tom Hardy",
		"Til Schweiger",
		"Chelsea Handler",
		"John Paul Ruttan",
		"Abigail Spencer",
		"Angela Bassett",
		"Rosemary Harris",
		"George Touliatos"
	],
	"staff": [
		"McG",
		"Timothy Dowling",
		"Simon Kinberg",
		"Marcus Gautesen",
		"Simon Kinberg",
		"James Lassiter",
		"Robert Simonds",
		"Will Smith",
		"Christophe Beck",
		"Russell Carpenter",
		"Nicolas De Toth",
		"Martin Laing"
	],
	"votes": 195260,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTYyOTQ4MDE2MV5BMl5BanBnXkFtZTcwOTE0MTgwNw@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "CIA agents and best friends FDR Foster (Chris Pine) and Tuck Hansen (Tom Hardy) are deployed to Hong Kong to prevent international criminal Karl Heinrich (Til Schweiger) from acquiring a weapon of mass destruction, but the mission goes awry, resulting in the death of Heinrich's brother Jonas and Heinrich swearing vengeance against them. For their protection, their boss, Collins (Angela Bassett), assigns them to desk duty upon returning to America.FDR is a womanizer, whose cover is that he's a cruise ship captain, while Tuck, who presents himself as a travel agent, has an ex-wife, Katie (Abigail Spencer), and a son, Joe (John Paul Ruttan). After seeing a commercial for online dating, Tuck decides to sign himself up and is paired with Lauren Scott (Reese Witherspoon), a product testing executive who's dealing with the recent engagement of her ex-boyfriend. Her best friend, Trish (Chelsea Handler), has signed her up for the same online dating site. FDR insists on being Tuck's backup for the date and hides nearby, but Tuck & Lauren hit it off.Shortly thereafter, FDR runs into Lauren at a video store and tries to flirt with her, not knowing she's Tuck's date, but she notices that he's a ladies' man and ignores him. Intrigued, FDR crashes into one of Lauren's test groups and persuades her to go on a date with him, where they also enjoy themselves. Lauren feels guilty about dating two men at the same time, but is persuaded by Trish to make the best of the situation.FDR and Tuck soon discover that they're seeing the same woman and decide not to tell her that they know each other, to interfere with each others' dates, nor have sex with her and let her come to a decision between them. However, they soon break their rules and use CIA technology to spy on her and discover her preferences, as well as try to sabotage one another. FDR and Lauren eventually have sex, and Tuck and Lauren nearly do as well, before Lauren interrupts it, feeling bad about herself. However, since Tuck had sabotaged FDR's bugs in Lauren's apartment, FDR was convinced that they had had sex.One day, Lauren invites Tuck to lunch, while FDR discovers that Heinrich has come to America to exact revenge against them. He interrupts Lauren's date with Tuck to warn him, but Tuck doesn't believe him and they engage in a fistfight, during which Lauren discovers that they are in fact best friends and, feeling made a fool of by them, decides to leave alone with Trish. At that moment, they are captured by Heinrich and his men, who are pursued by FDR and Tuck.FDR and Tuck rescue Lauren and Trish after a car chase, in which they reveal that they are CIA agents and, on Lauren's advice, shoot the headlights on Heinrich's car, deploying the airbags and sending Heinrich's car spiraling out of control. FDR and Tuck, on different sides of the road, urge Lauren to come to their side, and she ultimately chooses FDR as Heinrich dies when his car swerves off the bridge and crashes below. Lauren decides to be with FDR, and Tuck makes amends with him. Tuck soon reconciles with Katie and they get married once more.Shortly thereafter, FDR and Tuck are on a mission and about to parachute out of a Chinook helicopter when FDR reveals that he'll marry Lauren, and also that he had sex with Katie before she met Tuck, and no longer feels guilty about it because Tuck had sex with Lauren. Tuck, however, reveals that they didn't go all the way and angrily tackles FDR out of the helicopter.",
	"links": [
		"https://www.amazon.com/This-Means-War-Reese-Witherspoon/dp/B007Y4JQB4"
	]
}