{
	"title": "The Commuter",
	"release_year": "2018",
	"runtime": "104",
	"tags": [
		"Action",
		"Mystery",
		"Thriller",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Liam Neeson",
		"Vera Farmiga",
		"Patrick Wilson",
		"Jonathan Banks",
		"Sam Neill",
		"Elizabeth McGovern",
		"Killian Scott",
		"Shazad Latif",
		"Andy Nyman",
		"Clara Lago"
	],
	"staff": [
		"Jaume Collet-Serra",
		"Byron Willinger",
		"Philip de Blasi",
		"Ryan Engle",
		"Alex Heineman",
		"Andrew Rona",
		"Roque Baños",
		"Paul Cameron",
		"Nicolas De Toth",
		"Reg Poerscout-Edgerton",
		"Richard Bridgland"
	],
	"votes": 126945,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTU3Mjk2MDMwNl5BMl5BanBnXkFtZTgwNzQyODI1MzI@._V1_QL75_UX190_CR0,6,190,281_.jpg",
	"description": "Michael MacCauley (Liam Neeson), a former police officer, is a family man with a wife Karen (Elizabeth McGovern) and son Danny (Dean-Charles Chapman). He goes through the same routine train commute to work and back every day on the Hudson Line from Tarrytown to Grand Central Terminal. The train takes a scenic route through the coast, and Michael meets the same commuters as the conductors Jimmy (Adam Nagaitis) and Sam and an old passenger named Walt.Michael has been working as a Life Insurance salesman for the last 10 years. This endangers his family's financial security as his son is just about to start college, and he has 2 mortgages. His boss Frank (Ben Caplan) gives his medical insurance for his family as a severance package. Michael is 60 years old, 5 years from retirement and is living hand to mouth. Frank says that Michael is an expensive employee with his package and benefits, and the RoI is not there for the company.Waiting to reveal his dismissal to his wife and son, he instead confides in Murphy, his ex-partner still on the police force. Michael and Murphy were together for 7 years on the force. Captain David Hawthorne (Sam Neill) was their colleague, who is now captain of the department.On the train, before getting on it, Michael notices a man turning back after he watches police checking bags of all passengers and then a pickpocket steals Michael's mobile phone. The train is full of passengers and the last coach is empty as the AC is there is not working. Gradually, as commuters get off, Michael finds a seat to sit.\nMichael meets a mysterious woman named Joanna (Vera Farmiga). Joanna proposes a hypothetical situation to Michael, asking him to do one little thing, the results of which would have consequences that he would know nothing about, but would affect one of the passengers on the train. She tells Michael that in the bathroom is $25,000 plus the promise another $75,000 once the job is done. Michael desperately needs the money.Joanna's one little thing that she wants Michael to do is locate \"Prynne,\" an unknown passenger travelling till \"Cold Spring\", and plant a GPS tracker on them. With this, Joanna steps off the train at the next station.\nOut of curiosity, Michael searches the bathroom and finds an envelope with $25,000 and realizes that the situation is not hypothetical.He attempts to leave the train but is stopped by a young woman who hands him another envelope with Michael's wife's wedding ring and says that this is a warning. Michael borrows a phone from a fellow passenger and attempts to call his wife but with no response. Unable to reach his wife by phone, he discreetly approaches fellow commuter Walt (Jonathan Banks), writing a note on his newspaper to contact the police. Michael leaves Murphy a voicemail describing the situation and receives a call from Joanna threatening him and his family. She tells him the train is rigged with hidden cameras and to look outside (as the train comes to a temporary halt), where he sees Walt being pushed in front of a moving bus and killed. Joanna points Michael to a GPS tracker in his jacket to plant on Prynne.Michael checks the tickets of each of the passengers (the stubs were put by Jimmy on the seat handles and were easily visible to Michael) to see where they are getting off. He finds several passengers who are getting off in the same zone as Cold Springs (which has 2 stations). Michael suspects a passenger named Gwen (Florence Pugh), but she turns out to be carrying fake IDs on behalf of her boyfriend.Michael induces a conductor to make random security searches, saying that he has observed suspicious activity by some of the passengers.\nBut when the conductor tries to search a woman named Eva's (Clara Lago) bag, she protests loudly. A man immediately leaves the car, and Michael follows, but the man attacks him, and Michael plants the tracker on him believing that this man is Prynne. Murphy calls back and explains that Prynne is a key witness in the supposed suicide of city official Enrique Mendez (who fell 35 stories from his office window), leading Michael to realize that Prynne will be killed, and that Michael is being set up.In a deserted carriage, Michael discovers the body of the man he planted the tracker on and a badge revealing he was an FBI agent. Joanna calls, chastising Michael for marking the wrong person and warning that another passenger reported his suspicious activities to police. The police stop the train at the next station to investigate. Michael hides with the corpse underneath the carriage but loses the $25,000 when the envelope falls out of his bag.Sabotaging the air conditioning in the train except for the last car, Michael forces all of the remaining passengers into the last car. Prynne is revealed to be a 16-year-old girl named Sofia (Ella-Rae Smith), who is holding incriminating information on powerful people and was to go into witness protection at the final stop of the train. The FBI agents was escorting her into witness protection. Michael asks Sofia why she did not go to the police, and she reveals that it was police who killed Enrique, and that Enrique was her cousin.Michael realizes another passenger, Oliver (Kobna Holdbrook-Smith), killed the FBI agent. Oliver reveals that he received the same instructions for $100,000 but with orders to kill Prynne once Michael identified him. They fight, and Michael throws Oliver out of a window, thereby killing him.Joanna calls Michael and tries to convince him to kill Sofia for the sake of his family, but Michael refuses. Joanna activates the fail-safe plan and derails the train in order to kill everyone aboard. Michael manages to save all of the passengers by unhooking the final car from the rest of the train right before a curve. The conductor, Sam (Colin McFarlane), does not survive the crash. Michael instructs the passengers to block the carriage windows with wet newspapers before a massive police force arrives.Assuming Michael is holding the train hostage, Murphy is sent to talk to him, only to be revealed as the cop that killed Enrique. Michael and Murphy engage in a fight, during which Michael removes Murphy's police tracker which identifies him as a friendly to the snipers outside. The snipers, believing Murphy to be Michael, shoot and kill Murphy.Sofia tells the FBI what she knows, and Michael is exonerated by the other passengers while the FBI rescues his family. His former captain admits that Murphy and other corrupt officers had been under investigation and offers Michael his job back. Michael reveals that he kept the incriminating hard drive Sofia gave him. Sometime later, Joanna is on a train back from Chicago when Michael confronts her, showing her his detective's badge and preparing to arrest her.",
	"links": [
		"https://www.amazon.com/Retribution-Liam-Neeson/dp/B0C8XS4LKQ"
	]
}