{
	"title": "Zombieland: Double Tap",
	"release_year": "2019",
	"runtime": "99",
	"tags": [
		"Action",
		"Comedy",
		"Horror",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Woody Harrelson",
		"Jesse Eisenberg",
		"Emma Stone",
		"Abigail Breslin",
		"Zoey Deutch",
		"Avan Jogia",
		"Rosario Dawson",
		"Luke Wilson",
		"Thomas Middleditch",
		"Victoria Hall"
	],
	"staff": [
		"Ruben Fleischer",
		"Rhett Reese",
		"Paul Wernick",
		"Dave Callaham",
		"Gavin Polone",
		"David Sardy",
		"Chung-hoon Chung",
		"Chris Patterson",
		"Dirk Westervelt",
		"John Papsidera",
		"Martin Whist"
	],
	"votes": 207865,
	"cover": "https://m.media-amazon.com/images/M/MV5BOTViNDc4NTgtYzVlNi00YmY3LWFiNDgtODJlNGU1YzI1MGExXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Ten years after the events of the first film, survivors Tallahassee (Woody Harrelson), Columbus (Jesse Eisenberg), Wichita (Emma Stone), and Little Rock (Abigail Breslin) have become experts in identifying and disposing of various Zombies types (like Homer (Dumb Zombie), Hawking (Smart Zombie), Ninja (Silent and Deadly Zombie)). They move in to the abandoned White House. Columbus decides to propose to Wichita using the Hope Diamond, while Tallahassee rebuffs Little Rock's hopes of starting her own family. The next morning, Tallahassee finds a note from Wichita and Little Rock, who have left due to Little Rock feeling Tallahassee still treats her like a child and Wichita's fear she is too attached to Columbus.A month later, while exploring a mall, Columbus is startled by Madison, who has survived Zombieland alone since she was fourteen inside the freezer of a Pinkberry. Madison (Zoey Deutch) quickly annoys Tallahassee, but Columbus invites her back to the White House, where she has sex with him. Returning and discovering Columbus has slept with Madison, Wichita explains that Little Rock has left for Graceland with a pacifist musician Berkeley (Avan Jogia), and informs the group of more agile and durable \"super Zombies\". Fearing for Little Rock's safety, the group heads toward Graceland in a rundown minivan without any weapons. Tallahasse is enraged that Little rock is dating musician.. Wichita tells Tallahasse that he is over-bearing and is probably pushing Little-Rock away.On the road, the group tries to commandeer a luxury RV since Columbus has a strict \"no clown\" policy that prevents them from getting in an ice-cream truck. As they enter the RV the alarm goes off, and zombies attack. Methodically fighting back as a team, they encounter one of the super-zombies that takes multiple gunshots to kill, leading Columbus to nickname it the \"T-800\" after the Terminator franchise. Madison shows signs of \"Zombification\" after she is bit in the attack, forcing Columbus to lead her into the forest to shoot her. The group finds \"the Beast\", Tallahassee's modified presidential limousine stolen by Little Rock, at an Elvis-themed motel run by Nevada (Rosario Dawson), who reveals Little Rock took another vehicle toward Babylon, a hippie commune where no guns are allowed. Bonding over their love of Elvis, Nevada and Tallahassee spend the night together.The group awakens to find the Beast being crushed by a monster truck driven by Albuquerque (Luke Wilson) and Flagstaff (Thomas Middleditch), who strongly resemble Tallahassee and Columbus. Super zombies arrive, and Albuquerque explains they have turned back from their journey west due to hordes of super zombies moving east. Facing the super zombies alone, Albuquerque and Flagstaff are bitten, turn into zombies, and are both killed. Nevada talk about \"Murrayed\" which a term used for shooting somebody because you think they are a Zombie. Apparently that's how Bill Murray died.Heading out, the group finds Madison, alive and driving the clown themed ice-cream truck (her Zombification earlier was simply a nut allergy triggered by eating trail mix). Rejoining the group, she explains that her nut allergy caused symptoms similar to Zombification when Columbus spared her in the forest. The group arrives at Babylon, gives up their weapons, and find Little Rock. A satisfied Tallahassee departs (he is happy to see Little Rock safe and sound), only to find a horde of super zombies attracted by the commune's fireworks and runs back to warn the group. Left without guns, Tallahassee devises a plan to kill the zombies with exploding bio-diesel and then have commune members armed with barricade shields corral the stragglers off of a skyscraper with Tallahassee himself as the bait.The zombie horde is more massive than expected, and the group is surrounded and almost overwhelmed. Luckily, Nevada arrives in Albuquerque's monster truck, rescuing the group, although the vehicle soon rolls over. Escaping upstairs, the survivors corral the zombies off the roof. Tallahassee uses a construction crane hook to dangle just out of reach, but the last two zombies seize his leg as they fall, and Little Rock shoots them with a pistol given to her earlier by Tallahassee, rescuing him. The two reconcile, and Wichita accepts Columbus' proposal of marriage. Little Rock breaks up with Berkeley, who hooks up with Madison; they stay behind as the group, joined by Nevada, leave Babylon. Columbus remarks that they have finally found their home in each other.In a mid-credits scene, Bill Murray witnesses the start of the zombie outbreak ten years earlier while promoting a third Garfield film, before making his escape while killing multiple zombies. In a post-credits scene, Murray is shown earlier practicing coughing up a hairball as a joke in his interview.",
	"links": [
		"https://www.amazon.com/Zombieland-Double-Tap-4K-UHD/dp/B07Z6DBTHZ"
	]
}