{
	"title": "A Star Is Born",
	"release_year": "2018",
	"runtime": "136",
	"tags": [
		"Drama",
		"Music",
		"Romance",
		"max",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Lady Gaga",
		"Bradley Cooper",
		"Sam Elliott",
		"Greg Grunberg",
		"Andrew Dice Clay",
		"Rafi Gavron",
		"Anthony Ramos",
		"Dave Chappelle",
		"Alec Baldwin",
		"Marlon Williams"
	],
	"staff": [
		"Bradley Cooper",
		"Eric Roth",
		"Bradley Cooper",
		"Will Fetters",
		"Moss Hart",
		"Bradley Cooper",
		"Bill Gerber",
		"Lynette Howell Taylor",
		"Jon Peters",
		"Matthew Libatique",
		"Jay Cassidy",
		"Lindsay Graham",
		"Mary Vernieu",
		"Karen Murphy"
	],
	"links": [
		"https://www.max.com/movies/star-is-born/7a3a7d11-9c80-4652-9664-b84688e1ea7a",
		"https://www.amazon.com/Star-Born-Bradley-Cooper/dp/B07PMFRQPH"
	],
	"votes": 425348,
	"cover": "https://m.media-amazon.com/images/M/MV5BNGUxZTc0NTAtNzQwMy00MmM2LTgzMGYtZWIyY2E1MGFjYmM5XkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "Jackson Maine (Bradley Cooper), a famous country music singer privately battling an alcohol and drug addiction, plays a concert in California. His main support is Bobby (Sam Elliott), his manager and older half-brother. Bobby has a son who is 17 years old.\nAfter the show, Jackson visits a drag bar (Bobby was driving Jackson and they were out of alcohol in the car, so Jackson decided to stop at the next bar they saw) where he witnesses a performance by Ally (Lady Gaga), a waitress and singer-songwriter. Ramon (Anthony Ramos) is Ally's friend and a bouncer at the drag bar where she performs.\nJackson is amazed by her performance and Ramon takes Jackson to meet Ally backstage. They spend the night speaking to each other, where Ally discloses to him the troubles she has faced in pursuing a professional music career. Ally says that people have told her that she will never make it in the music industry as her nose is too big.Ally shares with Jack some lyrics she has been working on, and he tells her she is a talented songwriter and should perform her material. Jackson says that having something to say and having the voice to say it with are both a very powerful thing.\nAlly hits a bar patron when he tries to forcefully approach Jackson and take a picture with him without his permission. Jackson takes her to a grocery store to put frozen peas on her hand to control the swelling.\nJackson tells Ally that he comes from Arizona. His father had a mid-life crisis and left his family to travel to Arizona, where he hooked up with the daughter of a pecan farm owner. The daughter was just about 18 years old and got pregnant with Jackson. She died in childbirth and his father died when he was 13 years old. So, he was raised by his older half-brother.\nAlly lives with her father Lorenzo, who she says is a limo driver. Jackson suffers from acute tinnitus which is getting worse with time.Jackson invites Ally to his next show. Despite her initial refusal she attends and, with Jackson's encouragement, sings on stage with him. Jackson invites Ally to go on tour with him. Lorenzo finds out about Jackson's invitation and forces Ally to go (she agrees to go with her restaurant manager again berates Ally for being late to work). Ally goes from the restaurant into a private plane and from there to a live show where Jackson is performing in front of thousands of fans. Ally joins Jackson on stage as he sings her song and let's fly. She nails her performance on stage. Ally and Jackson form a romantic relationship.\nIn Arizona, Ally and Jackson visit the ranch where Jackson grew up and where his father is buried, only to discover that Bobby sold the land.\nAngered at his betrayal, Jackson punches Bobby, who subsequently quits as his manager. Before doing so, Bobby reveals that he did inform Jackson about the sale, but the latter was too inebriated to notice. Bobby says that all their father ever did was to make Jackson his drinking buddy.Jackson and Ally start doing his tour together and Jackson gives her the opportunity to sing her original songs.\nWhile on tour Ally meets Rez (Rafi Gavron), a record producer who offers her a contract. Although visibly bothered, Jackson still supports her decision. Rez refocuses Ally away from country music and towards pop. Even then Jackson supports Ally with all his experience and tries to get the best out of Ally in her song recordings.\nJackson misses one of Ally's performances after he passes out drunk in public; he recovers at the home of his friend Noodles (Dave Chappelle) (a retired musician and Jack's best friend), and later makes up with Ally.\nMeanwhile Rez tries to increasingly control Ally by making her change her hair color and forcing her to do her songs on stage with background dancers.\nThere he proposes to Ally with an impromptu ring made from a loop of guitar string, and they are married that same day.Jackson warns Ally that she needs to keep telling the truth to her fans, and she needs to be herself, and not create an image of her that her fans cannot relate with.\nDuring Ally's performance on Saturday Night Live (which is an exact replica of Rez's vision for Ally with a disco routine, with backup dancers and fake hair color), Bobby reconciles with Jackson. Later, Jackson and Ally fight after he drunkenly voices his disapproval of Ally's new image and music, which is nominated for three Grammy Awards.\nAt the Grammys, a visibly intoxicated Jackson performs in a tribute to Roy Orbison, and Ally wins the Best New Artist award. When she goes up on stage to receive her award, Jackson follows her, where he wets himself and passes out.\nAlly's father Lorenzo (Andrew Dice Clay) berates Jackson and Ally helps him sober up. Jackson joins a rehabilitation program shortly thereafter.Jackson recovers in rehab for about two months, where he discloses to his counselor that he attempted suicide when he was 13 years old. He also mentions that he has tinnitus, which has been getting worse. He tearfully apologizes to Ally for his behavior and returns home. Ally wishes to bring Jackson to perform with her on the European leg of her tour; Rez refuses, prompting Ally to cancel the remainder of the tour so she can care for Jackson.Rez later confronts Jackson, informing him of Ally's decision to cancel her tour and accusing him of holding Ally back. That evening, Ally lies to Jackson, and tells him that her record label has canceled her tour so she can focus on her second album. Jackson promises that he will come to her concert that night, but after Ally leaves, he hangs himself in their garage.\nAlly becomes inconsolable after Jackson's death. She is visited by Bobby, who explains Jackson's death was his own fault and not hers. Ally takes a song that Jackson had written but never performed and sings it at a tribute concert, introducing herself as Ally Maine."
}