{
	"title": "Carnage",
	"release_year": "2011",
	"runtime": "80",
	"tags": [
		"Comedy",
		"Drama",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Jodie Foster",
		"Kate Winslet",
		"Christoph Waltz",
		"John C. Reilly",
		"Elvis Polanski",
		"Eliot Berger",
		"Joseph Rezwin",
		"Nathan Rippy",
		"Tanya Lopert",
		"Julie Adams"
	],
	"staff": [
		"Roman Polanski",
		"Yasmina Reza",
		"Michael Katims",
		"Roman Polanski",
		"Saïd Ben Saïd",
		"Alexandre Desplat",
		"Pawel Edelman",
		"Hervé de Luze",
		"Fiona Weir",
		"Dean Tavoularis"
	],
	"votes": 133922,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTc4MjAyMDUwNl5BMl5BanBnXkFtZTcwOTQwMDMwNw@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In Brooklyn Bridge Park, eleven-year-old Zachary Cowan (Elvis Polanski) strikes his eleven-year-old classmate Ethan Longstreet (Eliot Berger) across the face with a stick after an argument. Among the more serious of Ethan's injuries is a permanently missing tooth and the possibility of a second tooth also being lost.\nTheir respective parents learn of the altercation through Ethan's parents questioning him about his injuries. The Longstreet parents, Penelope (Jodie Foster) & Michael invite the Cowan parents Nancy (Kate Winslet) & Alan (Christoph Waltz), to their Brooklyn apartment to deal with the incident in a civilized manner.The parents are Penelope Longstreet, whose idea it was to invite the Cowans, she whose priorities in life include human rights and justice; Michael Longstreet, a hardware salesman who tries to be as accommodating as possible to retain civility in any situation.\nNancy Cowan is an investment broker and a nervous and emotionally stressed woman; and Alan Cowan, who is married more to his work as evidenced by the attachment he has to his cell phone.\nAlan is a PR for a Pharma company & his attitude towards news reports of possible side effects of drugs that his company produces is deplorable. All Alan cares for is the impact on revenues and the company's stock-price and image, rather than the lives of the patients affected by the drug.\nAlan keeps everyone waiting while he has his detailed calls in front of everyone.Their meeting is initially intended to be short, but due to various circumstances, the conversation continues to draw out. In fact, Alan and Nancy begin to leave the apartment on two occasions but are drawn back in to further discussion.The Cowans refuses to entertain the possibility that Zach will apologize to Ethan willfully. Alan also strongly objects to strong words being used by Longstreets to describe the situation (like \"armed\" with a stick, hit \"deliberately\"). Penelope wants to know if Zach realizes that he has disfigured his classmate for life. Alan doesn't agree and says that perhaps Zach has no idea of this. Alan also suggests that Zach is a maniac, which Nancy protests.\nAlan offers to pay for Ethan's teeth, but Michael says that the Insurance would cover it. His main concern is that the boys should patch it up. The parents agree to get the boys together to allow them to talk to each other. Penelope is reluctant saying that Zach has to take accountability for his actions and apologize.Although the meeting starts off civilized enough, it quickly degenerates after Nancy says that the boys were arguing because Ethan won't allow Zach to be part of his gang and called him a snitch. Penelope is angry at Zach.\nNancy agrees to sanctioning Zach, but Penelope wants to be involved in that discussion & Nancy & Alan flatly refuse. They will talk to Zach on their own terms. Penelope also thinks that Nacy and Alan have ignored their child & that's why he has no sense of community or sharing.Nancy calls the Longstreets \"superficially fair-minded\" and Penelope and Michael complain about Alan's arrogant and dull attitude. Everyone also gets irritated with Alan when he accepts endless business phone calls on his BlackBerry, interrupting the discussion, and showing he has more interest in his business problems than the matter at hand. Michael also receives many phone calls from his ailing mother to his frustration.Nancy blows up at Alan for attending to his work calls every 2 minutes & interrupting every conversation. Then she feels nauseated & throws up all over Penelope's rare art book & ends up ruining it.\nNancy says that Ethan calling Zach a snitch is a source of the problem & Penelope keeps saying that Zach is violent & hit Ethan without provocation. Michael's mother is taking the medicine that Alan is busy defending against lawsuits & news reports over the phone.Things get out of hand when Michael refuses to feel remorse for releasing the family hamster on the footpath which his son & daughter were attached to. Penelope is also angry at Michael for that. Nancy says that if Michael can't feel sorry for his actions, why should Zach. Michael blows up saying he is a short-tempered person & has had enough of the Touchy-Feely bullshit.Michael & Alan begin to bond against the ladies & it emerges that Penelope has a drinking problem. Penelope hates that Michael has embraced mediocrity & is not excited about anything. Michael thinks having kids is a drag on marriages as they suck the life out of everything. Alan happens to agree with Michael.Penelope wants world peace & Michael & Alan are sick of her high-handed attitude. Nancy dumps Alan's phone in the water in the middle of his office conversation.\nEveryone gets drunk & while wrapping Nancy again says that the kids share the blame & Penelope asks her to get out & throws her bag. Nancy asks Alan to stand up for him, but he doesn't. Nancy's true colors are revealed when she destroys the tulips and drunkenly and vulgarly states she is glad that her son beat up Penelope's and Michael's son. Everyone acknowledges that it's been the worst day of their respective lives.\nAlan's BlackBerry, lying on the coffee table, vibrates, and all four stare at it.The next day in the park, Ethan & Zach are friends again & talking to each other like buddies.",
	"links": [
		"https://www.amazon.com/Carnage-Kate-Winslet/dp/B007NYO74Q"
	]
}