{
	"title": "The Grey",
	"release_year": "2011",
	"runtime": "117",
	"tags": [
		"Action",
		"Adventure",
		"Drama",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Liam Neeson",
		"Dermot Mulroney",
		"Frank Grillo",
		"Dallas Roberts",
		"Joe Anderson",
		"Nonso Anozie",
		"James Badge Dale",
		"Ben Hernandez Bray",
		"Anne Openshaw",
		"Peter Girges"
	],
	"staff": [
		"Joe Carnahan",
		"Joe Carnahan",
		"Ian Mackenzie Jeffers",
		"Joe Carnahan",
		"Jules Daly",
		"Mickey Liddell",
		"Ridley Scott",
		"Marc Streitenfeld",
		"Masanobu Takayanagi",
		"Roger Barton",
		"Jason Hellmann",
		"John Papsidera",
		"John Willett"
	],
	"votes": 265451,
	"cover": "https://m.media-amazon.com/images/M/MV5BNDY4MTQwMzc1MV5BMl5BanBnXkFtZTcwNzcwNTM5Ng@@._V1_QL75_UX190_CR0,6,190,281_.jpg",
	"description": "John Ottway (Liam Neeson) works in Alaska, killing wolves that threaten an oil drilling team. It is a lonely and brutal life in harsh climatic conditions. Oil drilling attracts all kinds of misfits including ex-cons, drifters, fugitives and generally unfit for mankind.\nOn his last day on the job, Ottway writes his wife, Ana (Anne Openshaw), a letter explaining his plans to commit suicide. Ottway feels purposeless and says that he is not doing any real good in the world. However, he doesn't follow through after hearing the howl of a wolf from the mountains.The next day, the plane carrying the team, including Ottway, crashes in a blizzard. The flight was half full, with about 15-20 passengers on board. Ottway tries to protect himself by lodging his body between 2 rows of seats and taking an oxygen mask. But at one point the fuselage of the plane breaks apart and Ottway was hanging partially outside the plane.\nOttway sees a vision of his wife urging him not to feel afraid. Oattway awakens in the Alaskan wilderness, surrounded by miles of ice. He finds the plane wreck a few meters away and finds one of the team, Lewenden (James Badge Dale), mortally wounded. Ottway calms him, and Lewenden dies.\nOttway finds some warm clothes for himself to protect from the biting cold and strong winds. There is no cell phone reception in the area. Ottway knows that there is no hope of being rescued from this wilderness.\nTaking charge, Ottway sets the survivors the task of building a fire. While doing this, he discovers a corpse, and is attacked by the gray wolf feeding on it. After saving Ottway, the group surmises that they are in the wolves' territory. A wolf pack territory extends up to 300 miles and they will protect their den ferociously. Wolves are man-eaters and hence Ottway asks the survivors to bury the dead, so that the wolves are not attracted by the stench.\nBut soon enough, a wolf pack announces their presence to the survivors. They decide to take turns keeping watch for the predators.Later, Hernandez (Ben Bray) is killed by two wolves, and the group discovers his body in the morning. Ottway suggests they leave the crash site, but Diaz (Frank Grillo) questions his leadership. Ottway says that the crash site is exposed from all sides, and they need to move to a location where they can defend themselves better against the wolf attacks.\nWhile searching for the wallets of their deceased colleagues, intending to return them to their families, Diaz finds an emergency wristwatch containing a radio beacon. Ottway finds the suicide letter he had written to his wife. The group then leaves the site.\nWhile walking through the snow (the blizzard is still strong and as a result there is very low visibility even in open frozen grounds), Flannery (Joe Anderson) (who was already injured in the leg and falls behind from the rest of the group) falls and is killed by wolves.\nOne of the group members sees the pack of wolves approaching, and the survivors run for the trees, lighting a fire in an attempt to ward off their attackers.The group sets about producing makeshift weaponry, and Diaz threatens Ottway with a knife, but is disarmed. They then kill and eat an omega wolf sent by the pack leader alpha to test them. Diaz, as a symbol of defiance, cuts the head off the cooking corpse and throws the head back at the pack, a move noted by the group as unwise, as wolves are the only creatures known to take revenge.\nWhile sitting around the fire, Diaz tells the group of his atheist beliefs, and Talget (Dermot Mulroney) states he believes in God. Ottway states he is also an atheist but wishes he could believe. He also recites a poem written by his father. A blizzard approaches, and the survivors set to maintaining the fire.In the morning, Burke (Nonso Anozie), who had been suffering from Hypoxia, is found dead. The remaining survivors leave the camp, and travel to the edge of a steep canyon. Hendrick secures a line across, and Diaz and Ottway traverse the canyon. Talget, however, is afraid of heights, and loses his glasses. His injured hand begins to bleed again, and his foot becomes caught on the rope, which breaks. He falls to the ground and is dragged away by wolves. Diaz attempts to save Talget but fails and injures his knee.The three remaining survivors continue and arrive at a river. There, Diaz explains that he would rather die there than return home to a meaningless life. He refuses offers of help and asks Ottway whether death would bring him comfort. They part company, and Ottway and Hendrick continue on together. Left alone, Diaz hears the wolves approaching. Further along the river, Ottway and Hendrick are set upon by wolves once again. In an attempt to flee, Hendrick falls into the river and is trapped beneath the surface. Ottway attempts to save him but is unsuccessful, and Hendrick drowns.Ottway, cold and wet, continues on alone. Exhausted, and at his wits end he stops walking and begins going through the collected wallets of the others seeing photos of them and their loved ones and carefully lays them in a small pile. A noise in the trees draws his attention to the wolves' that begin to appear from the tree line, and he realizes he has stumbled right into the wolves' den.\nSurrounded by the pack, he looks at his wife's photo in his wallet and fades into a memory of her; it is revealed that she is in a hospital bed dying of a terminal illness. As the alpha wolf approaches him, he places on the emergency wristwatch and arms himself with a knife and shards of glass from mini whiskey bottles taped to his hand. After reciting his father's poem once more, he lunges at the alpha wolf. The screen cuts to black and the ending is left ambiguous.In the post-credits scene, Ottway and the alpha wolf lie dying together following their battle.",
	"links": [
		"https://www.amazon.com/Grey-Liam-Neeson/dp/B007WV05GY"
	]
}