{
	"title": "Margin Call",
	"release_year": "2011",
	"runtime": "107",
	"tags": [
		"Drama",
		"Thriller",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Zachary Quinto",
		"Stanley Tucci",
		"Kevin Spacey",
		"Paul Bettany",
		"Jeremy Irons",
		"Penn Badgley",
		"Simon Baker",
		"Mary McDonnell",
		"Demi Moore",
		"Aasif Mandvi"
	],
	"staff": [
		"J.C. Chandor",
		"J.C. Chandor",
		"Robert Ogden Barnum",
		"Michael Benaroya",
		"Neal Dodson",
		"Joe Jenckes",
		"Nathan Larson",
		"Frank G. DeMarco",
		"Pete Beaudreau",
		"Tiffany Little Canfield",
		"Bernard Telsey",
		"John Paino"
	],
	"votes": 147547,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjE5NzkyNDI2Nl5BMl5BanBnXkFtZTcwMTYzNDc2Ng@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Junior risk analyst Seth Bregman (Penn Badgley), his more senior colleague Peter Sullivan (Zachary Quinto), and trading desk head Will Emerson (Paul Bettany) watch as a contracted temporary human resources team, hired by their firm, conducts an unannounced mass layoff action, right on their trading floor, at the start of an otherwise normal business day.One of the fired employees is Peter and Seth's boss, Eric Dale (Stanley Tucci), who heads risk management on the floor. In his exit interview, Dale attempts to tell his now former employer that the firm should look into what he has been working on. Dale's attempts to speak about the implications of a model he is working on are ignored. Dale's severance package includes 6 months of half-pay, and he can retain all the vested stock options he has. He is given 24 hours to accept the offer, or it will be revoked.The contracted human resources staff have no interest other than his quickly leaving the building. Dale was with the firm for 19 years. And yet, his company phone, email and all other electronic devices are switched off immediately. A security person is assigned to Dale for him to clear out his personal effects from his cabin.Bregman comes to meet Dale in his cabin and says that it was simply bad luck. But Dale surmises that chief risk management officer Sarah Robertson had something to do with his firing. Dale tries to share his concerns with Bergman but tells Dale that the firm is not Dale's problem anymore.While Dale is being escorted out, he gives Peter a USB memory stick with a project he had been working on, telling him to \"be careful\" just as he boards the elevator. By the end of the day, 80% of the floor was fired at the firm.That night, Peter finishes Dale's project and discovers that built-in volatility in the firm's portfolio of mortgage-backed securities will soon exceed the historical volatility levels of the firm. Because of excessive leverage, if the firm's assets in mortgage-backed securities decrease by 25%, the firm will suffer a loss greater than its market capitalization. He also discovers, that given the normal length of time that the firm holds such securities, this loss must occur. So, Sullivan alerts Emerson, who calls floor head Sam Rogers (Kevin Spacey).\nSam is going through an emotional turmoil as his dog is drying of cancer.Attempts by the four to contact Dale end unsuccessfully due to his company phone having been shut off. Sullivan and Bregman go out to find Dale, while Rogers and Emerson inform the company's senior management of the situation.\nEmerson made $2.5 million the previous year. Rogers and Emerson call Peter and Bregman back to the office to explain Peter's work to senior management. Peter was a rocket scientist before he joined the firm.The employees remain at the firm all night for a series of meetings with more senior executives, including division head Jared Cohen (Simon Baker), chief risk management officer Sarah Robertson (Demi Moore), Ramesh Shah (Aasif Mandvi) and finally CEO John Tuld (Jeremy Irons). Jared's plan is for the firm to quickly sell all of the toxic assets before the market can react to the news of their worthlessness, thereby limiting the firm's exposure, a course favored by Tuld over Rogers's strong objection. Tuld stresses that his desire to avoid the firm's bankruptcy is worth that risk and the cost.Rogers warns Cohen and Tuld that dumping the firm's toxic assets will spread the risk throughout the financial sector and will destroy the firm's relationships with its counter-parties. Rogers also warns Cohen that their customers will quickly learn of the firm's plans, once they realize that the firm is only selling (unloading) the toxic mortgage-backed securities but will accept none whatever in exchange for their sale. That is they will not barter or swap, one mortgage-backed security for another.After the meeting with Tuld, Emerson is informed by Dale's wife that he has returned home. Emerson travels to Dale's residence with Bregman and attempts to persuade him to return to the firm, but he refuses. During the drive back, Bregman asks if he will lose his job; Emerson responds that he likely will, but, philosophizing on the nature of the financial markets, tells him not to lose faith, and that his work is necessary.Dale is eventually persuaded to come in with the promise of a generous fee and the threat of having his severance package challenged if he didn't. Meanwhile, it is revealed that Robertson, Cohen, and Tuld were aware of the risks in the weeks leading up to the crisis. Tuld plans to offer Robertson's resignation to the board and employees as a sacrificial lamb.Before the markets open, Rogers tells his traders they will receive seven figure bonuses if they achieve a 93% reduction in certain MBS asset classes in a \"fire sale\". He admits that the traders are effectively ending their careers by destroying their relationships with their clients. Meanwhile, Robertson and Dale sit in an office, being paid handsomely to do nothing for the day; Robertson vigorously defends herself that she warned of the risks although perhaps not loudly enough. Emerson manages to close the positions, but his counter-parties become increasingly agitated and suspicious as the day wears on.After trading hours end, Rogers watches the same human resources team begin another round of layoffs on his floor. He confronts Tuld and asks to resign, but Tuld dismisses his protests claiming that the current crisis is really no different from various crashes and bear markets of the past, and sharp gains and losses are simply part of the economic cycle. He persuades Rogers to stay at the firm for another two years, promising that there will be a lot of money to be made from the coming crisis. Rogers sees Sullivan meeting with Cohen about his imminent promotion. Emerson survives, and it is implied that Bregman will be let go.Rogers is shown burying his dog that has died of cancer in his ex-wife's front lawn.",
	"links": [
		"https://www.amazon.com/Margin-Call-Kevin-Spacey/dp/B005UT29Z0"
	]
}