{
	"title": "Pacific Rim",
	"release_year": "2013",
	"runtime": "131",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.9,
	"actors": [
		"Idris Elba",
		"Charlie Hunnam",
		"Rinko Kikuchi",
		"Charlie Day",
		"Diego Klattenhoff",
		"Burn Gorman",
		"Max Martini",
		"Robert Kazinsky",
		"Clifton Collins Jr.",
		"Ron Perlman"
	],
	"staff": [
		"Guillermo del Toro",
		"Travis Beacham",
		"Guillermo del Toro",
		"Guillermo del Toro",
		"Jon Jashni",
		"Mary Parent",
		"Thomas Tull",
		"Ramin Djawadi",
		"Guillermo Navarro",
		"Peter Amundson",
		"John Gilroy",
		"Margery Simkin",
		"Andrew Neskoromny",
		"Carol Spier"
	],
	"votes": 536311,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTY3MTI5NjQ4Nl5BMl5BanBnXkFtZTcwOTU1OTU0OQ@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "In the near future, aliens identified as Kaijus have risen from a portal in a crevasse beneath the Pacific Ocean and started to attack coastal cities resulting in a war that takes millions of lives and quickly consumes humanity's resources. To combat the monsters, a special type of weapon is designed: massive, humanoid fighting machines, known as Jaegers, which are controlled simultaneously by two pilots whose minds are bound in a neural link (Through a process known as Drifting) which lets them share the mental strain which would otherwise overwhelm a single pilot.The Jaegers are initially successful in fending off Kaiju attacks; however, over time, Kaijus cross through the portal at a faster rate, with each new Kaiju adapted for fighting the Jaegers. As they become less effective, Earth's united governments lose faith in the Jaegers' ability.\nFive years later, the Jaeger program is terminated, with resources diverted to building a coastal fortification to protect coastal cities. Kaiju attack frequency is increasing, and Jaegers are being destroyed faster than they can be built. The walls quickly prove ineffective.The four remaining Jaegers are redeployed to Hong Kong to defend the unfortified coastline until the wall can be completed. Stacker Pentecost (Idris Elba), commander of the Jaeger forces, devises a plan to end the war by using a nuclear warhead to destroy the portal (the breach at the bottom of the ocean from which the Kaijus cross over from their world to Earth), despite unsuccessful previous attempts.In 2020, brothers Yancy and Raleigh Becket pilot the American Jaeger, Gipsy Danger, to defend Anchorage from a Category-3 Kaiju code-named Knifehead, who severely damages Gipsy, killing Yancy. Raleigh kills Knifehead and pilots Gipsy solo to shore before collapsing. Traumatized by the loss of his brother and the stress of piloting alone, Raleigh quits the Jaeger program.Pentecost approaches retired pilot Raleigh Becket (Charlie Hunnam) and convinces him to return and pilot Gipsy Danger, the Jaeger he and his brother Yancy (Diego Klattenhoff) once piloted. Raleigh, now working in wall construction, is recruited by Pentecost for the mission of blowing up the breach.Four Jaegers remain operational - the refurbished Gipsy Danger, the Russian Cherno Alpha (Sasha (Robert Maillet) and Alexis Kaidanovsky (Heather Doerksen) from Russia piloting), the Chinese Crimson Typhoon (The Wei Tang Triplets from China (Charles Luu, Lance Luu and Mark Luu) piloting), and the Australian Striker Eureka piloted by father-and-son team, Chuck Hansen (Robert Kazinsky) and his father Hercules Hansen (Max Martini).\nTendo Choi (Clifton Collins Jr.) is a Jaeger technician of Chinese and South American descent.Arriving at Hong Kong, Raleigh tests with potential co-pilots to find one with a strong connection, as the stronger the connection, the better their performance in battle. Raleigh is introduced to Mako Mori, the director of the Jaeger restoration program.\nSensing a strong connection, Raleigh demands to be partnered with Mako Mori (Rinko Kikuchi). As a result, Pentecost grounds Mako. Raleigh calls out Pentecost on this. Pentecost reveals he adopted Mako after her parents were lost in the Kaiju attack.The duo's initial test run nearly ends in disaster when Mako gets caught up in a childhood memory of a Kaiju attack; she inadvertently activates and nearly discharges Gipsy Danger's primary weapon, The Plasma Cannon, while in the hangar. The duo is withdrawn from the field as the remaining Jaegers are tasked with fending off a double Kaiju attack in Hong Kong. The defense goes badly, with the Kaijus destroying two Jaegers, Crimson Typhoon and Cherno Alpha, and disabling a third Jaeger, Striker Eureka. Pentecost sends Raleigh and Mako to mount a last stand, and the duo drive off the assault.Pentecost consults Kaiju experts Newton Geiszler and Hermann Gottlieb. Hermann claims the Breach will stabilize and the Kaiju will increase in number, but this will allow the assault to succeed.\nMeanwhile, Dr. Newton Geiszler (Charlie Day), a scientist studying the Kaijus, assembles a machine allowing him to establish a mental link with a Kaiju brain fragment. The experience nearly kills him, but he discovers the Kaijus are actually artificial weapons sent to Earth as an invading force to allow another species to colonize the planet.With Pentecost's approval, he seeks out Hannibal Chau (Ron Perlman), a major figure in the trafficking of Kaiju parts, in an attempt to procure an intact Kaiju brain to repeat the experiment. Chau criticizes Geiszler's merging with the Kaiju brain, as he has attracted their attention, and the Kaiju attacking Hong Kong are seeking him.\nNewton realizes the Kaiju hive mind gained access to his brain, since drifting is a two-way link, and the two newest Kaiju to emerge in Hong Kong, Leatherback and Otachi, are sent simultaneously to find him in Hong Kong.All Jaegers except Gipsy Danger are dispatched to intervene. Otachi destroys Crimson Typhoon, while Leatherback destroys Cherno Alpha and disables Striker Eureka with an EMP blast, injuring Herc. As the only non-digital Jaeger, the nuclear-powered Gipsy Danger is sent by Pentecost to help. Gipsy kills both Leatherback and Otachi.\nChau and his team move in to harvest parts. Geiszler realizes one of the Kaiju is pregnant; Chau and his crew are attacked by the newborn, which chokes on its own umbilical cord after eating Chau. Geiszler and his colleague Hermann Gottlieb (Burn Gorman) merge with the baby Kaiju's intact brain, where they discover the secret controlling the flow of Kaijus through the portal.The Jaeger forces reassemble to complete their plan to destroy the portal. Pentecost reveals to Raleigh he is ill from radiation poisoning due to piloting a first-generation Jaeger alone to save a young Mako, and has been unable to pilot a Jaeger since. Pentecost takes command of Striker Eureka as one of its usual pilots Herc was injured in the defense of Hong Kong.Pentecost ventures into the ocean depths, with Raleigh and Mako supporting him. Geiszler and Gottlieb inform them the portal has a fail-safe system to control the passage of Kaijus and will only allow them to enter if they can mimic a Kaiju's genetic code.\nTwo new Kaiju, Scunner and Raiju, are detected guarding the Breach, Gipsy and the repaired Striker, piloted by Pentecost and Chuck, approach the Breach, where a new Category-5 Kaiju, Slattern, appears.Before they can process this information, they are attacked by the three Kaijus, including the largest on record, the category 5. When the Jaegers are attacked by the Kaiju, Gipsy kills Raiju, but is crippled. Pentecost and Chuck sacrifice themselves and Striker, killing Scunner. then Gipsy slaughters Slattern, riding its corpse into the Breach.Then Gipsy slaughters Slattern, riding its corpse into the Breach, intending to overload Gipsy Danger's nuclear reactors to use it as an improvised bomb. With the Jaeger critically damaged by the fight, Raleigh ejects Mako and manually overrides the safety protocols before ejecting himself. Gipsy Danger detonates on the other side of the portal, destroying it and the alien commanders, as the two pilots emerge safely on the sea's surface.Chau-revealed to have survived-cuts his way out of the newborn Kaiju's stomach.",
	"links": [
		"https://www.amazon.com/Pacific-Rim-Charlie-Hunnam/dp/B00FWLDHSY"
	]
}