{
	"title": "Safe",
	"release_year": "2012",
	"runtime": "94",
	"tags": [
		"Action",
		"Crime",
		"Thriller",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Jason Statham",
		"Catherine Chan",
		"Chris Sarandon",
		"Robert John Burke",
		"James Hong",
		"Anson Mount",
		"Sándor Técsy",
		"Joseph Sikora",
		"Igor Zhizhikin",
		"Reggie Lee"
	],
	"staff": [
		"Boaz Yakin",
		"Boaz Yakin",
		"Lawrence Bender",
		"Dana Brunetti",
		"Mark Mothersbaugh",
		"Stefan Czapsky",
		"Frédéric Thoraval",
		"Douglas Aibel",
		"Joseph C. Nemec III"
	],
	"links": [
		"https://www.amazon.com/Safe-Jason-Statham/dp/B0CG8V9JGT"
	],
	"votes": 119225,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTcxNDI0NzUxMF5BMl5BanBnXkFtZTcwOTIzMjkyNw@@._V1_QL75_UX190_CR0,6,190,281_.jpg",
	"description": "Ex-cop and cage fighter Luke Wright (Jason Statham) unintentionally wins a fixed fight, angering Emile Docheski (Sandor Tecsy), head of the Russian mafia. Luke had lost every fight on the circuit and had gone down to every 2-bit fighter that was put up against him in the ring, and yet on that day, Luke took one shot and his opponent went down. Docheski was betting on Luke big time to take the dive.As punishment, Docheski's son Vassily (Joseph Sikora) and his men kill Wright's pregnant wife, then promises to kill anyone to whom he speaks regularly. Luke had no other family, including parents or siblings. According to his official records, he was a nobody, a garbage man and a sanitation worker. Luke leaves his life behind, becoming a homeless tramp.Meanwhile, in China, Mei (Catherine Chan) is a young math genius in Nanjing. Due to her prodigious math capability, she is transferred to a more advanced school in Beijing.\nMei is kidnapped by men working for Triad boss Han Jiao (James Hong). Han knew about Mei from his niece Bai Ye, who was in Mei's class at school. Han threatens Mei's mother if she refuses to cooperate.Han wishes to use Mei as a mental calculator to eliminate his criminal enterprise's traceable digital footprint. He sends her to New York City, in the care of brutal gangster Quan Chang (Reggie Lee). It's been a year since then and now Mei knows every single detail of Han's business in the USA. Mei knows all of Han's business locations and their weekly financial reports by heart.\nMei is able to quickly analyze that the casino is losing money as the floor boss is skimming off the top. Quan confronts the man and brutally shoots him down in front of Mei.\nMei is told that her mother died 2 days ago at a hospital in China.One year later, Han arrives from China, asking Mei to memorize a long number. On the way to retrieve a second number, their vehicle is ambushed by the Russian mafia.Meanwhile Luke is apprehended by corrupt cop Wolf and his colleagues. It is indicated that Luke ratted them out in the past and Wolf takes it out on Luke and roughs him up. He goads Luke into committing suicide, but Luke simply walks away.Mei is taken to Emile, who demands the number, but Mei refuses. Before they can further interrogate her, they are interrupted by police, sent by the corrupt Captain Wolf (Robert John Burke), who works for Han. Wolf negotiates with both Emile and Han and will hand over Mei to the highest bidder.Mei escapes during the confusion, chased by the Russians to a nearby subway station, where Luke contemplates suicide. Recognizing Chemyakin (Igor Jijikine), one of the men who killed his wife, and seeing Mei's distress, Luke boards the train at the last moment. Luke confronts and kills Chemyakin and the other Russians. Luke exhibits that he is an expert in closed hand budget, and an expert on firearms.Mei flees at the next stop, only to be stopped by two corrupt detectives working for Wolf. Luke arrives and incapacitates the detectives, convincing Mei of his good intentions, before he also dispatches some Russians.\nEmile instructs his men to kill Mei in case they cannot catch her. Together, Mei and Luke evade their Russian pursuers. Luke kills the Russians following them and asks Mei to follow her. Wolf is told that Luke is the one who took Mei.Hiding in a hotel, Mei explains the number to Luke, who guesses that it is the code to a combination safe. However, Quan tracks Mei down, through her cell phone, escaping with her during a diversion, as Luke fights through Quan's men.Across town, Captain Wolf meets with Mayor Danny Tremello (Chris Sarandon), who has learned that Luke is involved. He cautions Wolf, explaining that Luke wasn't a regular cop, but a government assassin.\nLuke was loaned by the government as a favor to Tremello by friends in the CIA shortly after 9/11.\nLuke responsible for numerous black operations on the orders of his commanding officers in an effort to wipe out criminal organizations in the New York area, along with his former partner Alex Rosen (Anson Mount). Luke quit after exposing Wolf's detective squad as dirty cops.\nLuke's life of exile is not one of necessity, but rather of atonement for the things he did for the government.Using Chemyakin's phone, Luke sets up Vassily, whom he kidnaps. Emile reluctantly accepts a deal for his son's life, explaining that Mei's number unlocks a heavily guarded safe in Chinatown with $30 million, though he does not know the contents of a second safe.Needing a team to get to the safe, Luke recruits Wolf and his detectives. Together, they fight through numerous Triad gangsters to reach the safe. As Luke is about to open it, Wolf attempts to betray him, but Luke kills the remaining detectives and takes Wolf hostage. Using the money, Luke bribes Alex Rosen, who now works for the mayor, into rescuing Mei. Alex reveals the second safe belongs to the mayor, containing a disc with data on his corrupt deals. Alex meets with Quan, showcasing his combat powers by killing Quan and his men as Mei watches. Meanwhile, Luke assaults the mayor and retrieves a copy of the mayor's disc.Alex and Luke arrange a meeting, but Luke refuses to surrender the money, instead suggesting that they settle it with a fight. Before they can begin, Mei shoots Alex, wounding him, and Luke finishes him off. In the aftermath, Luke gives Wolf $50,000 and instructs him to return Vassily to his father, unharmed. He sends the remainder of the money to Han, to buy off Mei's freedom, threatening to ruin Han's operations should Han try to recover Mei. Han leaves New York City in disgust, as Luke hides multiple copies of the disc throughout the city. Luke and Mei leave the city, heading west. When Mei asks if they are finally safe, Luke responds that they will take it one day at a time."
}