{
	"title": "The Fall Guy",
	"release_year": "2024",
	"runtime": "126",
	"tags": [
		"Action",
		"Comedy",
		"Drama",
		"amazon"
	],
	"rating": 6.9,
	"actors": [
		"Ryan Gosling",
		"Emily Blunt",
		"Aaron Taylor-Johnson",
		"Hannah Waddingham",
		"Teresa Palmer",
		"Stephanie Hsu",
		"Winston Duke",
		"Ben Knight",
		"Matuse",
		"Adam Dunn"
	],
	"staff": [
		"David Leitch",
		"Glen A. Larson",
		"Drew Pearce",
		"Guymon Casady",
		"Ryan Gosling",
		"David Leitch",
		"Kelly McCormick",
		"Dominic Lewis",
		"Jonathan Sela",
		"Elísabet Ronaldsdóttir",
		"Lindsay Graham",
		"Mary Vernieu",
		"David Scheunemann"
	],
	"votes": 149852,
	"cover": "https://m.media-amazon.com/images/M/MV5BM2U0MTJiYTItMjNiZS00MzU4LTkxYTAtYTU0ZGY1ODJhMjRhXkEyXkFqcGc@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "The film opens with stuntman Colt Seavers (Ryan Gosling) talking about how important the people in his line of business have been in the history of film and television. Colt takes a lot of hits as a stuntman, but he finds it worth it because he is in love with camera operator Jody Moreno (Emily Blunt), who aspires to become a director. In his latest project, Colt is doing stunts for major Hollywood actor Tom Ryder (Aaron Taylor-Johnson). Colt gears himself up to a harness to film a scene where he takes a big fall, but something goes wrong and Colt hits the ground and severely injures his back. He walks always from the business, and from Jody.Eighteen months later, Colt works as a valet driver and has not spoken to Jody since the incident. He is spotted by a former coworker who refers to him as \"the fall guy\" after what happened, so Colt brings his car back aggressively and by doing donuts in front of him. Later, Colt is contacted by Gail Meyer (Hannah Waddingham), a producer that frequently works with Ryder. She offers Colt a chance to be Ryder's stunt double on a new sci-fi epic, \"Metalstorm\", but Colt refuses until Gail informs him that Jody is directing the film.Colt arrives on set and reunites with his friend, stunt coordinator Dan Tucker (Winston Duke), who informs Colt that his first major stunt back is a cannon roll, which dismays Colt because he fears he will screw that up in front of Jody. The crew goes ahead with the cannon roll stunt, with Colt's car tumbling across a beach before he sticks his thumb out to let the crew know he is fine (a stuntman habit, as he claims). When Jody sees Colt is the stuntman, she is none too pleased to see him after such a long time away, which contradicts Gail's previous claim to Colt that Jody specifically asked for him. For his next stunt, he is set on fire and blown against a wall. Colt and Jody then try to dissect the scene while unsightly discussing their relationship in front of the crew, with most people appearing to be on Jody's side.Gail visits Colt in his trailer to let him know that Ryder has gone missing after he has gotten into bed with some shady people, and she is tasking Colt with finding him to save Jody's film production within the next 48 hours. Colt then goes to his car and reminisces about his time with Jody while listening to Taylor Swift and crying before Jody shows up, and he has to play it cool. She gets in the car with him and talks about how important the film is for her, and he promises not to derail the production for her.Colt goes to Ryder's apartment to try and find him but gets attacked by Iggy Starr (Teresa Palmer), Ryder's girlfriend and the main actress of \"Metalstorm\". After a bit of crashing around the place, Colt finds that Iggy is using a prop sword and he then tries to explain that he is looking for Ryder for the film's sake. Iggy tells him to go to a nightclub that Ryder goes to and to look for his drug dealer.Colt gets into the club by dressing flashy and meets the drug dealer, Doone (Matuse). When Colt asks for Ryder, Doone instead gives Colt a drugged drink and tries to have his guys deal with him. Colt starts tripping but manages to beat up three goons before chasing Doone outside as he tries to catch a cab. Colt jumps in front of the cab and stops Doone from getting away. He tells Colt that he was paid to drug him and directs him to a hotel to find someone named Kevin and to ask for a \"fruit platter\". Colt also hallucinates seeing a unicorn.At the hotel, Colt runs into Jody, who vents to him that the studio is meddling with her film's love story. Colt then meets the concierge, Kevin (Ben Gerrard), who gives him a \"fruit platter\", which is just the key to Ryder's hotel room. After a few unsuccessful tries with the door key, Colt breaks into the room by knocking the door down. Jody calls him and talks to him about some ideas for the film while playfully bantering. Afterwards, Colt finds the corpse of another stuntman, Henry Herrera. Colt calls Gail, who advises him not to talk to the police, but he does so anyway because one officer approaches him because he is illegally parked. When Colt mentions the body in the tub of ice, they return to Ryder's room to find the tub completely empty...and Colt still gets a ticket.On the next day of shooting, Dan complains that Jody was inspired by whatever she discussed with Colt since she has bigger and more complicated ideas for the shoot. Colt stands in for Ryder so that they can use deep fake technology and add Ryder's face to the final product. Jody later invites Colt out for karaoke, which he accepts.On his way to karaoke, Colt runs into Alma Martin (Stephanie Hsu), Tom's assistant, along with a trained dog named Jean-Claude that he has worked with. When he asks Alma about Ryder, she says that she last saw him and Henry at a crazy party before Gail called her away from it. Alma got her hands on Ryder's phone since his head of security, Dressler (Ben Knight), was hounding her over it. She knows there is something criminal on there and is willing to turn it in, but she tells Colt she wants producer credit on \"Metalstorm\". He says he will see what he can do right before they both get teased by Dressler, and he abducts Alma in his truck. Colt gets Jean-Claude and steals a truck to chase after them, all while Jody is at the karaoke bar waiting for him and disappointed that he is not there. Jody goes on to perform \"Against All Odds (Take a Look at Me Now)\" while Colt fights the goons after he and the dog make it onto their van. Jean-Claude bites the goons in the balls before going up front to help Alma get rid of the driver goon. They manage to stop the car, and Colt crashes through the windshield, but he is okay. He then runs with the dog to the karaoke bar, only to find Dan there, and he says that Jody is long gone.Colt and Dan give Ryder's phone to fellow crew member Venti (Zara Michales) to hack into, but she needs his password. The guys go to Ryder's apartment and go through his wide array of post-it note reminders until they manage to find the password written in plain sight. After Venti unlocks the phone, Colt and Dan find a video of Ryder, Iggy, and some of his buddies with Henry, who makes a crack about Ryder not doing his own stunts. Ryder is seen trying to do a stunt, only to accidentally knock Henry over and kill him. Moments later, Venti calls Dan to inform the guys that the news is reporting on Henry's death and naming Colt as the prime suspect. Soon, Dressler and his goons show up and open fire on Colt and Dan, who quickly take action. Dressler ends up shooting and destroying Ryder's phone out of Colt's hands. They fight off some goons as Colt makes it outside and jumps onto Ryder's boat, crashing through the roof. He then finds himself face-to-face with Ryder before getting knocked out cold.Colt wakes up to find himself tied up, with Ryder demanding his phone back. He admits to killing Henry and setting up Colt to be \"the fall guy\" for the crime, as well as informing him that the entire cover-up was Gail's idea after he went crying to her. Ryder also admits that he set up Colt's accident because he felt Colt was stealing his thunder. This happens just as Gail goes to meet with Jody to tell him that Colt is the suspect in Henry's murder. After Colt admits that Dressler destroyed the phone, Ryder has his goons douse Colt with kerosene to light him on fire, but he gets some in his mouth and spits it at Dressler when he tries to light him up. Colt hops on a boat and tries to get away while steering backwards. He tries to contact Jody, but Gail intentionally gets her phone wet before Jody can answer his call. Colt eventually manages to reach Jody and tries to explain himself, but the villains chase after him and cause his boat to crash and explode, though he manages to jump to safety. Colt is presumed dead, and it is billed a suicide, while the villains use the deep fake tech to use Colt's face on Ryder's body in the video showing Ryder killing Henry.Colt reaches Dan and gets help sneaking back onto set in disguise as an alien from the movie. Jody beats him up due to the confusion until he reveals himself. Before Colt can explain himself, Jody embraces him with a kiss, but the moment is ruined with Gail outside. Jody hides Colt and hears Gail talk about Colt's supposed death, as well as trying to do Jody's big car jump stunt for the film in VFX and focusing on Ryder's epic final monologue. After Gail leaves, Colt and Jody organize a plan to get Ryder to confess to the murder by getting him to make him do the car jump himself since he will be wearing a mic, and he usually forgets he is being recorded, so he is always seen or heard saying whatever he wants unfiltered.The crew gets ready for the big scene and shoots Ryder's monologue. Jody gets Ryder into the car by saying she needs a close-up of him. Colt reveals himself and begins to drive the car away, prompting Dressler and his goons to go after him. Jody and Dan help keep the goons off Colt long enough until he gets Ryder to admit to killing Henry and saying Gail came up with the frame job before Colt pulls off the epic jump across a canyon, which knocks Ryder unconscious. Gail then gets a chopper to come get her and Ryder after she steals his confession tape. With help from Jody, Colt is thrown toward the helicopter and fights both Gail and Ryder until he gets the tape back and jumps down onto a crash mat set up by the crew at the right time. Colt and Jody celebrate their victory with a kiss.Working as the stunt double for action star Tom Ryder, Hollywood stunt performer Colt Seavers breaks his back during a stunt gone wrong and abandons his career and his girlfriend, camerawoman Jody Moreno.Eighteen months later, Colt, now a valet for a small Mexican restaurant, is contacted by Gail Meyer, Tom's film producer. She tells him that Jody is directing her first film, a space opera film titled Metalstorm starring Tom, and wants Colt to join the production in Sydney. After arriving on set, Colt learns that Jody never asked for him and is still angry about their breakup, with the film being a less-than-subtle attempt at airing her grievances at Colt.Gail reveals that Tom has disappeared after getting into trouble with \"very bad people\", and she wants Colt to find him before his absence causes the already over budget film's cancellation. Not wanting Jody's directorial debut ruined, Colt starts to track down Tom. He first goes to Tom's apartment where he meets Tom's girlfriend and co-star Iggy. She gives Colt a lead, so he visits a nightclub, where he meets drug dealer Doone, who tricks Colt into drinking a cocktail laced with hallucinogenic drugs. After getting into a fight with Doone's henchmen, Colt visits Tom's hotel room where he finds a dead body in a bathtub full of ice. When Colt returns with the police, the body has disappeared.As the production of Metalstorm continues, Colt and Jody begin to rekindle their relationship until Gail abruptly informs him that he must return to the United States. Instead, he continues looking for Tom by tracking down his personal assistant Alma Milan. She hands him Tom's phone, which Tom and Gail had been searching for, before they are both attacked by Tom's head of security, Dressler, and his team, who are looking for the phone. Colt and Alma defeat them after an extended chase through Sydney involving a rubbish truck. He and his long-time friend Dan Tucker, the stunt coordinator on Metalstorm, unlock the phone and discover a video of an intoxicated Tom accidentally killing his most recent stunt double Henry Herrera (the man in the bathtub) while sparring at a party. The henchmen attack Colt and Dan, destroying the phone with shotgun pellets.Dan escapes, but Colt is captured and brought face-to-face with Tom, who has been hiding out on a yacht on Gail's instructions. He reveals that Gail is framing Colt for the crime using deep fake technology to replace Tom's face with Colt's on the incriminating video and that he orchestrated Colt's accident because he felt that Colt was stealing the spotlight from him. Henry's body is discovered and the doctored video is released on news media, while Gail tries to convince Jody that Colt is guilty. Colt escapes and is presumed dead after a boat chase, though he swims to safety.The next day, Tom arrives at the Metalstorm set and production continues. Colt secretly returns to the set and convinces Jody of his innocence. Together, they trick Tom into participating in a stunt sequence and confessing while he is wired with a lav mike. The rest of the crew, led by Dan, hold off his goons. Gail steals the recording at gunpoint and tries to escape in a helicopter with Tom, but Jody helps Colt leap onto the helicopter in mid-air. He retrieves the recording and falls onto a crash mat prepared by Dan, while the helicopter crashes with Gail and Tom in it.Metalstorm's trailer premieres at San Diego Comic-Con, with Jason Momoa being made the new lead and Alma the film's new producer; the film eventually becomes a box office hit. Colt gets exonerated, and he and Jody get back together.In a post-credits scene titled \"Previously On: The Fall Guy\", Gail is arrested, while Tom, trying to call his agent, accidentally triggers a series of radio-controlled pyrotechnics and blows himself up. Alma calls Momoa's agent.",
	"links": [
		"https://www.amazon.com/Fall-Guy-David-Leitch/dp/B0CVWCZNCL"
	]
}