{
	"title": "Murder Mystery",
	"release_year": "2019",
	"runtime": "97",
	"tags": [
		"Action",
		"Comedy",
		"Crime",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Adam Sandler",
		"Jennifer Aniston",
		"Luke Evans",
		"Terence Stamp",
		"Gemma Arterton",
		"David Walliams",
		"Dany Boon",
		"John Kani",
		"Adeel Akhtar",
		"Ólafur Darri Ólafsson"
	],
	"staff": [
		"Kyle Newacheck",
		"James Vanderbilt",
		"Allen Covert",
		"A.J. Dix",
		"Adam Sandler",
		"James D. Stern",
		"Rupert Gregson-Williams",
		"Amir Mokri",
		"Tom Costain",
		"Kathy Driscoll",
		"Sandie Galan Perez",
		"Barbara Giordani",
		"Andrea Kenyon",
		"Perry Andelin Blake"
	],
	"cover": "https://m.media-amazon.com/images/M/MV5BMzg4NDFjNmYtZjQxMy00MDY4LWEyZjUtYzRjNjNkNjJiZTZhXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"links": [
		"https://www.amazon.com/Tonto-pero-tanto-Tamra-Davis/dp/B0018OIJXM"
	],
	"votes": 172896,
	"description": "Nick Spitz (Adam Sandler) is a New York police officer, and his wife Audrey (Jennifer Aniston) is a hairdresser. Audrey wants to visit Europe, as Nick had promised at their wedding, but thinks they never will. After their 15th-anniversary dinner, Audrey confronts Nick, who lies that he has in fact booked the trip, and they set off to Europe. On the plane, Audrey meets billionaire Charles Cavendish (Luke Evans), who invites the couple to join him on his family yacht for a party celebrating his elderly uncle's upcoming wedding to Charles' former fiance. After seeing how crowded their previously planned bus tour would be, Nick agrees.Aboard the yacht, Nick and Audrey meet Cavendish's ex-fiance Suzi (Shiori Kutsuna) (who is now about to marry his uncle Malcolm Quince), his cousin Tobey (David Walliams) (who is Malcolm's son and is gay, Malcolm hates him), actress Grace Ballard (Gemma Arterton), Colonel Ulenga (John Kani) (who saved Malcolm's life in Namibia a long time ago), his bodyguard Sergei (Ólafur Darri Olafsson), the Maharaja Vikram (Adeel Akhtar) of Mumbai, race car driver Juan Carlos Rivera (Luis Gerardo Méndez) (Malcolm's godson and driver for his race-car team), and their host Malcolm Quince (Terence Stamp), Cavendish's uncle. Quince announces that his new wife Suzi will be the only one to receive his inheritance, believing the others only feign interest in him because of his money. Before he can sign his new will, the lights go out and come back on to reveal Quince dead, stabbed by his own dagger.Nick, who has lied to Audrey about being an NYPD detective (as he has failed the exam thrice in a row), orders the room locked, and the guests return to their rooms. Audrey theorizes that there must be 2 people behind the killing, one to man the lights and the second with the dagger. Later that night, the guests find Tobey, Quince's only son, dead from an apparent suicide (with a typewritten suicide note taking the blame for his father's murder). Upon arriving in Monte Carlo, the guests are questioned by Inspector Laurent Delacroix (Dany Boon), who believes Nick and Audrey guilty of the murders (he knows that Nick is not a detective and is lying to Audrey).At the Monaco Grand Prix, Nick and Audrey question the guests. That night, Sergei summons them to his room, where he reveals Quince had married the Colonel's fiance while the Colonel was in a coma (just after saving Malcolm's life from the bomb attack in Namibia), which ended with her death and a boy child who was allegedly stillborn. Sergei also reveals that a few years later the Colonel asked him how to kill Malcolm as he had not forgiven him for marrying the love of his life).The couple hide when someone knocks on the door and come out to find Sergei has been murdered. Bravely, they climb out the window and edge along the ledge, high above the ground. In the process, they see the Colonel flossing his teeth and Maharaja and Grace kissing, ruling out the chances of any of them being the murderer and killing Sergei. While fleeing, they see on the news that Delacroix has issued a warrant for their arrest. Audrey is furious to learn Nick is not actually a detective and lied about booking the trip in advance, and she leaves with Cavendish.Nick follows Suzi to a library where he finds Audrey, who reveals Cavendish is in the building as well. They realize Cavendish and Suzi are still in love and, presumably, the murderers. The couple are forced to flee from a hidden gunman and meet Rivera, and are confronted by Suzi, who is killed by the masked killer. Nick and Audrey go to Quince's mansion to confront Cavendish but find him dead by poisoning.The couple summon Delacroix and the remaining guests The Colonel, Grace, Vikram, and Rivera, who all have alibis. Nick and Audrey deduce that Grace is the murderer; she was helped by Tobey, then killed him. Grace reveals that she is Quince's child that \"died\" and that his money truly belongs to her, though she denies being the killer. However, Grace proves her guilt, and she is arrested.While celebrating, Nick and Audrey learn that Grace had another alibi (for the time when Sergei was murdered) and there must be another killer. They realize Rivera is the second murderer, who blamed Quince for an accident his father had where he had lost both of his legs. Rivera holds Delacroix hostage and leads Nick and Audrey in a car chase, but they force his car to crash and rescue Delacroix. Rivera holds them all at gunpoint, but is killed by the chaotic tour bus, which Nick and Audrey would have initially boarded earlier.Delacroix thanks the couple and offers to help get Nick promoted to detective back home. The movie ends with Nick and Audrey continuing their vacation aboard the fabled Orient Express courtesy of Interpol."
}