{
	"title": "Edge of Tomorrow",
	"release_year": "2014",
	"runtime": "113",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.9,
	"actors": [
		"Tom Cruise",
		"Emily Blunt",
		"Bill Paxton",
		"Brendan Gleeson",
		"Jonas Armstrong",
		"Tony Way",
		"Kick Gurry",
		"Franz Drameh",
		"Dragomir Mrsic",
		"Charlotte Riley"
	],
	"staff": [
		"Doug Liman",
		"Christopher McQuarrie",
		"Jez Butterworth",
		"John-Henry Butterworth",
		"Hiroshi Sakurazaka",
		"Jason Hoffs",
		"Gregory Jacobs",
		"Tom Lassally",
		"Jeffrey Silver",
		"Christophe Beck",
		"Dion Beebe",
		"James Herbert",
		"Laura Jennings",
		"Lucinda Syson",
		"Oliver Scholl"
	],
	"votes": 749475,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTc5OTk4MTM3M15BMl5BanBnXkFtZTgwODcxNjg3MDE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "A race of aliens called Mimics has taken over continental Europe. General Brigham (Brendan Gleeson), head of humanity's United Defense Force, orders Major William Cage (Tom Cruise), a public affairs officer and former advertising executive, to cover combat on the beaches of France during the next day's assault on the Mimics. Cage objects to the dangerous assignment and threatens to use his public relation skills to turn the public against Brigham when the casualties start increasing from the invasion, for which he is arrested and knocked out. He wakes in handcuffs at a forward operating base at Heathrow Airport and discovers he has been labeled a deserter and put on combat duty, as a private, for the invasion of France under the command of Master Sergeant Farell (Bill Paxton).The invasion is a disaster for the humans. Cage manages to kill a large Mimic, but dies as he is sprayed with its acid-like blood. He then wakes up at Heathrow the previous morning. No one believes his story that he knows the invasion will fail. He repeats the loop of dying on the beach and waking at Heathrow until he encounters Sergeant Rita Vrataski (Emily Blunt), who recognizes his ability to anticipate events and tells him to locate her the next time he \"wakes up\".Cage finds Vrataski at Heathrow. Together they meet with Dr. Carter (Noah Taylor), a former government scientist and expert in Mimic biology. Cage learns that the kind of Mimic he killed in his first loop, an \"Alpha\", resets time when it is killed to give the Mimics an advantage in battle. Cage inherited this ability when he was doused in the Alpha's blood as they both died. Vrataski had this ability in a previous battle in Verdun but lost it after receiving a blood transfusion. Vrataski tells Cage that the Omega wanted humans to believe that they could win, so it allowed Vratasky to win in Verdun, so that humans put everything into their battle at France & get beaten. She tells Cage that they must hunt the Mimics' hive mind, the Omega & until that day Cage has to die each day to reset time. Carter tells Cage that the Omega has lost power to reset time to Cage & will be mentally looking for him. When Omega finds Cage, Cage will start having visions of the Omega's location.Over succeeding loops Vrataski trains Cage into a more effective soldier. After getting discouraged from these loops he travels to London, there he realizes and sees the Mimics were planning on overrunning London during the invasion on the beach. He and Vrataski spend several loops learning how to survive the battle on the beach and get inland based on his vision of the Omega hiding in a Bavarian Alps dam. After numerous loops end in Vrataski's death, Cage decides to hunt the Omega alone, abandoning her and the rest of the invasion to doom on the beach. When he arrives at the dam, he discovers that the Omega is not there. He manages to kill himself before an Alpha can steal his blood and prevent him from resetting the day. Back at Heathrow, he tells Vrataski and Carter that his vision was a trick.Cage and Vrataski adopt a new approach: they infiltrate the Ministry of Defence in search of a prototype built by Carter that will allow Cage to discover the Omega's true location. The device is a transponder which once attached to an Alpha, finds the location of the Omega. After several failed loops they obtain the device from General Brigham, which reveals that the Omega is located under the Louvre Pyramid in Paris (Cage stuck the device in his leg to activate the prototype as he is an Alpha now). They are injured as they flee & both are knocked unconscious so Rita is unable to kill Cage this time when he get injured. Cage's life is saved by a blood transfusion, but it removes his ability to reset the day.Vrataski frees Cage and they return to Heathrow, where they convince his squad to help destroy the Omega. The team is given instructions not to kill the Alpha, as if an Alpha is killed, the Omega will reset the day & will know in advance of the squad's attack on Louvre. The other squad members sacrifice themselves to get Cage and Vrataski beneath the Louvre. Vrataski distracts a waiting Alpha while Cage advances on the Omega. The Alpha kills them both, but not before Cage primes and drops a grenade belt into the Omega's core, destroying it and neutralizing the other Mimics.Cage's body absorbs the Omega's blood. He wakes up en route to his meeting with Brigham the day before. Brigham announces that Mimic activity has ceased following a power surge in Paris. Cage is never arrested and he goes to Heathrow, where he finds his squad mates, including Farell. None of them recognize him and treat him respectfully as an officer, as he is once again a Major. He meets Vrataski, who does not recognize him either. She asks what he wants, as she had many times before, and he smirks and laughs.",
	"links": [
		"https://www.amazon.com/Live-Die-Repeat-Edge-Tomorrow/dp/B00KW25MFY"
	]
}