{
	"title": "The Foreigner",
	"release_year": "2017",
	"runtime": "113",
	"tags": [
		"Action",
		"Thriller",
		"amazon",
		"netflix"
	],
	"rating": 7.0,
	"actors": [
		"Katie Leung",
		"Jackie Chan",
		"Rufus Jones",
		"Mark Tandy",
		"John Cronin",
		"Caolan Byrne",
		"Donna Bernard",
		"Aaron Monaghan",
		"Niall McNamee",
		"Pierce Brosnan"
	],
	"staff": [
		"Martin Campbell",
		"David Marconi",
		"Stephen Leather",
		"Jackie Chan",
		"Wayne Marc Godfrey",
		"Claire Kupchak",
		"D. Scott Lumpkin",
		"Cliff Martinez",
		"David Tattersall",
		"Angela M. Catanzaro",
		"Debbie McWilliams",
		"Alex Cameron"
	],
	"votes": 125098,
	"cover": "https://m.media-amazon.com/images/M/MV5BNjBmY2MzYmMtNjdmMi00MWYyLTgwYTgtOTYwMTdmZTUxOGQxXkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "In London, England. Vietnam War veteran Ngoc Minh Quan (Jackie Chan) picks up his daughter Fan (Katie Leung) from school. He takes her to a dress shop in Knightsbridge. As Quan attempts to park his car, a man in a motorcycle parks his motorbike between the dress shop and the bank next door. Quan bumps into another vehicle whose driver is stealing his parking spot. The man gets out to confront Quan when a bomb on the motorcycle explodes, destroying the bank and dress shop. Quan is blown off his feet. His daughter Fan and 11 others are killed; 36 are injured.A news station receives a call from a group calling themselves the Authentic IRA, who are claiming responsibility for the bombing. The head of the station tells his employees to find out more information and to see if any other terrorist groups are behind the bombing. A photographer, Ian Wood (Rufus Jones), goes to the bombing site to take pictures. He stops when he sees Quan inside the store tearfully holding Fan's body.Three IRA members are watching the news from their safe house, stating that they must stay put in order to avoid detection.Irish Deputy Minister Liam Hennessy (Pierce Brosnan) is in bed with his mistress Maggie Dunn (Charlie Murphy). He receives a call from his wife Mary (Orla Brady) about the bombing. She wonders why he didn't come home the previous night. Hennessy talks to a British politician, Katherine Davies (Lia Williams) about the bombing. Hennessy meets with fellow Irish politicians and ex-IRA colleagues over the bombing. He demands they find out who was responsible for killing civilians and an inventory of every cache of Semtex controlled by each group. JesQuan is left inconsolable after the incident. He is visited at his home above the restaurant he owns by two detectives. Quan asks if they will find the bombers and punish them, and they assure him they will. He leaves his friend and co-worker Lam (Tao Liu) behind, despite her pleas to not pursue revenge.Quan meets with Scotland Yard's Commander Bromley (Ray Fearon) in an attempt to bribe him with all the money he has in exchange for the names of the bombers. Bromley declines the bribe and tells Quan they don't have the information they need at the moment. During this meeting, it is learned that Quan had two other daughters who were killed when Thai pirates attacked their ship on the way to a refugee camp in Singapore.Quan goes to Belfast to meet with Hennessy. After being turned away by his secretary, two security guards pull Quan away after finding a Swiss army knife on his person. Hennessy tells them to let Quan go and he meets with him. Quan brings up Hennessy's history as a leader of the IRA, even showing a newspaper clipping stating Hennessy is proud of his IRA roots. Despite Quan's requests to find the bombers, Hennessy says he knows nothing about them or who they are.Quan leaves Hennessy's office. In a nearby bathroom, he uses matches, cigarettes, and two soda bottles to fashion a makeshift bomb that destroys the bathroom, unnerving everyone on the building floor, but no one is hurt. Quan calls Hennessy and coldly demands the names of the bombers. Hennessy denies knowing who they are.Hennessy calls his nephew Sean Morrison (Rory Fleck Bryne) in New York to and summons him to London to help identify the bombers.Four of Hennessy's IRA goons break into Quan's rented apartment. They attack him, but Quan fights them off and escapes.Quan surveils Hennessy and takes pictures of him kissing Maggie in a restaurant. He texts a copy of one picture to Hennessy's phone. Quan later blows up a stable outside Hennessy's country home while hiding in the woods.Morrison visits Hennessey's wife Mary while she is alone. They have sex and are interrupted when Morrison receives a call from Bromley (whom he used to work with in the British Army) about making a deal with Hennessy over finding the bombers' identities. Mary tells Morrison how she resents her husband because six years earlier, her brother was killed and Hennessy refused to take revenge on his known killers.Quan sets off another bomb outside the country house and Hennessy's goons Chase him through the woods. They fall to Quan's traps, but one of the men shoots Quan in the shoulder, forcing him to retreat. Quan later cauterizes the wound with a hot knife. As he passes out from the pain, he has a flashback, remembering when Thai pirates attacked the boat carrying his family and others escaping Vietnam for a refugee camp in Singapore. He fought but his young daughters were kidnapped and later raped and killed. He and his wife were shot and wounded.Maggie is in London and hops on the motorcycle of the same man that bombed Knightsbridge. A double decker bus explodes on a bridge, killing 16 civilians.Hennessy meets with his co-conspirator, Hugh McGrath (Dermot Crowley) after the bus bombing. He angrily demands to know who is committing these bombings. McGrath tells Hennessy that Hennessy's plan to bomb a few financial targets so he could arrange pardons for five imprisoned members and gain political favor had no teeth, so he escalated the plan. Hennessy shoots McGrath in the leg and forces him he talk. McGrath tells Hennessy his mistress Maggie Dean (real name Sara McKay) was also working for McGrath. Hennessy also learns that his wife Mary helped McGrath In retribution for her husband's failure to kill her brothers murderers. Hennessy kills McGrath.Morrison tracks Quan to a bush shelter in the woods, but Quan ambushes him. They fight until Quan stops Morrison with a deadly stick at his throat. He ties Morrison up, who gives Quan The names of all five bombers, including the bomber that killed Fan, Patrick O'Reilly (Niall McNamee). Details Quan that O'Reilly can be identified by a burn mark on his hand. O'Reilly is responsible for a bomb that killed Morrison's family as well.Maggie has sex with the reporter Ian Wood after seducing him at a pub. He is booked aboard the flight with all the VIPs. While he's in the bathroom, Maggie plants a bomb in his laptop.Quan locates the bombers' hideout and poses as a gas technician to gain entrance. He fights all five. He shoots two of the bombers and smashes a TV on a third, killing them. Maggie is wounded in the shoulder. He fights O'Reilly and strangles him with a curtain.Police breach the room as Quan exits. They interrogate Maggie about the location of the third bomb. Maggie taunts the police, but they torture her with electrical prods. After learning that Ian is an unwitting mule set to board a flight at the airport, police locate him, take his laptop, and throw it down a jetway, which is destroyed. The police are ordered to leave no loose ends and they execute Maggie. Having learned of his wife's treachery, Hennessy orders Morrison to execute Mary as payback for both her and his betrayal. Morrison returns to New York.Hennessy receives a phone call from Davies, who was booked aboard the flight Maggie intended to blow out of the sky. Davies thanks Hennessy for helping save her life, but then reveals that Bromley has evidence that Hennessy was having sexual relations with Maggie. Davies tells Hennessy that she owns him from this point forward.Quan visits Hennessy for the last time. He shows him a picture he took of him kissing Maggie in the restaurant, implicating him in the terrorist attacks. Hennessy says he's sorry and that he never meant to kill his daughter or any of those who died. Quan forces Hennessy to hit \"send\" so that the picture will go viral, and the world will know of his guilt and complicity.Quan returns to his restaurant. An agent maintains surveillance on him under Bromley's orders. After asking if he should move in on Quan, Bromley says no and to let him be. Quan is then found by Lam, who hugs and kisses him.",
	"links": [
		"https://www.amazon.com/Foreigner-Jackie-Chan/dp/B0B5L3F6M4",
		"https://www.netflix.com/title/80185765"
	]
}