{
	"title": "Air",
	"release_year": "2023",
	"runtime": "111",
	"tags": [
		"Drama",
		"Sport",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Matt Damon",
		"Jason Bateman",
		"Ben Affleck",
		"Chris Messina",
		"Viola Davis",
		"Julius Tennon",
		"Damian Delano Young",
		"Chris Tucker",
		"Matthew Maher",
		"Gustaf Skarsgård"
	],
	"staff": [
		"Ben Affleck",
		"Alex Convery",
		"Ben Affleck",
		"Madison Ainley",
		"Jason Michael Berman",
		"Matt Damon",
		"Robert Richardson",
		"William Goldenberg",
		"Lindsay Graham",
		"Mary Vernieu",
		"François Audouy"
	],
	"links": [
		"https://www.amazon.com/Air-Ben-Affleck/dp/B0B8Q3JMCG"
	],
	"votes": 174397,
	"cover": "https://m.media-amazon.com/images/M/MV5BNjdjYzJkZmUtZDNiMC00MzQ0LWE2MGEtYTk4ZGM4NzFkMzM3XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1984, Oregon-based Nike, Inc. is on the verge of shutting their basketball shoe division due to low sales. In response to this, Marketing VP Rob Strasser (Jason Bateman), along with co-founder and CEO Phil Knight (Ben Affleck), task Nike's high school basketball talent scout Sonny Vaccaro (Matt Damon) to come up with a new spokesperson for Nike basketball shoes.\nThe company made a loss and Knight just had to fire 25% of the employees. The basketball division has an entire budget of $250,000. Sonny wants more, which Knight refuses. Nike dominated the running shoe market and a billion dollar business, but Knight is skeptical if people really even care about basketball shoes.Sonny is a gambler and spends a lot of his time in Vegas. He wins most of the time, but then has a habit to blow it all on one bad bet.\nIn 1984, Converse has a 54% share of the basketball shoe market, and Adidas has 29%. Nike is at 17% share. Nike offers more money for endorsements, yet high school basketball players, going to regional, want to sign for Adidas as they are considered \"hot\". Nike is considered a jogging company. Converse is the NBA all star shoe.\nHoward White (Chris Tucker) tells Sonny that he always signed player through their mothers. As boys listen to their mothers.\nThe Nike slogan \"Just do it\" apparently came from the last words of a convict who was facing a firing squad.While considering the basketball players chosen in the 1984 NBA draft, Nike's executives think third pick Michael Jordan (Damian Young) is off limits, being both a fan of Adidas and too expensive for the basketball division's meager budget. Nike is considering going after 3 players between the 5th and the 20th picks.\nSonny speaks to a grocery clerk who says that Jordan is over-rated and his success in high school is not likely to be converted in NBA. He got high in the draft pick due to the one shot which helped his team win the Championship at college level.\nHowever, once Sonny watches Jordan's highlights in conjunction with an Arthur Ashe commercial for his Head rackets, Vaccaro becomes convinced that Nike should pursue who he considers a generational talent, with both brand and athlete building off each other.Sonny argues to Strasser that Jordan was just 18 years old, yet the whole final play was designed around him. Even his coach saw greatness in him. Sonny wants the entire budget to sign Jordan. Nike to build a shoe around Jordan.\nDavid Falk is Jordan's agent and says that Jordan is an Adidas fan. Adidas is making a $250,000+ offer. Nike doesn't stand a chance. David says Jordan likes Adidas's tracksuits, where Nike doesn't even hold a candle to them.\nSonny tells Knight that he will bet his career to get Jordan in. Knight will only sign off if Sonny has a meeting, but David refuses to get a meeting with Jordan until Sonny makes a written offer. Sonny can't make a written offer as he is not authorized yet.Following dinner with his friend George Raveling (Marlon Wayans), who coached Jordan in the Olympic tournament, and asking for his support in courting the star. George supports Sonny but is clear that if Sonny doesn't close with Jordan, bypassing David could mean that Sonny loses his job.\nVaccaro travels to Wilmington, North Carolina, where he convinces Michael's mother Deloris (Viola Davis) that Nike would give Jordan all the attention that he would not receive from his preferred brands Adidas and Converse. Sonny tells Deloris exactly how the Converse and Adidas meetings would go and begs her to consider Nike, if she believes what he is saying is right.After receiving a negative phone call from Jordan's agent David Falk (Chris Messina) regarding contacting his client's family, Vaccaro learns that the Jordans have scheduled a meeting at Nike's Beaverton, Oregon headquarters the following Monday.\nVaccaro and Strasser start preparing their pitch while requesting shoe designer Peter Moore (Matthew Maher) to prepare a prototype, which Moore names \"Air Jordan\" after Nike's Air Sole technology. Those days NBA had a rule that a basketball shoe had to be 51% white. Sonny and Strasser decide to go beyond the 49% color and just pay the fine of $5000 per game to the NBE, for breaking that rule.\nIn the meantime, Knight agrees to assign the basketball division's entire $250,000 budget to hire Jordan.After the meeting with Jordan and his parents is successful, Vaccaro learns that Adidas matched the offer while adding a Mercedes Benz 380SL, and he thinks the deal will not go through. However, Vaccaro receives a call from Deloris, who states that Michael will sign with Nike on the condition he earns a percentage of every Air Jordan sold.Even though Vaccaro thinks the company's higher-ups would not accept this bonus, Knight is told he deems it necessary to ensure the endorsement.\nAn epilogue reveals the Air Jordan exceeded Knight's expectations of $3 million in sales, earning $162 million in its first year and becoming a steady source of income for Nike. Today Air Jordan does $4 Billion in annual sales for Nike.\nStrasser got the credit. Howard White became the founding father of the Air Jordan division at Nike. Michael ears $400 Million a year from Nike due to his revenue share. Nike bought Converse in 2003. David Falk sold his company for $100 million. Sonny was counted as one of the greatest sports reformers in history.\nDeloris runs charities. Her Air Jordan deal meant that billions more went to athletes and their families."
}