{
	"title": "La sociedad de la nieve",
	"release_year": "2023",
	"runtime": "144",
	"tags": [
		"Adventure",
		"Biography",
		"Drama",
		"netflix"
	],
	"rating": 7.8,
	"votes": 145177,
	"actors": [
		"Enzo Vogrincic",
		"Agustín Pardella",
		"Matías Recalt",
		"Esteban Bigliardi",
		"Diego Vegezzi",
		"Fernando Contingiani",
		"Esteban Kukuriczka",
		"Francisco Romero",
		"Rafael Federman",
		"Valentino Alonso"
	],
	"staff": [
		"J.A. Bayona",
		"J.A. Bayona",
		"Bernat Vilaplana",
		"Jaime Marques",
		"Nicolás Casariego",
		"Belén Atienza",
		"J.A. Bayona",
		"Sandra Hermida",
		"Michael Giacchino",
		"Pedro Luque",
		"Andrés Gil",
		"Jaume Martí",
		"María Laura Berch",
		"Javier Braier",
		"Iair Said",
		"Alain Bainée"
	],
	"cover": "https://m.media-amazon.com/images/M/MV5BODM1MWQ1MWUtMDM1ZS00ZjI3LTg4ZTMtNmI1ZDAwNmE4MTNiXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Society of the Snow begins in Montevideo, Uruguay In October 1972. The Old Christians Club rugby team is out on the field playing a heated match against some rivals. One of the younger players, Roberto (Matías Recalt), gets the rugby ball and runs with all his might, refusing to pass it to teammates, despite shouts and orders from the captain and other senior players. Roberto's heroics do not lead to any score, as he is soon tackled by the opposition players, and this short play resembles the final result of the match. The Old Christian Club loses the match terribly, but the atmosphere in the dressing room is not really grim at all. This is because the young men are very excited about an upcoming match of theirs, only because it is to be held in the neighboring country of Chile. Therefore, going to play the match overseas is almost like an adventurous trip for the friends, which is a truly exciting prospect.The plane takes off normally from Uruguay, carrying forty passengers, including 19 players of the Old Christians Club rugby team, and five crew members.\nPassnegers include Numa (Enzo Vogrincic), Roberto, Nando (Agustín Pardella), Gustavo (Tomas Wolf), Daniel Fernández Strauch (Francisco Romero), Alfredo \"Pancho\" Delgado (Valentino Alonso), Diego Storm (Felipe Ramusio), Carlitos Paez (Felipe Gonzalez Otano), Javier Methol (Steban Bigliardi), Enrique Platero (Federico Aznarez), Marcelo Perez Del Castillo (Diego Vegezzi), Adolfo \"Fito\" Strauch (Esteban Kukuriczka) & Eduardo Strauch (Rafael Federman).Numa was studying to be a lawyer and came on the trip with his friends. Daniel, Fito and Eduardo are cousins.\nAll goes well until midway through the journey, as the passengers take photographs of each other, and an overall joyous atmosphere prevails because of the youngsters. However, the weather swiftly changes when the plane flies near the Andes Mountain range, with stormy winds and snow causing massive turbulence for the flight. The course of the flight is such that it has to take a diversion in order to avoid the high mountains and instead travel through the relatively more open pass between two mountains. But this is where things go immensely wrong, as the pilots lose control of the plane, and it crashes into the snowy Andes.\nWhile some of the passengers, later found to be twelve, died from the impact, the others began a long and hard wait for help. October 13th, 1972, Day 1.The plane crash unfortunately killed the pilot within a few minutes, and together with the equipment all being damaged, communications between the survivors and the rest of the world were cut off. Some of the men tried contacting anyone over the pilot's radio, but there was simply no power for the machine to work.\nWhen the plane had landed on the thick snow-covered mountains, it had also broken off into two pieces, as the tail was separated after the crash, and it had catapulted away.\nFrom the very first night of their ordeal, the survivors realized that they needed to huddle with the bodies of the dead in order to protect themselves from the cold. The conditions were such that it took mere minutes for the temperatures to drop terribly after sunset.\nIt was the broken front half of the airplane that provided this shelter, and the survivors spent the first couple of days hoping that help was on the way. The survivors clean out the plane to make room and put the dead bodies out in the snow.\nThe dead included Eugina (Silvia Giselle Pereyra), Graziela, Dante (Maximiliano De la Cruz), Esther (Virginia Kaufmann), Francisco Nicola, Julio César Ferradas (Iair Said), Julio Lamas, Felipe Maquirriain, Francisco Abal, Fernando Vazquez, Carlos Valeta.The Uruguayan Air Force Flight 571 going missing had indeed become news, and the authorities had started looking for them. The survivors could hear some planes flying by as well, but the spot of the crash made them untraceable from the sky above. Along with the heavy snow that nearly covered everything on the ground, the exact location being at a difficult angle to trace ensured that the crash site or the survivors could not be spotted by the rescue planes.The wait for any help was naturally excruciating, firstly because of the extreme weather conditions and also since all of them were injured to some degree, without any respite other than some very basic first aid. But the worst situation was with regards to the shortage of food, since there were not enough food supplies for the group. Whatever little they had in the luggage soon ran out, and it was only much later, when the other half of the plane was found, that the group got access to some more meager food like chocolates.\nThe extreme cold of the place also meant that there were no animals, or even plants, in the deserted area. In their rather delirious state, some were convinced that the place was not meant for any life, for there was no means to support it. Yet, the group of survivors had to hold on and keep their lives afloat, restricted to the very spot, as they could not travel any considerable distance with the snow all around. Numa tries to find the tail of the plane which crashed on the other side of the mountain, but the expedition is not able to travel too far from their origin. Plus, the expedition realizes that just half way up the mountain, the plane is already not visible.Eventually, the survivors had to take in the most dreaded source of food-the group had to resort to cannibalism. The dead bodies lying around, with all their flesh going to waste, were the only things close to any food that the survivors could find after having tried consuming inedible objects like seat foam and leather. Their own skin, peeling off because of various infections and malnutrition, was also consumed by many, but it was simply not enough for nourishment. When the idea to consume the flesh of their dead friends and co-passengers was first proposed, many had different objections against it, both moral and religious. Along with the horrid thought of eating human flesh, such an act is also always considered a sin by religion, and so a few refused to partake in it. But there was also a bigger concern regarding consent, since none of the passengers who had lost their lives would have wanted their bodies to be disrespected in such a manner.\nNando's sister Susana (Alfonsina Carrocio) also dies from the cold and the hunger on the 8th day.The unstoppable hunger and the unwavering spirit to stay alive finally took over, and the survivors ultimately had to consume human meat in order to protect their lives. Arrangements were made as humanely as possible (led by the Strauch cousins), and the person responsible for cutting the meat into small pieces and portions never disclosed the identities of the bodies they had to use. Eventually, as more treacherous days went by without any promise or possibility of help from the world, the survivors agreed to give each other consent to use their bodies after their deaths in order to survive. Many were still grossed by the proposition, having to consume the meat together with mounds of snow in order to avoid the taste of it.To stay alive for seventy-two days in the barren, snowy lands of the Andes was no small ordeal. During this time, the group had managed to salvage electronic parts from another crash site and had setup a makeshift radio to hear about any rescue operation coming their way. But this led to even more disappointment, for they could only get the shattering news that no rescue group had traced them in the Andes and that such operations had now been halted.\nNuma finds Gaston Costemalle's (Louta) dead body near the other crash site, along with Ramon Martinez, Ovidio Ramirez, Alexis Hounie, Daniel Shaw and Guido Magri.Even more dangerous shifts in weather accompanied this disheartening news in the form of snowstorms & avalanches that covered the airplane, which got buried deep under the ground. Many more people died as a result including Liliana Methol, Marcelo, Carlos Roque, Juan Menendez, Enrique Platero, Diego Storm, Gustavo Nicolich and Daniel Maspons.\nThe survivors are still buried in the snow and are forced to eat the flesh of the dead bodies in the fuselage with them.\nBut while some could not help but wait for the authorities to resume the search, solely because of their physical condition, some of the rugby team friends decided to go hiking over long distances in order to find some help.On the 36th day after the crash, four of the men, Roberto, Nando, Tintin, and Numa, first headed out towards the east from the location, believing that they could trek past the mountain ranges and eventually reach Chile, which was right behind the high Andes mountains. At the very onset of this journey, Numa had to cancel his trip and return to the airplane because of a horrific infection on his foot from an injury he had sustained earlier.\nBack in the plane, Arturo Nogueira (Fernando Contigiani García) and Rafael \"el Vasco\" Echavarren (Benjamín Segura) succumb to the infection and the cold.The three remaining tread on, and this trip eventually ended in them finding the broken tail of the airplane. The trio bring back supplies from the tail to the surviving group.\nFor the next few days, the group tried making use of the electricity from parts salvaged from the tail in order to contact civilization. They also had to bear through more treacherous snowstorms and inhospitable weather. On November 29th, there were still 17 survivors from the crash. Tintin takes pictures of the survivors.\nUltimately, when Numa, who was much beloved among the friend group, also passed away on December 11th 1972, the rest decided to make the trip towards the east once again.The weather had greatly changed by now, with winter having passed and the sun growing brighter every day, making it possible for Roberto, Nando, and Tintin to walk towards the distant destination. The group still had to face harsh winds and snow along the way as they walked miles through the Argentinian side of the Andes range. But since the plane had crashed not too far away from the bordering region between Argentina and Chile, Expedition East was not just an impossible plan that would have failed.\nInstead, the three men finally managed to get to the highest part of the mountain range and spot the open valley underneath, beyond which was surely Chile and human settlement. In order to keep the food rations in check, Tintin returned to the crash site from here, while Roberto and Nando pushed on towards their original plan-to find any help for the group of survivors.Roberto and Nando suddenly stumble upon a lizard, suggesting that they were finally in an area that supported life. While Nando is busy staring at the life form, Roberto is bewildered by a different scene-a lone man on horseback, looking at them with confusion. The two men quickly communicated with the villager and let him know who they were, and they were soon taken back to the village. It is from here that they sent a message to the Chilean authorities, asking for help in being rescued.Nando and Roberto finally emerged in the Chilean village on 22nd December 1972, soon after which the police arrive and media reporters gathered to photograph them and spread the miraculous news of their survival. The same news was relayed on the radio channels, informing the rest of the survivors, who were still stuck at the crash site, that help was soon coming their way. The men waited with great enthusiasm, dressing up and combing their hair in the best manner possible, knowing well that the media was coming too and that their faces would be all over the newspapers for the next many days. Eventually, rescue helicopters circled the area, and the survivors were indeed saved from certain death.One of the survivors very rigidly refused to be taken back unless he was allowed to carry his suitcase, which actually contained various objects belonging to those who had passed away. These were their last remains, objects that their families would dearly want to receive to honor their memories.\nMen worked together, giving each other courage and inspiration, and many found a new faith in humanity and human determination over any divine power.",
	"links": [
		"https://www.netflix.com/title/81268316"
	]
}