{
	"title": "The Revenant",
	"release_year": "2015",
	"runtime": "156",
	"tags": [
		"Action",
		"Adventure",
		"Drama",
		"max",
		"amazon"
	],
	"rating": 8.0,
	"actors": [
		"Leonardo DiCaprio",
		"Tom Hardy",
		"Will Poulter",
		"Domhnall Gleeson",
		"Forrest Goodluck",
		"Paul Anderson",
		"Kristoffer Joner",
		"Joshua Burge",
		"Duane Howard",
		"Melaw Nakehk'o"
	],
	"staff": [
		"Alejandro G. Iñárritu",
		"Mark L. Smith",
		"Alejandro G. Iñárritu",
		"Michael Punke",
		"Steve Golin",
		"Alejandro G. Iñárritu",
		"Arnon Milchan",
		"Mary Parent",
		"Alva Noto",
		"Ryuichi Sakamoto",
		"Emmanuel Lubezki",
		"Stephen Mirrione",
		"Francine Maisler",
		"Jack Fisk"
	],
	"links": [
		"https://www.max.com/movies/revenant/175d821c-276e-4b5f-9cfd-b2f89db35631",
		"https://www.amazon.com/Revenant-Leonardo-Dicaprio/dp/B01AB7GJ4M"
	],
	"votes": 887220,
	"cover": "https://m.media-amazon.com/images/M/MV5BYTgwNmQzZDctMjNmOS00OTExLTkwM2UtNzJmOTJhODFjOTdlXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Fur trapper Hugh Glass watches as American soldiers burn down a Native American village in the Great Plains. The village is where Glass stayed with his Pawnee wife and son, and the house being burned down is his, while holding his wife in his arms.In 1823, during the Arikara War, a party of trappers under the command of Captain Andrew Henry (Domhnall Gleeson) hunt for pelts in the unsettled wilderness of the northern Louisiana Purchase. Glass guides the party through the territory of the present-day Dakotas.\nWhile he and his half-Pawnee son, Hawk, are hunting for Elk, the company's camp is attacked by an Arikara war party of a tribe called the Ree, which is seeking to recover its chief's abducted daughter, Powaqa. The men fire back with their rifles. Glass is attacked and nearly choked to death, but one of his men rescues him. A few men gather their furs and materials toward a boat to make their escape.Many of the trappers are slaughtered and the survivors flee on a boat. At the recommendation of the party's guide and most experienced hunter Hugh Glass (Leonardo DiCaprio), who has knowledge of the area and natives, they abandon the boat and begin the journey back to their outpost, Fort Kiowa, on foot, as believes that travelling on the river would leave them vulnerable. After docking, the crew stash their pelts near the shore.The decision bothers some, particularly John Fitzgerald (Tom Hardy), who is hostile towards Glass's half-native son Hawk (Forrest Goodluck), as Fitzgerald was partially scalped by natives' years prior. Glass quickly defends his son and tells him not to retaliate against Fitzgerald.Meanwhile, the Arikara warriors continue their search for Powaqa. They come across French fur traders and trade the riverside furs for five horses.While scouting ahead alone, Glass is ambushed by a grizzly bear after disturbing her cubs. The bear claws and bites Glass, throwing him around as Glass tries to defend himself. He manages to shoot the bear, but it doesn't kill her. She attacks again and Glass gets his knife, stabbing it several times as they both tumble down a hill. Glass lands in a gully and the dead bear lands on top of him.Glass is badly mauled; the party discover him close to death and carry him on a makeshift stretcher. Fitzgerald argues that Glass will not survive his injuries and that they should kill him to speed their journey. They attempt to carry him up a hill, only for him to slide and bring the other men down. Fitzgerald suggests they need to just kill Glass and put him out of his misery.Unwilling to kill Glass, Henry offers payment of $75 to those who will stay behind with him and bury him after he dies.\nFitzgerald, Hawk, and the young Jim Bridger (Will Poulter) volunteer when Henry increases the payment to $100. Henry has Fitzgerald promise to stay with Glass until he dies and give him a proper burial. Fitzgerald wanted the money to recoup his losses from the abandoned pelts. Glass is still in great pain and continues to have visions of his wife and the day his home was burnt down.Fitzgerald gets a moment alone with Glass and tries to convince him to let him put him out of his misery so that no one else is slowed down or left waiting to die, including Hawk. As Glass is unable to talk, Fitzgerald suggests Glass should blink if he agrees, knowing that Glass would eventually have to blink, with or without intention to agree to Fitzgerald's offer. Glass holds his eyes open for a long time before closing them, instead of blinking. Fitzgerald intentionally interprets this as blinking and starts to smother Glass. Hawk shows up, seeing Fitzgerald smothering his father. Hawk starts to call Bridger for help, leading to a struggle with Fitzgerald in which the man stabs Hawk in the abdomen, then letting him bleed out as Glass watches helplessly. Fitzgerald gets rid of Hawk's body and tells Bridger he doesn't know where he went, and Glass is too injured to protest.Later, Fitzgerald lies that the Ree Arikara are nearby and that they must abandon Glass; he drags Glass into a shallow grave and partially buries him alive under a pile of dirt. Bridger hesitates but flees with Fitzgerald. Bridger leaves a canteen on which he had engraved a spiral symbol with Glass.Glass crawls out of the grave and walks through the woods, haunted by visions of his deceased Native wife. He finds Hawk's body freezing up from the cold. Glass vows to stay by his son's side. He finds a thick bear pelt to take with him to keep warm. As he continues to move through the woods, he feeds off of roots and old bone marrow. He attempts to build a fire for added warmth and uses some of his leftover gunpowder to seal the wound in his throat.\nHe escapes the Arikara, whose chief is searching for his kidnapped daughter Powaqa (Melaw Nakehk'O), by floating down rapids.On their way to Fort Kiowa, Bridger realizes that Fitzgerald lied (Bridger forces Fitzgerald to admit that there are no pursuing Arikara). Bridger turns his rifle on Fitzgerald, who takes it from Bridger and turns it on him. He pulls the trigger, but the unloaded rifle clicks on an empty chamber. They continue to move.\nhey come across a burnt-down settlement with bodies sprawled across the ground. One woman emerges from her burnt hut and sees the men. Bridger quietly leaves some food for her.When they arrive at the fort, Fitzgerald tells Henry that Glass succumbed to his wounds and that Hawk was likely attacked by the Arikara. Bridger is complicit in the lie about Glass's death but remains unaware of Hawk's murder. Fitzgerald collects his payment. Bridger remains quiet but is upset and refuses a bonus pay. Henry tells Fitzgerald that the fort is almost out of money, and that they are waiting for reinforcements led by Henry Leavenworth before anyone can be paid their regular salary.Glass is getting colder and hungrier. He walks into the river and eats a live fish. He walks up a hill and sees a Pawnee Indian feeding off the carcass of a bison. Glass encounters Hikuc (Arthur Redcloud), a friendly Pawnee.\nGlass approaches him cautiously and gestures for food. The Indian throws him an organ, which Glass eats ravenously. In the morning, the Indian observes the bear wounds on Glass' body, which are starting to rot.\nHikuc too has lost family but says that \"revenge is in the Creator's hands.\" The two travel together on horseback.As a storm approaches, Hikuc constructs a sweat lodge for the feverish Glass to shelter in. The Pawnee performs a healing ritual for Glass' wounds.\nAfter a hallucinogenic experience in the lodge, Glass emerges to discover that his wounds are healing, but French Canadian hunters have lynched Hikuc.Glass infiltrates the camp and sees the leader Toussiant (Fabrice Adde) sexually assaulting Powaqa. After he frees her, Powaqa castrates Toussaint and flees while he kills several hunters and recovers Hikuc's horse (while freeing the others so that the hunters cannot pursue), leaving behind Bridger's canteen. He rides to a spot in the woods where he builds himself a fire.\nThe following day, Glass is ambushed by the Arikara and driven over a cliff on his horse. A tree breaks his fall, and he lands in the woods at the bottom of the cliff, but his horse dies. As the night falls and the cold intensify, he cuts the horse open, removes its organs, and bunks inside its carcass for warmth. When he wakes up, he gets out of the carcass and moves to a snow cave. In there, he carves \"Fitzgerald killed my son.\"At Fort Kiowa, a lone French hunter arrives carrying Bridger's canteen. Believing it was stolen from Hawk, Henry organizes a search party and leaves to find him. Fitzgerald, realizing that Glass is alive, steals the fort's payroll money and escapes. The search party finds the exhausted Glass near the Yellowstone River and brings him to the fort. Furious, Henry charges Bridger with treason, but Glass assures Henry that Fitzgerald lied to him. Glass insists on joining Henry to find Fitzgerald.After they split up while tracking him, Fitzgerald ambushes Henry. Glass finds him dead and scalped.\nBy pretending to be dead, Glass ambushes Fitzgerald and shoots him in the shoulder. He chases him into the woods, and they engage in a bloody fight on a riverbank. Glass is about to kill Fitzgerald but remembers Hikuc's words and pushes him downstream into the hands of the Arikara. The chief Elk Dog (Duane Howard), accompanied by Powaqa, scalps and kills Fitzgerald but spares Glass. Glass walks away and collapses. He has a vision of his wife, who smiles at him before disappearing into the woods."
}