{
	"title": "Colombiana",
	"release_year": "2011",
	"runtime": "108",
	"tags": [
		"Action",
		"Crime",
		"Drama",
		"amazon",
		"netflix"
	],
	"rating": 6.4,
	"actors": [
		"Zoe Saldana",
		"Michael Vartan",
		"Callum Blue",
		"Jordi Mollà",
		"Lennie James",
		"Amandla Stenberg",
		"Cliff Curtis",
		"Beto Benites",
		"Jesse Borrego",
		"Cynthia Addai-Robinson"
	],
	"staff": [
		"Olivier Megaton",
		"Luc Besson",
		"Robert Mark Kamen",
		"Luc Besson",
		"Ariel Zeitoun",
		"Nathaniel Méchaly",
		"Craig Walker",
		"Romain Lacourbas",
		"Camille Delamarre",
		"John Papsidera",
		"Alejandro Reza",
		"Patrick Durand"
	],
	"votes": 109012,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTM0NDI2NjgxNl5BMl5BanBnXkFtZTcwMTYyNjA3NQ@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Bogota, Columbia. Fabio is speaking to Don Luis (Beto Benites), a drug lord and his boss.\nFabio wants to quit, but Don Luis tells Marco (Jordi Mollà) to shoot Fabio. No one leaves the cartel.Fabio is leaving the country with wife Alicia & daughter Cataleya. He gives Cataleya a microchip & tells her to go to US embassy if anything were to go wrong. then Marco arrives & kills Fabio & Alicia. Cataleya swallows the microchip & swears to kill Don Luis. She escapes & somehow reaches the US embassy & vomits the microchip to her freedom. Microchip has details of all Don's illegal activities & is very valuable for Americans. They take Cataleya to the U.S.\nIn the U.S., she goes to Chicago & meets Uncle Emilio (Cliff Curtis) who is Fabio's brother. Cataleya is finally able to let go and cries in her uncle's arms. Cataleya asks Emilio to train her as a killer to avenge Fabio.Emilio enrolls her in the best school as he wants her to be a smart assassin.\nCataleya (Zoe Saldana) is now grown up & is a trained assassin & very skillful. She manages to shoot a guarded prisoner (her Target) inside a prison, while framing the prison guard while being under arrest & in a locked cell herself in the women's section of the same prison. Cataleya heads to the apartment of Danny (Michael Vartan), a painter and her quasi-boyfriend. Danny knows little about her, and only knows her as \"Jennifer.\" Danny and Cataleya have sex.FBI Special Agent Ross (Lennie James) comes to the jail and realizes the victim is the latest of a string of murders they have been tracking for the past four years, 22 in all. They call the perpetrator \"The Tag Killer\" due to the markings the killer leaves on the chest. It is the Cataleya flower.\nCIA Agent Richard (Callum Blue) travels to New Orleans to a heavily guarded villa. It is the home of Don Luis, who was brought to the U.S. by the CIA in exchange for Info. Richard shows him the hit from the jail cells, but Luis denies he had anything to do with it. Luis suspects Cataleya to be behind the killings & asks Marco to handle it.Ross holds a meeting about the Tag Killer and their numerous victims. He concludes that one of the people in the jail killed the target and they need to find out who.\nMeanwhile, Cataleya goes to see Emilio. He shows her the paper with her calling card. He is livid. A hedge manager created a Ponzi scheme and stole billions and fled the country. People want him dead. That's her next target, She won't stop till Luis is dead.\nRoss is at the FBI office going over security footage. Some of his agents think the killer is Cataleya but he cannot believe a woman would be this type of killer.Mexico. Mansion of the hedge manager who lives in opulence surrounded by stunning women. He also has an aquarium of sharks. Cataleya swims through the aquarium and pushes up a glass cover to enter the mansion. The hedge fund manager gets up and notices Cataleya wrote on him \"Thief\" and the flower design. He walks around his mansion and notices all his guards are dead. Cataleya shoots him in the legs. The man pleads with her to not kill him. Cataleya shoots him in the chest, and he falls into the opened pool. The blood flows and his sharks eat him alive in seconds.Ross is looking at the Tag Killer's calling card when the mailman gives him a vital clue; it is the Cataleya flower that only grows in Columbia. Ross tries to tie it to open cases in Columbia but is denied access due to CIA jurisdiction.\nRoss calls Richard and asks for clearance but Richard dodges the issue. He puts pressure on Luis to resolve the issue. Marco resorts to a door-to-door search in Chicago to find Cataleya.\nDanny & Cataleya have sex. He takes a picture of her with his iPhone. Danny tries to get close to Cataleya, but she is afraid that he will get hurt.Cataleya meets with Emilio. He is livid, having seen the paper. Cataleya has not stopped with her calling card. People are looking for them, showing that eight people were gunned down in a bar, one being a friend of Emilio. \"You're retired,\" Emilio tells her. Cataleya refuses to give up.\nDanny shows Cataleya's photo to a friend, who calls his sister-in-law, who is a cop to check if Cataleya or \"Jennifer\" is legit. When Danny is distracted, he sends the photo to the cop.\nRoss is at his computer when it is pinged with Cataleya's photo. He traces the signal to the other police station. Ross compares the photo to the security footage at the jail and its a match. Cataleya is the woman who he is looking for.That evening Danny mentions the photo to Cataleya & she immediately leaves the apartment. A SWAT team is already outside. Cataleya manages to escape via a planned escape route.\nShe heads to Emilio & finds him tortured & dead. She breaks down.\nCataleya meets Ross at his apartment & tells him about Don Luis & asks him to approach Richard for the info on Don. Ross has to agree as Cataleya promises to kill his family if he doesn't. Richard refuses, but Cataleya fires shots at him when Ross is meeting with him. Richard gives Ross the address for Don Luis.Cataleya goes to Pepe's (he was Emilio's trusted friend & was killed by Marco) garage. She grabs some guns. She sees the two dogs & takes them.\nCataleya attacks Don's home. She kills all their men & faces Marco & kills him in hand-to-hand combat.\nLuis tries to escape in a van when Cataleya calls him from Marco's phone. She had put Pepe's dogs in the van & now tells them \"EAT.\" The trained dogs proceed to eat Don Luis.Danny was taken into custody by Ross and the FBI. Danny knows little and tells them so. Ross says while he is not under arrest, he still has questions to answer. Danny asks for coffee and Ross goes to get it. Danny gets a call from Cataleya. She tells him she's OK and they have 40 seconds before they trace the call, so that's enough time to ask three questions. He asks for her real name, and she tells him it's Cataleya. Danny asks if his little bird will return one day (meaning her). Cataleya tells him that maybe one day she can.Danny has only seconds now. \"I love you,\" Danny says which makes Cataleya tear up. Ross orders him to give over the phone but Cataleya hangs up before he can get anything from her. Ross stares at the phone and tells Danny he's free to go.\nCataleya puts her sunglasses on and gets on a bus for a destination unknown.",
	"links": [
		"https://www.amazon.com/Colombiana-Movie-European-Format-Stenberg/dp/B008H09LIC",
		"https://www.amazon.com/Colombiana-Unrated-Zoe-Saldana/dp/B006E2VTG2",
		"https://www.netflix.com/title/70178640"
	]
}