{
	"title": "Johnny English Reborn",
	"release_year": "2011",
	"runtime": "101",
	"tags": [
		"Action",
		"Adventure",
		"Comedy",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Rowan Atkinson",
		"Rosamund Pike",
		"Dominic West",
		"Roger Barclay",
		"Eric Carte",
		"Togo Igawa",
		"Eleanor Wyld",
		"Mandi Sidhu",
		"Margaret Clunie",
		"Gillian Anderson"
	],
	"staff": [
		"Oliver Parker",
		"Hamish McColl",
		"William Davies",
		"Neal Purvis",
		"Robert Wade",
		"Tim Bevan",
		"Chris Clark",
		"Eric Fellner",
		"Ilan Eshkeri",
		"Danny Cohen",
		"Guy Bensley",
		"Lucy Bevan",
		"Jim Clay"
	],
	"votes": 142508,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTc0MTM3NzEzMl5BMl5BanBnXkFtZTcwNjE5MTU3NQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Eight years after the events of the first film, Sir Johnny English (Rowan Atkinson) is learning martial arts in Tibet as penance for an earlier failed mission in Mozambique. However, he is contacted by MI7, requesting he returns to service, as one of their contacts has specifically asked to speak only to English.Johnny returns to MI7's London headquarters (now Toshiba British Intelligence) and assigned by new boss \"Pegasus\" (Gillian Anderson) to stop a plot to assassinate the Chinese Premier during scheduled talks with the Prime Minister. This information was given to MI7 by ex-CIA agent Titus Fisher. Johnny's mission is to contact Fisher in HK & find out what he knows. Johnny also meets with fellow agent Simon Ambrose (Dominic West) and MI7's resident inventor, Patch Quartermain (Tim McInnerny). He is also assigned a junior agent, Colin Tucker (Daniel Kaluuya).In Hong Kong, English is contacted by ex-CIA agent Titus Fisher (Richard Schiff). Fisher delivers his address in HK to English. Fisher reveals that he is a member of a group of 3 assassins called 'Vortex', who also sabotaged English's mission in Mozambique. Vortex has now been contracted to kill the Chinese premier. Vortex holds a secret weapon, which requires three metal keys to unlock, and Fisher reveals one. Fisher is killed by an assassin (Pik-Sen Lim) dressed as a cleaner, and the key falls into Vortex's hands, when they steal it from English during his flight from HK to USA. English is humiliated in front of the Foreign Secretary and Pegasus by the loss of the key, and assaults Pegasus's mother, mistaking her for the assassin from Hong Kong.Kate Sumner (Rosamund Pike), MI7's behavioral psychologist, prompts English to recall the events of his mission in Mozambique, and the identity of the second Vortex operative, Karlenko (Mark Ivanir), a Russian double agent, ex MI7 & now retired. A golf match between Karlenko and English leads to multiple attempts on English's life. However, Karlenko is critically injured by the assassin, and English attempts to fly him to hospital. Before they arrive, Karlenko reveals that Vortex's last agent is a member of MI7 (he says Vortex is KGB, CIA and MI7), and dies.In a meeting at MI7, it is revealed that talks between Britain and China will continue in a heavily guarded Swiss fortress called 'Le Bastion'. Over dinner the same night, English informs Ambrose that he knows of a mole in MI7. Ambrose prepares to kill English, until it becomes clear to him that English doesn't know who the traitor is. Tucker confronts Ambrose in the bathroom, knowing he is the mole, but English orders him to leave. Ambrose convinces English that Quartermain is the traitor. English entrusts the key to Ambrose, who tells Pegasus that English is the traitor.English confronts Quartermain and realizes that he has been framed. He escapes in Quartermain's modified wheelchair after being hit by a stray bullet in the leg. English goes to Kate's house and convinces her that he is not the traitor. Kate, scrutinizing footage of the Mozambique mission, realizes that the assassin behaved abnormally. They learn that Vortex owns a drug called Timoxeline Barbebutenol that allows them to control a person for a brief time before they die of heart failure. The drug was created by CIA & Fisher was ordered to destroy it. Ambrose, the only surviving member of Vortex, plans to use the drug to kill the Premier in exchange for 500 million USD. While with Kate, English realizes that he saw Ambrose in Mozambique with Fisher & Karlenko, & that Ambrose is the 3rd member of Vortex.English confronts Tucker and convinces him to help break into 'Le Bastion'. English warns Pegasus of the threat and drinks the drug accidentally that Ambrose had prepared for Pegasus to turn her into the assassin. English is rendered vulnerable to Ambrose's commands. Ambrose orders English to kill the Premier using a pistol disguised as a tube of lipstick. English tries to resist the effects of the drug and engages in a fight with himself while Tucker attempts to interrupt communication between Ambrose and English. Tucker disrupts the frequency, replacing it with radio station, resulting in English beginning to dance. Ambrose reasserts his command, revealing himself in the process. English resists, shooting at Ambrose, who escapes.The effects of the drug wear off and English seemingly dies of heart-failure, before being revived by Kate, who kisses him of the lips, making his heart rate boost. English pursues Ambrose, parachuting from the building and hijacking a snow mobile. English reaches Ambrose, who is in a gondola lift. The two fight, with English falling out of the car. Ambrose tries to shoot English, who shoots a rocket at the cable-car, killing Ambrose.English is knighted but finds out that the killer cleaner was disguising herself as the Queen. He chases and attacks her with a tray, before discovering he has targeted the real Queen.\nA post-credits scene, influenced by the barber scene in The Great Dictator, sees English making a takeaway for Kate to the tune of \"In the Hall of the Mountain King\". During the cooking scene, he parodies the Loituma Girl video by spinning some leeks.",
	"links": [
		"https://www.amazon.com/Johnny-English-Reborn-Rowan-Atkinson/dp/B0076R62FM"
	]
}