{
	"title": "Kick-Ass 2",
	"release_year": "2013",
	"runtime": "103",
	"tags": [
		"Action",
		"Comedy",
		"Crime",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Aaron Taylor-Johnson",
		"Aaron Taylor-Johnson",
		"Chloë Grace Moretz",
		"Chloë Grace Moretz",
		"Christopher Mintz-Plasse",
		"Christopher Mintz-Plasse",
		"Jim Carrey",
		"Morris Chestnut",
		"Claudia Lee",
		"Amy Anzel",
		"Clark Duke",
		"Clark Duke",
		"Augustus Prew",
		"Augustus Prew",
		"Mary Kitchen"
	],
	"staff": [
		"Jeff Wadlow",
		"Jeff Wadlow",
		"Mark Millar",
		"John Romita Jr.",
		"Adam Bohling",
		"Tarquin Pack",
		"Brad Pitt",
		"David Reid",
		"Henry Jackman",
		"Matthew Margeson",
		"Tim Maurice-Jones",
		"Eddie Hamilton",
		"Reg Poerscout-Edgerton",
		"Russell De Rozario"
	],
	"votes": 291117,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTQ4OTQxNzc0N15BMl5BanBnXkFtZTcwOTQxOTU5OQ@@._V1_QL75_UY281_CR2,0,190,281_.jpg",
	"description": "Dave Lizewski (Aaron Taylor-Johnson), bored after having retired from fighting crime as Kick-Ass, begins training with Mindy Macready (Chloe Grace Mortez) to become a proper hero. Mindy is having problems of her own after the death of Big Daddy & is taking isolation very hard, so she agrees to team up with Dave. Meanwhile, Chris D'Amico and his mother argue over the death of his father. Frustrated, Chris kicks the tanning bed his mother is using, causing it collapse on Chris' mother, killing her. Now with control over his family's money, Chris reinvents himself as super-villain, The Motherf****r (Christopher Mintz-Plasse) and swears vengeance on Kick-Ass.Mindy's guardian, Marcus, discovers she is still fighting crime and makes her promise to give it up. Dave's girlfriend, Katie Deauxma, has noticed Dave behaving strangely and breaks up with him, believing he is cheating on her with Mindy. Kick-Ass joins the superhero team Justice Forever, led by Colonel Stars and Stripes; it includes Battle Guy (Dave's friend, Marty), Dr. Gravity, Insect Man, Night-Bitch, and the parents of a missing child named Tommy. The team starts out working at soup kitchens and patrolling the streets before taking on the larger task of shutting down a brothel. Kick-Ass begins a relationship with Night Bitch, and he and Marty try to get their friend Todd involved with heroics, but instead alienate him by calling his chosen identity, Ass Kicker, a copy of Kick-Ass.Mindy tries leading a normal life. Brooke, one of the popular girls, suggests Mindy try out for the dance team at school, but when Mindy wows the audience with her audition, Brooke is unhappy. Dave tries to convince Hit-Girl to join Justice Forever, but she refuses, and promptly asks a boy to take her on a date. The date ends up as a cruel prank, leaving Mindy abandoned in the forest to walk home alone. Dave consoles the tearful Mindy and encourages her to beat the mean girls at their own game. The next day, Mindy does so with verbal put-downs and a crowd-control shock baton, resulting in her suspension from school. Meanwhile, Mr. Lizewski discovers Dave is Kick-Ass after finding his superhero costume in his room.The Motherf****r assembles a gang of super-villains and establishes an underground lair. He finds Colonel Stars and Stripes and has Mother Russia, a massive Russian ex-con and former KGB agent, decapitate him before taunting Justice Forever on Twitter. He then tracks down Night-Bitch and attempts to rape her. When police arrive, Mother Russia kills all 10 officers, resulting in a police clampdown on both costumed villains and vigilantes. When the police track Dave through his IP address, Dave's protective father claims he, not Dave, is Kick-Ass.The Motherf****r, unconvinced the real Kick-Ass has been caught, learns from Todd, who had inadvertently joined the Motherf****r's group, that the man identified as being Kick-Ass is actually his father. The Motherf****r has Mr. Lizewski killed in jail and sends a photograph to Dave, revealing his true identity as Chris D'Amico. Grief-stricken, Dave vows to never put on the Kick-Ass costume again, as he had promised his father. At the funeral, the Motherf****r's gang ambushes and kidnap Dave.Mindy pursues their fleeing van, killing all but one of its occupants, rescuing Dave, and convincing him to confront the Motherf****r. Dave and his superhero friends attack the villain's lair where they are preparing to have Kick-Ass fed to a shark. While Kick-Ass fights the Motherf****r, Hit-Girl struggles against Mother Russia. Hit-Girl tricks Mother Russia into injecting her with a syringe of adrenaline. This gives her the strength to kill Mother Russia with shards of glass. Fighting on a rooftop, the Motherf****r falls through a skylight, but Kick-Ass grabs him. The Motherf****r refuses help and falls, landing in his own shark tank where he is mauled. Later on, Justice Forever decide to give up their superhero duties for good.Mindy takes Dave home on her motorcycle and tells him that since she is wanted for murder, she is leaving New York. She tells him he is now the superhero the city needs and kisses him before departing. Dave accepts the responsibility and begins training and upgrading his equipment.\nIn a post-credits scene, the Motherf****r screams from a hospital bed for water. He shouts that his legs and genitalia were bitten off and is barely able to move.",
	"links": [
		"https://www.amazon.com/Kick-Ass-2-Jim-Carrey/dp/B00GET77OS"
	]
}