{
	"title": "Hodejegerne",
	"release_year": "2011",
	"runtime": "100",
	"tags": [
		"Action",
		"Crime",
		"Thriller",
		"amazon"
	],
	"rating": 7.5,
	"actors": [
		"Aksel Hennie",
		"Synnøve Macody Lund",
		"Nikolaj Coster-Waldau",
		"Julie R. Ølgaard",
		"Eivind Sander",
		"Kyrre Haugen Sydness",
		"Valentina Alexeeva",
		"Reidar Sørensen",
		"Nils Jørgen Kaalstad",
		"Joachim Rafaelsen"
	],
	"staff": [
		"Morten Tyldum",
		"Ulf Ryberg",
		"Lars Gudmestad",
		"Jo Nesbø",
		"Marianne Gray",
		"Asle Vatn",
		"Trond Bjerknes",
		"Jeppe Kaas",
		"John Andreas Andersen",
		"Vidar Flataukan",
		"Jannecke Bervel",
		"Nina Bjerch Andresen"
	],
	"votes": 107886,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjE4OTgzOTI2Nl5BMl5BanBnXkFtZTcwMjM5MDg0Nw@@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Roger Brown (Aksel Hennie), Norway's most successful headhunter, supports his lavish lifestyle by stealing paintings from his clients. His partner Ove (Eivind Sander) works at a surveillance company and deactivates security at the victims' homes, allowing Roger to swap the art for a counterfeit. Asked to dinner by his mistress, Lotte (Julie Olgaard), Roger declines and ends their relationship.\nRoger's wife, Diana (Synnøve Macody Lund), an art gallery owner, introduces him to Clas Greve (Nikolaj Coster-Waldau), an executive for GPS technology company HOTE who wants to work for Pathfinder, a rival company, for which Roger is recruiting. Actually, Clas plays very hard to get & even refuses to meet Roger the first couple of times, which only makes Roger chase him even more.Diana wants kids & Roger's sperm count is low (which he hasn't told Diana). Diana is increasingly angry at Roger for avoiding the pregnancy conversation.\nRoger becomes jealous of Diana's attraction to Clas. Diana tells Roger that Clas owns a rare Rubens painting, which is going to be in Clas's house for just another week. Diana reveals that Clas has asked her to authenticate the lost Rubens painting he inherited that is believed to be worth millions.Roger makes plans with Ove to steal the painting at the first available opportunity, after Roger's lunch with Clas. Roger takes Clas to lunch to discuss the job at Pathfinder and after playing squash later, he notices scars on Clas's back. Clas mentions he received them during his military service, where he was a member of a special forces unit that specialized in tracking people, a fact which gives Roger pause for thought. He also learns that Clas helped HOTE develop a nanotechnology GPS tracking gel that is difficult to remove.\nDespite his misgivings, Roger meets with Ove to work out details on stealing the painting. Roger manages to steal it from Clas' home, but he discovers Diana's cellphone beside Clas' bed. This implies the two of them are having an affair due to Roger's refusal to have children with Diana.Roger is angry & even though Clas's meeting with Pathfinder goes great, he vows to make sure Clas doesn't get a job in Norway. An upset Roger flippantly informs Clas that the company may be looking for someone else to fill the position.\nA vow that Roger repeats in front of Diana, who calls Clas & tells him about this.The next day, Roger leaves for work but finds Ove in his car in his garage, apparently dead. Roger discovers a poison syringe in the car seat. He places Ove in the trunk and later dumps the body in a lake, but the water revives Ove, who didn't get a full dose of the poison. The two go to Ove's home, where Ove demands hospital attention. Roger refuses as he does not want the police involved. Ove pulls a gun, and, in a shoot-out, Roger accidentally kills Ove.When Roger exits, he sees Clas waiting outside and after a scuffle, Roger escapes. Believing that Clas is tracking him, Roger switches his car for Ove's and throws his clothes, wristwatch and wedding ring in a lake, changing into Ove's clothes that he found in the car. Clas tails Roger to the farm and murders the farmer but Roger hides from him. Roger is bitten by Clas's dog, but he kills it and escapes on a tractor.\nRoger, believing Clas is still chasing him, drives erratically and falls from the tractor, only to find his pursuer is a stranger wanting to help.Waking in a hospital, Roger learns the police think he is Ove, and arrest him for the farmer's murder when he tries to escape. Driving to the station, the officers pull over to block a truck reported stolen. Roger realizes that Clas is driving the truck, and that Diana may have helped Clas by rubbing the GPS gel into Roger's hair. With Clas approaching, the officers ignore Roger's protests, allowing Clas to ram the car off a cliff. Playing dead until Clas leaves the scene, Roger shaves his head and hides his hair on a deceased officer's body, then swaps clothes with a detective's disfigured body to fake his death.Roger turns to Lotte for help, only to discover she is working for Clas. Clas, who is still secretly employed by HOTE, was planning to use Roger to get the Pathfinder job and steal their secret technologies. Lotte admits that she put the GPS gel in Roger's hair, absolving Diana, and that she suggested dinner so she could introduce him to Clas. Since Roger ended their affair, Clas used a counterfeit Rubens painting to meet Roger through Diana. When Roger lets his guard down, Lotte attacks him with a knife, causing Roger to shoot and kill her in self-defense. Roger returns home and admits everything to Diana, who apologizes for her affair with Clas. The next morning, Roger goes to a morgue to retrieve the remaining evidence linking him to the murders (his cut hair), while Diana contacts Clas to ostensibly resume their affair.While cleaning Ove's cabin of evidence, Roger is confronted by Clas, who tracks the GPS gel in the cut hair. Clas gloats that Diana has returned to him and tries to shoot Roger but fails. Roger fatally wounds Clas with a hidden gun, explaining that Diana only resumed their affair so she could load Clas' gun with blanks.Ove's home security records Clas involved in a shootout, though Roger stays in a camera blind spot near Ove. The footage, combined with evidence doctored by Roger, suggests Ove and Clas were art thieves who killed the farmer, Lotte, and then finally each other after a dispute. The police, including star detective Brede Sperre (Reidar Sorensen), ignore the minor inconsistencies (Ove's time of death being days earlier than what is implied by the video footage) because Brede knows that leaving the case unsolved would harm his growing reputation. Later, Roger and a visibly pregnant Diana are shown selling their house, and Roger returns to work, giving the Pathfinder job to the client he rejected and robbed at the beginning.",
	"links": [
		"https://www.amazon.com/Headhunters-Aksel-Hennie/dp/B0CPP5HDZJ"
	]
}