{
	"title": "In Time",
	"release_year": "2011",
	"runtime": "109",
	"tags": [
		"Action",
		"Sci-Fi",
		"Thriller",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Justin Timberlake",
		"Amanda Seyfried",
		"Cillian Murphy",
		"Olivia Wilde",
		"Shyloh Oostwald",
		"Johnny Galecki",
		"Colin McGurk",
		"Will Harris",
		"Michael William Freeman",
		"Jesse Lee Soffer"
	],
	"staff": [
		"Andrew Niccol",
		"Andrew Niccol",
		"Marc Abraham",
		"Eric Newman",
		"Andrew Niccol",
		"Craig Armstrong",
		"Roger Deakins",
		"Zach Staenberg",
		"Denise Chamian",
		"Alex McDowell"
	],
	"votes": 454202,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjA3NzI1ODc1MV5BMl5BanBnXkFtZTcwMzI5NjQwNg@@._V1_QL75_UY281_CR6,0,190,281_.jpg",
	"description": "By the year 2169, genetic alteration has allowed humanity to stop aging at 25. 'Living time', which can be transferred among individuals on body-contact, is displayed on a clock implanted in people's forearms. When that clock reaches zero, one dies instantly. Society is divided by social class living in specialized towns called 'Time Zones'. The poor live in the ghettos of Dayton, where youth predominate, and must work each day to earn a few more hours of life, which they must also use to pay for everyday necessities, as time has replaced money as currency. The rich live in the luxurious New Greenwich, where the middle-aged and elderly predominate, though they look young because they have stopped aging at 25 years old as well.28-year-old factory worker Will Salas (Justin Timberlake) lives with his mother Rachel (Olivia Wilde) in the ghettos. One day, Will saves 105-year-old Henry Hamilton from suffering a time-robbery assault in a bar. Hamilton is attacked by Fortis; the elderly British mobster boss of a middle-aged gang called the Minute Men. Will rescues Hamilton, who tells him, \"For few to be immortal, many must die\", as there is essentially enough time for everyone to live a full life, but it is stockpiled for the rich to become immortal. An upset Will argues that no one should die before their time naturally ends, upon which Hamilton describes how he no longer even desires life, in saying \"Your mind can be spent, even if your body is not. We want to die. We need to.\" Hamilton explains that rich control the population of the poor by exploiting the time zone system & by raising prices and taxes, so that poor keep dying, else \"where would you put them\".Later that night, Hamilton transfers 116 years to the sleeping Will, keeping only five minutes for himself, which he uses to go and sit on a bridge over an aqueduct. As his time expires, Hamilton falls into the river below. Will arrives too late to save him. Resident police force, the Timekeepers, have various theories as to his death. A young timekeeper, Jaeger, correctly assumes Hamilton had \"timed out\", a.k.a. killed himself, but a middle-aged veteran Timekeeper, Raymond León (Cillian Murphy), is convinced he was murdered by a Dayton resident.Will visits his friend, Borel, and gives him 10 years of time, one for each year of their friendship. Will waits for his mother at a bus station, only to discover that she didn't have enough time to pay for her usual bus ride after the price suddenly increased. Faced with a 2-hour walk, she tries to find anyone who can loan her time but failing in that she runs in a panic, watching her life slip away with minutes left. Will also runs his mom's bus route to find her. They encounter each other on foot, and as she runs and leaps into his arms, her time expires, and she dies.Remembering what Hamilton told him about the inequity of the time system, Will decides to seek revenge. He leaves for New Greenwich, with over a century on his clock. It costs time to cross time zone borders & that's how the rich make sure that the poor never cross over into their zones. Upon arrival, he enters a casino, where he meets an old millionaire, time-loaning businessman Philippe Weis and his daughter Sylvia (Amanda Seyfried). Sylvia has observed Will's arrival in Greenwich and became further intrigued at the gambling table, where Will beats her father in poker betting practically his entire time. She invites Will to a party at her father's mansion.At the mansion, Will is apprehended by León, who confiscates all of his time, spare two hours. Will then escapes by taking Sylvia hostage. Returning to the ghetto with her, he drives into an ambush of Fortis, who, in disappointment to find that the unconscious Will lost all of Hamilton's time, steals most of Sylvia's, failing to take the last half hour as the approach of Timekeepers forces him to leave. Will returns to consciousness and gives Sylvia some of his remaining time so they can return to his old neighborhood. They first visit Borel to retrieve some time Will gave him earlier, only to find out from Borel's grief-stricken wife, Greta, that he drank himself to death with 9 years on his clock. Sylvia pawns her jewelry for the meager price of 2 days. Finding themselves a shelter, Will calls Weis demanding a 1,000 years' ransom for Sylvia, to be distributed to the people of the ghetto. León traces Will's location from his phone call, and heads to Dayton in pursuit.Will discovers that Weis did not pay the ransom, but decides to let Sylvia go regardless. León appears to arrest Will but is shot in the shoulder by Sylvia. Will transfers two hours of time to the disarmed Leon so he can walk out of Dayton before he \"times out\". Will and Sylvia escape in León's patrol car and use it to steal a limo. Later, Will tells her that she still has a chance to walk away from the situation, but she says there is no purpose to the life she once had in New Greenwich. They begin a series of Time Bank robberies, stealing Time Capsules which store time equivalents and distributing them to the poor, getting a bounty of 10 years on their heads. Fortis eventually tracks down Will and Sylvia a second time, and challenges Will to a Time Fight. Will uses the technique he learned from his late father to defeat Fortis.Will and Sylvia realize their previous efforts were futile, as the rich have the power to simply increase the cost of living in the ghettos to maintain the status Quo. They succeed in stealing a million years from Weis' private headquarters in a Time Capsule, Will informing Weis in the process that nobody should be immortal if even one person has to die. As they return to Dayton, Leon crashes his car into Will's, but Will is able to hand the Time Capsule to a young girl who then distributes the time among the people.León eventually catches up with Will and Sylvia outside the city, holding them at gunpoint. Having noticed that León behaves differently from the other Timekeepers, Will correctly guesses that Leon was himself from the ghettos once, but managed to successfully circumvent the system. Will jokingly asks León to return some of the time he previously loaned him so that they can survive until their executions, but Leon realizes that he had neglected to replenish his own time before going after them and dies. Will and Sylvia are left with seconds to live. Will runs to León's car and takes his allotted time. In a scene mirroring his mother's death, Will transfers the time to Sylvia seconds before she is about to die.Will and Sylvia continue robbing banks as part of their efforts to crash the system, now with a bounty of 100 years on their heads, while the rich attempt to cope with the sudden surge of people who now have enough time to change zones arriving from the ghettos. A news broadcast shows the factories, in which Will once worked, are no longer in action. Factory workers, now rich with Time, cross Time Zones while the Timekeepers look on.The last scene shows Will and Sylvia preparing to rob an obscenely huge Time Bank and continue disrupting the system.",
	"links": [
		"https://www.amazon.com/In-Time/dp/B006IVNJ1C"
	]
}