{
	"title": "Ready Player One",
	"release_year": "2018",
	"runtime": "140",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Tye Sheridan",
		"Tye Sheridan",
		"Olivia Cooke",
		"Olivia Cooke",
		"Ben Mendelsohn",
		"Lena Waithe",
		"Lena Waithe",
		"T.J. Miller",
		"Simon Pegg",
		"Simon Pegg",
		"Mark Rylance",
		"Mark Rylance",
		"Philip Zhao",
		"Win Morisaki",
		"Hannah John-Kamen"
	],
	"staff": [
		"Steven Spielberg",
		"Zak Penn",
		"Ernest Cline",
		"Donald De Line",
		"Dan Farah",
		"Kristie Macosko Krieger",
		"Steven Spielberg",
		"Alan Silvestri",
		"Janusz Kaminski",
		"Sarah Broshar",
		"Michael Kahn",
		"Lucy Bevan",
		"Ellen Lewis",
		"Adam Stockhausen"
	],
	"votes": 496569,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzVkMTgzODQtMWIwZC00NzE4LTgzZjYtMzAwM2I5OGZhNjE4XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 2045, many of Earth's population centers have become slum-like cities. To escape their desolation, people engage in the virtual reality world of the OASIS (Ontologically Anthropocentric Sensory Immersive Simulation), where they can engage in numerous activities for work, education, and entertainment. Users have discovered Anorak's Quest inside OASIS, a game programmed by the late OASIS creator, James Halliday (Mark Rylance). The first to find the Easter egg, locked behind a gate requiring three keys within Anorak's Quest is promised full ownership of OASIS among other gifts. This has attracted a number of Gunters (\"egg hunters\") to play the game. Innovative Online Industries (IOI), a video game conglomerate and manufacturer of most of the virtual reality equipment used to access the OASIS, also wants ownership. The new CEO of the company, Nolan Sorrento (Ben Mendelsohn), has amassed an army of debt-indentured players, known as \"Sixers\" (due to their six-digit identification), to seek the prize. However, to date, no one has managed to finish the first quest, a vehicle race across an ever-shifting version of New York City.Wade Watts (Tye Sheridan), an orphaned, 20-year-old Gunter, lives in a Columbus, Ohio, slum with his aunt. In the OASIS, Wade goes by his avatar Parzival, and has partnered with Aech, a male avatar that serves as a virtual mechanic. He later befriends well-known player Art3mis after saving her from dying in-game - referred to as being \"zeroed out\" - which would reset her avatar's character progression and remove all her goods. Wade decides to study the virtual OASIS library to learn about Halliday's personal life, hoping to find a hint to finish the race. Wade learns that Halliday felt regret when he had to accept the resignation of his partner, Ogden Morrow (Simon Pegg), over a personal falling-out, musing, \"Why can't we go backwards for once? Backwards really fast, as fast as we can - really put the pedal to the metal.\" At the next race, Wade reverses from the start line, finding a hidden, safe path to the finish line of the race. He gains the first key and a clue to the next quest. Aech and Art3mis, as well as players Daito and Sho, follow Wade to finish the quest, and the five appear atop the global scoreboards, becoming known as the \"High Five\".IOI takes interest in them, desiring to learn their real-life identities. Bounty hunter i-R0k (T.J. Miller) overhears Wade tell Art3mis his real name, disclosing it to Sorrento, who approaches Wade in an attempt to convince him to join IOI to solve Anorak's Quest, but Wade refuses. In retaliation, Sorrento has his assistant F'Nale Zandor (Hannah John-Kamen) attack Wade's slum, killing Wade's aunt and her boyfriend. Wade is rescued by Art3mis' real-life friends and is taken to a Gunter hideout in Columbus, where he meets Art3mis' player, Samantha Cook (Olivia Cooke). The two discover that Halliday had once dated Kira (Perdita Weeks), who later became Morrow's wife, and was the source of their falling-out. In the virtual OASIS archives, Wade wins a bet with its Curator regarding whether Kira's memory remains anywhere within the archives, winning a 25-cent coin and access to Halliday's memories of Kira, which turn out to be the entrance to the second quest. In a re-creation of The Shining, the High Five team each gain the second key and the clue that the last quest is in Castle Anorak on Planet Doom.Zandor discovers the Gunter hideout and kidnaps Samantha. Meanwhile, Wade is rescued by the real-life players of Aech (Lena Waithe), Daito and Sho (Philip Zhao), who have taken to hiding in Aech's van. In the OASIS, they learn that IOI has erected a force field blocking access to the castle, maintained by the Sixers, including an enslaved Samantha. Wade hacks into IOI signals into OASIS & hacks Sorrento's personal account & blackmails Sorrento into revealing Samantha's location and communication access code to free her, and sends a message to all OASIS players about IOI's activities, convincing millions to join their side. With Aech, Daito, and Sho leading the players, Samantha is able to shut down the field, by accessing the real world IOI war room as a Sixer and allowing Wade inside. Wade finds that several Sixers have found the Atari room, trying to determine which Atari 2600 game was Halliday's favorite; choosing the wrong one leads to being zeroed out after precisely one minute. Sorrento and Wade recognize the right game as Adventure, but successfully completing it causes the playing Sixer to be zeroed out.Sorrento activates the Cataclyst, after a confrontation with Wade and Sho which zeroes out all players on Planet Doom. However, the Curator's coin is revealed to be an extra life, protecting Wade's avatar. Continuing the quest, Wade deduces that the goal is not to win Adventure but to find its own Easter egg. Upon doing so, he is given the last key. Wade uses the keys to open a gate in the castle, where he is congratulated and presented with a contract by Anorak. Recognizing it as the one Morrow had to sign on his termination, Wade declines. Anorak transforms into a projection of Halliday, who reveals that this was a final test, which centered around his biggest regret in his life. Halliday offers Wade the opportunity to wipe out the OASIS with the Big Red Button if he considers it for the best, and otherwise awards him with the Golden Egg, granting Wade control of OASIS.Sorrento and Zandor are arrested, and IOI's indentured servitude division removed, heavily restructuring the company. Wade shares control of OASIS with the other members of the High Five. Morrow offers to help consult on a salary of 25 cents, while revealing he had been the OASIS' Curator all along. The High Five decide to have OASIS shut down twice a week, to coax people into spending more time in experiencing and fixing problems in the real world, while Wade and Samantha form a romantic relationship and move in together",
	"links": [
		"https://www.amazon.com/Ready-Player-One-Tye-Sheridan/dp/B07BDQP6CH"
	]
}