{
	"title": "Super 8",
	"release_year": "2011",
	"runtime": "112",
	"tags": [
		"Action",
		"Mystery",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Elle Fanning",
		"AJ Michalka",
		"Kyle Chandler",
		"Joel Courtney",
		"Jessica Tuck",
		"Joel McKinnon Miller",
		"Ryan Lee",
		"Zach Mills",
		"Riley Griffiths",
		"Gabriel Basso"
	],
	"staff": [
		"J.J. Abrams",
		"J.J. Abrams",
		"J.J. Abrams",
		"Bryan Burk",
		"Steven Spielberg",
		"Michael Giacchino",
		"Larry Fong",
		"Maryann Brandon",
		"Mary Jo Markey",
		"April Webster",
		"Alyssa Weisberg",
		"Martin Whist"
	],
	"votes": 370073,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjIzNjEyMzcwOF5BMl5BanBnXkFtZTcwMTkyMjE0NQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The film starts in February of 1979, at a steel plant in Lillian, Ohio. Elizabeth Lamb (Caitriona Balfe) has been killed in an accident. Though their family and friends are sad for her husband, Deputy Jackson Lamb (Kyle Chandler), their main concern is Joe Lamb (Joel Courtney), Elizabeth and Jackson's son. Jackson blames Louis Dainard for his wife's death and forces him out of the house and puts him in his squad car. As Joe watches his father take Louis away, his gaze shifts to a silver locket in his hand.During summer, Joe's friend Charles (Riley Griffiths) has been shooting a Super 8 film for a film festival & has gotten Alice Dainard (Elle Fanning) for the part of wife of a detective. Later that evening, Joe goes to meet Charles and the rest of their crew: Cary (Ryan Lee), Preston (Zach Mills), and Martin (Gabriel Basso). Alice shows up in her Dad's Buick Skylark. The group arrives at the Lillian Train Station, where Charles intends to shoot a scene with Martin as the detective of his story, trying to get his wife (aka Alice) to leave because of a zombie infection. Joe is smitten with Alice, who delivers a performance that brings her to tears. The boys are snapped by the sound of an approaching train. Charles demands they start filming again ASAP so they can put the train into their film and increase the 'production value.'As they film the scene of the train thundering past the station, Joe catches sight of a white truck turning onto the tracks. The truck hits the train, causing a massive (and explosive) derailment. The gang runs for cover, and luckily survive. Joe hears something pounding loudly on one of the derailed train cars right before the door flies off.\nSurveying the wreckage, they come across some strange white cubes (Joe takes one) and find the wreckage of the truck. Inside, they find the body of one of their local science teachers, Dr Woodward (Glynn Turman). Joe removes a map from the doctor's hand. Everyone is shocked when he pulls a gun, he threatens them to keep quiet.Fearful of being caught, they recover Charles' Super 8 camera, and quickly drive off. Next day Charles and Joe drop off the film for development. Joe insists he will help Charles finish the film, offering his Dad's video camera. However, Charles believes that Alice will not want to help them after the night before.\nJoe goes over to Alice's house to convince her to help them finish the film. Her dad, Louis, demands that Joe stay away from the family's home and Alice. Seeing that her father is somewhat drunk, she agrees to help Joe and his friends.The gang then goes out to the scene of the train-crash. During the filming, Joe notices that the train features Air Force insignia. Later at a restaurant, he peruses over the map that Dr Woodward had in his possession, noting a red line drawn in, snaking across the country.\nJackson goes to the train-wreck site looking for answers. However, the clean-up crew or their superior, General Nelec (Noah Emmerich), is not willing to tell him anything, other than the cargo and clean-up is not hazardous. Jackson notes the government men picking up little white cubes and making plaster casts of some tire tracks in the ground.The next day, the town devolves into a state of crisis, as Sheriff Pruitt (Brett Rice) goes missing. His wrecked vehicle is found near a gas station, with its windows smashed in and the attendant also missing. Jackson also receives reports of missing people, dogs and electrical equipment. While some report missing household items like microwaves, the oddest thing are missing electrical lines and engines straight out of vehicles!Jackson soon grows concerned when the Military begins to roll into Lillian. Jackson has the other officers tune their radios into the military frequency, and soon hears word of something code-named \"Operation: Walking Distance.\" Jackson finds the Military moving stuff out of Dr Woodward's home. Finding General Nelec at the site, Jackson again demands answers. When he doesn't get any, he mentions 'Operation: Walking Distance.' This causes Nelec to agree to meet with Jackson later on that evening at a nearby airfield.Jackson goes to the airfield to meet with General Nelec, only to be placed under arrest and locked away.\nAlice comes to Joe's home & Alice tries to convince Joe that Louis is not a bad man, Joe agrees. Their attention is drawn to the strange white cube Joe picked up at the crash site. As they watch, it begins to vibrate, before shooting through a nearby wall, leaving a hole behind!\nAt home, Louis is drunk & Alice escapes her on her bike & chased by her dad in car. Alice is abducted by a creature after Louis crashes the car. The next day, Charles & Joe examine the film, & they see parts of a strange creature emerging from one of the wrecked train cars. As they wonder what it was they just saw, air raid sirens begin to go off.They emerge outside to find the town being evacuated, with everyone being asked to report to the local Military base. Joe and Charles get on a bus and are transported to the base. There, Charles is reunited with his family, while Joe goes to look for his Dad. He instead finds Louis, who tells Joe that he saw Alice being taken away by a creature, but nobody believes him.Joe rounds up Charles & his friends & bribes the town camera store owner to get back into town to rescue Alice. They go to Dr Woodward's (In a separate shot Nelec is shown talking to Woodward about how Woodward was part of the team that worked on the creature) storage area at school & find several films, tapes, records & notes. Through the materials, they learn that the creature landed on Earth in his craft in 1958 is a underground dweller and wants to just go home.However, General Nelec was more intent on keeping the creature for Army purposes. Nelec tortured the creature for military benefit, which turned it against all humans when to begin with he was very sophisticated. They also found its ship contained technology that when disassembled, 'shattered' into the little white cubes that the group saw at the crash site. Due to Woodward's interactions with the creature, he was able to gain a telepathic link to it, and notes in his findings that due to the hostilities directed towards it, it has grown hostile in nature to humans as well. The boys are soon found by Nelec and his men.The boys are put on a Military bus and are headed back to the base when the creature attacks the bus. The boys manage to escape while the creature attacks the other Military Officers and kills General Nelec.\nJackson has managed to escape his captors, and finds one of Joe's friends, and after hearing of Joe's plans to rescue Alice, finds her father and takes him along. Louis explains that he came to the Lamb's house after the funeral to apologize. Jackson also quietly forgives him.\nThe boys suddenly find themselves in the middle of a war zone, as tanks and other Military weaponry are going haywire, firing random shots and destroying property. As the boys attempt to escape, Martin is injured. Charles stays behind to tend to his wounds, as Joe and Cary rush off to the cemetery.Joe tells Cary about the strange things he saw and heard from the garage. Breaking down a door, they find a large hole, dug down several stories deep. Climbing down, they across the creature's lair under the town's water tower, which houses all sorts of mechanical parts, including the missing items from the townspeople. As they watch, they see several people strung from the ceiling, including the missing Sheriff, as well as Alice! Before they can rescue her, they catch a glimpse of the creature, who is eating the limb of another human!Joe directs Cary to create a distraction using the fireworks in his backpack. This causes the distraction that Joe needs as the creature heads down the tunnel towards the loud sounds. Joe manages to save Alice, as well as the Sheriff. Suddenly, the creature comes up behind them, snatching the Sheriff and the other woman into the darkness.Joe, Alice, and Cary run, but are soon at a dead end. The creature has them cornered, but Joe stands before it, reasoning with it. The creature acts hostile at first, but even in the face of its bizarre appearance, Joe does not react hostile like the previous treatment it has known.\nThe three return to the surface, and congregate near the water tower. As they do, all sorts of mechanical objects in the area become magnetized to the water tower's top area. Truck trailers nearby that also contained the recovered white cubes burst open, and the cubes begin to form around the edges of the water tower as well.During the spectacle, Jackson and Louis come across their children, and both families reconcile as the creature ascends the water tower. As they watch, the locket in Joe's pocket attempts to fly away. Joe catches it, and we see what it was inside the whole time: a picture of Joe's Mom and him as a baby. Joe finally 'let's go' of his Mom, and the locket flies up to the magnetized water tower, where he metallic objects and the white cubes morph into a spaceship. The creature climbs aboard, as the top of the water tower disappears, raining down its watery contents on the people below.Everyone watches as the ship ascends into the sky.-Extras over the Film Credits*\nOver the film's credits, we see that Charles has completed his movie, titled 'The Case.' The Super 8 film consists of a detective investigating a rash of zombie appearances that seem linked to a company called 'Romero Chemicals.' The head of the company denies any wrong doing, but the detective feels something is amiss. He attempts to send his wife away to keep her safe, but she refuses. While at the train station, they witness a train derailment (the footage captured on their camera replaced by model trains from Joe's collection). The detective soon encounters a doctor who has an antidote to the zombie disease, but only enough for one person. As he attempts to administer it to a captured zombie, the detective watches as the zombie bites into the doctor.After killing the Zombified Doctor, the detective returns home, only to find his wife has become a zombie! He stabs her in the neck with the antidote. It appears that it has not worked, and he prepares to kill his wife. However, suddenly she returns to normal, and the two embrace.",
	"links": [
		"https://www.amazon.com/Super-8-J-J-Abrams/dp/B0D4RQZPZ9"
	]
}