{
	"title": "Now You See Me",
	"release_year": "2013",
	"runtime": "115",
	"tags": [
		"Crime",
		"Mystery",
		"Thriller",
		"amazon"
	],
	"rating": 7.2,
	"actors": [
		"Jesse Eisenberg",
		"Common",
		"Mark Ruffalo",
		"Woody Harrelson",
		"Isla Fisher",
		"Dave Franco",
		"Mélanie Laurent",
		"Morgan Freeman",
		"Michael Caine",
		"Michael Kelly"
	],
	"staff": [
		"Louis Leterrier",
		"Ed Solomon",
		"Boaz Yakin",
		"Edward Ricourt",
		"Bobby Cohen",
		"Alex Kurtzman",
		"Roberto Orci",
		"Brian Tyler",
		"Mitchell Amundsen",
		"Larry Fong",
		"Robert Leighton",
		"Vincent Tabaillon",
		"Carmen Cuba",
		"Peter Wenham"
	],
	"links": [
		"https://www.amazon.com/Now-You-See-Louis-Leterrier/dp/B0D24PSHP5"
	],
	"votes": 717741,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTY0NDY3MDMxN15BMl5BanBnXkFtZTcwOTM5NzMzOQ@@._V1_QL75_UX190_CR0,7,190,281_.jpg",
	"description": "Magicians J. Daniel Atlas, Merritt McKinney, Henley Reeves, and Jack Wilder each receive mysterious tarot cards that lead them to a New York City apartment. Inside, they discover advanced holographic technology and detailed instructions from an unknown benefactor.One year later, the four perform as \"The Four Horsemen\" in Las Vegas, sponsored by insurance magnate Arthur Tressler. Their grand finale involves \"teleporting\" an audience member into the Crédit Républicain bank vault in Paris. The vault's money appears to be sucked into its air vents and showered over the Las Vegas audience. Meanwhile, the Paris vault is found empty, with its contents missing.FBI agent Dylan Rhodes and French Interpol agent Alma Dray investigate and arrest the Horsemen but are forced to release them due to insufficient evidence. Unbeknownst to the authorities, the Horsemen had replaced the vault's money with flash paper designed to resemble cash. The heist was prey-planned, involving the hypnosis of the audience participant, who unwittingly helped execute the trick. His credit card was used to forge his signature on the real vault's access card.The FBI enlists Thaddeus Bradley, a former magician turned magic debunked, to help uncover the Horsemen's methods. Meanwhile, the magicians move to their next performance in New Orleans, where they transfer millions from Tressler's private accounts to audience members who were victims of his company's denial of Hurricane Katrina insurance claims. Despite Rhodes's attempts to capture them, the Horsemen escape.Angered by the heist, Tressler hires Thaddeus to expose the magicians. Alma begins to suspect that the Horsemen are connected to \"The Eye,\" a mythical secret organization of magicians who use their skills to fight injustice.The Horsemen stay ahead of the FBI by swapping Dylan's phone with a bugged clone. Following a lead, the FBI tracks them to the New York apartment. While three Horsemen escape, Jack remains behind to destroy evidence. In the ensuing car chase, Jack seemingly dies in a fiery crash. Rhodes recovers documents pointing to their next target: a safe belonging to Elkhorn Manufacturing.The FBI rushes to Elkhorn's warehouse but discovers the safe has already been taken. It is intercepted by a hypnotized FBI agent and opened, only to reveal a decoy filled with balloon animals. At their final show at 5 Pointz, the Horsemen bid farewell to their audience. They leap off the roof and vanish in a shower of counterfeit money as Alma stops Dylan from shooting them.Meanwhile, the real Elkhorn safe is found in Thaddeus's car, leading to his arrest as a presumed accomplice. Dylan visits Thaddeus in jail, where Thaddeus deduces that Dylan is the true mastermind behind the Horsemen's heists. Dylan used the elaborate plans to manipulate the FBI and frame Thaddeus.It is revealed that Jack faked his death using a decoy car and a stolen cadaver. He broke into the real Elkhorn safe, which had been hidden behind a massive mirror. The Horsemen successfully tricked the FBI and planted the stolen money in Thaddeus's car. Later, at Central Park's carousel, the Horsemen meet Dylan, who officially inducts them into The Eye.In Paris, Dylan meets Alma at the Pont dies Arts. She has deduced his involvement with the Horsemen. Dylan confesses that he orchestrated the heists as revenge for his father, Lionel Shrike, a magician whose career Thaddeus ruined. Shrike died decades earlier in a failed escape trick due to a faulty Elkhorn safe. Dylan reveals that each target-Crédit Républicain, Tressler's company, and Thaddeus-was chosen as part of his plan to avenge his father's death. Alma, harboring feelings for Dylan, promises to keep his secret."
}