{
	"title": "Anatomie d'une chute",
	"release_year": "2023",
	"runtime": "151",
	"tags": [
		"Crime",
		"Drama",
		"Thriller",
		"amazon"
	],
	"rating": 7.7,
	"actors": [
		"Sandra Hüller",
		"Swann Arlaud",
		"Milo Machado-Graner",
		"Antoine Reinartz",
		"Samuel Theis",
		"Jehnny Beth",
		"Saadia Bentaïeb",
		"Camille Rutherford",
		"Anne Rotger",
		"Sophie Fillières"
	],
	"staff": [
		"Justine Triet",
		"Justine Triet",
		"Arthur Harari",
		"Marie-Ange Luciani",
		"David Thion",
		"Simon Beaufils",
		"Laurent Sénéchal",
		"Cynthia Arra",
		"Emmanuelle Duplay"
	],
	"votes": 148649,
	"cover": "https://m.media-amazon.com/images/M/MV5BYTk3MjFkZmQtMThiYi00N2JhLTk2YzItZTE5ZGUxZTIyZDVkXkEyXkFqcGc@._V1_QL75_UY281_CR1,0,190,281_.jpg",
	"description": "In an isolated mountain chalet near Grenoble, Samuel Maleski is playing music in his attic so loudly that his wife, German novelist Sandra Voyter, asks to reschedule with the female student interviewing her. Their visually impaired son, Daniel, returns from a long walk with his guide dog Snoop to find Samuel dead below his attic window.Talking to an old friend, lawyer Vincent Renzi, Sandra says the fall must have been accidental. When Vincent says the court will not believe that, Sandra tells Vincent about Samuel's attempt to overdose on aspirin six months earlier, after having gone off antidepressants. Vincent notes a bruise on her arm, which she tells him resulted from bumping into a countertop.Daniel tells the police that his parents were having a calm talk when he left the house but gives conflicting accounts of exactly where he was standing. This, combined with an autopsy revealing Samuel's head wound occurred before his body hit the ground, blood spatter, and an audio recording Samuel made of a fight he and Sandra had the day before he died, prompts an indictment.During the trial, Sandra's defense team claims Samuel fell from the attic window and hit his head on a shed, while the prosecution's theory is that Sandra hit him with a blunt object and pushed him from the third-floor balcony. During a courtroom argument with Samuel's psychiatrist, Sandra admits her resentment towards Samuel due to his partial responsibility for the accident that led to Daniel's impaired vision.In the recorded fight, Samuel accuses Sandra of plagiarism, infidelity, and exerting control over his life. The protracted argument turns physically violent, but it is unclear who is hitting whom. The prosecution claims that all the violence was coming from Sandra. She says that she had thrown a glass at a wall and slapped Samuel's face, that the bruises on her arms were due to Samuel grabbing her, and that the rest of the violence heard was Samuel beating on himself.After Sandra admits to having had an affair with a woman the year before Samuel's death, the prosecution argues that Samuel's loud music indicated jealousy over Sandra's flirting with the interviewer, leading to a physical confrontation where the prosecution claims Sandra killed him. The prosecutor notes her pattern of writing personal conflicts into her stories and how murdering Samuel could mirror a minor character's thoughts from her most recent novel.Sandra protests that one audio recording does not remotely represent the nature of their marriage, nor do the words of a character in one of her novels reflect her own inclinations. Disturbed by what has transpired, Daniel insists on testifying before closing arguments the following Monday, and the judge lays strict ground rules to prevent anyone from influencing Daniel's testimony, including bringing in a court monitor, Marge, and demanding that all conversations must be held in French, in spite of Sandra's struggles with the language.Daniel then asks that Sandra leave their house for the weekend so he can be alone with Marge and Snoop. After hearing Sandra's testimony about Samuel's aspirin overdose, Daniel has remembered that Snoop became sick at that time and now suspects that Snoop ate some of Samuel's vomit. He deliberately feeds Snoop aspirin and finds it has the same effect, which aligns with Sandra's testimony.Daniel confides to Marge his anguish over trying to determine the truth, and she advises him that sometimes when we do not know what is really true, we can instead just decide what's true for us. On the witness stand, Daniel says that if his mother did this, he cannot understand it, but if his father did it, he can. He testifies that when he and Samuel were driving Snoop to the veterinarian, his father spoke to him about the need to be prepared that those he loves will die and to know that his life will go on, which Daniel now sees as Samuel's own suicidal thoughts.Sandra is soon acquitted after Daniel's testimony. When she comes home, Daniel tells her he was afraid of her homecoming and she says that she was too; the two embrace. As Sandra heads to bed, she lingers at a photo of her and Samuel before falling asleep with Snoop.",
	"links": [
		"https://www.amazon.com/Anatomy-Fall-Sandra-H%C3%BCller/dp/B0CK3XWWX2"
	]
}