{
	"title": "The Maze Runner",
	"release_year": "2014",
	"runtime": "113",
	"tags": [
		"Action",
		"Mystery",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.8,
	"actors": [
		"Dylan O'Brien",
		"Kaya Scodelario",
		"Will Poulter",
		"Thomas Brodie-Sangster",
		"Aml Ameen",
		"Ki Hong Lee",
		"Blake Cooper",
		"Dexter Darden",
		"Chris Sheffield",
		"Joe Adler"
	],
	"staff": [
		"Wes Ball",
		"Noah Oppenheim",
		"Grant Pierce Myers",
		"T.S. Nowlin",
		"James Dashner",
		"Marty Bowen",
		"Wyck Godfrey",
		"Ellen Goldsmith-Vein",
		"Lee Stollman",
		"John Paesano",
		"Enrique Chediak",
		"Dan Zimmerman",
		"Denise Chamian",
		"Marc Fisichella"
	],
	"votes": 520004,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjUyNTA3MTAyM15BMl5BanBnXkFtZTgwOTEyMTkyMjE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "A boy wakes up inside a rusty elevator with no memory of who he is. He is greeted by a group of boys in a large grassy area called The Glade. It is surrounded by tall, stone walls. Beyond its wall is a vast maze. Every month, a new boy and supplies arrive in the elevator.The group leader is Alby (Aml Ameen) who tells the boy that he will soon remember his name. Newt (Thomas Brodie-Sangster), second in command, explains that the surrounding Maze is the only way out of the Glade. During the day, designated Runners search for an escape route, returning before nightfall when the Maze entrance closes. No one has ever survived a night in the Maze. Shortly after the boy tries to leave the Glade by entering the Maze but is stopped by Gally. Newt tells the boy that the people in the Glade have been trying to find a way out of the Maze for 3 years now. The Maze changes shape every night which makes it difficult for the Runners to track & find an escape route.The boy gets in a fight with Gally (Will Poulter) and suddenly remembers that his name is Thomas (Dylan O'Brien).\nLater, Thomas is attacked by Ben (Chris Sheffield), a Runner who was stung by a Griever, a deadly techno-organic creature that roams the maze at night. Ben is forced into the Maze by all the other occupants of the Glade, to die as his infection is contagious & if Ben is allowed to stay in the Glade, he will end up killing many more. Newt tells Thomas that Alby was the first person to arrive in the Glade & spent a full month alone, before he saw another person coming thru the elevator.Minho, a Runner, and Alby attempt to retrace Ben's steps in the maze, but Alby is stung. Minho appears at dusk, dragging Alby, but they are unable to reach the entrance before it closes. Thomas runs into the maze to help. All three survive the night, with Thomas killing a Griever by trapping it in the shifting boulders of the Maze. They return to the Glade the next day with Alby, astonishing the other boys.Gally is upset that Thomas may have jeopardized the fragile peace between the boys and the Grievers, but Newt makes Thomas a Runner. Thomas, Minho and a few others go into the maze. They remove a beeping mechanical device from inside the dead Griever's corpse. It is numbered to correspond to a certain section in the maze. The next morning, a girl arrives in the elevator. She apparently recognizes Thomas; however, Thomas does not know her. A note says she is the final one that will be sent. The girl, named Teresa (Kaya Scodelario), carries two syringes filled with a mysterious substance. One is used on Alby, and he gradually recovers from the Griever sting and begins regaining his memories. He tells Thomas that he remembers him & that he was \"their\" favorite. He wonders why Thomas was sent down to the Glade in the first place and laments that none of them were going to leave alive.Teresa recounts her dreams to Thomas & they are exactly the same & turns out not to be dreams at all. They both remember being under water with some sort of procedure being performed on them, with a woman in the background saying, \"wicked is good\".\nMinho shows Thomas a map-model of the Maze he has built. He says that he himself has explored every inch of the Maze & that there is no way out. But with the mechanical device, they may be able to find an escape route. Minho and Thomas venture back into the maze and discover a possible way out, but they barely make it back to the Glade.That night, the wall remains open, and a wave of Grievers pour in. Alby and many others are attacked & taken away. The Grievers retreat only after they take away Alby. Thomas stabs himself in the leg with a severed stinger (& cured by the 2nd syringe that Teresa had brought on her person) and remembers that he and Teresa were part of the organization that created the Maze, and that all of this was a test. The test started when all of them were kids & the organization gave them small puzzles to test their aptitudes. Until one day when the grown boys started disappearing one by one, starting with Alby. Now Thomas realizes that they were being sent into the Maze. Gally attempts to execute them, but the other Gladers stop him. Most follow Thomas through the maze's escape route.The group enter a lab strewn with dead scientists. A video recording of a woman, Eva Page from WCKD (World Catastrophe Kill Zone Department) explains that the planet has been devastated by increased solar activity, followed by a global pandemic that attacked the brain. The Gladers were an experiment researching the resistance of the new generation to the pandemic, to study what made them resist the virus & how was their brain different to any normal human brain. At the end, she shoots herself as the lab is attacked by gunmen.Gally suddenly appears with a gun. He is delirious from a Griever sting; he insists they must not leave the maze and proceeds to shoot Thomas. He is saved by Chuck--who sacrifices himself by jumping in front of Thomas--and Minho, who impales Gally with a spear. Armed masked men rush in to take the group away to a helicopter, though Thomas resists.As they fly over the maze, it is revealed to be in a vast desert. The helicopter approaches the ruins of a city buried in sand. The dead scientists are alive, stating that the experiment has been a success; the survivors are now entering Phase Two.",
	"links": [
		"https://www.amazon.com/Maze-Runner-Dylan-OBrien/dp/B00NQFFS5I"
	]
}