{
	"title": "Killing Them Softly",
	"release_year": "2012",
	"runtime": "97",
	"tags": [
		"Crime",
		"Drama",
		"Thriller"
	],
	"rating": 6.2,
	"actors": [
		"Brad Pitt",
		"Ray Liotta",
		"Richard Jenkins",
		"Scoot McNairy",
		"Ben Mendelsohn",
		"James Gandolfini",
		"Vincent Curatola",
		"Trevor Long",
		"Max Casella",
		"Sam Shepard"
	],
	"staff": [
		"Andrew Dominik",
		"Andrew Dominik",
		"George V. Higgins",
		"Dede Gardner",
		"Anthony Katagas",
		"Brad Pitt",
		"Paula Mae Schwartz",
		"Greig Fraser",
		"Brian A. Kates",
		"Francine Maisler",
		"Patricia Norris"
	],
	"votes": 154486,
	"cover": "https://m.media-amazon.com/images/M/MV5BODk3MDg2NDk5M15BMl5BanBnXkFtZTcwMjcxMjMzOA@@._V1_QL75_UY281_CR1,0,190,281_.jpg",
	"description": "During the American financial crisis and presidential election campaign in the fall of 2008, Johnny \"Squirrel\" Amato (Vincent Curatola) plans to rob a Mafia poker game. He enlists Frankie (Scoot McNairy), a former business associate, and Russell (Ben Mendelsohn), a heroin-addicted Australian expatriate who is stealing purebred dogs for money (by selling them in Florida). Johnny doesn't like Russell as Russell thinks Johnny is too weak to carry out this job by himself. Russell also doesn't like Johnny (He already has $5K in savings and when he has $7K, he plans to buy heroin and become a dealer), but Frankie needs the money and convinces Russell to come for the job. Johnny still has reservations about Russell and tells Frankie that Russell is likely to get nabbed.They decide to target a game run by Markie Trattman (Ray Liotta), who is known to have previously orchestrated an inside job by paying two men to rob his own illegal poker game. Squirrel anticipates that Markie will be the obvious suspect because of this, and the Mafia will simply have him killed without investigating further.\nThe mafia had sent Dillon (Sam Shepard) to interrogate Markie who holds up under questioning and survives the first time. But he is likely to be just killed the 2nd time around.Frankie and Russell, although obviously amateurs (They use dish washing gloves, and a sawed-off shotgun to carry off the heist), do the holdup and leave with the money (They clean out the house take, and then rob the gamblers too). Afterwards, a mafioso named Driver (Richard Jenkins) hires hit-man Jackie Cogan (Brad Pitt) to deal with the situation (Dillon wasn't available and he sent Jackie to meet the Driver). Although Jackie correctly intuits that Markie was not involved with the recent heist (He believes Markie is not that stupid to hit his own game twice in a row), he believes Markie still needs to die since he looks guilty, and an example needs to be made to discourage further robberies. Driver wants Jackie to beat up Markie, but he argues that Markie is dead whether he confesses or not.Jackie sends brothers Barry (Max Casella) and Stevie (Trevor Long) to kill Markie. Markie implores that he didn't do anything. Markie is given a thorough beating but maintains that he doesn't know anything about the robbery.Upon completing the crime, Russell travels to Florida to sell the dogs. While in Florida, he inadvertently informs a man named Kenny Gill (Slaine) of his involvement in the heist while trying to recruit him as a drug dealer. Kenny informs Jackie, who deduces that Russell, Frankie, and Squirrel were the perpetrators. Kenny also tells Russell that the trio have a contract out for them. Russell plans to move to Montreal. Meanwhile now Frankie knows that Russell spoke to Kenny, who knows Dillon, who knows Jackie.Jackie carries out the hit on Markie himself (after telling Driver that Markie needs to be taken out to put some fear in the other street operators who might be thinking about robbing games. Driver is not convinced since now they know Markie was not involved, but he agrees when Jackie insists that the street believes Markie hit his own game twice in a row) but brings in another hit-man named Mickey Fallon (James Gandolfini), who is on parole in New York, to kill Squirrel.\nJackie rolls up to Mickey's car at a red light and shoots him through the car window...Jackie meets Mickey who explains how he got arrested when he bought a shotgun for geese hunting, which was found in his trunk. If an old man doesn't testify that Mickey was carrying the guns for him, Mickey will do jail time. During conversation with Jackie, Mickey reveals that he has violated his parole, and doesn't seem to either care about or really comprehend the consequences; instead he goes off on drunken tangents. It becomes clear to Jackie that the respected hit-man has lost his nerve and ability to do his job.\nJackie explains to Driver how he prefers \"killing them softly\"-shooting his victims from a distance, without warning, giving them no opportunity to experience fear or despair-and that his acquaintance with Squirrel risks complicating this approach.Mickey postpones going through with his assigned hit, and instead indulges in drunkenness and sex with prostitutes in a hotel room. Jackie eventually decides to carry out the hit on Squirrel himself. He convinces Driver to arrange Mickey's arrest before the job has been completed.\nRussell is arrested on a drug possession charge and deported; meanwhile, Jackie confronts Frankie and convinces him to trade Squirrel's whereabouts for his life. Jackie has Frankie drive him to Squirrel; upon reaching Squirrel's apartment complex, he kills Squirrel with a shotgun. After confirming Squirrel is dead, Jackie has Frankie drive him to get his car several hours away. Frankie becomes very nervous and begins speeding. Unable to get Frankie to slow down, Jackie takes over driving. Once they arrive at the parking garage, Jackie shoots Frankie in the head without warning. Jackie then wipes down any fingerprints he might have left and leaves the scene.On the night of the presidential election, Jackie meets with Driver to collect his fee for the three hits. On the TV in the bar, Barack Obama is giving his election victory speech. The two argue over his fee (Jackie claims $45K for the 3 hits while Driver has paid him $30K as that's what Dillon's rate was. But Jackie argues that he got Mickey for $15K for just one hit, so that the rate), with Driver trying to pay a lesser amount and Jackie insisting on the full sum. Referring to Obama's speech, Jackie angrily declares: \"This guy wants to tell me we're living in a community? Don't make me laugh. I'm living in America, and in America, you're on your own. America is not a country; it's just a business. Now pay me.\"",
	"links": []
}