{
	"title": "Les Misérables",
	"release_year": "2012",
	"runtime": "158",
	"tags": [
		"Drama",
		"Musical",
		"Romance",
		"amazon"
	],
	"rating": 7.5,
	"actors": [
		"Hugh Jackman",
		"Russell Crowe",
		"Anne Hathaway",
		"Amanda Seyfried",
		"Sacha Baron Cohen",
		"Helena Bonham Carter",
		"Eddie Redmayne",
		"Aaron Tveit",
		"Samantha Barks",
		"Daniel Huttlestone"
	],
	"staff": [
		"Tom Hooper",
		"William Nicholson",
		"Alain Boublil",
		"Claude-Michel Schönberg",
		"Herbert Kretzmer",
		"Tim Bevan",
		"Eric Fellner",
		"Debra Hayward",
		"Cameron Mackintosh",
		"Danny Cohen",
		"Chris Dickens",
		"Melanie Oliver",
		"Nina Gold",
		"Eve Stewart"
	],
	"votes": 349003,
	"cover": "https://m.media-amazon.com/images/M/MV5BOGI0YzhkNWEtNzU1NS00OTRkLTg5ZDMtZTNkNGY1Y2U5M2EzXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1815, convict Jean Valjean (Hugh Jackman) is released on parole by prison guard Javert (Russell Crowe) after serving a nineteen-year sentence for stealing a loaf of bread and numerous escape attempts. Valjean had displayed tremendous strength & ability to motivate his fellow prisoners to do extraordinary feats in the service of the French nation. Valjean is refused employment and driven out of every town because of his paroled status. He is offered food and shelter by the Bishop of Digne, but Valjean steals his silver during the night. When he is captured by the authorities, the Bishop tells them that the silver was given as a gift, securing Valjean's release. Moved by the Bishop's grace, Valjean breaks his parole and vows to start a new life under a new identity. In doing so, Valjean violates his permanent parole terms & is under automatic warrant for arrest.Eight years later, Valjean has become a factory owner and mayor of Montreuil-Sur-Mer, while Javert (Russell Crowe) has been assigned as his new chief of police. In their initial meeting, Javert recognizes but cannot place his face, but suspects who Valjean is after witnessing him lift a heavy cart to free a trapped man. Meanwhile, Fantine (Anne Hathaway), one of Valjean's workers, is discovered by the other women working there to send money to her illegitimate daughter, Cosette (Amanda Seyfried), who lives with the unscrupulous Thenardiers (Helena Bonham Carter and Sacha Baron Cohen) and their daughter Eponine (Samantha Bark). The foreman, angry that Fantine has spurned his advances, dismisses her for promiscuity. To support her daughter, Fantine sells her hair and teeth and eventually becomes a prostitute. She is arrested by Javert after attacking an abusive customer, but is saved by Valjean, who has her hospitalized and watches over her.Later, Valjean learns that a man believed to be him has been arrested. Because of this, Javert tries to resign his duties, but Valjean refuses, saying that he only did his job. Finally unable to accept that an innocent man could be condemned in his place, Valjean reveals his identity to the court. He returns to the hospital, where he promises Fantine that he will look after her daughter before she died. Javert arrives to take Valjean into custody, but Valjean pleads for enough time to rescue Cosette. After a brief fight, Valjean jumps into a river to escape. He finds the Thenardiers, pays Fantine's debts, and leaves with Cosette, promising to be like a father to her. Valjean and Cosette flee to Paris. The Thenardiers wonder whether they demanded enough money from Valjean. After Valjean and Cosette escapes to a convent, Javert vows to bring Valjean to justice.Nine years later, there is increasing poverty in Paris. Jean Maximilien Lamarque, the only government official sympathetic towards the poor, is nearing death; a large group of young revolutionary students, known the ABC, plan a rebellion against the French monarchy. They are Marius Pontmercy (Eddie Redmayne), Enjolras, Gavroche, Grantaire, Courfeyrac, Combeferre, Joly, and Jean Prouvaire. Marius lives near the Thenardiers and Eponine, fell deeply in love with him but was merely considered his best friend.When Valjean and Cosette, now a young woman, are out giving alms to the poor, Marius catches a glimpse of Cosette and falls in love with her. The Thenardiers also see Valjean and believe that they now have their chance to extract more money from him. Valjean and Thenardier have an argument and Javert arrives in the street to break it up. Valjean and Cosette slip away before Javert can recognize them. Marius pleads with Eponine to find out where Cosette lives.At the ABC cafe, Enjolras is rallying the students when they receive word from Gavroche that Lamarque has died. Eponine leads Marius to Cosette. The two profess their love for one another, while Eponine laments that her secret love for Marius will go unrequited. Thenardier's gang arrives at Valjean's home to capture him for a reward from Javert. Eponine screams to warn Valjean and Cosette. Thenardier is enraged at Eponine's interference and slaps her. Valjean decides to flee, unaware of Cosette's desire for Marius. Cosette tries to talk him out of it, then asks him questions about her past, and his as well. Valjean refuses to tell her anything. She leaves a note for Marius to tell him why she's leaving. Eponine finds Cosette's letter to Marius, who is heartbroken at losing Cosette. He joins the revolution. Eponine joins too, disguised as a man, just to be near Marius. Enjolras urges the Parisians to full revolt.The next day, the students begin their revolt. They throw up barricades all over the city. Javert poses as a rebel in order to spy on them, but he is quickly exposed by street child Gavroche and captured. During the ensuing battle, Eponine saves Marius from blowing up the barricade at the cost of her own life. She gives Marius the letter Cosette wrote and professes her love to him before she dies in his arms.Marius asks Gavroche to deliver the letter for Cosette and it is instead given to Valjean. Valjean abandons his plans to flee the country and goes to the barricade to protect Marius. After saving Enjolras from a sniper, he is allowed to execute Javert. However, when the two are alone, Valjean frees Javert. Javert leaves, confused by this act of mercy from a criminal whom he holds in low regard.With the Parisians not joining the revolution as they expected, the students resolve to fight to the death. Everyone is killed except Marius, who is saved when Valjean drags his unconscious body into the sewers before the army arrives. Thenardier discovers Marius and Valjean and steals Marius's ring before moving on to scavenge other bodies. Valjean jumps on Thenardier and demands a way out. Thenardier show the way, and Valjean escapes the sewers carrying Marius, but is confronted by Javert. Valjean begs for one hour to take Marius to a doctor. Javert refuses and threatens to shoot him if he does not surrender. Valjean ignores him and leaves with Marius. Stunned by Valjean's mercy towards him earlier and his own mercy towards Valjean now, and unable to reconcile the conflict between his civil and moral duties, Javert jumps to his death in the Seine.Marius recovers at his rich grandfather's home without knowing who rescued him from the barricade. He mourns his friends, and Cosette comforts him. Valjean sees that Cosette and Marius are happy together and believes that his presence can only threaten their happiness. He reveals his past to Marius and tells him he must leave to ensure their safety and happiness. Marius vows that he will not tell Cosette that her father is a fugitive.Marius and Cosette marry, although Cosette is sad that Valjean is not with them. The Thenardiers attempt to crash the reception and tell Marius that they saw his father-in-law (Valjean) carrying a murdered corpse through the sewers. They plan to blackmail him to keep it quiet. As proof, Thenardier shows Marius the ring that he stole from the murder victim in the sewers.Recognizing the ring as his own, Marius realizes it was Valjean who saved his life. The Thenardiers are ejected from the wedding, and Marius and Cosette hurry off to find Valjean, who is dying in a local convent. As he perceives Fantine's spirit arriving to take him to Heaven, Cosette and Marius rush in to bid him farewell. Valjean hands Cosette a letter of his confession of his past life and joins the spirits of the Bishop, Fantine, Enjolras, Grantaire, Eponine, Gavroche, Courfeyrac, Joly and the other rebels at the holy barricade.",
	"links": [
		"https://www.amazon.com/Miserables-Hugh-Jackman/dp/B00BI5IXL4"
	]
}