{
	"title": "Moonrise Kingdom",
	"release_year": "2012",
	"runtime": "94",
	"tags": [
		"Adventure",
		"Comedy",
		"Drama"
	],
	"rating": 7.8,
	"actors": [
		"Jared Gilman",
		"Kara Hayward",
		"Bruce Willis",
		"Bill Murray",
		"Edward Norton",
		"Frances McDormand",
		"Tilda Swinton",
		"Jason Schwartzman",
		"Bob Balaban",
		"Lucas Hedges"
	],
	"staff": [
		"Wes Anderson",
		"Wes Anderson",
		"Roman Coppola",
		"Wes Anderson",
		"Jeremy Dawson",
		"Steven Rales",
		"Scott Rudin",
		"Alexandre Desplat",
		"Robert D. Yeoman",
		"Andrew Weisblum",
		"Douglas Aibel",
		"Adam Stockhausen"
	],
	"votes": 369187,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTEwMTc3NDkzOTJeQTJeQWpwZ15BbWU3MDI4NTAwNzc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1965, on an idyllic New England Island called New Penzance, twelve-year-old orphan Sam Shakusky (Jared Gilman) is attending a \"Khaki Scout\" summer camp, Camp Ivanhoe, led by Scout Master Ward (Edward Norton).Other camp attendees are Gadge (Chandler Frantz), Deluca (Robert Hadlock), Skotak (Gabriel Rush), Nickelby (Tommy Nelson), Izod (L.J. Foley), Panagle (Andreas Sheikh), Redford (Lucas Hedges) and others. Each member of the camp has specifically designated tasks.\nThe Island itself is 16 miles long, forested with old growth pine and maple trees. There are no paved roads, and mail is delivered by air. The island has miles of intersecting footpaths and dirt trails. A ferry runs 2 times day from Stone Cove.Suzy Bishop (Kara Hayward) lives on the island with her attorney parents Walt (Bill Murray) and Laura (Frances McDormand), and three younger brothers in a house called Summer's End.\nSam and Suzy met the previous summer during a church performance of Noye's Fludde and they remained pen pals over the following year.They made a secret pact to reunite the following summer and run away together. Sam sneaks away from the camp without the knowledge of Ward. Ward notices Sam's absence at breakfast the following morning and realizes that he has run away from the camp. He reports the matter to Island Police led by Captain Sharp.\nSharp calls up Sam's parents and speaks to Howard Billingsley (Lucas Hedges), who says that Sam is an Orphan and that they are his foster parents. Howard also says that Sam is not invited back to their home, as it is not fair to the other kids. Howard says that social services will be in touch for the next steps regarding Sam.\nIt is shown that Suzy's mom is having a secret affair with Police Captain Sharp (Bruce Willis).Sam brings camping equipment (canoe, air rifle, fishing tackle, 2 bedrolls and 10 pounds of sundries), and Suzy brings six books (from the library), her cat, toiletries, and a record player. They spend several days hiking and camping together in the wilderness with the goal of reaching a secluded cove on the island, which they name Moonrise Kingdom. Sam is a trained Scout and can survive in the wild by living off the land.Eventually, Suzy's parents realize that she has run away from home. Laura finds Suzy's correspondence with Sam. The parents realize that both Suzy and Sam were troubled kids and connected over letters when they shared how society does not understand them. Sam proposed that they run away, and Suzy accepted. Sharp launches a search for the kids using all of Ward's scouts.\nThe kids stick to the seldom used trails on the Island. They dance on the beach in their underwear and their young romance blossoms as they share a kiss.\nAlong the way Sam's peer scouts catch up with him & even attack him & Suzy (For some reason nobody liked Sam very much). But Sam has excellent hunting skills & Suzy is somewhat of a bad-ass, together they are able to fight the scouts off (one of the scouts is stabbed in the back with a pair of scissors by Suzy) & keep moving to remain untraceable.\nAn old teach of Sam remembers that Sam used to fascinated by one particular indigenous trail on the Island and believes that he knows where the kids are headed.Suzy's parents, the police, and the Scout master eventually find them at the cove.\nSuzy returns with her parents and is forbidden from seeing Sam again. Sam stays with police Captain Sharp (Bruce Willis) while they await Social Services (Tilda Swinton), who will place him in a \"juvenile refuge\" because his foster parents no longer wish to house him.Sharp & Scout Master Ward are worried that Social Services want to subject Sam to shock therapy due to his violent conduct, even though the incidents in his report were actually conducted by Suzy. Suzy's parents being lawyers made sure that all the blame went to Sam & he was accused of kidnapping Sam & then forcing her to participate in violence.The Scouts, who previously were not kind to Sam, later decide it is their duty to help the young lovers run away again. They believe that Sam is emotionally distant as he is a disadvantaged orphan.\nSuzy, Sam, and the other Scouts seek out the help of Cousin Ben (Jason Schwartzman), an older relative of one of the Scouts who works at the larger Khaki Scout summer camp, Fort Lebanon, run by Commander Pierce (Harvey Keitel). They enact this escape with Suzy & Sam just before a monster storm hits the island. The next morning Ward realizes his whole scout troop is missing & raises an alarm to Commander Pierce. Cousin Ben marries off Sam & Suzy in an illegal civil ceremony.As Ben prepares to take Sam & Suzy away to a safe location, they are discovered by commander Pierce, who raises an alarm. The storm strikes & Sam is hit by lightning. Pierce informs Sharp, who informs Ward & Bishops & then asks Social Services to converge on Fort Lebanon as well. The local dam at Fort Lebanon bursts & a flash flood in imminent.\nEveryone converges at the local church with social services adamant on taking Sam away & Sharp taking a stand that Sam will not be subjected to juvenile refuge. After many twists and turns, Sam and Suzy eventually are apprehended on a church steeple during a violent hurricane and flash flood. The church steeple is destroyed by lightning, but everyone survives.Sharp decides to become Sam's legal guardian, saving him from the orphanage and allowing him to remain on the island and maintain contact with Suzy. At Summer's End, Sam paints a landscape of the cove and then slips out the window as Suzy and her brothers are called to dinner.",
	"links": []
}