{
	"title": "Ender's Game",
	"release_year": "2013",
	"runtime": "114",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Harrison Ford",
		"Asa Butterfield",
		"Hailee Steinfeld",
		"Abigail Breslin",
		"Ben Kingsley",
		"Viola Davis",
		"Aramis Knight",
		"Suraj Partha",
		"Moises Arias",
		"Khylin Rhambo"
	],
	"staff": [
		"Gavin Hood",
		"Gavin Hood",
		"Orson Scott Card",
		"Orson Scott Card",
		"Robert Chartoff",
		"Lynn Hendee",
		"Alex Kurtzman",
		"Steve Jablonsky",
		"Donald McAlpine",
		"Lee Smith",
		"Zach Staenberg",
		"John Papsidera",
		"Sean Haworth",
		"Ben Procter"
	],
	"votes": 256620,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjAzMzI5OTgzMl5BMl5BanBnXkFtZTgwMTU5MTAwMDE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In the future, humanity is preparing to launch an attack on the home world of an alien race called the Formics who had attacked Earth and killed millions. Over the course of fifty years, gifted children are trained by the International Fleet to become commanders of a new fleet for this counterattack.Cadet Andrew \"Ender\" Wiggin (Asa Butterfield), a gifted boy, draws the attention of Colonel Hyrum Graff (Harrison Ford) and Major Gwen Anderson (Viola Davis) by his aptitude in simulated space combat. They order the removal of his monitor, signifying the end of the cadet program. Ender is attacked by Stilson (Caleb J. Thaggard (as Caleb Thaggard)), a student he defeated in the combat sim, but Ender fights back and severely injures him. Ender confesses his grief to his older sister Valentine (Abigail Breslin) but is harassed further by their older brother Peter (Jimmy 'Jax' Pinchak (as Jimmy Jax Pinchak)). Graff arrives to reveal he was being tested and still part of the program. Graff brings Ender to Battle School, placing Ender with other cadets his age, but treats him as extraordinary, ostracizing him from the others.Among other studies, the cadets are placed in squads and perform training games in a zero-gravity \"Battle Room.\" Ender quickly adapts to the games, devising new strategies older students have not yet seen. Graff reassigns Ender to Salamander Army, led by Commander Bonzo Madrid (Moises Arias). Bonzo is resentful of the new addition and prevents Ender from training. Another cadet, Petra Arkanian (Hailee Steinfeld), takes Ender and trains him privately. In one match, Ender goes against Bonzo's orders and working with Petra, achieves a key victory for his army.Meanwhile, Ender plays a computerized \"mind game\" set in a fantasy world aimed to present difficult choices to the player. In one situation, Ender creates a solution to overcome an unsolvable problem. Later, he encounters a Formic in the game, and then a simulated image of Valentine entering the ruins of a castle. Inside, he finds another image of Valentine but as he nears, it turns into an image of Peter before the game ends.Graff promotes Ender to his own squad, made of other students who have gained Ender's trust. They are put in increasingly difficult battles. In one match against two other teams including Bonzo's squad, Ender devises a novel strategy of sacrificing part of his team to achieve a goal, impressing Graff. Bonzo accosts Ender in the bathroom after the match, but Ender fights back and mortally harms him. Distraught over this, Ender prepares to quit Battle School, but Graff has Valentine speak to him and convince him to continue.Graff takes Ender to humanity's forward base on a former Formic planet near their home world. There, Ender meets Mazer Rackham (Ben Kingsley), who explains how he spotted the shared-mind nature of the Formics to stop the attack fifty years prior. Rackham noticed that the formic battle formations had an epicenter in one particular ship. So, he rammed his plane into the center of that ship, & that disabled the entire formic battle fleet. They also figured out that the epicenter ship had a formic queen, much like the queen in the ant world & there was perhaps another queen on the formic home world, which if killed would disable the entire formic fleet.Ender finds that his former squad members are also here to help him train in computerized simulations of large fleet combat; Rackham puts special emphasis on the fleet's Molecular Detachment (MD) Device that is capable of disintegrating matter. Ender's training is rigorous, and Anderson expresses concern that they are pushing Ender too fast, but Graff notes that they have run out of time to replace Ender.Ender's final test is monitored by several of the fleet commanders. As the simulation starts, Ender finds his fleet over the Formic home world and is vastly outnumbered. He orders most of his fleet to sacrifice themselves to protect the MD long enough to fire on the home world, which is does. The simulation ends, and Ender believes the test is over, but the commanders restart the video screens, showing that the destruction of the Formic home world was real, and Ender had been controlling the real fleet this time. Despite Graff's assurance he will be known as a hero, Ender is furious as everyone will remember him as a killer.As Ender struggles with his emotions, he recognizes one of the Formic structures nearby (on the forward base) similar to the ruined castle from the game, and believing they were trying to communicate with him, races out towards it. He follows the path set by the game and encounters a dying Formic queen who has been protecting another queen egg.Ender writes in a letter to Valentine that he is heading to deep space with the egg, determined to colonize a new Formic world with it.",
	"links": [
		"https://www.amazon.com/Enders-Game-Harrison-Ford/dp/B00HV8T8S4"
	]
}