{
	"title": "Bohemian Rhapsody",
	"release_year": "2018",
	"runtime": "134",
	"tags": [
		"Biography",
		"Drama",
		"Music",
		"amazon"
	],
	"rating": 7.9,
	"actors": [
		"Rami Malek",
		"Lucy Boynton",
		"Gwilym Lee",
		"Ben Hardy",
		"Joseph Mazzello",
		"Aidan Gillen",
		"Allen Leech",
		"Tom Hollander",
		"Mike Myers",
		"Aaron McCusker"
	],
	"staff": [
		"Bryan Singer",
		"Anthony McCarten",
		"Peter Morgan",
		"Jim Beach",
		"Graham King",
		"Newton Thomas Sigel",
		"John Ottman",
		"Susie Figgis",
		"Aaron Haye"
	],
	"votes": 603696,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTA2NDc3Njg5NDVeQTJeQWpwZ15BbWU4MDc1NDcxNTUz._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1970, \"Freddie\" Farrokh Bulsara (Rami Malek), an Indian-British Parsi is studying art at a college in London while working as a baggage handler at Heathrow Airport. At night he often goes out with friends to listen music. One night after a show at a pub, Freddie goes to find the band, Smile and notices an attractive young woman (Mary Austin) in the hallway. She tells him how to find the band and Freddie learns she works at Biba, a posh London boutique. Outside, he compliments drummer, Roger Taylor (Ben Hardy) and guitarist, Brian May (Gwilym Lee) on their performance. Learning that their lead singer, Tim Staffell (Jack Roth) just quit, Freddie offers himself as a replacement and demonstrates his vocal ability.One day Freddie is at Biba and sees Mary (Lucy Boynton). She approaches and helps him choose some clothes, complimenting him on his style. They become a couple and later move in together.\nWith the addition of Freddie as lead singer, and bassist John Deacon (Joe Mazzello), the band play gigs across Britain selling out Unis and pubs. Freddie urges the band to think bigger and record an album. After selling their van, they book time late at night in a studio to produce their debut album. While recording with experimental sounds and techniques, an A&R rep from EMI watches them. He asks RT (Roy Thomas Baker) (Tim Plester) the sound engineer for demos.Soon, Freddie changes the band's name to Queen and designs their logo. He also changes his name legally to Freddie Mercury. The band sign with John Reid (Aidan Gillen), Elton John's manager, and land a contract with EMI Records. Paul Prenter (Allen Leech), Reid's assistant manages Queen on a day-to-day basis. An appearance on Top of the Pops gives Queen a hit record, Killer Queen. After touring to promote the album, Mary and Freddie become engaged.\nThe album hits the charts in America, and, during the band's sold out U.S. tour, Freddie begins questioning his sexuality.In 1975, Queen records their fourth album, A Night at the Opera, but leave EMI when executive Ray Foster (Mike Myers) refuses to release the six-minute song \"Bohemian Rhapsody\" as the album's lead single. Freddie has DJ Kenny Everett debut the song on the radio. Despite mixed reviews, \"Bohemian Rhapsody\" becomes a smash hit. Following a world tour, Freddie begins an affair with Paul Prenter, the band's day-to-day manager. Mary breaks up with Freddie when he comes out to her as bisexual, although she assures him that he is gay.The band's success continues through to the early 1980s, but tensions arise over the direction of their music and changes in Freddie's attitude resulting from his relationship with Paul. In 1980, after a lavish party at his home, Freddie falls for Jim Hutton (Aaron McCusker), a waiter at the party. They soon part ways, with Jim telling Freddie to find him when he learns to like himself. A press conference to promote the 1982 album Hot Space is hijacked by the press, who bombard Freddie with questions about his personal life and sexuality, to which Freddie responds with insults and refusals towards the press. Meanwhile Reid brings a solo deal from CBS to Freddie, and Freddie fires him for suggesting breaking up the band. Freddie is also dismayed to find that Mary has a boyfriend called Davids. Freddie is also angry that the band decision to record a video as \"drag queens\" ends up being bad for Freddie personally.Freddie's relationship with his band-mates sours when he announces that he has signed a $4 million solo deal with CBS Records. He moves to Munich in 1984 to work on his first solo album Mr. Bad Guy and engages in gay orgies with Paul. Mary, now pregnant, visits and urges him to return to the band, as they have been offered a spot in Bob Geldof's benefit concert Live Aid at Wembley Stadium. Discovering that Paul withheld this news from him, an enraged Freddie severs ties with him. In retaliation, Paul goes public about Freddie's sexual escapades.Freddie returns to London to ask for forgiveness from his band-mates and manager Jim Beach. They are reconciled and are given a last-minute slot in Live Aid. With the outbreak of AIDS spreading worldwide, Freddie discovers that he is infected with the disease. He reveals this to his band-mates during a rehearsal, and they embrace. On the day of Live Aid, he is reunited with Hutton and Mary, and reconnects with his family with his father's Zoroastrian maxim, \"Good thoughts, good words, good deeds.\" The band perform at Live Aid, performing \"Bohemian Rhapsody\", \"Radio Ga Ga\", \"Hammer to Fall\" and \"We Are the Champions\". The Live Aid set is a massive success, helping increase the rate of donations during the event.\nThe film ends with a statement explaining Freddie Mercury's death on November 24, 1991, at 45 and how the band hosted the Freddie Mercury Tribute Concert in his honor.",
	"links": [
		"https://www.amazon.com/Bohemian-Rhapsody-Rami-Malek/dp/B07K2KJQB9"
	]
}