{
	"title": "Sausage Party",
	"release_year": "2016",
	"runtime": "89",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Seth Rogen",
		"Seth Rogen",
		"Kristen Wiig",
		"Jonah Hill",
		"Alistair Abell",
		"Alistair Abell",
		"Iris Apatow",
		"Iris Apatow",
		"Iris Apatow",
		"Sugar Lyn Beard",
		"Sugar Lyn Beard",
		"Michael Cera",
		"Ian James Corlett",
		"Ian James Corlett",
		"Ian James Corlett",
		"Michael Daingerfield",
		"Michael Daingerfield",
		"Michael Daingerfield",
		"Brian Dobson",
		"Brian Dobson"
	],
	"staff": [
		"Conrad Vernon",
		"Greg Tiernan",
		"Kyle Hunter",
		"Ariel Shaffir",
		"Seth Rogen",
		"Evan Goldberg",
		"Megan Ellison",
		"Evan Goldberg",
		"Seth Rogen",
		"Conrad Vernon",
		"Christopher Lennertz",
		"Alan Menken",
		"Kevin Pavlovic",
		"Michael Donovan",
		"Francine Maisler",
		"Kyle McQueen"
	],
	"votes": 213798,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjkxOTk1MzY4MF5BMl5BanBnXkFtZTgwODQzOTU5ODE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In a supermarket called Shopwell's filled with anthropomorphic grocery items, human shoppers are worshiped as gods who take groceries to the \"Great Beyond\" when they are purchased. Among the groceries in the store is a sausage named Frank (Seth Rogen), who has dreams of living with his hot dog bun girlfriend, Brenda (Kristen Wiig), in the Great Beyond, where they can finally consummate their relationship. Frank lives in a package and looks forward to life in the Great Beyond Brenda and their friends Carl (Jonah Hill) and Barry (Michael Cera). Barry is a deformed sausage and is made fun of by the other sausages in the packet.One day, Frank and Brenda's packages are purchased by a female shopper Camile (Lauren Miller Rogen), along with Douche (Nick Kroll) an evil feminine hygiene product.\nA returned jar of Honey Mustard (Danny McBride) claims that the Great Beyond is a lie and says that humans are not Gods, but Monsters. Honey Mustard does not want to go back to the Great Beyond but is picked up by Camile. Honey Mustard calls on Frank to seek out an old Native American bottle of liquor named Firewater (Bill Hader) before jumping out of the shopping cart to his death.\nThis creates an accidental shopping cart collision and several groceries, including Frank, to fall out. This also kills their best chance of escaping into the \"Great Beyond\". Carl and Barry are still inside the shopping cart and are taken out of the store by the shopper.Kareem Abdul Lavash (David Krumholtz) is angry at Frank for ruining his chance of escape and so is Douche (Nick Kroll). Sammy Bagel Jr. (Edward Norton) is a passive Hebrew bagel who wants peace and hates violence. Kareem swears revenge on Frank as he believed that 77 bottles of extra-virgin olive oil were waiting for him in the Great Beyond.\nKareem blames Sammy of taking over his shelf space by stealth, in an apparent reference to the Middle East conflict.Douche is damaged during the ding up (as his nozzle is bent) and is carried to the trash can by the store manager Darren (Paul Rudd). Darren is nicknamed the \"dark lord\" as he disposes of expired food and spilled items.\nIn the trash can, Douche repairs himself by drinking the juice from a damaged juice can & repairing himself with tape. He swears revenge on Frank.Seeking to verify Honey Mustard's warning, Frank leads Brenda, Sammy, and Lavash to the liquor aisle where he meets Firewater and learns that Firewater and his colleagues, the Non-Perishables including Mr Grits (Craig Robinson) and Twink (Scott \"Diggs\" Underwood) (a gay Twinkie), created the white lie of the Great Beyond to assuage the groceries' fear of being eaten.Firewater says that before the story, every grocery used to be terrified of shoppers. So, the Non-Perishables invented the Great Beyond, where the humans cared for the groceries and all dreams come true. The story of the Great Beyond made the groceries look forward to being shopped away, instead of kicking and screaming and scaring everybody else in the supermarket.While Frank enters the liquor aisle, Brenda is separated and meets Teresa Del Taco (Salma Hayek), a lesbian Taco shell who develops a lustful friendship with Brenda. Douche attacks Brenda, but she escapes with the help of Teresa.Firewater tells Frank that the proof of the God's brutality lays beyond the ice in the \"dark alley\". Frank vows to reveal the truth and is encouraged to travel beyond the store's freezer section to find proof. When Frank catches up with Brenda, he urges her to search for the proof, but Brenda does not believe Frank and urges that they should get back inside their packages and wait for the next God who would pick them up.Meanwhile at the shopper's house, Carl and Barry are horrified to see the shopper cooking the foods. Barry escapes through an open window as Carl is stabbed and sliced in half by the shopper.\nFrank goes his way & eventually reaches the cooking section behind the seafood aisle. Frank's friends disapprove of his skepticism of the Great Beyond. He finds a cookbook there which is graphic & displays all the ways in which humans cook and eat food.While Frank learns that Firewater invented the story of the Great Beyond as a noble lie, the rest of the groceries who were purchased (and made it out in the shopping cart) are horrified to watch foods being cooked and eaten.Barry escapes the house and encounters a human drug addict (James Franco), who becomes able to communicate with his groceries, one of them being Gum (Scott \"Diggs\" Underwood), a Stephen Hawking-like wad of chewing gum, after injecting himself with bath salts. The bath salts wear off and the addict prepares to cook Barry. The addict accidentally burns himself and Barry yanks his shoelaces, making him slip and causing an ax to fall and decapitate him.Frank reveals the cookbook to the rest of Shopwell's groceries. However, they choose not to believe him, lest they lose their sense of purpose, until Barry arrives and presents them the drug addict's severed head proving that the humans can indeed be killed.The group drugs the human shoppers and employees with toothpicks laced with bath salts, whereupon an epic battle begins. Several humans are gruesomely killed by the groceries while Douche takes control of the store manager Darren. He confronts Frank about becoming a god now that he is in control of Darren and takes a bite out of Frank's torso. Brenda saves Frank as Barry and the other groceries catch Douche and Darren in a garbage pail strapped to propane tanks. They are then launched out of the store as the tanks explode, killing them both. The inhabitants celebrate their victory with a massive orgy.Frank and his friends visit Firewater, who has had a psychedelic experience and discovered that their world is not what they think; they are merely animated characters voiced by actors in another dimension. Gum has constructed a portal to this dimension, and the group resolve to travel there and confront their creators.",
	"links": [
		"https://www.amazon.com/Second-Course/dp/B0CTMKCMM6"
	]
}