{
	"title": "We're the Millers",
	"release_year": "2013",
	"runtime": "110",
	"tags": [
		"Comedy",
		"Crime",
		"amazon",
		"netflix"
	],
	"rating": 7.0,
	"actors": [
		"Jason Sudeikis",
		"Jennifer Aniston",
		"Emma Roberts",
		"Ed Helms",
		"Will Poulter",
		"Nick Offerman",
		"Kathryn Hahn",
		"Molly C. Quinn",
		"Tomer Sisley",
		"Matthew Willig"
	],
	"staff": [
		"Rawson Marshall Thurber",
		"Bob Fisher",
		"Steve Faber",
		"Sean Anders",
		"John Morris",
		"Chris Bender",
		"Vincent Garcia Newman",
		"Tucker Tooley",
		"Happy Walters",
		"Ludwig Göransson",
		"Theodore Shapiro",
		"Barry Peterson",
		"Michael L. Sale",
		"Lisa Beach",
		"Sarah Katzman",
		"Clayton Hartley"
	],
	"votes": 493412,
	"cover": "https://m.media-amazon.com/images/M/MV5BNDQ0NWI1ZGEtY2NlMy00MWYyLTk4NGEtMTY5MmQ4YTcyY2E0XkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Low level marijuana drug dealer David Clark (Jason Sudeikis) is robbed of his money and stash, some of which he owes to his supplier. His boss, wealthy drug lord Brad Gurdlinger forces David to smuggle marijuana from Mexico in order to clear his debt. Realizing that one man attempting to get through customs is too suspicious, he hires a stripper stage-named Rose (Jennifer Aniston), a runaway teenage girl and thief named Casey, and his 18 year-old neighbor Kenny to pose as a bogus family called the \"Millers\".Because of the extra load of the marijuana on the RV, one of the radiator hoses breaks while going up a steep incline. A family they had encountered at the border called the Fitzgeralds, consisting of Don, Edie, and Melissa, catch up to them and tow the Millers' RV to a repair shop. On the trip to the shop, David learns that Don Fitzgerald is a DEA agent after finding his badge and gun in the glove compartment.The marijuana turns out to be stolen from Pablo Chacon's cartel. The next day, when the Millers head to the shop to pick up the RV, Chacon and his henchman One Eye are waiting for them and prepare to execute the family. They immediately tell Chacon that they aren't a real family and that they didn't know they were stealing from him. Rose is given a chance to prove that she is a stripper by dancing, and when she gets close, turns a steam vent onto Chacon.The Millers then escape in the RV, with Kenny behind the wheel. Due to Kenny's erratic driving, the RV veers off the highway and a tarantula, hiding in a bowl of fruit given to them when they picked up the marijuana, crawls up Kenny's leg and bites his testicle. As Kenny has a severe allergic reaction to the bite, the Millers head to the hospital. This further delays the delivery of the contraband, but David re-negotiates with Gurdlinger for a fee of $500,000. When Kenny is finally released, David rushes him to the RV in a wheelchair and tips him over. David inadvertently reveals how much he is getting paid, in comparison to how little he offered to pay each of the others. Casey, Rose, and Kenny are left in disgust by the revelation, and so David leaves them at the local carnival.David regrets abandoning them and returns to the carnival, begging them on his knees to come back with him. On their way back to the RV, One Eye discovers them and as he is about to shoot everyone, Don Fitzgerald comes out of the camper and subdues him. Chacon then comes around the corner and is about to kill them all, but David hits Chacon and he drops his gun. Rose picks it up and accidentally shoots Chacon in the shoulder and as he is recovering, Kenny punches Chacon and knocks him out.Don arrests Chacon and One Eye and tells the Millers that he will arrest them too, but actually gives them the opportunity to leave. David delivers the drugs to Gurdlinger who tells him he's late and that their deal is off. DEA agents then crash into the room, arresting Gurdlinger. The agent in charge is Don, who tells David that he will have to be in the witness protection program until Gurdlinger's trial. He then adds that anyone that was a witness to the crime will be in protection, and David smiles. The Millers are then seen together in a beautiful home, with several marijuana plants growing in the garden.",
	"links": [
		"https://www.amazon.com/Were-Millers-Jennifer-Aniston/dp/B00FLNQBTK",
		"https://www.netflix.com/title/70270408"
	]
}