{
	"title": "Civil War",
	"release_year": "2024",
	"runtime": "109",
	"tags": [
		"Action",
		"Adventure",
		"Thriller",
		"max",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Kirsten Dunst",
		"Wagner Moura",
		"Cailee Spaeny",
		"Nick Offerman",
		"Jefferson White",
		"Nelson Lee",
		"Evan Lai",
		"Stephen McKinley Henderson",
		"Vince Pisani",
		"Justin James Boykin"
	],
	"staff": [
		"Alex Garland",
		"Alex Garland",
		"Gregory Goodman",
		"Andrew Macdonald",
		"Allon Reich",
		"Geoff Barrow",
		"Ben Salisbury",
		"Rob Hardy",
		"Jake Roberts",
		"Francine Maisler",
		"Caty Maxey"
	],
	"links": [
		"https://www.max.com/movies/civil-war/b04dd538-d36d-40da-aa25-210cdcb14748",
		"https://www.amazon.com/Civil-War-Alex-Garland/dp/B0D28GW5HL"
	],
	"votes": 157167,
	"cover": "https://m.media-amazon.com/images/M/MV5BNjJiM2Y0NmItYzEzZS00NDZhLTllYmQtOTg3OGRhMmNiY2UxXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In the near-future, a civil war has engulfed the United States. An authoritarian federal government, led by a third-term president, is embattled by secessionist movements. Despite the president claiming victory is imminent, it is widely expected that Washington, D.C. will soon be reached by the \"Western Forces\" (WF) led by Texas and California. After surviving a suicide bombing in New York City, jaded veteran war photographer Lee Smith and journalist colleague Joel meet with their mentor Sammy to share their plan to interview the isolated president. While trying to dissuade them from heading to the capital, Sammy joins them to reach the front line at Charlottesville, Virginia. The next morning, Lee finds Joel has allowed a young aspiring photojournalist whom Lee encountered at the bombing, Jessie Cullen, to join them.After departing the city, the group stops at a gas station protected by armed men. Jessie explores a nearby car wash, where she finds the men torturing two alleged looters. One of the guards follows Jessie, but Lee defuses the situation by taking a photo of the man posing with his victims. Later, Jessie berates herself for being too scared to take photos.Following an overnight stop near ongoing fighting, the group documents combat the next day as secessionist militiamen successfully assault a loyalist-held building. Lee recognizes Jessie's potential as a war photographer and begins to mentor her, while Jessie photographs the secessionists executing prisoners. The group spends the night at a refugee camp before passing through a small town where, under watchful guard, residents attempt to live in blissful ignorance of the war.Later, they are caught in a sniper battle amid the remains of a Christmas fair. Nearby snipers mock Joel's questioning what side they are fighting for or against, instead summarizing the situation as killing those trying to kill them. Jessie's nerve and photography skills improve as she becomes increasingly desensitized to violence. Jessie asks if Lee would photograph Jessie being killed, to which Lee responds in the affirmative.While driving, the four encounter two foreign reporters they know, Tony and Bohai. Tony and Jessie switch vehicles before Bohai drives off ahead with Jessie in his car. The others catch up to find the pair held at gunpoint by unknown uniformed militia who are burying civilians in a mass grave. Sammy stays behind as the other three approach to attempt to negotiate their release, but the leader of the militia executes both Bohai and Tony for not being \"American\". Sammy saves the others after he rams the group's truck into members of the militia but is mortally wounded when he is shot while fleeing afterward.Traumatized, the remaining three arrive at the Charlottesville WF base and find most of the remaining loyalists have surrendered, leaving Washington, D.C., defended only by fanatical remnants of the armed forces and Secret Service. Joel drunkenly lashes out at what he views as Sammy's pointless death, while Lee tries to console Jessie by saying that Sammy would've liked to die on the job. Lee finds herself unable to document Sammy's death, deleting a photo she took of his body.The trio embed themselves with the WF as they assault D.C., where Jessie repeatedly endangers herself during fighting to capture photographs, while Lee struggles with post traumatic stress disorder from the carnage. When the WF breaches the White House's fortified perimeter, a convoy with the presidential limousine flees but WF units eliminate the convoy, and its occupants (including the first lady) are killed. Understanding it to be a diversion, the trio heads inside with WF soldiers instead.Advancing through the largely-abandoned building filled with dead staffers (presumed to have committed suicide), an abortive attempt by a single Secret Service agent to negotiate the president's surrender and safe passage results in the death of said agent. This results in the few remaining Secret Service agents still guarding the president engaging in a firefight with the WF. Jessie steps into the line of fire while taking photos, but Lee pushes her to safety and is killed by the Secret Service while Jessie captures Lee's demise on her camera.Jessie unemotionally continues into the Oval Office, watching soldiers drag the president from under his desk and prepare to summarily execute him. Joel momentarily stops them to get a quote from the president, who replies, \"Don't let them kill me.\" Satisfied, Joel stops delaying the soldiers while Jessie photographs WF soldiers posing with the president's corpse."
}