{
	"title": "Saltburn",
	"release_year": "2023",
	"runtime": "131",
	"tags": [
		"Drama",
		"Thriller",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Barry Keoghan",
		"Jacob Elordi",
		"Rosamund Pike",
		"Richard E. Grant",
		"Archie Madekwe",
		"Sadie Soverall",
		"Richie Cotterell",
		"Millie Kent",
		"Will Gibson",
		"Tasha Lim"
	],
	"staff": [
		"Emerald Fennell",
		"Emerald Fennell",
		"Emerald Fennell",
		"Josey McNamara",
		"Margot Robbie",
		"Anthony Willis",
		"Linus Sandgren",
		"Victoria Boydell",
		"Kharmel Cochrane",
		"Suzie Davies"
	],
	"votes": 223796,
	"cover": "https://m.media-amazon.com/images/M/MV5BZjk4NGE3MWItMDRhMy00YzhiLTk0MGUtZDlkNmQxYWIxYzc2XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In late 2006, scholarship student Oliver Quick from Prescot struggles to fit in at the University of Oxford because of his inexperience with upper-class manners. He befriends Felix Catton, an affluent and popular student who is sympathetic to Oliver's stories of his parents' substance abuse and mental health issues. When Oliver becomes distraught over his father's sudden death, Felix comforts him and invites him to spend the summer at his family's country house, Saltburn.At Saltburn, Oliver meets Felix's eccentric parents Sir James and Lady Elspeth, his sister Venetia, and Elspeth's friend Pamela, as well as Felix's American cousin Farleigh, with whom Oliver has had a tense relationship as classmates at the university.Oliver quickly wins over Felix's family (except for Farleigh), and his obsession with Felix grows. One night, he watches Felix masturbating in a bathtub and lustfully drinks the semen-laced bathwater. Oliver waves to Venetia and performs oral sex on her while she is on her period. Farleigh witnesses this and informs Felix. When Felix confronts Oliver about the accusation, he claims nothing happened. At night, Oliver initiates sexual advances on Farleigh, threatening him in the process. The next morning, James evicts Farleigh after receiving a report from Sotheby's about Farleigh's intention to sell some of James's valuables.As the summer ends, Elspeth and James plan a party for Oliver's birthday. Felix surprises Oliver with a trip to see his estranged mother, causing Oliver to panic. Upon arriving at the family's house in Prescot, Felix realises that Oliver lied to him about his upbringing. Oliver's father is still alive; neither of his parents are substance abusers; and they live in a respectable middle-class suburb. Horrified and hurt by Oliver's deception, Felix decides not to tell anyone to spare his own family the humiliation, but he orders Oliver to leave Saltburn after the party. During the celebrations, Oliver seeks to make amends with Felix by expressing his adoration for him. Felix rejects him and suggests he seek help.The next morning, Felix is found dead in Saltburn's hedge maze. Oliver implies Felix's death was connected to Farleigh supplying drugs during the party, and James withdraws financial support from Farleigh and bans him from returning. Oliver mourns Felix and visits his grave alone, where he places flowers, lies naked on the grave soil, and masturbates on it.After Felix's funeral, Elspeth insists that Oliver extend his stay at Saltburn. Venetia, increasingly distraught and disturbed, accuses Oliver of destroying her family, calling him a moth, a serf and a spider. He attempts to placate her, but she eventually rebuffs him, disturbed by his growing impersonation of Felix. The next day, Venetia is found dead, having killed herself in the bathtub. Despondent over Oliver's continuing presence at Saltburn and Elspeth's closeness to him, James bribes him to leave, which Oliver accepts.In 2022, Oliver reads about James's death in a newspaper. He subsequently has what appears to be a chance encounter with Elspeth at a café. She is delighted to see him again, insisting he return with her to Saltburn. After spending several months with Oliver, Elspeth becomes terminally ill. At her deathbed, Oliver confides in Elspeth that he is responsible for the tragic events at Saltburn. He had orchestrated his meeting Felix at Oxford and even planned his encounter with Elspeth at the café, after which she bequeathed all her assets, including Saltburn, to him. Oliver comforts Elspeth and then murders her by removing her life support. Having now assumed ownership of Saltburn and the Catton family fortune, he dances happily naked around the mansion.",
	"links": [
		"https://www.amazon.com/Saltburn-Movie-Disclosed-Comprehensive-Unraveling/dp/B0CQVXJZ24"
	]
}