{
	"title": "American Hustle",
	"release_year": "2013",
	"runtime": "138",
	"tags": [
		"Crime",
		"Drama",
		"amazon"
	],
	"rating": 7.2,
	"actors": [
		"Christian Bale",
		"Amy Adams",
		"Bradley Cooper",
		"Jennifer Lawrence",
		"Jeremy Renner",
		"Louis C.K.",
		"Jack Huston",
		"Michael Peña",
		"Michael Peña",
		"Shea Whigham",
		"Alessandro Nivola"
	],
	"staff": [
		"David O. Russell",
		"Eric Warren Singer",
		"David O. Russell",
		"Megan Ellison",
		"Jonathan Gordon",
		"Charles Roven",
		"Richard Suckle",
		"Danny Elfman",
		"Linus Sandgren",
		"Alan Baumgarten",
		"Jay Cassidy",
		"Crispin Struthers",
		"Lindsay Graham",
		"Mary Vernieu",
		"Judy Becker"
	],
	"votes": 503927,
	"cover": "https://m.media-amazon.com/images/M/MV5BMGQ2NzEwZGEtYjk1MC00NWFmLTgyYTgtZmRhMTRmOTBlN2U5XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1978, con artists Irving Rosenfeld (Christian Bale) and Sydney Prosser (Amy Adams) have met, started a relationship, and are working together. Irving's basic scam was to charge $5,000 from people who needed a line of credit & couldn't get it from a bank. Of course, after taking the money, Irving would disappear. Sydney has improved Irving's scams, posing as British aristocrat \"Lady Edith Greensley\" with London Banking connections. Having Sydney pose as British royalty increases the perceived legitimacy of their operation & the profits triple in no time. They are a well-matched couple, but Irving is reluctant to leave his adoptive son with wife Rosalyn (Jennifer Lawrence), who will not divorce him.FBI agent Richard \"Richie\" DiMaso (Bradley Cooper) catches Irving and Sydney in the loan scam but offers to release them if Irving can line up four additional arrests. Sydney opposes the agreement. Richie believes Sydney is British but has proof that her claim of aristocracy is fraudulent. Sydney tells Irving she will manipulate Richie, distancing herself from Irving.\nIrving has a friend pretending to be a wealthy Arab Sheikh looking for potential investments in America. An associate of Irving's suggests that the Sheikh do business with Mayor Carmine Polito (Jeremy Renner) of Camden, New Jersey.The popular mayor is campaigning to revitalize gambling in Atlantic City but has struggled to raise the necessary funds. The scam is that Carmine will issue building permits & casino licenses to the Shiekh in exchange for a bribe. Richie is excited by netting a Mayor on corruption charges. He asks his boss Stoddard to transfer $ 2MM into a Chase account under the Sheikh's name to make him seen legit to the Mayor.Richie devises a plan to entrap Carmine despite the objections of his boss Stoddard Thorsen (Louis C.K.) and Irving. Sydney helps Richie manipulate an FBI secretary into making an unauthorized wire transfer of $2,000,000 to Carmine. When Stoddard's boss, Anthony Amado (Alessandro Nivola), hears of the operation, he praises Richie's initiative, pressuring Stoddard to continue the operation.Richie's over-eagerness to catch Carmine causes the mayor to leave their meeting. Irving convinces Carmine that the Sheikh is legitimate, expressing his dislike toward Richie, and the two become friends. Irving takes Rosalyn to dinner with Carmine & his wife & this angers Sydney off.\nRichie arranges for Carmine to meet the Sheikh at an airfield, forcing Stoddard into further expenses. Without consulting the others, Richie has a Mexican American FBI agent Paco Hernandez (Michael Peña) play the part of the Sheikh.Carmine brings the Sheikh to a casino party, telling him that mobsters are there, and it is a necessary part of doing business. Irving is surprised to see that the violent Mafia overlord Victor Tellegio (Robert De Niro), second-in-command to Meyer Lansky, is there, and wants to meet the Sheikh. Tellegio explains the business will need the Sheikh to become an American citizen, and Carmine will need to expedite the process, bribing officials if necessary. Tellegio also requires a $10 million wire transfer, to prove the Sheikh's legitimacy. Richie agrees, eager to bring down Tellegio, while Irving realizes the operation is out of control.Richie, who is attracted to Sydney, tells Sydney he loves her, but becomes confused and aggressive when she drops her British accent and admits to being American. Irving arrives to protect Sydney and tries to call off their deal with Richie. Richie says that if they back out, Tellegio will learn of the scam and murder Irving, Sydney, Rosalyn, and Danny.Rosalyn starts an affair with Pete Musane (Jack Huston), a mobster she met at the party. She mentions her belief that Irving is possibly working with the Internal Revenue Service, so Pete threatens Irving, who promises to prove the Sheikh's investment is real. Irving later confronts Rosalyn, who admits she told Pete because she feels unloved. Rosalyn agrees to keep quiet about the plan but wants a divorce.With Carmine's help, Richie and Irving entrap members of Congress into receiving bribes on videotape for agreeing to expedite the Sheikh's citizen process through an act of congress. Irving feels bad about Carmine also getting trapped in the process. He confesses to Sydney that he wants to save Carmine. Richie goes over Stoddard, convincing Amado that $10,000,000 is needed to entrap Tellegio, but only gets $2 million. A meeting is arranged at the offices of Alfonse Simone (Paul Herman), Tellegio's lawyer, but Tellegio does not show up. The operation continues, and Richie records an admission of criminal activities when the lawyer accepts the transfer.Irving visits Carmine's house and admits to the scam. Carmine blames Irving, saying he only wanted to improve New Jersey. Irving regrets the loss of his friendship. The money is missing, but an anonymous source offers to return it in exchange for immunity for Irving and Sydney and a reduced sentence for Carmine. Amado is willing to make the deal, but Richie objects. Irving suggests Richie either has the money or is incompetent for losing it. in reality, Irving had a friend pose as Tellegio's lawyer to con Richie, to give him leverage, and to keep them away from the mob. Amado accepts the deal and removes Richie from the case, dropping him back into obscurity.Irving and Sydney open a legitimate art gallery and move in together, while Rosalyn is with Pete, and shares custody of her son with Irving. The mob accepts that Irving deflected attention from them and leaves him to get on with his life.",
	"links": [
		"https://www.amazon.com/American-Hustle-Christian-Bale/dp/B00HVNZHZW"
	]
}