{
	"title": "Captain America: The Winter Soldier",
	"release_year": "2014",
	"runtime": "136",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.7,
	"actors": [
		"Chris Evans",
		"Chris Evans",
		"Samuel L. Jackson",
		"Scarlett Johansson",
		"Scarlett Johansson",
		"Robert Redford",
		"Sebastian Stan",
		"Sebastian Stan",
		"Anthony Mackie",
		"Anthony Mackie",
		"Cobie Smulders",
		"Frank Grillo",
		"Maximiliano Hernández",
		"Emily VanCamp",
		"Emily VanCamp"
	],
	"staff": [
		"Anthony Russo",
		"Joe Russo",
		"Christopher Markus",
		"Stephen McFeely",
		"Joe Simon",
		"Jack Kirby",
		"Kevin Feige",
		"Henry Jackman",
		"Trent Opaloch",
		"Jeffrey Ford",
		"Matthew Schmidt",
		"Sarah Finn",
		"Peter Wenham"
	],
	"votes": 910800,
	"cover": "https://m.media-amazon.com/images/M/MV5BNWY1NjFmNDItZDhmOC00NjI1LWE0ZDItMTM0MjBjZThiOTQ2XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Two years after the Battle of New York, Steve Rogers (Chris Evans) works in Washington D.C. for the espionage agency S.H.I.E.L.D. under Director Nick Fury (Samuel Jackson), while adjusting to contemporary society.\nRogers and Agent Natasha Romanoff (Scarlett Johansson) are sent with S.H.I.E.L.D.'s (Strategic Homeland Intervention, Enforcement and Logistics Division) counter-terrorism S.T.R.I.K.E. (Special Tactical Reserve for International Key Emergencies) team, led by Agent Rumlow (Frank Grillo), to free hostages aboard a S.H.I.E.L.D. vessel from Georges Batroc (Georges St-Pierre) and his mercenaries. Jasper Sitwell is the captain of the S.H.I.E.L.D. ship.Mid-mission, Rogers discovers Romanoff has another agenda: to extract data from the ship's computers for Fury. Georges escapes while Steve discovers what Romanoff is up to. Rogers returns to the Triskelion, S.H.I.E.L.D.'s headquarters to confront Fury and is briefed about Project Insight: three Helicarriers linked to spy satellites, designed to preemptively eliminate threats.\nRogers is not convinced and says that holding a gun on everyone on Earth cannot be called protection. He argues that the punishment should come after trial, and Project Insight is judge, jury and executioner all in one. Rogers says that Insight is not Freedom, but Fear.Unable to Decrypt the data recovered by Romanoff, Fury becomes suspicious about Insight and asks senior S.H.I.E.L.D. official Alexander Pierce (Robert Redford) to delay the project.\nRogers meets Peggy Carter (Hayley Atwell), who is now an old woman, and has had a full life with a husband and a family. Rogers meets Sam Wilson while doing his morning run, and befriends him. Sam works at the local VA center.On his way to rendezvous with Maria Hill (Cobie Smulders), Fury is ambushed by assailants led by a mysterious assassin called the Winter Soldier (Sebastian Stan). Fury escapes to Rogers's apartment and warns Rogers that S.H.I.E.L.D. is compromised. After handing Rogers a flash drive containing data from the ship, Fury is gunned down by the Winter Soldier through the window of Rogers apartment. Rogers pursues the Winter Soldier, but he gets away before Rogers can have a good look at him.\nFury dies in surgery, and Hill recovers the body. The next day, Pierce summons Rogers to the Triskelion. Pierce insinuates that Fury was the one who was controlling the pirates led by George Batroc for the stealing & sale of classified information. The sale went sour & that led to the attack & death of Fury.Pierce wants Rogers to hand over anything that Fury shared with him. When Rogers withholds Fury's information, Pierce brands him a fugitive. Rogers manages to escape from Rumlow and his team, who are revealed to be working for Pierce.\nHunted by S.T.R.I.K.E., Rogers meets with Romanoff. Romanoff knew that Rogers had hidden the flash drive in a vending machine and initially they both did not trust each other. Romanoff and Rogers realize that they are both looking for the person behind Fury's death.\nUsing data in the flash drive they discover a secret S.H.I.E.L.D. bunker in New Jersey, where they activate a supercomputer containing the preserved consciousness of Arnim Zola (Toby Jones). Zola was a scientist who had worked for the Red Skull. He transferred his consciousness into computers in 1972, after he received a terminal diagnosis.Zola reveals that ever since S.H.I.E.L.D. was founded after World War II, Hydra has secretly operated within its ranks, sowing global chaos with the goal that humanity would willingly surrender its freedom in exchange for security. Zola also reveals that Howard Stark and Fury were killed when they became obstacles to Hydra's plans. The pair narrowly escape death when a S.H.I.E.L.D. missile destroys the bunker.\nPierce also uses the opportunity to relaunch project Insight, convincing the council that Fury had delayed it as it would have exposed his own illegal activities. Pierce also engages the Winter Soldier to eliminate Rogers and Romanoff.Rogers and Romanoff enlist the help of former USAF parachute rescue specialist Sam Wilson (Anthony Mackie), whom Rogers befriended, and acquire his powered \"Falcon\" wing pack. Deducing that S.H.I.E.L.D. agent Jasper Sitwell (Maximiliano Hernandez) (Captain of the SHIELD vessel that was captured by pirates controlled by Fury) is a Hydra mole, they force him to divulge that Zola developed a data-mining algorithm that can identify individuals who might become future threats to Hydra's plans. The algorithm has access to all possible data about an individual including their bank records, SAT scores, phone calls, emails, medical records, voting records, everything.\nThe Insight Helicarriers will sweep the globe, using satellite-guided guns to eliminate these individuals. Rogers, Romanoff, and Wilson are ambushed by the Winter Soldier, who kills Sitwell. During the fight, Rogers recognizes the Winter Soldier as Bucky Barnes, his friend who was captured and experimented upon during WWII. Hill manages to extract the trio to a safe-house where Fury, who had faked his death, is waiting with plans to sabotage the Helicarriers by replacing their controller chips. Fury says that only by faking his own death could he ascertain exactly who was calling the shots at S.H.I.E.L.D.After the World Security Council members arrive for the Helicarriers' launch, Rogers broadcasts Hydra's plot to everyone at the Triskelion. Romanoff, disguised as one of the Council members, disarms Pierce. Fury arrives and forces Pierce to unlock S.H.I.E.L.D's database so that Romanoff can leak classified information, exposing Hydra's actions. Following a struggle, Fury shoots Pierce dead. Meanwhile, Rogers and Wilson storm two Helicarriers and replace the controllers, but the Winter Soldier destroys Wilson's suit and fights Rogers on the third. Rogers fends him off and replaces the final chip, allowing Hill to take control and have the vessels destroy each other.Rogers refuses to fight the Winter Soldier in an attempt to reach his friend, but as the ship collides with the Triskelion, Rogers is thrown out into the Potomac River. The Winter Soldier rescues the unconscious Rogers, before disappearing into the woods. With S.H.I.E.L.D. in disarray, Romanoff appears before a Senate subcommittee and Fury, under the cover of his apparent death, heads to Eastern Europe in pursuit of Hydra's remaining cells. Rogers and Wilson decide to track down the Winter Soldier, while Rumlow, who was a double agent for Hydra, is hospitalized following the Triskelion's destruction.In a mid-credits scene, Baron Wolfgang Von Strucker (Thomas Kretschmann), at a Hydra lab, proclaims that the \"age of miracles\" has begun as scientists examine an energy-filled scepter and two prisoners: one with superhuman speed, the other with telekinetic powers.\nIn a post-credits scene, the Winter Soldier visits a Bucky memorial at the Smithsonian Institution.",
	"links": [
		"https://www.amazon.com/Captain-America-Winter-Soldier-Theatrical/dp/B00NFQSW1U"
	]
}