{
	"title": "The Highwaymen",
	"release_year": "2019",
	"runtime": "132",
	"tags": [
		"Biography",
		"Crime",
		"Drama",
		"netflix"
	],
	"rating": 6.9,
	"actors": [
		"Kevin Costner",
		"Woody Harrelson",
		"Kathy Bates",
		"John Carroll Lynch",
		"Thomas Mann",
		"Dean Denton",
		"Kim Dickens",
		"William Sadler",
		"W. Earl Brown",
		"David Furr"
	],
	"staff": [
		"John Lee Hancock",
		"John Fusco",
		"Casey Silver",
		"Thomas Newman",
		"John Schwartzman",
		"Robert Frazen",
		"Denise Chamian",
		"Tracy Kilpatrick",
		"Michael Corenblith"
	],
	"votes": 105860,
	"cover": "https://m.media-amazon.com/images/M/MV5BYjIyNzBjNDktYjhlZS00MDk5LTg3OTctNDkwMTFlNmJhN2FlXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1934, after two years on the run as robbers and murderers, the criminals Bonnie (Emily Brobst) and Clyde (Edward Bossert) break several associates out of the Eastham Prison Farm in Texas. In response, Texas Department of Corrections Chief Lee Simmons (John Carroll Lynch) persuades Governor \"Ma\" Ferguson (Kathy Bates) to hire former Texas Ranger Frank Hamer (Kevin Costner) to track down the criminals independent of the Federal Bureau of Investigation (FBI). Ferguson and her staff are skeptical, having disbanded the Rangers for more advanced units, but she reluctantly allows Simmons to go ahead. Hamer initially hesitates due to his family but both he and his wife Gladys Hamer (Kim Dickens) accept after hearing about a devastating shootout in Missouri involving the infamous pair. Hamer's former partner, Benjamin Maney Gault (Woody Harrelson), joins Hamer after long being unemployed and living in hardship.The FBI have been wiretapping the fugitives' families for a while. Hamer and Gault get access to the files and conclude they are likely making their way to Dallas. There they see a man throw a bottle at Bonnie's mother's house and then a boy picking it up. Suspicious, they give chase but the boy escapes. FBI agents arrive, telling them that Clyde is believed to be in Brownsville and encouraging the Rangers to stay out of the operation. The Rangers brush off the FBI and meet with Dallas Sheriff \"Smoot\" Schmid, who introduces them to Deputy Sheriff Ted Hinton (Thomas Mann), a childhood friend of Bonnie and Clyde who can identify them on sight, but Hamer and Gault are concerned over Hinton's previous hesitations to fire on the pair. The next day, they hear of a double police murder committed by Bonnie and Clyde near Grapevine.Investigating the site with Hinton, Hamer is appalled by the pair's brutality and emphasizes it to Hinton. They also find that Bonnie was accompanied by a white rabbit. Hinton tells them it is likely a present for a family member. Leaving Hinton behind, they move to Oklahoma. From a gas station attendant sympathetic to the criminals, they discover that the wanted are headed to a migrant camp.\nOnce there, the two learn from a local girl that the gang were there and investigate the criminals' campsite. Continuing their pursuit, the Rangers hear on the radio of two other murdered police officers. They make their way to the site but since they are outside their authority, the FBI and local police bar them from entering. Frustrated, the Rangers continue to Coffeyville, Kansas, believing the Barrow gang will stop there for supplies (specifically painkiller medicine for Bonnie, who is severely dragging her left leg and is taking powerful medications to subdue the pain). They set eyes upon both Bonnie and Clyde and give chase but are impeded by crowds cheering on the criminals. Catching up outside the town, they briefly exchange shots, but the gang evades the Rangers.Trying to pick up their trail the next day, Hamer is told that Clyde had breakfast in Amarillo and return to Dallas to find out the white rabbit had been delivered to Bonnie's family. Hamer visits Henry Barrow (William Sadler), Clyde's father, who tearfully asks him to \"end it\" for his family, knowing his son would never be taken alive. Hamer follows up on a plan by Gault to have Simmons furlough a prisoner, Wade McNabb (Josh Caras), associated with the gang, hoping to draw them out. While Hamer interrogates McNabb in a bar, Gault is assaulted by three criminals helping the gang but defeats them. Hearing that Bonnie is due to meet a hairdresser, the next day the Rangers keep watch at Bonnie's home where they witness a man throwing a bottle at the house and the same boy retrieving it again and give chase. They catch up and find a message from the gang that they are heading elsewhere. Visiting McNabb's home for more information, the Rangers discover his corpse, savagely beaten to death with a bat.Gault believes McNabb's death to be his fault while Hamer tries to dissuade him, leading to an argument. They reconcile and continue. By analyzing their adversaries' movements and believing that \"criminals always go home\", Hamer and Gault predict they are heading for Louisiana, to the home of gang member Henry Methvin's father Ivy (W. Earl Brown), who lives in Bienville Parish.The two go to the house and find evidence that the outlaws were there. Joining forces with the local sheriffs after proving them not corrupt, the posse corners Ivy who tells them, in exchange for his son's safety, that the gang is expected soon and that there is only one way to and from his home. The posse is then joined by Ted Hinton and Dallas Sheriff's Deputy Bob Alcorn (Dean Denton).\nThat night, Gault tells the posse of his first deployment with Hamer which caused the death of a 13-year-old boy Gault accidentally shot. Ivy later arrives and tells them the gang is coming the next day. Setting up an ambush, Hamer orders Ivy to join them and pretend his vehicle has broken down to stop the gang at the ambush point. When Bonnie and Clyde arrive, they stop to assist Ivy as planned. Hamer steps out, ordering them to raise their hands. When they do not comply and prepare to draw their own weapons, the posse guns them down before the duo has any chance of escape.The bullet-riddled car is towed along with Bonnie and Clyde's mangled bodies to Arcadia, Louisiana, where it's mobbed by hysterical onlookers. Refusing a press offer of $1,000 for an interview the Associated Press, Hamer and Gault quietly drive home. Bonnie and Clyde's funerals were attended by thousands.",
	"links": [
		"https://www.netflix.com/title/80200571"
	]
}