{
	"title": "Safety Not Guaranteed",
	"release_year": "2012",
	"runtime": "86",
	"tags": [
		"Adventure",
		"Comedy",
		"Drama",
		"amazon"
	],
	"rating": 6.9,
	"actors": [
		"Aubrey Plaza",
		"Mark Duplass",
		"Jake Johnson",
		"Karan Soni",
		"Lauren Carlos",
		"Basil Harris",
		"Mary Lynn Rajskub",
		"David Leo",
		"Jeff Garlin",
		"William Hall Jr."
	],
	"staff": [
		"Colin Trevorrow",
		"Derek Connolly",
		"Derek Connolly",
		"Stephanie Langhoff",
		"Peter Saraf",
		"Colin Trevorrow",
		"Ryan Miller",
		"Benjamin Kasulke",
		"Joe Landauer",
		"Franklin Peterson",
		"J.C. Cantu",
		"Kat Ogden",
		"Ben Blankenship"
	],
	"votes": 131610,
	"cover": "https://m.media-amazon.com/images/M/MV5BZDAzYTlhZjktNmFkNi00YzZjLWI4NmMtYWI1MWJiYzYwNTlkXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Darius Britt (Aubrey Plaza) is a disillusioned college graduate who lives at home with her widower father, and who interns at a Seattle magazine. Darius doesn't fit into any clique at college and simply expects the worst.\nDarius is given odd jobs like stocking supplies at the office and changing toilet paper rolls in the bathrooms.One of the magazine's writers, Jeff Schwensen (Jake M. Johnson), proposes to investigate a newspaper classified ad that reads:\n\"Wanted: Somebody to go back in time with me. This is not a joke. P.O. Box 91 Ocean View, WA 99393. You'll get paid after we get back. Must bring your own weapons. Safety not guaranteed. I have only done this once before.\"\nJeff says that they can try to find out if the ad is real or it is a prank.Jeff's story idea is approved by his boss, Bridget (Mary Lynn Rajskub). Jeff selects Darius and Arnau (Karan Soni), a studious biology major interning at the magazine to diversify his resume, to assist him. Darius volunteers as she was desperate to be out of the office. Arnau is a major nerd. Darius believes that she wants to go back in time as everything cool is already gone.They travel to the seaside community of Ocean View to find and profile the person behind the ad. Jeff later reveals an ulterior motive for this assignment, to track down a long-lost love interest who lives in the beach community.\nThey check into a motel and are assigned one room with 2 double beds. Darius takes one bed and Jeff and Arnau share the other.They stake out in front of the PO box mentioned in the ad, to see who comes to retrieve the mail. When the person arrives, Arnau panics, leading to Darius going after the person alone.\nDarius discovers that the person behind the ad is Kenneth Calloway (Mark Duplass), who works as a stock clerk at a local grocery store.\nDarius finds that Kenneth was himself staking out the office of GML laser technologies.Darius returns and relays her findings to Jeff, who decides to approach Kenneth at his home.Jeff's attempt to contact Kenneth alienates Kenneth, so Jeff orders Darius to make contact. Kenneth hates the way Jeff smirks all the time and says that he has never experienced pain in his life, thus is not a good candidate for time travel.Darius approaches Kenneth at the grocery store where he works. Darius acts very secretive and pretends that she wants to buy a gun.\nDarius's disaffected attitude serves her well, and she quickly endears herself to Kenneth as she poses as a candidate to accompany him on his mission. While Kenneth is paranoid and believes that \"secret agents\" are tracking his every move, and suspects that Jeff is a secret agent.\nDarius gains his trust as she participates in a series of training exercises in the woods around his house (including basic shooting drills, physical endurance, one to one combat) and begins to develop feelings for him. Somewhere closer to the mission, they even share a kiss.Kenneth shares that he was born without a left ear, and he used a fake and all the kids at school used to make fun of him. Darius helps Kenneth steal a component from the GML laser company.She tells Kenneth about the death of her mother when she was 14, and that her mission is to prevent it. Kenneth says his mission is to go back to 2001 and prevent the death of his old girlfriend Belinda who was killed when someone drove a car into her house.Darius starts to believe that Kenneth is the real deal, but Jeff and Arnau are understandably skeptical.Meanwhile, Jeff tracks down Liz (Jenica Bergere), his fling from his teenage years, and though she is not as attractive as his memories of her younger self, they reconnect when Jeff visits her home, and they sleep together. Liz was married to a ball player, but she separated from him after her husband got traded, moved to Miami and cheated on her.\nHe asks her to move to Seattle, but she believes that this is just another fling for Jeff, so she refuses. Upset by her rejection, Jeff takes Arnau out on the town and they pick up some young women. Jeff tells Arnau to not waste his youth and convinces him to spend the night with one of the young women.The next morning, Jeff learns from Bridget, who has been following the notes on the story, that Belinda (Kristen Bell) is still alive. Darius goes to interview her. Belinda says that she was only friends with Kenneth, and that Kenneth had driven into her then boyfriend's house, but no one was injured. After the interview, Darius is questioned by two government agents who have been following Kenneth and who believe that he may be a spy because of his communications with government scientists. They know Kenneth has been breaking into labs and stealing equipment.Darius returns to Kenneth's house to confront him about Belinda. Kenneth claims that if Belinda is alive, it means that his time traveling worked. Jeff then comes in to warn them that the government agents are also on the property. Seeing Jeff, Kenneth thinks that Darius is with Jeff & was making fun of him the whole time. Kenneth panics and runs into the woods. Darius follows him and finds Kenneth on a boat with his time machine.Darius apologizes for lying to Kenneth and tells him everything else they shared was real. Darius joins him on the boat. Kenneth tells Darius that the mission has changed, saying that he now wants to go back for her. As Jeff, Arnau, and the two government agents watch, Kenneth activates his time machine, and the boat disappears with Kenneth & Darius on it.\nA filmed interview, presumably from earlier, shows Kenneth explaining why he chose to enlist a partner for his time travels.",
	"links": [
		"https://www.amazon.com/Safety-Not-Guaranteed-Kristen-Bell/dp/B009M8TVRO"
	]
}