{
	"title": "RED 2",
	"release_year": "2013",
	"runtime": "116",
	"tags": [
		"Action",
		"Comedy",
		"Crime",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Bruce Willis",
		"Helen Mirren",
		"John Malkovich",
		"Anthony Hopkins",
		"Mary-Louise Parker",
		"Lee Byung-hun",
		"Catherine Zeta-Jones",
		"Neal McDonough",
		"David Thewlis"
	],
	"staff": [
		"Dean Parisot",
		"Jon Hoeber",
		"Erich Hoeber",
		"Warren Ellis",
		"Cully Hamner",
		"Lorenzo di Bonaventura",
		"Mark Vahradian",
		"Alan Silvestri",
		"Enrique Chediak",
		"Don Zimmerman",
		"Deborah Aquila",
		"Tricia Wood",
		"Jim Clay"
	],
	"votes": 182525,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjI2ODQ4ODY3Nl5BMl5BanBnXkFtZTcwNTc2NzE1OQ@@._V1_QL75_UX190_CR0,8,190,281_.jpg",
	"description": "While trying to lead a normal life with girlfriend Sarah Ross (Mary-Louise Parker), Frank Moses (Bruce Willis) is approached by Marvin Boggs (John Malkovich), who is afraid that there are people still after them, but Frank dismisses him. After appealing a second time, Marvin drives off but his car explodes. Although Frank does not believe Marvin is dead, Sarah convinces him to go to Marvin's funeral where he delivers a teary-eyed eulogy.After the funeral, a group of government agents approach Frank and take him to be interrogated at a Yankee White Facility. During the interrogation, Jack Horton (Neal McDonough) appears, killing most of the facility's personnel, and tells Frank that he will torture Sarah in order to get information out of Frank. Horton is an independent assassin contractor & has been hired by the US Govt to get information on Operation Nightshade from Frank.Frank manages to escape with the help of Marvin, who turns out to be alive, and they go on the run with Sarah. Marvin explains that he and Frank are being hunted down because they were listed as participants in a secret operation code-named Nightshade. The operation was conducted during the Cold War era in order to smuggle a nuclear weapon into Russia piece by piece.\nHorton has been able to convince the Pentagon bosses that Frank and his crew are terrorists and must be stopped. Victoria (Helen Mirren) calls and tells them she has accepted a contract from MI6 to kill Frank. Meanwhile, top contract killer Han Cho-Bai (Neal McDonough) is hired by Horton to kill Frank as well.Marvin kidnaps the Head of Military intelligence who reveals that Nightshade was a US first strike capability against the Soviets during the Cold War. A whole nuke was smuggled and hidden inside Moscow, to be detonated when required. The scientist was Edward Bailey. Frank & Marvin were part of the security detail protecting Bailey, but they believe Bailey was killed in a car bomb & the nuke's exact location was lost.\nSearching the internet, Marvin and Sarah find clues to a man named \"The Frog\" who seems to be driving the chatter exposing Frank's & Marvin's role in Nightshade. The Frog is based out of Paris.Frank, Marvin, and Sarah travel to Paris to track down a man nicknamed \"The Frog\" (David Thewlis), in Han's stolen plane, with the Americans and a furious Han on their tails. As they arrive in Paris, they are stopped by Katya (Catherine Zeta-Jones), a Russian secret agent who Frank had a relationship with earlier in his career. Katya is in search of Nightshade as well, and teams up with them to find the Frog. After the Frog flees from them, Frank and Katya catch him and bring him back to his house, where Sarah succeeds in wooing him to help them and prove she is a better girlfriend than Katya. The Frog gives them the key to his security box, which Katya attempts to get from Frank after drugging him, but Marvin anticipated this and had planted a fake key on Frank. He, Frank, and Sarah later find documents in the Frog's security box which point to the location of Dr. Edward Bailey (Anthony Hopkins), a brilliant physicist, as the creator of the bomb involved with Operation Nightshade. Bailey is alive.They find out that Bailey is still alive, having been held in an asylum for the criminally insane in London for thirty-two years. After arriving by the stolen jet in London, Victoria confronts the trio, but helps to fake their deaths. Victoria then feigns insanity in order to gain access to the asylum. Frank and Victoria meet Bailey, who is hyperactive and does not respond to their questions. After a while, Bailey reveals that the bomb is still in Moscow. They go to Moscow, and after a close call with Han, Bailey comes to the conclusion that he hid the bomb in the Kremlin. They break into the Kremlin, and Bailey locates the bomb, but as they are about to leave, Katya stops them. Frank convinces his former lover to switch to their side. The Nightshade device is made of red mercury & is undetectable. Frank reasons with Katya that this weapon should be destroyed and is too much power for any one government.As all are celebrating success, Victoria calls Frank from London and tells him that Bailey was locked up specifically because he wanted to detonate the bomb. Bailey holds Frank at gunpoint and confirms Victoria's message, revealing that he made a deal with Horton and the Americans to leave with the bomb. He then shoots Katya, staging her death at Frank's hands, and leaves. Horton reneges on his deal with Bailey, intending to imprison & question him, but Bailey escapes by using a nerve agent he created. Bailey moves to the Iranian embassy in London, and as Frank attempts to follow, Han confronts him, and after a fistfight, Frank asks Han to join sides with him and stop the bomb. Han eventually relents, and they set in place a plan to recapture Bailey and the bomb.Sarah first seduces the Iranian ambassador, then takes him hostage on the pretext of women's rights in Iran. Marvin sets in place a diversion, and the rest come in disguise to \"fix\" the problem. When they arrive, they discover that Bailey has set the bomb timer off.Bailey kidnaps Sarah and goes to the airport to escape the imminent explosion. Frank, Marvin, Victoria, and Han give chase as they also get chased by embassy guards. After they escape, they arrive at the airport, and Frank saves Sarah from Bailey, but is forced by him to take the bomb off the plane. They reunite with Marvin, Victoria, and Han and wait for their imminent deaths, but the bomb explodes in the air. Frank reveals that he smuggled the bomb on the plane in a compartment near the front of the plane. The movie closes with a scene showing Sarah enjoying herself on a mission with Frank and Marvin.",
	"links": [
		"https://www.amazon.com/Red-2-Dean-Parisot/dp/B0CW3Q18MX"
	]
}