{
	"title": "Turbo",
	"release_year": "2013",
	"runtime": "96",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"amazon"
	],
	"rating": 6.4,
	"actors": [
		"Ryan Reynolds",
		"Paul Giamatti",
		"Maya Rudolph",
		"Samuel L. Jackson",
		"Michael Peña",
		"Luis Guzmán",
		"Bill Hader",
		"Snoop Dogg",
		"Ben Schwartz",
		"Richard Jenkins"
	],
	"staff": [
		"David Soren",
		"David Soren",
		"Darren Lemke",
		"Robert Siegel",
		"Lisa Stewart",
		"Henry Jackman",
		"Chris Stover",
		"James Ryan",
		"Leslee Feldman",
		"Christi Soper",
		"Michael Isaak",
		"Henrik Tamm"
	],
	"votes": 113441,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTA4NTgwMjM5MzheQTJeQWpwZ15BbWU3MDg2ODA1ODk@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In a suburban San Fernando Valley tomato garden of Van Nuys in Los Angeles, Theo, self-named \"Turbo\", is a garden snail who dreams of being a racer, just like his hero, five-time Indy 500 champion Guy Gagné. However, his obsession with racing makes him an outcast in the slow and cautious snail community, and a constant embarrassment to his older brother, Chet. One day after nearly getting killed by a lawnmower in an attempt to retrieve a fallen tomato, Theo wanders onto a freeway to admire the traffic and wishes upon a star, which is actually an airplane, that he could be fast. Suddenly, he is sucked into the supercharger of a Chevrolet Camaro, fusing his molecules with nitrous oxide. When he wakes up, he possesses superspeed and other characteristics of a real car. However, his first attempt to try out his new powers ends with him crashing a boy's tricycle into the garden where many other snails worked, resulting in him and Chet getting fired from the garden crew.Chet angrily scolds Theo for his recklessness, and is snatched by a crow, but he is rescued by Theo at a rundown strip mall called \"Starlight Plaza\". There, they are captured by Tito Lopez, a taco truck driver who works at the Plaza, and are brought to a snail race held by him and his co-workers. Theo wins the race in a matter of seconds, astounding both the humans and snails alike, earning the respect of the snails, led by Whiplash, and firmly establishing the name \"Turbo\" as his own. Chet, however, is unhappy with his brother's new abilities and wants him to return to normal. Tito wants to revive Starlight Plaza, with Turbo as a main attraction, but his brother and coworker Angelo dismisses him. Later on, the snails manage to divert and strand a tour bus to see Turbo's superspeed, bringing impressive business. With this success, Turbo convinces Tito to enter him in the Indy 500 as a competitor, and his coworkers agree to put up the entrance fee and accompany them to Indianapolis.Tito is initially refused entry into the race, but a chance meeting with Gagné allows Turbo to show off his speed, qualifying for the race via achieving a speed of 226 mph, becoming a sensation on social media and forcing the CEO of IndyCar to reluctantly let Turbo compete. The night before the race, after a heated argument with Chet, who is still unwilling to respect his brother's wishes, Turbo sneaks out to meet Gagné, who reveals his true colors by demoralizing him, showing that he only cares about winning, and warning him to back out of the race. The next day at the race, Chet is taken by a young boy and traps him in a glass to see the race. In the race, the more experienced competitors leave Turbo in last place. At a pitstop, Whiplash and his crew give Turbo a pep talk, advising him to stop racing like a car. Turbo uses his small size to his advantage and rapidly gains ground, but Gagné resorts to cheating and knocks him against the wall, damaging his shell and weakening his superspeed.With the final lap and Turbo in the lead, Gagné drives over debris on the last turn and overtakes Turbo, inadvertently causing a crash involving most of the competitors, including Turbo, who wakes to find his shell punctured and his superspeed gone, causing him to give up and hide in his shell. Surprised at seeing his brother losing hope, Chet, with a change of heart, escapes from the glass and meets with Whiplash's crew, and they encourage Turbo to continue. Turbo, inspired by his older brother's newfound support, resumes the race. Gagné desperately pursues him by dragging his wrecked car, and attempts to kill Turbo by stepping on him, but Turbo narrowly wins the race by tucking and rolling.Starlight Plaza thrives from Turbo's fame, and all the businesses become spectacular successes and hold elaborate snail races. Whiplash's crew is given special propulsion aids for their shells, while Chet is the track referee and paramedic, and the garden snails have also received special shells of their own. Turbo discovers that his shell has healed, and his superspeed has returned, now ready to race once again.In a mid-credits scene, one of the snails from the garden is finally able to tuck into his shell, until he realizes he is too big to come out of it.",
	"links": [
		"https://www.amazon.com/Turbo-David-Soren/dp/B079HRZD8S"
	]
}