{
	"title": "Divergent",
	"release_year": "2014",
	"runtime": "139",
	"tags": [
		"Action",
		"Adventure",
		"Mystery",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Shailene Woodley",
		"Theo James",
		"Kate Winslet",
		"Jai Courtney",
		"Ashley Judd",
		"Ray Stevenson",
		"Zoë Kravitz",
		"Miles Teller",
		"Tony Goldwyn",
		"Ansel Elgort"
	],
	"staff": [
		"Neil Burger",
		"Evan Daugherty",
		"Vanessa Taylor",
		"Veronica Roth",
		"Lucy Fisher",
		"Pouya Shahbazian",
		"Douglas Wick",
		"Tom Holkenborg",
		"Alwin H. Küchler",
		"Richard Francis-Bruce",
		"Nancy Richardson",
		"Venus Kanani",
		"Mary Vernieu",
		"Andy Nicholson"
	],
	"votes": 495245,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjExNjUyMzI2OF5BMl5BanBnXkFtZTgwMTg1NTIxMDE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In a post-apocalyptic Chicago, survivors divide into five factions based on their dispositions: Abnegation, for the selfless volunteers & AID workers; Amity, for the peaceful farmers; Candor, for the honest lawyers judges & such; Dauntless, for the brave soldiers & police; and Erudite, for the intellectual scientists. Each year, all sixteen-year-old people must take an aptitude test that describes the one faction for which they are best suited. After receiving the results, they can decide whether to remain with their family's faction or transfer to a new faction. Those who do not complete initiation into their new faction become \"Factionless\" and are forced to live in poverty on the streets of the city.Sixteen-year-old Beatrice Prior (Shailene Woodley) is born into an Abnegation family. She doesn't feel like she belongs in Abnegation, because she doesn't see herself as naturally selfless. Her aptitude test also supports this, inconclusively indicating aptitude for three factions: Abnegation, Erudite, and Dauntless. The tester warns her to never share this fact, as it makes her a Divergent. Before the Choosing Day, she agonizes over whether to stay in Abnegation to satisfy her parents Natalie Prior (Ashley Judd), or whether she should change to another faction.\nAbnegation is the faction that forms the Government & Erudite is not happy with that. So they fan rumors about Abnegation hoarding food & their leader Marcus abusing his son when it was a child, which made him chose Dauntless.On Choosing Day, Beatrice decides to leave Abnegation and join Dauntless, while her brother Caleb (Ansel Elgort) chooses Erudite. Their Dauntless instructor, Four (Theo James), explains that not all the dauntless initiates will enter the Dauntless faction; only the top 21 will stay while the rest will be dismissed and become faction-less. This is unusual as most factions allow everyone who completes initiation to enter the faction. During her initiation into the new faction, Beatrice renames herself Tris. During the initiation, she befriends some transfer initiates - Christina, Al, and Will - while coming into conflict with others - Peter, Drew and Molly.The Willis (or Sears) Tower, one of the several landmarks Roth describes within the post-apocalyptic Chicago. Initiation is broken into three stages. The first involves learning how to handle guns and knives as well as engaging in hand-to-hand combat with the other initiates. Despite being physically weaker than most of her fellow initiates, Tris finishes the stage in 20th place by beating Molly, who is ranked 6th. Once the rankings are announced, Peter (who came second) is jealous of the first-place finisher, Edward, and, under cover of night, Peter stabs Edward in the eye with a butter knife.During the parent visiting day, Tris realizes that her mother originally grew up in Dauntless. Her mother also finds that Tris's test results were Divergent. She warns Tris that Erudite is actively seeking out Divergents as everyone is afraid of them.Meanwhile, Erudite stirs dissent against Abnegation leadership in the city government. The Erudite's reports accuse Abnegation's leader, Marcus, of abusing his son, who joined Dauntless two years before. Reports vilify Tris' parents because both their children switched factions, and falsely claim Abnegation is hoarding supplies. During the same period, Tris befriends some Dauntless-born initiates, including Uriah, Lynn, and Marlene.Stage two involves simulations, similar to the aptitude tests, which force the initiates to face scenarios symbolic of their fears. Because Tris is Divergent, she recognizes that she is under a simulation while others do not and can work the simulations to her advantage. Four realizes that Tris is Divergent. Tris was ranked first. Peter, Drew, and Al attack Tris, threaten sexual assault, and attempt to throw her into the chasm at Dauntless headquarters, but Four intervenes. Later, Al begs Tris's forgiveness, but she rebuffs him, and he later commits suicide.The final stage of their initiation is a fear landscape, which gathers all of their fears in a single induced simulation. In the fear landscape, all of them, Divergent or not, will be aware that they are under a simulation and must overcome each fear. Four decides to train Tris to avoid detection as a Divergent. He lets her into his own fear landscape & trains her how to think & act like a Dauntless. Tris learns that Four only has four fears in his landscape, a record, hence his nickname. She also learns his real name, Tobias, and that his father is Marcus. Four later shares with Tris information he has discovered about the Erudite's plans to use the Dauntless to stage an attack on the Abnegation.Tris successfully overcomes six fears in her fear landscape. After her test, Tris, along with all other Dauntless members, is injected with a new \"tracking\" serum that is supposedly only activated if someone goes missing. Before the official initiation ceremony, Four invites Tris back to his private apartment, and Tris expresses her feelings for him. Soon, the ceremony begins, the final rankings are posted, and Tris discovers she has been ranked first. In the midst of celebrating, though, she suddenly realizes that the Erudite will use the \"tracking\" serum to force Dauntless members to carry out their plans of invading the Abnegation.A junction on the Chicago 'L', one of the train systems operating in modern Chicago. The Dauntless demonstrate their fearlessness by jumping on and off trains traveling throughout the city. During the night following the ceremony, the serum induces a simulation and all of the Dauntless become sleep-walking soldiers ordered to attack the Abnegation compound. The serum does not work on Tris or Tobias (Four) because they are both Divergent. After arriving at the Abnegation compound, Tris and Tobias try to break away from the pack to escape.However, Tris is shot, but not mortally wounded, and when Tobias refuses to leave her behind, they are captured and brought before Jeanine (Kate Winslet), the Erudite leader. She injects Four with an experimental serum, which counteracts the Divergent effect by controlling what he can see and hear. Jeanine directs Tobias to be sent back to the Dauntless control room to oversee the attack, and sentences Tris to death. Tris is taken to be shot but her saves her. As they escape, her mother reveals that she is also Divergent, but while helping Tris escape, she is killed. Tris escapes but is forced to kill Will, who attacks her while under the influence of the simulation.She finds her father, Caleb, and Marcus in the safe house, and they resolve go to the Dauntless compound to find the source of the simulation. Fighting their way through Dauntless headquarters, Tris' father sacrifices himself to clear the way for Tris to reach the control room.When she confronts the mind-controlled Tobias, he attacks Tris. In the fight, Tris realizes she cannot bring herself to kill him, and surrenders, causing Tobias to break through the special sight-and-sound-only simulation. Freed, Tobias helps Tris shut down the Erudite simulation and free the remaining Dauntless from their mind control. They rejoin Caleb and Marcus, as well as Peter, who had helped Tris find the control room in exchange for his safety. The group then boards a train to the Amity sector to find the rest of the Abnegation survivors, leading to the events described in Insurgent.",
	"links": [
		"https://www.amazon.com/Divergent-Shailene-Woodley/dp/B00J59ZKV6"
	]
}