{
	"title": "The Place Beyond the Pines",
	"release_year": "2012",
	"runtime": "140",
	"tags": [
		"Crime",
		"Drama",
		"Thriller",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"Ryan Gosling",
		"Bradley Cooper",
		"Eva Mendes",
		"Craig Van Hook",
		"Olga Merediz",
		"Angelo Anthony Pizza",
		"Mahershala Ali",
		"John Facci",
		"Ben Mendelsohn",
		"Tula"
	],
	"staff": [
		"Derek Cianfrance",
		"Derek Cianfrance",
		"Ben Coccio",
		"Darius Marder",
		"Lynette Howell Taylor",
		"Sidney Kimmel",
		"Alex Orlovsky",
		"Jamie Patricof",
		"Mike Patton",
		"Sean Bobbitt",
		"Jim Helton",
		"Ron Patane",
		"Cindy Tolan",
		"Inbal Weinberg"
	],
	"votes": 293732,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjc1OTEwNjU4N15BMl5BanBnXkFtZTcwNzUzNDIwOQ@@._V1_QL75_UX190_CR0,6,190,281_.jpg",
	"description": "Luke Glanton (Ryan Gosling) is a locally famous motorcycle stuntman working in a traveling act for state fairs. During the fair in Altamont, New York, Luke is visited by his ex-lover, Romina (Eva Mendes), and learns he is the father of her infant son. Luke quits his job as a stuntman to stay in town and provide for the child, but Romina does not want him in the child's life, as she has become involved in a relationship with another man named Kofi. Luke turns to Robin (Ben Mendelsohn), an auto repair shop owner, for part-time employment as he continuously attempts to insert himself into his son's life.Making only minimum wage, Luke asks Robin for more money to care for his son. Robin reveals he was once a bank robber, and offers to partner with Luke to hit several banks in the area. The duo perform several successful heists, in which Luke does the robbery, then uses his motorbike as a getaway vehicle and drives it into an unmarked truck driven by Robin. Luke uses the new money to win back Romina's trust and visits her and his son more often. Kofi (Romina's current boyfriend) objects to his presence and the two get into a fight at Kofi's house, resulting in Luke's arrest after he hits Kofi in the head with a pipe wrench.After Robin has bailed him out of jail, Luke wants to resume their bank robberies. Robin objects, not wanting to press their luck, and the two have a falling-out that results in Robin dismantling the motorbike & cutting the shaft to within an inch of breaking. Luke takes back at gunpoint the bail money he owed Robin. Luke attempts to rob a bank alone and is pursued by police. He falls off his bike during the chase when his bike shaft fails and seeks refuge in a resident's home, where he is pursued by Schenectady Police Officer Avery Cross (Bradley Cooper). Luke corners himself upstairs and calls Romina. Just before Avery confronts him, Luke asks Romina not to tell their child about who he was.Avery enters the room and fires the first shot; Luke falls out of the second-story window after shooting Avery in the leg. Avery looks out the window to find Luke dying on the pavement.\nAvery gains hero status after his take-down of Luke. Avery feels remorse about shooting Luke, especially as Avery's fellow officers Scotty and Peter Deluca (Ray Lolita) illegally seize the stolen money from Romina's home and give him the lion's share in honor of his newfound hero status. He later attempts to return the money to Romina, but she rejects his offer. Avery eventually tries to turn the money in to the chief of police, who dismisses him, wishing not to get involved. The chief of police talks to Peter telling him about how Avery wanted to rat them out.Following the advice of his father, a retired judge, Avery records a fellow officer asking him to remove cocaine from the evidence locker Avery is supervising for use in a separate case. Avery uses the recording to expose the illegal practices in the police department and pressures the district attorney to hire him as assistant district attorney. Based on the recording Peter & Scotty are put in jail.Fifteen years later, Avery is running for public office and has to deal with his now-teenage son A.J., who has gotten into trouble with drugs. Avery has separated from his wife Jennifer and agrees to take A.J. into his home. A.J. transfers into the high school in Schenectady. There A.J. befriends a boy named Jason; neither A.J. nor Jason know that Jason is Luke's son. The two are arrested for felony drug possession, and when Avery is called in to pick up his son, he recognizes Jason's name. He uses his influence to get Jason's charge dropped to a misdemeanor and orders A.J. to stay away from Jason, but the boys continue to talk.Jason seeks the truth about his biological father, whom Romina refuses to discuss with him. His stepfather, Kofi, finally tells the boy his father's name. He discovers Luke's past on the Internet. He visits Robin's auto shop, and Robin tells Jason more about Luke, including his superior motorbiking skills.Back in school, A.J. invites Jason over to his house for a party and guilt-trips him into stealing Oxycontin for the party. Jason eventually gives in to A.J., and arrives with the drugs after stealing them from a pharmacy. At the house, Jason sees a framed photograph of Avery and realizes that A.J.'s father is the man who killed his own father. After a fight with A.J., which leaves Jason hospitalized with mild facial injuries, Jason breaks into the Cross family home and beats A.J. at gunpoint. When Avery arrives, Jason takes him hostage and orders him to drive into the woods. Although Jason had intended to kill Avery, he reconsiders after Avery tearfully apologizes for killing Jason's father. Jason takes Avery's wallet and jacket. In the wallet, Jason finds a photo of himself as a baby with his parents, which Avery had stolen from the evidence locker. Jason then leaves in Avery's car.Avery wins his bid for New York Attorney General, with A.J. at his side. Romina receives an envelope addressed to \"Mom\" with the old photograph of Jason with his parents. Jason leaves home and buys a motorbike, reminiscent of his father's, and heads west, presumably intending to start anew.",
	"links": [
		"https://www.amazon.com/Place-Beyond-Pines-Ryan-Gosling/dp/B00DP3L80U"
	]
}