{
	"title": "The Judge",
	"release_year": "2014",
	"runtime": "141",
	"tags": [
		"Crime",
		"Drama",
		"Mystery",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Robert Downey Jr.",
		"Robert Duvall",
		"Vera Farmiga",
		"Billy Bob Thornton",
		"Vincent D'Onofrio",
		"Jeremy Strong",
		"Dax Shepard",
		"Leighton Meester",
		"Ken Howard",
		"Emma Tremblay"
	],
	"staff": [
		"David Dobkin",
		"Nick Schenk",
		"Bill Dubuque",
		"David Dobkin",
		"David Dobkin",
		"Susan Downey",
		"David Gambino",
		"Thomas Newman",
		"Janusz Kaminski",
		"Mark Livolsi",
		"Kerry Barden",
		"Lisa Lobel",
		"Paul Schnee",
		"Mark Ricker"
	],
	"votes": 209470,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTcyNzIxOTIwMV5BMl5BanBnXkFtZTgwMzE0NjQwMjE@._V1_QL75_UX190_CR0,6,190,281_.jpg",
	"description": "Hank Palmer (Robert Downey Jr.) is a successful defense attorney in Chicago who has been estranged from his family in a small-town Carlinville in Indiana for some time. While in court, he receives a call telling him his mother has died. As he leaves to fly to his hometown of Carlinville, it is revealed that Hank is going through a divorce and custody battle for his young daughter Lauren with his wife Lisa (Sarah Lancaster). Lisa reminds Hank that he knows almost nothing about Lauren's life and so fighting for her custody is pointless. Hank is livid with Lisa for cheating on him with her college boyfriend.In Carlinville, Hank reunites with his older brother Glen (Vincent D'Onofrio), owner of a tire shop, and his younger brother Dale (Jeremy Strong), an autistic aspiring filmmaker who carries an old 8mm film camera everywhere he goes. Hank then stops by the small county courthouse, softly enters a courtroom, and sits in the back where he observes a case in progress. The judge is Joseph Palmer (Robert Duvall), Hank's father. During the proceedings, the Judge cannot recall his long-time bailiff's name. Everybody refers to him as \"The Judge\". The Judge firmly believes that a man is solely responsible for the consequences of his actions.\nWhen Joseph sees Hank for the first time in many years, at the funeral, he is treating guests with kindness but acknowledges his son coldly.\nHank's room has been converted into a storage room for the Judge. The next morning, the family leaves for breakfast without telling Hank and when Hank reaches the diner, they leave for the funeral.Hank also reconnects with his old girlfriend Sam (Vera Farmiga), whom he abandoned after going to a Metallica concert more than 20 years ago. Sam is a waitress at the diner and has been so for 20 years.After the funeral, Hank tells Glen that The Judge might be drinking again, as he forgot the name of the bailiff. Glen says Joseph has been sobered for 28 years. That night The Judge drives himself to buy some groceries.\nThe brothers go for a drink at the tavern. At the bar, locals start to give Glen a hard time because they've all had poor experiences in the Judge's courtroom. Glen is about to fight them when Hank steps in and through fast talking shames the locals into leaving. This impresses young bartender Carla (Leighton Meester) who starts making out with Hank later that night.The next morning, Hank notices damage to his father's Cadillac Coupe DeVille as he is preparing to leave. Upon seeing the damage, Joseph denies knowing how it happened; but Hank believes his father was drinking and driving and damaged his own car. The Judge reacts defensively and makes fun of Hank getting a divorce from Lisa after she cheated on him. Glen and Dale had no clue about this.After a heated exchange, Hank leaves, promising never to return. But after boarding his plane, Hank learns from Glen that Joseph is being questioned by police with regard to a fatal hit and run. The victim is identified as Mark Blackwell (Mark Kiely), is a recently released ex-convict whom Judge had sentenced to 20 years in prison for the murder of his 16-year-old girlfriend Hope Stevens. Blackwell had killed her by drowning after the Judge had given him a light sentence of 30 days for shooting up the girl's house (Blackwell had been dating Hope for 6 months and this seemed like a lover's tiff to The Judge. The Judge says that Blackwell was drunk and repentant and hence he let him go).\nBoth the Judge and Blackwell were seen at the convenience store last night. The Judge says he went a different way home than where Blackwell's body was found.After Blackwell's blood is found on the car Joseph is soon indicted, with prosecutor Dwight Dickham (Billy Bob Thornton) seeking a conviction for first-degree murder. Mrs Blackwell (Grace Zabriskie) confronts The Judge on the street and spits at him angrily.Joseph refuses to appoint Hank as his attorney as he maintains that this was an accident and needs an honest lawyer to argue his case. That night the brothers' bond over watching their childhood home movies to share memories of their mother with each other.The Judge hires local attorney C.P. Kennedy (Dax Shepard) for his defense. Kennedy is also a full-time antiques furniture salesman and a part time lawyer. Kennedy's defense proves ineffective, as he loses the preliminary hearing, and the judge decides that the case will go to a full jury trial.\nThe case is assigned to Judge Sanford Warren (Ken Howard). Hank was sure that the case could be dismissed as an accident rather than being listed as a murder trial.Hank agrees to defend Joseph. Hank asks Dale about the Judge's condition. Dale says that he is fine and keeps a routine where he goes and plays Chess with Doc Morris (Denis O'Hare) every week. Hank remembers his dad doesn't play Chess so he asks if Dale has any footage of that. He does. They look at the film and Hank finds that The Judge was getting Chemotherapy for colon cancer.\nThis explains Joseph's inability to remember the accident and provides a potential diminished capacity defense, but Joseph rejects any such defense because of the potential damage it would do to his legacy. Everyone that the Judge sentenced in the last year would challenge the ruling. The Judge says that he would rather die in prison than be remembered as a failed Judge.\nHe says that people don't remember any of the great stuff Ronald Reagan did, they only remember him as a senile old fool. He doesn't want that to be his legacy too. Hank points out that he is just a small town Judge and he'll have no legacy.During this time, Hank's daughter, Lauren (Emma Tremblay), arrives for a visit, meeting her grandfather for the first time and bonding with him. Much to Hank's surprise, the Judge is delightful to Lauren and tells her that she's the first girl they've had in the family in a very long time. That night, Hank and Lauren are hanging out and hear a noise from the Judge's room. Hank goes to investigate and sees that his dad is out of it, struggling to walk and has soiled himself. Hank takes him into the bathroom, undresses him and helps him in the shower to clean him off.Hank picks a jury. He does it entirely by asking what kind of bumper sticker each candidate has on their car. If its something about having an honor roll student or anything like that, he passes. He does accept people if they have stickers that say things like Gun Control means using two hands and Missing: Wife and Dog, reward for Dog like from the trailer for the movie.Hank breaks out his old Metallica shirt and bike and starts riding around town. He rides no handed on his bike and wipes out. Samantha and her daughter Carla the bartender pick him up and give him a ride. Carla and Hank don't tell Samantha that they made out the other night.\nHank discovers that Carla was born nine months after he left and deals with his concern that he is Carla's father.\nSam says that she owns the diner now. They eat pie and she comes on to him, but he rejects her advances and explains that he is going back to Chicago as soon as he can. She is insulted that he'd think she wanted anything more than just a hook up and tells him to lock up when he leaves because she is going to go home and masturbate.A security tape shows that the Judge lied about his trip home. He said he went one direction, saw that the road was washed out and went back the other way. The security tape shows that his time-line doesn't match up.During the trial Hank and Joseph confront their bitterness with each other, dating back to a teenage drunk driving accident in which Hank was driving and Glen was injured-ending the latter's potential for a career in professional baseball. Joseph saw to it that Hank was sent to a youth detention center, and Hank left Carlinville after never receiving acknowledgment from Joseph for turning his life around.At trial, Hank believes he has established enough reasonable doubt in the case to result in an acquittal. But Joseph sabotages the case by testifying that although he still cannot remember the accident, he has come to believe that he probably did kill Blackwell intentionally. Joseph confesses on the stand that he was personally haunted by Blackwell's case, having seen Hank in Blackwell, and wanting to help him like he would his son. Having misread Blackwell, Joseph afterward saw him in Hank.Joseph is acquitted of murder but convicted of voluntary manslaughter and sentenced to four years in prison, though he is released on compassionate parole after seven months, his cancer being terminal. He and Hank go fishing.After acknowledging Hank as the best lawyer he knows, Joseph dies peacefully in the boat. Hank, having made peace with his father, returns to the courtroom Joseph once reigned over, and spins the judges chair, where it ominously stops, pointed at him.",
	"links": [
		"https://www.amazon.com/Judge-Robert-Downey-Jr/dp/B00OCDS5SU"
	]
}