{
	"title": "Blade Runner 2049",
	"release_year": "2017",
	"runtime": "164",
	"tags": [
		"Action",
		"Drama",
		"Mystery",
		"amazon"
	],
	"rating": 8.0,
	"actors": [
		"Harrison Ford",
		"Ryan Gosling",
		"Ana de Armas",
		"Dave Bautista",
		"Robin Wright",
		"Mark Arnold",
		"Vilma Szécsi",
		"Wood Harris",
		"David Dastmalchian",
		"Tómas Lemarquis"
	],
	"staff": [
		"Denis Villeneuve",
		"Hampton Fancher",
		"Michael Green",
		"Philip K. Dick",
		"Broderick Johnson",
		"Andrew A. Kosove",
		"Cynthia Sikes",
		"Bud Yorkin",
		"Benjamin Wallfisch",
		"Hans Zimmer",
		"Roger Deakins",
		"Joe Walker",
		"Francine Maisler",
		"Dennis Gassner"
	],
	"votes": 682297,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzA1Njg4NzYxOV5BMl5BanBnXkFtZTgwODk5NjU3MzI@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 2049, Replicants (bioengineered humans designed by the Tyrell corporation) have been integrated into society as servants and slaves. They were initially designed for off-world usage. After a series of violent rebellions, the manufacture of Replicants became prohibited and Tyrell went bankrupt.\nIn mid 2020s Niander Wallace perfected synthetic farming to avert a global farming due to collapsing ecosystems in absence of slave labor. Wallace acquired remnants of Tyrell corporation and created a new line of Replicants who obey. The older model Replicants, Nexus 8s with open ended life spans have survived. Due to their inherent potential for violence, they are systematically hunted down and retired.In California, one Replicant known as \"K\" (Ryan Gosling) works for the LAPD as a \"Blade Runner\", an agent who hunts down and \"retires\" (eliminates) rogue Replicants, the older generation models who frequently malfunction and don't obey their human masters. Replicants look very much like humans but have far enhanced capabilities.\nK lives with his holographic girlfriend Joi (Ana De Armas), an artificial intelligence product of the Replicant manufacturer Wallace Corporation. K purchases an Emanator device which allows Joi to be free from her ceiling-based projector and allows her to travel with K outside the apartment, and to anywhere in the world.\nEvery time K returns to LAPD HQ, he is subjected to an elaborate obedience test, which contains a series of questions, with a non-sensible yet, mandatory answer, which K has to provide.After K retires the rogue Replicant Sapper Morton (Dave Bautista), he finds a box buried on Morton's farm containing bodily remains. Forensic analysis reveals they are the remains of a female Replicant (identified as such when K finds her ID number imprinted deep within her bones) who died 30 years ago during an emergency cesarean section, contradicting the belief that Replicants are sterile. Fearful that this knowledge could lead to war between humans and Replicants, K's superior Lieutenant Joshi (Robin Wright) orders K to destroy the evidence and retire the Replicant child.K visits the Wallace Corporation headquarters, where the deceased female is identified from DNA archives as Rachael, an experimental Replicant designed by Dr. Tyrell. K learns of Rachael's romantic ties with former blade runner Rick Deckard (Harrison Ford). By accessing the old data records on K. The data on that time period is sketchy as not a lot of data survived the post rebellion blackout. For 10 days all machines were switched off and all data erased, including bank records.\nThe CEO, Niander Wallace (Jared Leto), wants to discover the secret to Replicant reproduction to expand interstellar colonization. Wallace has sent humanity to 9 new worlds, but he believes that humanity should own the stars. Wallace knows that he can only make so many Replicants. So, self-producing Replicants are the key to accelerating production to billions and trillions and conquering new worlds. Wallace knows that Replicant procreation is Tyrell's final trick that was perfected and then lost.\nHe sends his Replicant enforcer Luv (Sylvia Hoeks) to steal Rachael's remains from LAPD headquarters and follow K to Rachael's child.Returning to Morton's farm, K finds the date 6-10-21 carved into a dead tree trunk over Rachael's burial place and recognizes it from a childhood memory of a wooden toy horse with the same date carved underneath the toy horse. In the memory, K hides the toy in a furnace, while being chased by some bullies.\nK sets fire to Morton's house. As Replicants' memories are implanted, Joi believes this is evidence that K was born and not created as a Replicant.\nSearching records, K discovers twins born on that date with identical DNA except for the sex chromosome, but only the boy is listed as alive. But this is physically impossible as 2 people cannot have the same DNA, so only 1 is real and the other is a copy created to conceal the truth of the real child. Both DNA were processed at the Morrill Cole Orphanage.K travels to the Orphanage but is captured by rebels who bring his car down. Luv was keeping an eye on K via drones and rescues K by blowing up all the rebels from the air.\nK tracks the child to an orphanage in ruined San Diego but discovers the records from that year have been removed. K recognizes the orphanage from his memories and finds the toy horse where he remembers hiding it in the furnace.K seeks out Dr. Ana Stelline (Carla Juri), a designer of Replicant memories. Stelline is a sub-contractor to Wallace and knows that Wallace needs her memory implants to keep his product stable. Stelline has lived a sterile life ever since she was a toddler. Her parents were about to leave the planet, when she took ill. So, she was given a sterile dome to live, and a Holographic projector to create what she could imagine. This is how she perfected the art of creating memories.\nStelline confirms that his memory of the orphanage is real and that someone lived it.K concludes that he is Rachael's son. After K fails an LAPD obedience test, he decides to flee, and transfers Joi to a mobile emitter on her request. Joi had hired a prostitute for K, so she could super-impose projection on the prostitute, and have sex with K. Unknown to K or Joi, the prostitute was already working for Luv and puts a tracker inside K's jacket. K finds the tracker and destroys it.\nHe has the toy horse analyzed, revealing traces of radiation that lead him to the ruins of Las Vegas. There he finds Deckard who attacks K. K manages to fight off Deckard, who eventually surrenders. Deckard reveals that he is the father of Rachael's child and that he scrambled the birth records to protect the child's identity; Deckard left the child in the custody of the Replicant freedom movement.Luv confronts Joshi and asks her to reveal K's location, which she refuses to do. After killing Joshi, Luv and her men track K to Deckard's location using Joshi's terminal. They kidnap Deckard, destroy Joi and leave K to die. K is rescued by the Replicant freedom movement, whose leader Freysa (Hiam Abbass) informs him that Rachael's child is female.\nTo prevent Deckard leading Wallace to the child or the freedom movement, Freysa asks K to kill Deckard. Deckard is brought before Wallace, who offers him a clone of Rachael as a reward for revealing what he knows. When Deckard refuses, Luv kills the Rachael clone, and escorts Deckard off-world to be interrogated.K intercepts Deckard's captors and kills Luv but is severely injured in the fight. He stages Deckard's death to protect him from Wallace and the Replicants, and leads Deckard to Stelline's office, having deduced that she is his daughter, and that the memory of the toy horse is hers.\nK lies down and looks up into the sky, dying peacefully from his injuries, while Deckard approaches Stelline.",
	"links": [
		"https://www.amazon.com/Blade-Runner-2049-Ryan-Gosling/dp/B0765NR8MJ"
	]
}