{
	"title": "Serbuan maut",
	"release_year": "2011",
	"runtime": "101",
	"tags": [
		"Action",
		"Crime",
		"Thriller",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Iko Uwais",
		"Ananda George",
		"Ray Sahetapy",
		"Donny Alamsyah",
		"Joe Taslim",
		"Yayan Ruhian",
		"Pierre Gruno",
		"Tegar Satrya",
		"Iyang Darmawan",
		"Eka 'Piranha' Rahmadia"
	],
	"staff": [
		"Gareth Evans",
		"Gareth Evans",
		"Ario Sagantoro",
		"Aria Prayogi",
		"Mike Shinoda",
		"Joseph Trapanese",
		"Fajar Yuskemal",
		"Matt Flannery",
		"Dimas Imam Subhono",
		"Gareth Evans"
	],
	"votes": 219353,
	"cover": "https://m.media-amazon.com/images/M/MV5BOGUxM2Q0MzItZDRmYy00ZWY1LWFiNzctNmY3Njg2ODJjZWNmXkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Indonesian special tactics officer Rama (Iko Uwais) prays, practices Silat and bids goodbye to his father and wife, who is pregnant with his child. He cryptically promises his father he will \"bring him home.\" Rama joins a 20-man elite police squad, including Officers Bowo (Tegar Satrya) and Dagu (Eka \"Piranha\" Rahmadia), Sergeant Jaka (Joe Taslim), and Lieutenant Wahyu (Pierre Gruno), for a raid on an apartment block in Jakarta's slums. The team intends to capture crime lord Tama Riyadi (Ray Sahetapy), who, along with his two lieutenants Andi (Donny Alamsyah) and Mad Dog (Yayan Ruhian), owns the block and lets criminals around the city rent rooms under his protection. Arriving undetected, the team sweeps the first floors and subdues various criminal tenants; they also temporarily detain an innocent, law-abiding tenant delivering medicine to his sick wife in apt #726. Continuing undetected to the sixth floor, the team is spotted by a young lookout, who passes on the message to another adolescent lookout, before he is shot and killed by Wahyu; but the latter youth raise the alarm.Tama calls down reinforcements. They snipe the two police officers patrolling the outside and shoot up the two waiting in the SWAT van, then ambush those on the first five floors, killing many of them. Cutting the lights, Tama announces over the PA system that the police are trapped on the sixth-floor stairwell, and he will grant free permanent residence to those who kill the intruders. In the darkness, the remaining team members are ambushed by shooters from above and behind and are almost completely wiped out. Under fire, Wahyu admits to Jaka he has staged the mission, so he can eliminate Tama, who is in league with many corrupt police officers, including himself. The mission is not officially sanctioned by the police command; nobody knows their location, and, regardless, no backup or reinforcements will be allowed to help.The remaining officers flee into an empty apartment, then use their ax to make a hole in the floor. Officer Bowo is shot and injured by a mob of pursuing thugs below. Rama uses a small propane tank, from under the kitchen sink to construct an improvised explosive device that kills the goons, giving them a small window of time. With more antagonists approaching, the team splits into two groups: Jaka, Wahyu, and Dagu retreat to the fifth floor, while Rama and Bowo ascend to the seventh.Fighting their way to apartment 726. Rama and Bowo must plead with the tenant for help, and despite his sick wife's protest, he reluctantly hides the officers in a secret wall space. Four machete-wielding thugs arrive and ransack the man's apartment but fail to find Rama and Bowo. After tending to Bowo's wounds, Rama leaves him with the couple to search for Jaka's team; however, he crosses paths again with the machete gang. He manages to dispatch one member and flee but is forced to fight the rest of them without any weapon. Rama defeats the group, including their leader, whom he uses to smash through a window and cushion a three-story plummet onto a fire escape below. He then continues his search, only to be confronted by Andi, who has just murdered two of Tama's thugs in the elevator. Rama and Andi are revealed to be estranged brothers, and Rama signed up for the mission to search for him, at the urging of their father. Rama refuses to leave the building without his comrades, and Andi refuses to leave his auspicious criminal life.Concurrently, Jaka and his group are found by Mad Dog. Lt. Wahyu flees, and Jaka orders Dagu to follow Wahyu. Mad Dog captures Jaka, but instead of shooting him, he challenges him to a hand-to-hand battle, which concludes with Mad Dog killing Jaka. Afterward, he drags the corpse to an elevator, where he meets up with Andi. Tama suspects that Andi aided Rama thanks to the numerous security cameras in the building. Tama does not fully understand Andi's betrayal but stabs him in the hand and turns him over to Mad Dog.Rama regroups with Wahyu and Dagu, who go on to fight through a narcotics lab, and they head for Tama on the 15th floor. Rama, finding Andi being beaten by Mad Dog, separates from Wahyu and Dagu to save him. Mad Dog allows him to free Andi and fights both brothers simultaneously. Mad Dog initially has the upper hand, but the brothers prove to be a match for him when working together. After an intense and grueling fight, Mad Dog eventually overcomes the brothers but is stabbed in the neck by Andi while trying to finish off Rama. This weakens him enough for the brothers to finally kill him.Meanwhile, Wahyu and Dagu confront Tama, only for Wahyu to betray and kill Dagu. Wahyu takes Tama hostage with the intention of using him to escape, but Tama taunts Wahyu by revealing that Tama had been waiting for the team before the events of the movie began, and Wahyu was set up by his corrupt higher-ups; even if Wahyu escapes, he will be killed later.Panicked, Wahyu kills Tama and attempts suicide, only to find that he has no bullets left.\nAndi uses his influence over the tenants to allow Rama to leave with Bowo and a detained Wahyu. The tenant who protected Bowo watches from a window and grins with delight. Andi also hands over numerous blackmail recordings Tama made of corrupt officers taking bribes, hoping that Rama can use them to his benefit. Rama asks Andi to come home, but Andi refuses, due to his acclimation to his criminal lifestyle. Before Rama leaves, Andi asserts he can protect Rama in his role as a criminal boss, but that Rama could not do the same for him. Andi turns around and walks back to the apartment block with a grin that breaks into a wide smile, while Rama, with Wahyu and an injured Bowo, exits to an uncertain future.",
	"links": [
		"https://www.amazon.com/Raid-Redemption-Iko-Uwais/dp/B008KNZ4LO"
	]
}