{
	"title": "X-Men: Days of Future Past",
	"release_year": "2014",
	"runtime": "132",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.9,
	"actors": [
		"Patrick Stewart",
		"Ian McKellen",
		"Hugh Jackman",
		"Hugh Jackman",
		"James McAvoy",
		"Michael Fassbender",
		"Jennifer Lawrence",
		"Jennifer Lawrence",
		"Halle Berry",
		"Nicholas Hoult",
		"Nicholas Hoult",
		"Anna Paquin",
		"Elliot Page"
	],
	"staff": [
		"Bryan Singer",
		"Simon Kinberg",
		"Jane Goldman",
		"Matthew Vaughn",
		"Simon Kinberg",
		"Hutch Parker",
		"Lauren Shuler Donner",
		"Bryan Singer",
		"John Ottman",
		"Newton Thomas Sigel",
		"John Ottman",
		"Andrea Kenyon",
		"Roger Mussenden",
		"Randi Wells",
		"John Myhre"
	],
	"votes": 756731,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzNiYWE4NjMtMTU4OS00NmM4LWE4ZjAtYmE5OTA5NjkzODExXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In the future, robots known as Sentinels are exterminating all mutants, as well as any humans who seek to help them. A band of mutants evades the Sentinels in Moscow with the help of Kitty Pryde (Ellen Page), who can project a person's consciousness into the past. Upon the sentinel attack she projects one of the mutants into the past to change some event such that the present events do not even take place.Pryde's group convenes with Storm (Halle Berry), Wolverine (Hugh Jackman), Professor Xavier (James McAvoy and Patrick Stewart), and Magneto (Michael Fassbender and Ian McKellen) at a monastery in China. Pryde sends Wolverine's consciousness to 1973 to prevent Mystique (Jennifer Lawrence) from assassinating Bolivar Trask (Peter Drinklage), the creator of the Sentinels.Following the assassination, Mystique was captured, and her DNA was used by Trask's company to create Sentinels, whose ability to adapt to any mutant power makes them almost invincible. Xavier and Magneto advise Wolverine to find both of their younger selves for help. Logan has limited time as Sentinels are bound to find the mutants in China and once they do, this time mutants won't be able to escape as Pryde would be busy projecting Logan into the past & won't be able to project anyone else.Also, whatever Logan changes would become history & would be the only history that the rest of the world will remember, but Logan will be the only person who will remember the truth.\nWolverine awakens in 1973 (into his younger body), he still has his original claws & not the ones created by William Stryker. At the X-Mansion, he encounters Xavier and Beast. Xavier's Institute for Gifted Youngsters has closed after most of the teachers and students were drafted for the Vietnam War. Xavier, now a broken man, is overusing a serum which allows him to walk (After he was shot & paralyzed in the Cuban missile crisis incident) and suppresses his telepathy.Wolverine explains his mission and persuades Xavier to help free Magneto from a prison cell beneath the Pentagon, where he is being held for allegedly assassinating President John F. Kennedy (which explains the magic bullet theory, a bullet with a curved path that killed JFK). They rescue Magneto with the help of Peter Maximoff, a mutant with superhuman speed.\nIn Washington D.C., Trask unsuccessfully lobbies Congress to gain support for his Sentinel program as the defense committee is not willing to fund a program to target its own citizens & is not convinced that mutants are a threat to society. Meanwhile, in Saigon, Mystique prevents a young William Stryker (Josh Helman) from appropriating a group of mutant G.I.s for Trask's research.Mystique investigates Trask's office and discovers he has been capturing mutants to use in experiments. She also finds that Trask is having a meeting in Paris with the Vietnamese generals & plans to kill him there.\nXavier, Magneto, Beast, and Wolverine fly to Paris to intercept Mystique. on the plane Magneto tells Charles that he didn't kill JFK, in fact he was trying to save JFK, before he was taken out. JFK, he claims was a mutant too.In Paris, Mystique impersonates a South Vietnamese general to infiltrate the Paris Peace Accords with Trask, who is trying to sell his Sentinel technology to communist nations. Xavier, Magneto, Beast, and Wolverine arrive as Mystique is about to kill Trask. Magneto tries to kill Mystique to ensure her DNA cannot be used for the Sentinels, but she jumps from a window. The fight spills onto the street in view of the public where Charles tries to save Mystique, while magneto tries to kill her, allowing Magneto and Mystique to escape. During this time in the future, Pryde's control over Logan weakens, who injures Pryde.Trask is saved, but the world is horrified by the existence of mutants. President Richard Nixon approves Trask's Sentinel program and arranges an unveiling ceremony. Trask's scientists recover Mystique's blood from the street.\nMystique tracks down Erik/Magneto & confronts him on his attack on her. Magneto explains that now that Trask has Mystique's blood they have to strike now while they still have the upper hand. Mystique agrees to support Magneto.Meanwhile, Magneto-who has recovered his telepathy-blocking helmet-intercepts the prototype Sentinels in transit and laces their polymer-based frames with steel, allowing him to control them. At the mansion, Xavier stops taking his serum and slowly regains his mental powers, while losing the ability to walk. Through Wolverine, Xavier speaks to his future self and is inspired to work for peace between humans and mutants once again. He uses Cerebro to track Mystique, who is heading to Washington D.C.As Xavier, Wolverine, and Beast search for Mystique, Nixon unveils the Sentinel prototypes at the White House. Mystique tries to kill Nixon (disguised as a secret service member), but Xavier finds her in time, stops her & then persuades her that killing the President or Trask would be the wrong thing to do.Magneto commandeers the Sentinels and attacks the crowd, then sets the Robert F. Kennedy Memorial Stadium around the White House as a barricade. Nixon and Trask, accompanied by the Cabinet, Secret Service officers, and Mystique (disguised as a Secret Service member), are taken to a safe room. Wolverine and Beast try to stop Magneto, but he pits a Sentinel against them and then throws Wolverine into the Potomac River.In the future, the X-Men make their final stand as a large army of Sentinels attack the monastery.\nIn 1973, Magneto pulls the safe room from the White House and prepares to kill Nixon and his Cabinet. Mystique, disguised as Nixon, incapacitates Magneto with a plastic gun. Xavier persuades Mystique to spare Trask and allows her and Magneto to flee. Mystique's actions are seen as a mutant saving the President, leading to the cancellation of the Sentinel program. Trask is arrested for trying to sell American military secrets.Wolverine wakes up in the future to find Iceman, Rogue, Colossus, Pryde, Beast, Storm, Jean Grey, Cyclops, and Xavier alive. In 1973, Mystique impersonates Stryker and takes custody of Wolverine.",
	"links": [
		"https://www.amazon.com/X-Men-Days-Future-James-McAvoy/dp/B00KIGRRRU"
	]
}