{
	"title": "Nebraska",
	"release_year": "2013",
	"runtime": "115",
	"tags": [
		"Drama",
		"amazon"
	],
	"rating": 7.7,
	"actors": [
		"Bruce Dern",
		"Will Forte",
		"June Squibb",
		"Bob Odenkirk",
		"Stacy Keach",
		"Mary Louise Wilson",
		"Rance Howard",
		"Tim Driscoll",
		"Devin Ratray",
		"Angela McEwan"
	],
	"staff": [
		"Alexander Payne",
		"Bob Nelson",
		"Albert Berger",
		"Ron Yerxa",
		"Mark Orton",
		"Phedon Papamichael",
		"Kevin Tent",
		"John Jackson",
		"J. Dennis Washington"
	],
	"votes": 124587,
	"cover": "https://m.media-amazon.com/images/M/MV5BYTgyNzRhMTQtZWUxZi00YzFmLTlhYTItNzY5ZDY2ZjdlYjM1XkEyXkFqcGc@._V1_QL75_UX190_CR0,8,190,281_.jpg",
	"description": "Woody Grant (Bruce Dern) is found walking in Billings, Montana, traffic and stopped by a police officer. He is picked up by his son, David (Will Forte), who learns that Woody wants to go to Lincoln, Nebraska to collect a $1 million sweepstakes prize he has won. When David sees the sweepstakes letter, he realizes that it is a mail scam to make a person purchase magazine subscription. He returns Woody to his home, where David's mother Kate (June Squibb) becomes annoyed by Woody insisting on collecting his money. This happens again with David being disrupted at his job as a stereo salesman. He and his brother Ross (Bob Odenkirk), a local news anchor, discuss putting Woody in a retirement home. David is later paid a visit by his ex-girlfriend Noel (Missy Doty), who is returning his things, and refuses to move back in. Their conversation is cut short by a call from David's mother reporting that his father has left yet again. David retrieves Woody and decides to drive Woody to Lincoln, much to Kate's dismay.Upon arriving in a town on the way, Woody disappears and goes on a drinking bender. He returns to their hotel room and falls, hitting his head on the dresser. David wakes to this, takes him to the hospital for stitches and realizes that Woody has lost his dentures. They retrace Woody's steps to some train tracks where they locate his dentures, which Woody unceremoniously puts back in his mouth. While Woody was in the hospital, David had notified the family and plans were made for a reunion in Woody's hometown.They arrive in Woody's hometown of \"Hawthorne,\" set in Madison County, Nebraska. They have lunch with Woody's brother Ray (Rance Howard) and his family. Woody and David spend time catching up with the other family members. They go to the main street and visit a mechanic shop Woody used to own and then to the local bar. When David brings up Woody's alcoholism and problems within the family-with Woody stating that he did not love his wife nor really want children-they get into an argument, which makes Woody leave. When Woody sees another bar on the street, they decide to go in. They encounter Woody's old business partner, Ed Pegram (Stacy Keach), whom the family blames for stealing Woody's air compressor decades ago. Against David's recommendation, Woody mentions winning the money and the customers of the bar give him a toast. The next morning, they learn that the news has spread through the town.They drive to the bus station to pick up Kate, who is joining in on the reunion. Kate takes Woody and David to the cemetery to pay respects to relatives past and provides some colorful history on Woody's relatives and their behavior. While later having dinner at a restaurant, Ed, who is singing karaoke, alerts the diners to their presence. When David goes to the bathroom, Ed approaches him about some money Ed loaned Woody several years ago that hasn't been re-paid and asks him to pay the money soon. He gives a not-so-subtle warning of legal action. David also meets with the local newspaper owner who had been planning a story on Woody to tell her the truth about the \"sweepstakes.\" He discovers that she is an ex-girlfriend of his father and learns a little more about his dad, including how he was affected when he came back from the Korean War.The rest of Woody's family, including Ross, come to visit him. Woody's nephews, Cole and Bart (Devin Ratray and Tim Driscoll), and other relatives approach David and Ross about getting some money that they believe Woody owed them and a fight begins. But the fight ends abruptly with Kate calling out the relatives for unpaid debts they owe Woody. David, Kate, Ross and Woody tour Woody's childhood home, which has fallen into disarray and neglect. They drive past a house Kate says is Ed's, and David and Ross elect to steal back the air compressor. However, Kate comes to realize that the house actually belongs to another couple, whom Kate distracts when they arrive home as David and Ross are returning the air compressor.At the bar, Woody and David run into Ed, who in the middle of asking Woody for the money reveals that Woody cheated on Kate before David's birth. When leaving the bar, they are attacked by a masked Bart and Cole who steal the sweepstakes letter and take off. When David later confronts them, they insult him and Woody and state that they threw it away after finding out there was no prize money. David and Woody go searching for it and learn that Ed has it and is reading it out to the bar customers, attempting to humiliate Woody.Woody takes the letter back and David punches Ed. Woody had told anyone who asked that he wanted to buy a truck with the money. David presses him about this since Woody cannot drive anymore, to which Woody replies that he also wanted to leave something for his family when he passes. David tells Woody that they aren't going to Lincoln, at which point Woody collapses and David takes him to the hospital. In the middle of the night, Woody abruptly leaves and starts walking. David again agrees to take Woody to Lincoln.They arrive at the marketing agency to collect the money, where they discover that Woody did not win. He is, however, given a prize winner hat. Before they leave Lincoln, David goes to a car dealership and sells his car to buy Woody a truck. He also buys him a new air compressor. David has Woody drive the truck up and down Hawthorne's Lucas Street for all to see. Among them is the former flame of Woody's who smiles at him, a perplexed Ed with a black eye, and his brother Albert, who he waves goodbye to. Woody drives the truck out of town, then stops in the road and switches seats with David who drives them home.",
	"links": [
		"https://www.amazon.com/Nebraska-Bruce-Dern/dp/B00HVNZ1DK"
	]
}