{
	"title": "Spotlight",
	"release_year": "2015",
	"runtime": "129",
	"tags": [
		"Biography",
		"Crime",
		"Drama"
	],
	"rating": 8.1,
	"actors": [
		"Mark Ruffalo",
		"Michael Keaton",
		"Rachel McAdams",
		"Liev Schreiber",
		"John Slattery",
		"Brian d'Arcy James",
		"Stanley Tucci",
		"Elena Wohl",
		"Gene Amoroso",
		"Doug Murray"
	],
	"staff": [
		"Tom McCarthy",
		"Josh Singer",
		"Tom McCarthy",
		"Blye Pagon Faust",
		"Steve Golin",
		"Nicole Rocklin",
		"Michael Sugar",
		"Howard Shore",
		"Masanobu Takayanagi",
		"Tom McArdle",
		"Kerry Barden",
		"Paul Schnee",
		"Stephen H. Carter"
	],
	"links": [
		"https://www.amazon.com/Spotlight-Blu-ray-Mark-Ruffalo/dp/B019NB5EVG"
	],
	"votes": 507328,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjIyOTM5OTIzNV5BMl5BanBnXkFtZTgwMDkzODE2NjE@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "In 2001, The Boston Globe hires a new editor, Marty Baron (Liev Schreiber). Baron meets Walter \"Robby\" Robinson (Michael Keaton), the editor of the Spotlight team, a small group of journalists writing investigative articles that take months to research and publish. Robby says that his team reports into Ben Bradlee Jr. (John Slattery), who has so far supported the Spotlight team completely.After Baron reads a Globe column about a lawyer, Mitchell Garabedian, who says that Cardinal Law (the Archbishop of Boston) knew that the priest John Geoghan was sexually abusing children and did nothing to stop him, he urges the Spotlight team to investigate. Marty talks to the DA about lifting a seal on a set of documents in possession of the church that Garabedian claims can prove that Cardinal Law knew about the systemic abuses by priests for a number of years and yet did nothing about it.Robby and his colleague Sacha Pfeiffer (Rachel McAdams) speak to the company lawyer Eric Macleish, who advises Robby that the statute of limitations on sexual abuse cases is only 3 years and mostly victims don't come before the law till long after the act. even then damages are capped to $ 20,000 per abuse. So, the only way to proceed is to try the cases in press, which won't happen unless the victims agree to come forward voluntarily to tell their story on TV. Eric believes that Garabedian does not have anything on Cardinal Law & most of his 80 plaintiffs are not cooperating with him.Journalist Michael Rezendes (Mark Ruffalo) contacts Garabedian, who initially declines interview. Though he is told not to, Rezendes reveals that he is on the Spotlight team, persuading Garabedian to talk.\nThere are subtle hints in the movie that most people refuse to cooperate with the Spotlight team as they believe that the editor Marty (who is Jewish, unmarried & no family), is anti-Catholic and is hence pushing the Spotlight team to continue with the investigation.Initially believing that they are following the story of one priest who was moved around several times, the Spotlight team begin to uncover a pattern of sexual abuse of children by Catholic priests in Massachusetts, and an ongoing cover-up by the Boston Archdiocese. Through a man Paul Saviano, who heads a victim's rights organization, they widen their search to thirteen priests.Robby shares his findings with Ben, who asks Robby to ignore Saviano. Robby tells his team to start ignoring everyone with regard to this case & pursue it completely. As the investigation proceeds, Sacha and Marty speak to a number of victims, who say that Paul Saviano had introduced them to a lawyer (who turns out to be Eric Macleish), who had discouraged them from pursuing the latter legally. Robby & Sacha speak to Eric who says that all settlements were handled privately between the victim and the church, nothing was ever filed in court. Eric says that the church always promised to take the offending priest out of circulation, but there was never any way to confirm that. Eric was completely in on the cover up.They learn through an ex-priest who worked trying to rehabilitate pedophile priests that there should be approximately ninety abusive priests in Boston. Through their research, they develop a list of eighty-seven names, and begin to find their victims to back up their suspicions.\nRobby and Sacha again meet Macleish to get him to give them a list of priests for whom he ran settlements. Robby even threatens Eric for it. Eric says that he sent a list of 20 priests to the paper in 1987, but it was buried. The next morning Eric sends a list of 45 priests for whom he ran settlements.When the September 11 attacks occur, the team is forced to push the story to the back burner. They regain momentum when Rezendes learns from Garabedian that there are publicly available documents that confirm Cardinal Law was aware of the problem and ignored it.\nAfter The Boston Globe wins a case to have even more legal documents unsealed, the Spotlight Team finally begins to write the story, and plan to publish their findings in early 2002.As they are about to go to print, Robinson confesses to the team that he was sent a list of twenty pedophile priests in 1993 in a story he never followed up on. Baron, nevertheless, tells Robinson and the team that the work they are doing is important. The story goes to print with a link leading to the documents that expose Cardinal Law, and a phone number requesting victims of pedophile priests to come forward. The following morning, the Spotlight team is inundated with phone calls from victims coming forward to tell their stories. The film closes with a list of places in the United States and around the world where the Catholic Church has been involved in concealing abuse by priests. By December 2002, The Spotlight team published 600 stories of abuse by 249 priests in Boston alone.Cardinal Law resigned in December 2002. He was re-assigned to Rome, at one of the highest-ranking churches in the world."
}