{
	"title": "The Amazing Spider-Man 2",
	"release_year": "2014",
	"runtime": "142",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Andrew Garfield",
		"Andrew Garfield",
		"Emma Stone",
		"Jamie Foxx",
		"Jamie Foxx",
		"Paul Giamatti",
		"Dane DeHaan",
		"Dane DeHaan",
		"Colm Feore",
		"Felicity Jones",
		"Sally Field",
		"Embeth Davidtz",
		"Campbell Scott"
	],
	"staff": [
		"Marc Webb",
		"Alex Kurtzman",
		"Roberto Orci",
		"Jeff Pinkner",
		"James Vanderbilt",
		"Avi Arad",
		"Matt Tolmach",
		"Michael Einziger",
		"Tom Holkenborg",
		"Andrew Kawczynski",
		"Johnny Marr",
		"Dan Mindel",
		"Pietro Scalia",
		"Kathleen Chopin",
		"Francine Maisler",
		"Mark Friedberg"
	],
	"votes": 547305,
	"cover": "https://m.media-amazon.com/images/M/MV5BOTA5NDYxNTg0OV5BMl5BanBnXkFtZTgwODE5NzU1MTE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Former Oscorp scientist Richard Parker records a video message to explain the circumstances behind his disappearance. While attempting to flee with his wife, Mary, aboard a private jet, they are confronted by an assassin sent to retrieve Richard's research. A struggle ensues, and the jet crashes, killing both Richard and Mary.In the present, two years after defeating Dr. Curt Connors, Peter Parker continues his crime-fighting as Spider-Man. While apprehending Russian criminal Aleksei Sytsevich, Peter grapples with his promise to Gwen Stacy's late father to stay away from her for her safety. After their high school graduation, Gwen decides to end their relationship, sensing Peter's lingering doubts.Meanwhile, Peter's childhood friend, Harry Osborn, returns to New York to visit his dying father, Norman Osborn, the CEO of Oscorp. Norman reveals that his terminal illness is genetic and warns Harry that his symptoms will soon develop. Following Norman's death, Harry is named Oscorp's new CEO.At Oscorp, electrical engineer Max Dillon, an isolated and awkward employee, suffers an accident when he falls into a tank of genetically engineered electric eels. The incident transforms him into a living generator of electricity. Unaware of his powers, Max, now calling himself \"Electro,\" wanders into Times Square, causing a massive power outage. Spider-Man intervenes, subdues Electro, and has him sent to the Ravencroft Institute, where Dr. Ashley Kafka begins studying him.As Harry starts exhibiting symptoms of his inherited illness, he deduces from his father's research that Spider-Man's blood might cure him. Harry pleads with Peter to help him contact Spider-Man. Torn by the risks of a transfusion, Peter, as Spider-Man, refuses, fearing it might worsen Harry's condition. Furious, Harry lashes out. Adding to his troubles, Oscorp's vice president, Donald Menken, frames Harry for covering up Electro's accident, ousts him as CEO, and seizes control of the company.Desperate for revenge, Harry teams up with Electro, who agrees to help him infiltrate Oscorp in exchange for freedom. Together, they kill Dr. Kafka and take back the company. Harry discovers a hidden supply of venom from Oscorp's genetically engineered spiders and injects himself with it. The venom accelerates his illness, mutating him into a goblin-like creature, but an armored suit restores his health and enhances his strength.Meanwhile, Peter uncovers Richard Parker's hidden lab in an abandoned subway station. He learns that Richard fled because he refused to let Norman Osborn weapons his research. Peter also discovers that Richard used his own DNA in the creation of the genetically engineered spiders, making their effects unique to Peter and preventing Oscorp from recreating the experiments.Afterward, Peter reconnects with Gwen, who reveals she has been offered a scholarship to Oxford University. Peter confesses his love for her, and they decide to move to England together.Electro, seeking vengeance, causes a massive blackout across the city. Peter and Gwen work together to restore power and overload Electro's energy, killing him. However, their victory is short-lived when Harry, now the Green Goblin, arrives and kidnaps Gwen after deducing Spider-Man's true identity. Taking her to the top of a clock tower, Harry taunts Peter and drops Gwen. Though Peter subdues the Goblin, he fails to save Gwen, who falls to her death. Devastated and guilt-ridden, Peter abandons his role as Spider-Man.Five months later, Harry, imprisoned at Ravencroft, begins recovering from his transformation. He conspires with his associate, Gustav Fiers, to assemble a team of villains, starting with Sytsevich. Outfitted with an electromechanical suit of armor, Sytsevich dubs himself the \"Rhino\" and wreaks havoc in the city. Inspired by Gwen's graduation speech, Peter rediscovers his purpose and returns as Spider-Man to confront the Rhino, ready to embrace his responsibility once more.",
	"links": [
		"https://www.amazon.com/Amazing-Spider-Man-Set-4K-UHD/dp/B09QFJ5B5T"
	]
}