{
	"title": "Deepwater Horizon",
	"release_year": "2016",
	"runtime": "107",
	"tags": [
		"Action",
		"Drama",
		"History",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Mark Wahlberg",
		"Kurt Russell",
		"Douglas M. Griffin",
		"James DuMont",
		"Joe Chrest",
		"Gina Rodriguez",
		"Brad Leland",
		"John Malkovich",
		"David Maldonado",
		"JD Evermore"
	],
	"staff": [
		"Peter Berg",
		"Matthew Michael Carnahan",
		"Matthew Sand",
		"David Barstow",
		"David Rohde",
		"Lorenzo di Bonaventura",
		"Stephen Levinson",
		"Mark Vahradian",
		"Mark Wahlberg",
		"Steve Jablonsky",
		"Enrique Chediak",
		"Gabriel Fleming",
		"Colby Parker Jr.",
		"Deborah Aquila",
		"Tricia Wood",
		"Chris Seagers"
	],
	"votes": 185642,
	"cover": "https://m.media-amazon.com/images/M/MV5BOTEzNDU0OTgxM15BMl5BanBnXkFtZTgwNjA0ODM2OTE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "On April 20, 2010, Deepwater Horizon, an oil drilling ship operated by private contractor Transocean, is set to begin drilling off the southern coast of Louisiana on behalf of BP. Each deep ocean well is equipped with a Blow Out Preventor (BoP) at the ocean floor, which is designed to shut down in the event of a catastrophe and acts as a well pressure control and fail safe. For Deepwater Horizon the BoP is at a depth of 3.5 miles. Unknown to anyone, the BoP is not firmly secured in place and the cement around it is slowly cracking and even leaking tiny amount of oil, not being registered on any sensors or visual inspections.Workers on the rig work in 21-day shifts. Michael Williams is with his wife Felicia (Kate Hudson) and daughter, when he rotates to the rig for his shift from the Bristow Heliport, which is the transportation hub for offshore personnel.\nDeepwater is 41 miles off the Louisiana coast and free floating 5200 feet over the gulf floor. It has 126 crew members on board.Crew members Michael \"Mike\" Williams (Mark Wahlberg) and his superior, James \"Jimmy\" Harrell (Kurt Russell), are surprised to learn that the Schumberger workers assigned to pour the concrete foundation intended to keep the well stable are being sent home early without conducting a pressure test (cement bond log (CBL)), at the insistence of BP liaison Donald Vidrine (John Malkovich) and Robert Kaluza (Brad Leland). The well is 43 days behind schedule (and $50 million over budget) and hence there is pressure from the top to start production ASAP by bypassing critical safety procedures. The test itself would have cost $125,000.While Mike preps the drilling team, including Caleb Holloway (Dylan O'Brien), Shane Roshto (Henry Frost) and Adam Weise (Jeremy Sande), Harrell meets with Vidrine and persuades him to conduct a negative pressure test, which only serves to weaken the already-crumbling foundation further.\nThe test indicates the cement has not properly sealed the well from the high-pressure reservoir. Vidrine disputes the test finding and orders a second test. Vidrine argues that the test indicated a high amount of pressure, but no mud came to the top, as should be expected with a failed test.After concluding the second test was a success, Vidrine pressures senior tool-pusher Jason Anderson (Ethan Suplee) to run more tests and orders the rig to remove the drilling mud and prepare the rig to move to its next job. Once the drilling job is done, the rig is move to its next site, while a production rig is brought over to run the oil extraction process.Harell is about to confront Vidrine, when the other BP execs shuttle Harrell out of the room to present him a safety award in front of the entire crew. Vidrine runs another pressure test which comes out OK, as the pipes are blocked with large rock particles.\nWithout waiting for Harrell to confirm the results, Vidrine orders the well to be opened. At first, the operation goes smoothly, but the foundation eventually gives way, triggering a massive blowout that nearly kills the entire drilling crew.A chain of equipment malfunctions, coupled with a failed attempt to seal the well, ignites the oil, killing 11 workers. Andrea Fleytas (Gina Rodriguez), the rig's navigation officer, tries to alert the Coast Guard, but her superior Captain Curt Kuchta (Dave Maldonado) overrides her on the grounds that the rig is not in any imminent danger, at least until the rig erupts in flames. Then Kuchta sends out his own call for help.With oil leaking into the ocean, a frightened pelican flies into the bridge of a nearby vessel, the Damon Bankston, which was there to collect the drilling mud from the well, which heads towards the rig just as the workers begin a frantic evacuation. Harrell, still alive, although badly injured in the explosion, is rescued by Mike and assumes control of the situation, only to realize that the rig cannot be saved. Dale Burkeen (Jason Kirkpatrick), a close friend of Mike's sacrifices himself to keep the burning crane from collapsing onto the surviving crew, while Mike and Caleb are able to retrieve Vidrine and get him to safety.The crew delays hitting the pipe cutting valve that would seal the well, as they don't think they have the authority. By the time Harrell makes his way to the bridge to hit the switch, it is too late, and the fire keeps burning out of control.As night falls and the burning oil lights up the area, the Coast Guard becomes aware of the incident and sends a ship to collect the survivors. The survivors were being ferried in the lifeboats to the Damon Bankston as it was already on scene to assist with the evacuation and rescue.\nWith all the lifeboats full, Mike locates the emergency life raft, but it becomes separated from the rig before he and Andrea can board, causing the latter to suffer a panic attack. Just as the oil in the well itself ignites and destroys the rig, the two jump into the water and are picked up by rescuers, who then ferry them to the Damon Bankston, where the surviving crew mourn their lost crewmen and say the Lord's Prayer.Eventually the rig loses power and the engines keeping the rig in position shut down. The pipes thus start tilting eventually leading to the Blow Out Preventor on the ocean floor to be torn apart and 210 million gallons of crude oil to flow unrestricted into the Gulf of Mexico.Returned home, the workers reunite with their families in a hotel lobby, during which a relative of one of the deceased confronts Mike for failing to save him, resulting in Mike having a panic attack with his wife by his side.The film ends with a series of clips showing the aftermath of the disaster, including testimony from the real-life Mike Williams and the revelation that Donald Vidrine and Robert Kaluza were the only two people prosecuted for their actions; both were charged with eleven counts of manslaughter. By 2015 these charges were dismissed. Pictures appear of the eleven men who lost their lives before the credits. The movie postscript reads: \"The blowout lasted for 87 days, spilling an estimated 210 million gallons of oil into the Gulf of Mexico. It was the worst oil disaster in U.S. history.\"",
	"links": [
		"https://www.amazon.com/Deepwater-Horizon-Mark-Wahlberg/dp/B01LWOVD45"
	]
}