{
	"title": "Let's Be Cops",
	"release_year": "2014",
	"runtime": "104",
	"tags": [
		"Action",
		"Comedy",
		"Crime",
		"amazon"
	],
	"rating": 6.4,
	"actors": [
		"Jake Johnson",
		"Damon Wayans Jr.",
		"Rob Riggle",
		"Nina Dobrev",
		"James D'Arcy",
		"Keegan-Michael Key",
		"Andy Garcia",
		"Jonathan Lajoie",
		"Tom Mardirosian",
		"Natasha Leggero"
	],
	"staff": [
		"Luke Greenfield",
		"Luke Greenfield",
		"Nicholas Thomas",
		"Luke Greenfield",
		"Simon Kinberg",
		"Aditya Sood",
		"Christophe Beck",
		"Jake Monaco",
		"Daryn Okada",
		"Bill Pankow",
		"Jonathan Schwartz",
		"Mark Fincannon",
		"Nancy Foy",
		"Christian Kaplan",
		"William Arnold"
	],
	"votes": 140848,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjI3MDY2ODQwNF5BMl5BanBnXkFtZTgwNjUzNjE4MTE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Two longtime pals, Justin (Damon Wayans, Jr.), a reject video game designer, and Ryan (Jake Johnson), a washed-up college quarterback, recall a pact they once made: if they hadn't \"made it\" in Los Angeles by the time they were thirty, they would head back to their Columbus, Ohio hometown. Ryan makes a living by appearing in state commercials for congenital diseases, like Herpes.\nWhile exiting a bar, their car is hit by a vehicle full of Albanians, who intimidate them into doing nothing as they were riding with their muscle men.Justin attempts to pitch a game about policemen, but his boss Todd (Jon Lajoie) bullies him down. Todd says that nobody wants to be a cop and says that people like firefighters. Todd is into Vampires, Zombies and such themes which have been done to death.\nLater, Ryan convinces him to use the police uniforms from his presentation as costumes for their college reunion party. Upon attending, both are confronted with their failures and mutually accept to honor their pact. As they walk home, they are treated like real cops (all the hot girls notice them and one of them even walks up to kiss them) and decide to enjoy the gag.\nIt allows Justin to finally get the attention of Josie (Nina Dobrev), a waitress to whom he is attracted and who works at a local diner, Georgie's. During the night, they also find the Albanian gang parked outside Georgie's. The Albanians were threatening Georgie to sign a partnership agreement with their boss Mossi, when Ryan and Justin walked in. Ryan takes control of the situation and forces the Albanians to retreat from the diner. The local business owners applaud the cops and Joise now acknowledges Justin as a hero.But now the Albanians report to Mossi that the cops stopped them from getting Georgie to sign on the partnership agreement.Ryan decides to take the hoax further than one night. Ryan doubles down on the hoax, learning official procedures from YouTube and modifying a decommissioned Ford Crown Victoria Police Interceptor to resemble an active Los Angeles Police Department vehicle. On one of their drives, they are mistaken for male strippers for a hens party.\nAlthough reluctant, Justin agrees to continue the charade, and through it begins a relationship with Josie. Ryan gets revenge on the Albanians who hit his car, unaware they are actually mobsters blackmailing the owner of Georgie's.\nThey use a police radio to monitor emergency frequencies and respond to calls where females are involved. They end up in a cat fight between 3 fat, and middle-aged sorority sisters. One of the ladies was having an affair with the husband of the other sorority sister and the 2 were going at it with each other.During their many shenanigans, Ryan and Justin end up on a real distress call with Patrol Officer Segars (Rob Riggle). Segars had stopped Ryan and Justin for not having plates on their cop car, but Ryan convinces him that they are real cops on a mission and that their plates were stolen. Segars takes them out for a drink at a cop bar, when they find an alarm go off at a hardware store and they go in together to investigate.\nThe experience shakes Justin, who realizes they face serious jail time if exposed. He tries to \"retire,\" but gets a phone call from Josie about a man frequently harassing her at work. It turns out to be Mossi Kasic (James D'Arcy), leader of the Albanian mobsters. Once more, the pair are intimidated into doing nothing.Via Segars, Ryan obtains surveillance equipment to gather evidence and put Mossi away, along with an unidentified partner who has been investigating the pair. Ryan convinces Justin to do an undercover operation to obtain information on an incriminating shipment of crates. The friends interrogate the delivery driver, Pupa (Keegan-Michael Key). Josie, an aspiring makeup artist, helps disguise Justin as Pupa to infiltrate Mossi's club, where Justin is forced to smoke crystal Meth and fight in a bare-knuckle boxing match.\nDuring the mission, they discover the crates full of SWAT equipment, along with secret tunnels in which they are shipped that run between Mossi's club and Georgie's (Tom Mardirosian) restaurant. This necessitates the acquisition of the restaurant, explaining the blackmail. After a few close encounters, they barely escape. Fed up, Justin insists on mailing the evidence anonymously, but Ryan, finding purpose in his life again, is set on delivering it personally. They fight, and part ways.Ryan brings his evidence to Segars, who recommends it go to the highest authority, which is Detective Brolin (Andy García). Unfortunately, Brolin is actually Mossi's partner. After instantly recognizing each other, Ryan makes it out of the station, but his sudden threat has blown their cover. Meanwhile, Justin decides to man up and, in uniform, assertively pitches his game to his boss again. One of Brolin's officers shows up to try and kill him, inadvertently helping to sell the pitch. Ryan is abducted, and Mossi sends a threatening message to Justin. Overwhelmed, Justin pleas to Segars for help after admitting everything. He also confesses to Josie, which he had made previous attempts to do, and she disgustedly leaves him.Justin goes into the tunnels alone while Ryan pits Mossi and Brolin against each other, prompting Mossi to shoot and kill the detective. Justin attempts to save his friend but is overpowered. Segars arrives, causing Mossi and his crew to retreat. Segars admonishes the duo for their deception and orders them to leave before going after the mobsters without waiting for backup. Ryan and Justin agree they can't abandon him and suit up with the SWAT equipment. They save Segars, but he becomes incapacitated. The pair then face Mossi alone, during which the two reconcile. They fail to take him out, but luckily, Segars is able to show up and shoots Mossi in the back of the chest, saving Justin and Ryan.Thanks to the respective confidence and motivation gained during their impersonations, Justin has become a successful game developer, while Ryan graduates from the police academy as a true, fully-fledged member of the LAPD. Justin apologizes to Josie, and after she forgives him, they rekindle their relationship. Ryan, however, still has not given up on their fun as cops together and convinces Justin to don the fake uniform once again and join him on patrol.",
	"links": [
		"https://www.amazon.com/Lets-Cops-Jr-Damon-Wayans/dp/B00MO7Y44U"
	]
}