{
	"title": "The Good Dinosaur",
	"release_year": "2015",
	"runtime": "93",
	"tags": [
		"Action",
		"Adventure",
		"Animation",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Jeffrey Wright",
		"Frances McDormand",
		"Maleah Nipay-Padilla",
		"Ryan Teeple",
		"Jack McGraw",
		"Marcus Scribner",
		"Raymond Ochoa",
		"Jack Bright",
		"Peter Sohn",
		"Steve Zahn"
	],
	"staff": [
		"Peter Sohn",
		"Bob Peterson",
		"Peter Sohn",
		"Erik Benson",
		"Meg LeFauve",
		"Denise Ream",
		"Jeff Danna",
		"Mychael Danna",
		"Stephen Schaffer",
		"Natalie Lyon",
		"Kevin Reher",
		"Harley Jessup",
		"Daniel Lopez Muñoz"
	],
	"votes": 129802,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTc5MTg2NjQ4MV5BMl5BanBnXkFtZTgwNzcxOTY5NjE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In an alternate time-line, the asteroid that would have caused the extinction of dinosaurs 65 million years ago passes safely over Earth.Millions of years later, two Apatosaurus named Henry (Jeffrey Wright) and Ida (Frances McDormand), who are farmers, give birth to three children: Libby (Maleah Padilla), Buck (Marcus Scribner), and the runt Arlo (Raymond Ochoa). While Libby and Buck easily adjust to life and their chores on their farm and make their mark (signified by a mud-print on a corn silo), Arlo's timid nature makes his tasks difficult for him. In order to give Arlo a sense of purpose, Henry puts him in charge of guarding their silo from critters and helping him set up a trap. While Arlo is on guard, the trap manages to capture a feral cave-boy, but Arlo is too reluctant to kill him and sets him free. Heavily disappointed, Henry has Arlo accompany him to track the cave-boy through a ravine where it begins to rain. After Arlo injures himself, Henry decides to turn back just as a flash flood occurs and a massive rapid appears, but Henry only manages to save Arlo before he is swept away and killed.Without his father, Arlo must help his mother with harvesting crops before the first snow. After spotting the same cave-boy inside the silo, Arlo, blaming him for his father's death, chases him until both of them fall into a river, where Arlo hits his head on a rock and is knocked unconscious. Waking up, Arlo is dismayed to find himself far from home and tries to survive on his own with minimal success, leaving himself trapped under a boulder. The next day, the cave-boy finds and frees Arlo, and eventually gives him some berries to eat. The cave-boy then leads Arlo to a berry tree where they are both attacked by a snake. The cave-boy fights and repels the snake, an act which amazes Arlo. A nearby eccentric Styracosaurus (Peter Sohn), also impressed with the cave-boy's physical prowess, tries to give him a name, but when Arlo calls him \"Spot\", he responds to it. After traveling together for the rest of the day, Arlo laments about his lost family and confides in Spot, who reveals that his own mother and father are dead. The next day, a storm ravages the land and Arlo, remembering the storm that took his father's life, runs away in fear.The next morning, Arlo wakes up to find Spot only to be encountered by a fanatical band of pterodactyls, consisting of a leader, Thunderclap (Steve Zahn), and his accomplices Downpour (Mandy Freund) and Coldfront (Steven Clay Hunter). The pterodactyls turn out to be savagely carnivorous. After they find Spot, Arlo and Spot run away, encountering a pair of Tyrannosaurus named Nash (A.J. Buckley) and Ramsey (Anna Paquin), who both ward the pterodactyls off. Arlo and Spot then meet Nash and Ramsey's father Butch (Sam Elliott), who agrees to let the two of them join their party if they can help them locate a herd of longhorns they had lost. Spot manages to sniff them out with Arlo, discovering the presence of \"Rustlers\".On Butch's instruction, Arlo lures the Rustlers out, who are revealed to be a pack of Velociraptors led by Bubbha (Dave Boat) looking to steal Butch's herd. As Butch and his children try to fend off the Rustlers, Arlo musters his courage to successfully hit two of them, allowing Butch to scare them off for good. Having gained the respect of the T. Rexes, Arlo is led by Butch towards the area of his homeland. Along the way, Arlo and Spot encounter a caveman off in the distance, but they ignore him and continue on.As another storm begins to pick up, Thunderclap and the pterodactyls return and attack the two, this time managing to take Spot away and leaving Arlo behind. As Arlo gets tangled in some vines, he has a vision of Henry leading him away and back toward home, but Arlo admits his friendship with Spot and resolves to save him, which makes his father proud before he fades away. Filled with determination, Arlo wakes up and attacks the pterodactyls who have cornered Spot at the river. Arlo and Spot manage to throw the pterodactyls into the water where they ride helplessly downstream. A flash flood begins and a massive mudslide crashes into the river and triggers a torrent. Despite his fear, Arlo leaps to save Spot and the two of them are carried away by the flood towards a waterfall. Arlo manages to swim towards Spot and hold on to him as they both fall, with Arlo carrying Spot to shore where he regains consciousness.As they venture forth, Arlo and Spot both hear the calls of a caveman family just as they come over the hill overseeing Arlo's farm. With great reluctance, Arlo encourages Spot to join them and the two of them share a tearful, loving goodbye. The film ends with Arlo arriving back home to his mother and siblings, and he is allowed to leave his mud-print on the silo between the prints of his mother and father.",
	"links": [
		"https://www.amazon.com/Good-Dinosaur-Plus-Bonus-Features/dp/B018F03RL0"
	]
}