{
	"title": "Penguins of Madagascar",
	"release_year": "2014",
	"runtime": "92",
	"tags": [
		"Action",
		"Adventure",
		"Animation",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Tom McGrath",
		"Chris Miller",
		"Christopher Knights",
		"Conrad Vernon",
		"John Malkovich",
		"Benedict Cumberbatch",
		"Ken Jeong",
		"Annet Mahendru",
		"Peter Stormare",
		"Andy Richter"
	],
	"staff": [
		"Eric Darnell",
		"Simon J. Smith",
		"Michael Colton",
		"John Aboud",
		"Brandon Sawyer",
		"Alan Schoolcraft",
		"Lara Breay",
		"Mark Swift",
		"Lorne Balfe",
		"Nick Kenway",
		"Leslee Feldman",
		"Christi Soper",
		"Shannon Jeffries"
	],
	"votes": 104348,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTEyMDg4MDU4MjdeQTJeQWpwZ15BbWU4MDQyOTc3MjIx._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In Antarctica, young penguins Skipper, Rico, and Kowalski rescue a runaway egg from leopard seals on a whaling ship. They then drift away on an iceberg with the egg, which hatches into a chick they name Private.Ten years later, after leaving Circus Zaragoza, the penguins break into Fort Knox to celebrate Private's birthday by getting Cheesy Dibbles from a vending machine. However, they are kidnapped and taken to a submarine where they meet Dave, a giant Pacific octopus. Dave was once a star attraction at Central Park Zoo until he was overshadowed by the penguins' cuteness. After being repeatedly outshone by penguins in various zoos, Dave, disguised as Dr. Octavius Brine, seeks revenge with a substance called Medusa Serum.Chased by Dave's henchmen in Venice, the penguins are saved by the North Wind, an elite inter-species task force led by an Eurasian wolf named Classified, a polar bear named Corporal, a harp seal named Short Fuse, and a snowy owl named Eva. Despite Skipper's team being deemed a liability, they escape to discover Dave's plan to kidnap penguins from zoos he was kicked out of, starting with the Shanghai Zoo. Private reluctantly agrees to be bait in their plan to stop Dave.Despite capturing Dave temporarily, he escapes, capturing Private and the Shanghai penguins. Skipper, Rico, and Kowalski hijack the North Wind's jet to pursue him. At Dave's lair, Private learns that Dave's plan involves turning penguins into disfigured monsters. After a clash with the North Wind, both teams are captured. Private escapes using a paper clip and attempts to free the North Wind, who refuse to help without their equipment. Private decides to go alone.Dave unleashes the mutated penguins on New York City, but Private manages to restore Skipper, Kowalski, and Rico's sanity. During the final battle, Private uses his cuteness to reverse the mutation, saving the penguins and shrinking Dave inside a snow globe. Private finally earns his place as a valued team member, and the North Wind rewards the penguins with jet packs to fly back to Circus Zaragoza.",
	"links": [
		"https://www.amazon.com/Penguins-Madagascar-Eric-Darnell/dp/B079HRSCK3"
	]
}