{
	"title": "The Hunger Games: Mockingjay - Part 2",
	"release_year": "2015",
	"runtime": "137",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Jennifer Lawrence",
		"Josh Hutcherson",
		"Liam Hemsworth",
		"Woody Harrelson",
		"Donald Sutherland",
		"Philip Seymour Hoffman",
		"Julianne Moore",
		"Willow Shields",
		"Sam Claflin",
		"Elizabeth Banks"
	],
	"staff": [
		"Francis Lawrence",
		"Peter Craig",
		"Danny Strong",
		"Suzanne Collins",
		"Nina Jacobson",
		"Jon Kilik",
		"James Newton Howard",
		"Jo Willems",
		"Alan Edward Bell",
		"Mark Yoshikawa",
		"Debra Zane",
		"Philip Messina"
	],
	"votes": 380762,
	"cover": "https://m.media-amazon.com/images/M/MV5BMzAzMzQ0NzQyMF5BMl5BanBnXkFtZTgwNzg1MjYxNzE@._V1_QL75_UY281_CR4,0,190,281_.jpg",
	"description": "Katniss Everdeen (Jennifer Lawrence) is recovering after being attacked by Peeta Mellark (Josh Hutcherson), who has been brainwashed by the Capitol. Peeta has also recovered to a large extent but is still kept under confinement as he can have episodes from time to time, where he gets very violent and vows to kill Katniss.The rebels attack and disable the Capitol's weapons arsenal in District 2. The rebels in district 2 are led by Homes, Commander Lyme (Gwendoline Christie), a previous winner from District 2, and Commander Paylor. Without the control of the arsenal, the capitol cannot be defeated. Yet the arsenal is very well protected (it is buried deep inside a mountain) and a ground attack is suicidal.\nThe rebel plan is to use the surrounding mountains to trigger an avalanche that will bury all entry and exit points for the weapons arsenal building. The weapons depot is protected by civilians from District 2 and the Capitol loyalists.Katniss believes that the rebels are using the same kind of brutal tactics that the Capitol has used against the Districts so far. Gale argues that anyone working for the Capitol is the enemy.\nCoin suggests that they leave the train tunnel open for civilians to escape and surrender to rebel forces. Katniss tries to rally the loyalists against the Capitol (she argues that as the districts fight each other, only Snow wins. She says that she is done being a slave of the Capitol) but is shot and injured in the confrontation.President Snow orders the evacuation of the outer borders of the Capitol, to allow the rebels in. He readies anti-aircraft defenses to secure the skies & his plan is to use the game makers to win the battle against the rebels in the streets. He wants rebels to pay heavily for every inch they march inside his Capitol.Despite Katniss' desire to kill President Snow (Donald Sutherland) personally, Alma Coin (Julianne Moore) refuses to allow her into battle. Coin argues that as far as the rebels are concerned Katniss has survived a bullet to the heart (in reality she was wearing a bulletproof vest), and they would understand if they don't see her in battle. Plutarch Heavensbee (Philip Seymour Hoffman) says that Katniss will be flown into the Capitol for the surrender.\nAt Finnick (Sam Claflin) and Annie's wedding, Johanna Mason (Jena Malone) suggests Katniss sneak aboard a supply ship leaving for the Capitol, where Commander Paylor (Patina Miller) is planning an invasion.Unable to bring Katniss back, Coin has her assigned to the \"Star Squad\", led by Boggs (Mahershala Ali) and includes Gale (Liam Hemsworth), Finnick, Cressida (Natalie Dormer), Messalla (Evan Ross), Castor (Wes Chatham), Pollux (Elden Henson), Jackson (Michelle Forbes), the Leeg twins, Mitchell, and Homes (Omid Abtahi); they will follow in relative safety, several days behind the actual invasion of the Capitol providing video of their incursion for propaganda purposes. Each member of the squad is given a suicide pill in the event that they are captured.\nBoggs carries a holographic map (the \"Holo\") to help them evade known booby trapped \"pods\" which line the streets of the Capitol. To prevent Holos falling into the hands of the Capitol, each device is loaded with a self-destruct mechanism. The war for the Capitol is now equivalent to the 76th Hunger Games.\nCoin also sends Peeta to join the squad, even though he has not fully recovered from the Capitol's conditioning.Boggs educates Katniss that Coin perhaps wanted to get rid of Katniss & hence eventually did send her into battle. Boggs says that Coin never likes anyone that she cannot completely control, and it was Peeta she wanted to rescue from the arena and not Katniss.\nAfter the war, a free election was promised & Coin was afraid that Katniss would not support her & hence her only value to the rebellion is now being dead. Boggs promises to protect Katniss.As they venture deeper into the Capitol, Boggs triggers a pod which sets off a land mine and mortally wounds him and transfers command of the Holo to Katniss before dying. The squad triggers another pod, which releases a flood of lethal black tar. Peeta momentarily succumbs to his conditioning and attacks Katniss, pushing Mitchell into the tar and killing him.The group takes shelter in an abandoned building, where Jackson, the second-in-command, attempts to commandeer the Holo, until Katniss convinces them she is under secret orders from Coin to kill Snow. Katniss and most of the group escape just before a squad of Peacekeepers arrive and destroy the building, killing the Leeg twins. The Capitol broadcasts a message announcing Katniss's death, which is interrupted by Coin, who delivers an impassioned eulogy for her, to rally the rebels.Katniss decides to mount an attack on Snow's palace, but the palace is 75 blocks away and pods are set up every 10 steps.\nThe team descends into the Capitol's sewers to avoid further pods (Snow's teams picks up Katniss in the underground sewers and knows that the team is alive), but they are attacked by a horde of genetically engineered creatures called \"mutts\". Jackson, Castor, and Homes are killed as the squad flees through the sewers. Finnick is overwhelmed as he fights off the swarm to allow the team to escape, forcing Katniss to set the Holo's self-destruct, killing him and the remaining mutts.\nThe surviving team members reach the surface but are chased by Peacekeepers, and Messalla is killed by a pod that melts and disintegrates him. The team takes refuge in a shop, where Tigris (Eugenie Bondurant), a former Hunger Games stylist and rebel sympathizer, hides them in her basement.\nAs rebel forces gain ground, Snow invites fleeing Capitol citizens into his mansion for protection.Katniss and Gale join the crowd, posing as refugees to gain access to Snow. Rebels arrive and attack, killing many in the crossfire. In the chaos, Katniss pushes forward to Snow's mansion, where Peacekeepers are herding Capitol children toward the closed gates.\nA hovercraft flies overhead and drops small parcels by parachute into the pen of children. The parcels explode, killing them. A team of rebel medics attempt to help the injured, among whom is Katniss's sister Prim (Willow Shields). A second wave of bombs detonate, killing Prim and knocking Katniss unconscious.Upon recovering, Katniss learns the Capitol has been conquered, and Snow captured. When Katniss confronts Snow, he claims that Coin orchestrated the bombing outside his mansion to turn his soldiers against him. Katniss realizes that the incident resembles a trap that Gale had developed earlier. When Gale is unable to assure Katniss that the bombs were not of his design, Katniss cuts all ties with him.Coin, now the interim President, refuses to hold the promised democratic election. Coin invites the remaining Hunger Games victors to vote on a proposal to have another Hunger Games using the children of the Capitol, as a symbolic gesture to satisfy the districts. Katniss swings the vote in favor, in exchange for the right to execute Snow personally.At the execution, Katniss shoots and kills Coin instead of Snow. Snow is tortured and killed by the angry mob. Katniss then tries to swallow her suicide pill, but Peeta stops her, and she is arrested. Katniss is eventually pardoned for her crime and returns to District 12, where she is joined by Peeta, who has recovered from his conditioning. Commander Paylor is elected the new President of Panem, and Katniss, Peeta, and Haymitch (Woody Harrelson) bond over their shared trauma.Years later, Katniss and Peeta play with their two children, as Katniss contemplates the nightmares of her past, and somberly reflects that \"there are much worse games to play.\"",
	"links": [
		"https://www.amazon.com/Hunger-Games-Mockingjay-Part/dp/B0186DG6XC"
	]
}