{
	"title": "Cloudy with a Chance of Meatballs 2",
	"release_year": "2013",
	"runtime": "95",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Bill Hader",
		"Anna Faris",
		"Will Forte",
		"Neil Patrick Harris",
		"James Caan",
		"Andy Samberg",
		"Benjamin Bratt",
		"Terry Crews",
		"Kristen Schaal",
		"Cody Cameron",
		"Cody Cameron"
	],
	"staff": [
		"Cody Cameron",
		"Kris Pearn",
		"Erica Rivinoja",
		"John Francis Daley",
		"Jonathan Goldstein",
		"Phil Lord",
		"Kirk Bodyfelt",
		"Pam Marsden",
		"Mark Mothersbaugh",
		"Robert Fisher Jr.",
		"Mary Hidalgo",
		"Justin K. Thompson"
	],
	"votes": 116799,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjA5NzA0MDM1NF5BMl5BanBnXkFtZTgwODM3ODkwMDE@._V1_QL75_UY281_CR2,0,190,281_.jpg",
	"description": "After Flint Lockwood (Bill Hader) and his friends save the world from the food storm in the first film, super-inventor Chester V (Will Forte), the CEO of Live Corp, is tasked by the UN to clean the island. Chester V is Flint's childhood idol and the whole reason why Flint became an inventor in the first place.\nChester now runs a company that produces and sells food bars.Chester relocates Flint, his friends, and the citizens of Swallow Falls to San Franjose, California.\nUnbeknownst to Flint, the FLDSMDFR (The Flint Lockwood Diatonic Super Mutating Dynamic Food Replicator) survived the explosion and landed in the center of the island, and Chester is determined to find it.\nChester wants to use the FLDSMDFR to continue producing living Foodimals & use them to launch a new line of food bar, made from Foodimals. Chester is in the habit of using a hologram for his virtual presence, and seldom visits any place in person.Chester invites Flint, his biggest fan, to work at Live Corp, where he meets Chester's assistant Barb (Kristen Schaal), a talking orangutan with human intelligence. Barb tells Flint about a ceremony held by Chester every six months to select the best innovation from his employee pool & to crown the inventor a \"Thinkonaught\". Flint is super excited by the idea & starts working on his invention as he believes this is a great opportunity to impress Chester.\nSix months later, Flint humiliates himself during a promotion ceremony when his invention \"Party-In-A-Box\" explodes. The invention is a celebration device which is supposed to blow up and cover the entire room in party themed colors. But Flint doesn't win the prize (it goes to someone who invented a zero-emission car that runs on cute), and Steve accidentally activates the \"Party-In-A-Box\" to color the entire stadium in party colors.\nFlint is devastated as he is desperately seeking Chester's approval. Tim wants to help by taking Flint fishing, but Flint refuses.Meanwhile, Chester is informed that his search-parties on the island have been attacked by monstrous cheeseburgers (with French Fries legs and Sesame Seed eyes) which are learning how to swim. Reluctant to commit more of his men to die in the line of this search, Chester tasks Flint to find the FLDSMDFR and destroy it once and for all. He needs someone expendable and knows the Island inside out.\nChester tells Flint that his FLDSMDFR has survived & is producing Foodimals, which are learning to swim & if they escape the island, they will spell doom for the whole world. Chester has created a BS-USB or the Bifurcating Systematic Universal Stop Button, which will destroy the machine and everything it has created.Despite Chester's demands to keep the mission classified, Flint recruits his girlfriend, meteorologist Sam Sparks (Anna Faris); her cameraman Manny (Benjamin Bratt); police officer Earl Devereaux (Terry Crews); Steve (Neil Patrick Harris), a monkey who communicates via a device on his head; and \"Chicken\" Brent (Andy Samberg). Much to Flint's dismay, his father Tim (James Caan) joins the crew, and they travel to Swallow Falls on his fishing boat. Flint wanted them to travel by the Grocery Deliverator, which creates portals and wormholes, but the gang refuses to step into that.Upon arriving back at Swallow Falls, they notice that a jungle-like environment has overgrown the island. Tim stays behind while Flint and the others investigate, finding a vast habitat of living food animals. Flint is livid when a cute strawberry swallows his BS-USB, but Sam finds it cute and names it Barry.\nTim, searching for food at his abandoned tackle shop, encounters a family of humanoid pickles and bonds with them by fishing. Chester discovers that Flint allowed his friends to join him on the mission, so Chester travels to the island with Barb, chagrined and determined to separate them.\nBarb scares the Strawberry with a knife, and it defecates the BS-USB encased in jam. Chester takes Flint to his lab, where he uses his hard drive to create a simple mechanism to track the FLDSMDFR. He creates the Flint Lockwood Food Jungle Topographical Pointing Machine (FLFJTPM) to track the FLDSMDFR.After escaping a Tacodile attack, Sam notices that the Foodimal was protecting its family & that the Foodimals are harmless and begins to suspect Chester is up to no good. Sam attempts to convince Flint to spare the Foodimals and says that Chester might be wrong, but Flint is intent on making Chester proud.\nSam leaves in anger, and Flint's other companions go with her (including Steve). In the jungle, Sam proves that the Foodimals mean no harm by taming a Cheespider. Upon realizing Chester's intentions, the group is then ambushed by Live Corp employees.Flint finds the FLDSMDFR but notices a family of cute marshmallows and becomes hesitant to destroy the machine. Chester immediately seizes control of the FLDSMDFR using the BS-USB and announces his plot to make his updated line of food bars out of the Foodimals by reprogramming the machine.A crushed Flint is knocked into the river but rescued by the marshmallows. Flint is taken to his father, and they and the Foodimals (Barry is fond of Sam and summons all his friends to help Flint) all work together to allow Flint to infiltrate the Live Corp building that is under construction on the island. Barb also helps the gang when she realizes that Chester only considers her a monkey. Flint realizes that to the Foodimals, he is a God as the creator of the FLDSMDFR.\nFlint frees the trapped Foodimals and confronts Chester, who threatens to make food bars out of his friends. Chester says that he needed the FLDSMDFR since he had found that FLDSMDFR food was much better tasting than the regular food.\nChester makes several holograms of himself to overwhelm Flint, but Flint uses the \"Party-In-A-Box\" to expose the real Chester. An army of Foodimals arrive and Flint's friends are freed by Barb, who had a change of heart.Chester tries to make off with the FLDSMDFR but is eaten by a Cheespider. With the island safe from Chester and with Live Corp destroyed, Flint returns the FLDSMDFR to its place and the Foodimals continue to live in peace as more are born. The film ends with Flint fishing with his father for the first time, finding it enjoyable.",
	"links": [
		"https://www.amazon.com/Cloudy-Chance-Meatballs-Bill-Hader/dp/B00GZ76O5W"
	]
}