{
	"title": "Ford v Ferrari",
	"release_year": "2019",
	"runtime": "152",
	"tags": [
		"Action",
		"Biography",
		"Drama",
		"amazon"
	],
	"rating": 8.1,
	"actors": [
		"Matt Damon",
		"Christian Bale",
		"Jon Bernthal",
		"Caitríona Balfe",
		"Josh Lucas",
		"Noah Jupe",
		"Tracy Letts",
		"Remo Girone",
		"Ray McKinnon",
		"JJ Feild"
	],
	"staff": [
		"James Mangold",
		"Jez Butterworth",
		"John-Henry Butterworth",
		"Jason Keller",
		"Peter Chernin",
		"James Mangold",
		"Jenno Topping",
		"Marco Beltrami",
		"Buck Sanders",
		"Phedon Papamichael",
		"Andrew Buckland",
		"Michael McCusker",
		"Dirk Westervelt",
		"Ronna Kress",
		"François Audouy"
	],
	"votes": 493834,
	"cover": "https://m.media-amazon.com/images/M/MV5BOTBjNTEyNjYtYjdkNi00YzE5LTljYzUtZjVlYmYwZmJmZWYxXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1963, Ford is losing market share to Chrysler, and this makes Henry Ford II mad. He is looking for a new idea that can propel sales for his cars.\nFord Motor Company Vice President Lee Iacocca (Jon Bernthal) proposes to Henry Ford II to purchase the cash-strapped Ferrari as a means to boost their car sales by participating in the 24 Hours of Le Mans.\nIacocca argues that the baby boomers have cash in their pockets, but want sex appeal and beauty in their cars, and they want them fast. None of this is what Ford gives.\nOwner Enzo Ferrari (Remo Girone) uses Ford's offer to secure a deal with Fiat (who agree to pay $18 million for Ferrari) that allows him to retain ownership of the firm's racing team, Scuderia Ferrari. Ford's deal would given 90% control of car production to Ford, and Ferrari would own 90% of the car racing division.In rejecting the proposed deal with Ford, Ferrari insults the company and its CEO. He says that Ford is only good for making small and ugly cars and that Henry is not a real Ford.\nA furious Henry II (Tracy Letts) orders his racing division to build a car to defeat Ferrari at Le Mans. For this task, Iacocca hires Shelby American owner Carroll Shelby (Matt Damon), a racing driver who won Le Mans in 1959 (The only American to do so at that time, and Shelby was driving the Aston Martin when he won the race) but was forced to retire due to his heart condition (a bad valve that will kill him the minute his heart rate touches 130).In turn, Shelby enlists the help of Ken Miles (Christian Bale), a hot-tempered British racer and struggling mechanic. Miles is a big believer that a car has to be driven like it has been designed. Miles is married to Mollie (Caitríona Balfe) and has a son. Miles designs his own race cars, which are often disqualified for not meeting regulations on minor points such as luggage space and doors not locking properly.\nShelby worked together with Miles on several races and knew that PR was not Miles' strong suit, but he builds and drives fast cars capable of winning endurance races.\nTo win at Le Mans, they need a car that can do 200 MPH on a straight and maintain that for 3000 miles. Le Mans is not a track, it is a country road. A million things can go wrong, and with every mistake, Ferrari wins again as they have always done. Shelby and Miles have 90 days to deliver.Shelby and Miles test the Ford GT40 Mk I prototype at Los Angeles International Airport, working out all of its design flaws until it is race ready. At the launch of the new Ford Mustang, Miles gives a witheringly rude appraisal of it to Ford Senior Vice President Leo Beebe (Josh Lucas). Beebe campaigns against sending Miles to the upcoming race at Le Mans as a public relations liability. Shelby reluctantly excludes Miles and sends Phil Hill and Bruce McLaren (Benjamin Rigby) to 1964 Le Mans.As predicted by Miles, none of the Fords finish the race. While Henry II sees this as a humiliating defeat, Shelby explains to him that the GT40 instilled fear in Enzo Ferrari, as it reached 218 mph on the Mulsanne Straight before it broke down. He says a race car cannot be designed by committee. Ford tells him to continue the project and report directly to him.Shelby and Miles continue development on the GT40 Mk II, but Miles is nearly killed when the car's brakes fail during testing. The team realizes the rules permit replacing the whole brake assembly during the race.\nIn 1966, Ford Senior Vice President Leo Beebe takes over the racing division, with the intent to continue the program without Miles. When he and Ford arrive to inspect the program, Shelby locks Beebe in his office and gives Ford a ride in the GT40. Shelby wagers his own company on the line to convince him that if Miles wins the 24 Hours of Daytona, he will be allowed to race at Le Mans. If not, Ford will take full ownership of Shelby American.Shelby American enters Daytona, but Beebe has a second Ford entered with NASCAR team Holman-Moody supporting it. While the Holman-Moody team has quicker pit stops, Shelby has Miles push his car's limit to 7,000 RPM, resulting in him winning the race.At the 1966 Le Mans, Miles struggles with a faulty door during the first lap, but after team engineer Phil Remington (Ray McKinnon) fixes the door with a mallet, Miles begins to set lap records while catching up with the Ferraris. While racing with Ferrari driver Lorenzo Bandini (Francesco Bauco) - piloting Ferrari's new prototype 330 P3 - Miles experiences brake failure and has his brake system replaced during his pit stop. Enzo Ferrari protests the move, but Shelby convinces the race officials that the brake change is legal.Miles and Bandini once again duel on the Mulsanne Straight until Bandini blows his engine, completely eliminating Ferrari in the race. With three Ford teams in the top-three positions, Beebe orders Shelby to have Miles slow down for the other two Fords to catch up with him and provide the press with a three-car photo finish. Miles is initially against this decision, continuing to set new lap records near the end of the race, but decides to let Ford have their way on the final lap.\nUltimately, McLaren is declared the winner on a technicality. Having started behind Miles, his car traveled further overall. Miles is placed second. Shelby accuses Beebe of deliberately costing Miles the win.\nMiles is grateful to Shelby for giving him the opportunity to race at Le Mans. From his vantage point, Enzo Ferrari tips his hat to Miles on the track. As they walk off together, Shelby tells Miles they will win Le Mans next time.Two months after Le Mans, while testing the J-car at Riverside International Raceway, Miles once again experiences brake failure and is killed in the resulting crash. Six months later, Shelby pays Miles' widow Mollie (Caitriona Balfe) and son Peter (Noah Jupe) a visit and gives Peter a wrench that Miles threw at him before winning an SCCA race at Willow Springs in 1963. Ford would continue its winning streak at Le Mans in 1967 (using the GT40 Mk IV, developed from the J-car), 1968, and 1969, becoming the only American manufacturer to win the prestigious race. Miles would be posthumously inducted into the Motorsports Hall of Fame of America in 2001.",
	"links": [
		"https://www.amazon.com/Ford-v-Ferrari-Matt-Damon/dp/B081DZ57RF"
	]
}