{
	"title": "Pitch Perfect",
	"release_year": "2012",
	"runtime": "112",
	"tags": [
		"Comedy",
		"Music",
		"Romance",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Anna Kendrick",
		"Brittany Snow",
		"Rebel Wilson",
		"Anna Camp",
		"Skylar Astin",
		"Ben Platt",
		"Alexis Knapp",
		"Ester Dean",
		"Hana Mae Lee",
		"Kelley Jakle"
	],
	"staff": [
		"Jason Moore",
		"Kay Cannon",
		"Mickey Rapkin",
		"Elizabeth Banks",
		"Paul Brooks",
		"Max Handelman",
		"Christophe Beck",
		"Mark Kilian",
		"Julio Macat",
		"Lisa Zeno Churgin",
		"Kerry Barden",
		"Paul Schnee",
		"Barry Robison"
	],
	"links": [
		"https://www.amazon.com/Pitch-Perfect-2-Anna-Kendrick/dp/B00XOX6HLQ"
	],
	"votes": 334347,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTcyMTMzNzE5N15BMl5BanBnXkFtZTcwNzg5NjM5Nw@@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "During the 2011 International Championship of Collegiate A Cappella (ICCA) Finals at the Lincoln Center, Barden University's all-female A Cappella group, the Barden Bellas, perform well until Aubrey Posen (Anna Camp) projectile vomits on stage during her solo under the pressure of her peers. They are publicly humiliated, losing any chance of winning, and losing to their all-male rival group, the Barden Treblemakers. After the performance Aubrey and Chloe take over the leadership of the Bellas from outgoing leader Alice (Kether Donohue).John Smith (John Michael Higgins) and Gail Abernathy-McKadden (Elizabeth Banks) are commentators for the ICCAs. Gail is exasperated with John's sexist and misogynist comments on air. John believes that an all girls group is an aberration since women cannot hit the low notes.Four months later, newly arrived Barden freshman Beca Mitchell (Anna Kendrick) has no desire to attend college, but she is forced to do so by her father Dr. Mitchell (John Benjamin Hickey), a professor (of comparative literature) at the university, with whom Beca has a strained relationship. Wishing she could instead pursue a career as a music producer in Los Angeles, Beca spends her time making mash-up mixes of songs and takes up an internship at the school radio station, where she gets to know fellow freshman Jesse Swanson (Skylar Astin). Kimmy Jin (Jinhee Joung) is Beca's Korean American roommate.When Beca's father discovers she has not been attending classes, he comes to her with a proposition: if she joins a club and still does not want to remain at college after one year, he will allow her to leave college, and he will pay for Beca to move to Los Angeles to pursue her music career.At the university's activities fair, now-seniors Aubrey and Chloe Beale are attempting to recruit new members for the Bellas but find that interest in their group has decreased significantly after last year's on-stage incident. Beca is invited to join but declines and claims she can't sing. Later, Chloe hears Beca sing in the shower. They were both naked at the time, and Chloe wouldn't let go till Beca agrees to audition. It is indicated that Chloe has lesbian feelings for Beca.After some persuasion from Chloe Beale (Brittany Snow) the co-leader of the Bellas along with Aubrey, she reluctantly auditions for the Barden Bellas. At auditions, Beca sings a rendition of \"Cups (When I'm Gone)\".Aubrey does not initially approve of recruiting Beca but yields nonetheless due to a desperate need for members and Beca's talent. Beca joins alongside a group of other women who do not fit the Bellas' typical mold (super-hot girls with a bikini ready body, who can harmonize and have a pitch): Cynthia-Rose (Ester Dean), Stacie Conrad (Alexis Knapp), Lilly Onakuramara (Hana Mae Lee) (can beat-box), and Fat Amy (Rebel Wilson) (from Tasmania).\nJesse is also revealed to have joined the Bellas' all-male rival group, the Treblemakers, but his roommate Benji (Ben Platt) was rejected after being called \"weird\" by Bumper (Adam DeVine) (the egotistical leader of the Barden Treblemakers).\nAubrey takes control of the Bellas and they practice for 2 hours every day for 7 days a week. Aubrey sticks to the song list of the Bellas even though Beca points out that the list has no songs from the current century. Nobody can hear Lilly speaking. Chloe finds out that she has vocal nodes and has to undergo corrective surgery to have any chance of a career in singing.The Bellas participate in the southeastern regional competition at Carolina University where, at Aubrey's insistence, they perform the same medley that helped the Bellas advance to the finals the previous year. In spite of their old set list, the group manages to place second, which sends them to the semi-finals.\nAfter the competition, the Bellas try to break up a fight between the Treblemakers and the Tonehangers, a male alumni Acappella group. Beca and Fat Amy accidentally smash a window with the Treblemakers' trophy. This alerts a police officer standing outside who then arrests her.Jesse tries to help by calling Beca's father, who is furious and tells Beca that he will no longer pay for her to move to Los Angeles because of the incident. This infuriates Beca, which turns her budding friendship with Jesse sour. In the meantime, Beca suggests to the Bellas to try to be more daring, but Aubrey insists that they will win with the repertoire the group has always used in the past.At the semi-finals, Beca provides an impromptu back-up of one of her favorite songs into the \"traditional\" song on the Bellas' set list to reinvigorate the crowd after they seemed to have lost interest. The Bellas come in third in the competition behind the Treblemakers and the Footnotes. Even though the audience seemed to enjoy Beca's remix, Aubrey becomes furious with Beca. Aubrey berates Beca after the performance and accuses her of hooking up with Jesse, a Treblemaker- a rule violation punishable by ejection from the Bellas. Jesse attempts to deny it, causing Beca to snap at them both and quit the Bellas.When the Footnotes are later disqualified from the national competition because the lead singer was in high school, the Bellas are called to take part instead. The Bellas reform after spring break, with the notable exception of Beca. During rehearsals, Chloe stands up against Aubrey's stubbornness. The group starts to fall apart, which sparks a fight. Meanwhile, Beca tries to apologize to Jesse, which he declines. Beca then apologizes to the Bellas for her actions during the semi-finals and asks to have another chance, which Aubrey eventually allows. After having a group heart-to-heart conversation, the Bellas decide to adopt Beca's more modern and original music style. Beca rejoins the group, and Aubrey relinquishes her half of the Bellas' leadership to Beca. Chloe discovers that she is able to sing bass notes after her node removal surgery.Meanwhile, group leader Bumper leaves the Treblemakers after being offered a job as a back-up singer for John Mayer. With Bumper gone, Jesse persuades the Trebles to let his previously rejected roommate Benji (Ben Platt) join the group in Bumper's place.At the A Cappella national competition, the Bellas sing a piece arranged by Beca, which includes \"Don't You (Forget About Me)\" a song featured in The Breakfast Club, one of Jesse's favorite movies. This acts as a more effective apology from Beca, and after the performance, she and Jesse kiss. The Bellas win the national competition, and six months later, auditions for new members take place."
}