{
	"title": "Flight",
	"release_year": "2012",
	"runtime": "138",
	"tags": [
		"Drama",
		"Thriller",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"Denzel Washington",
		"Nadine Velazquez",
		"Don Cheadle",
		"John Goodman",
		"Carter Cabassa",
		"Adam C. Edwards",
		"Tamara Tunie",
		"Brian Geraghty",
		"Kelly Reilly",
		"Conor O'Neill"
	],
	"staff": [
		"Robert Zemeckis",
		"John Gatins",
		"Laurie MacDonald",
		"Walter F. Parkes",
		"Jack Rapke",
		"Steve Starkey",
		"Alan Silvestri",
		"Don Burgess",
		"Jeremiah O'Driscoll",
		"Scot Boland",
		"Victoria Burrows",
		"Nelson Coates"
	],
	"links": [
		"https://www.amazon.com/Flight-Denzel-Washington/dp/B00B0LPWU6"
	],
	"votes": 379836,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTUxMjI1OTMxNl5BMl5BanBnXkFtZTcwNjc3NTY1OA@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "On October 14, 2011, Airline captain William \"Whip\" Whitaker (Denzel Washington) awakens in his Orlando hotel room with flight attendant Katerina Márquez (Nadine Velazquez) after a night of sex, alcohol, and very little sleep.\nWhip is separated from his wife Deana and shares custody of their 15-year-old son. After using cocaine to wake up, he boards SouthJet flight 227 to Atlanta. The flight itself is a short 52 minutes.\nMargaret (Tamara Tunie) & Camelia Satou (Boni Yanagisawa) are the other stewardess on the plane along with Katerina. This is the first time that Whip is flying with copilot Ken Evans.Whip threads the plane through severe turbulence at takeoff. He increases the speed of the plane to cut through the storm, and then uses the radar to find a pocket of smooth weather passage in between the 2 colliding weather systems.\nCopilot Ken Evans (Brian Geraghty) flies the airplane while Whip discreetly mixes vodka in his orange juice and takes a nap. Whip threw the empty vodka bottles in the trash cans of the aircraft, in the area manned by the flight attendants.\nWhip is jolted awake just before their final descent and the aircraft goes into a steep dive as a result of an apparent catastrophic failure of control systems of the aircraft. With no other choice, Whip rolls the plane upside down to bring it out of the dive and maneuvers the plane right-side up just before crash-landing in a field. He loses consciousness upon impact.Whip awakens in an Atlanta hospital with minor injuries. He is greeted by his old friend Charlie Anderson (Bruce Greenwood), who now represents the airline's pilot's union. He tells Whip his heroism saved 96 of 102 people on board. 6 people died, which included 2 crew and 4 passengers. An NTSB official informs him Katerina & Camelia were among those killed, and that Evans has been put into a coma.\nWhip's friend and drug dealer, Harling Mays (John Goodman) visits him in the hospital and brings him his cigarettes. Whip says that he has given up he alcohol, presumably due to the guilt of Katerina's death.Sneaking a cigarette in the stairwell, Whip meets Nicole (Kelly Reilly), who is recovering from a heroin overdose at the same hospital and promises to visit her when they leave the hospital.\nNicole was pressurized to do porn movies to pay for her drug addiction. Nicole refused to do so and instead used her last $100 to buy a really potent dose of drugs, which she was warned only to smoke and not to inject into her body. Nicole ended up using the needle and overdosed. She was found unconscious by her building manager, who called emergency services.Harling Mays (John Goodman) picks him up and sneaks him away from the hospital. Whip drives to his late father's farm, where he hopes to avoid the media. He gets rid of all the alcohol at the farm, to stay true to his resolution.\nCharlie calls Whip at the farm and leaves a message for a meeting.When Whip meets Charlie and attorney Hugh Lang (Don Cheadle), they explain that the NTSB performed a toxicology screen while he was unconscious in the hospital that revealed he was intoxicated (with a Blood Alcohol Level of 0.24, when the legally permissible limit is 0.08), which could result in Whip going to prison on drink, drugs and manslaughter charges. Whip could be spending the rest of his life in prison. Whip is adamant saying that the plane was defective and malfunctioned at 30,000 feet.\nLang promises to get the toxicology report ruled inadmissible on technical grounds, but Whip leaves in a fury and seeks out Nicole. He finds her skipping out on her lease and offers to let her stay at the farm.Nicole and Whip begin a romantic relationship, but Nicole is trying to stay clean and sober while Whip's alcoholism progresses, and she soon leaves. The media discover his farmhouse, so he drives intoxicated to visit his ex-wife and teenage son, but they call the police. He begs to stay with Charlie, vowing not to drink before the upcoming NTSB hearing.Whip talks to the surviving crew & requests them to say to the NTSB that it was a normal day. Whip is afraid that he might go to jail if the crew tells them that he was intoxicated when he boarded the plane that morning. Copilot Evans, who was in a coma, regains consciousness & squarely blames the crash on Whip, ignoring any possibility that the plane might be damaged & except for Whip none of them would have survived it.The night before the hearing, Charlie and Hugh check Whip into a guarded hotel room to ensure he does not get intoxicated. His mini-bar has only nonalcoholic beverages, but Whip discovers that the door to the adjoining room is open and finds alcohol in its mini-bar. Charlie and Hugh find him the next morning, passed out drunk. They call Harling, who brings him cocaine to perk him up for the hearing.At the hearing, Ellen Block (Melissa Leo), the lead NTSB investigator, reveals that the cause of the plane's malfunction was a damaged jack-screw in the elevator assembly. She commends Whip on his valor. Just as it appears Whip will escape culpability; Block raises the fact that there were two empty alcohol containers found in the trash on the plane; Whip knows these were his. Block points out that only the flight crew had access to the alcohol, and since only Katerina's toxicology screen showed alcohol, Block asks Whitaker whether he thinks Katerina may have been drinking on the job. Refusing to taint Katerina's good name, Whip admits not only that he was flying intoxicated but also that he is intoxicated at the hearing.Thirteen months later, an imprisoned Whip, serving a minimum five-year sentence, tells a support group of fellow inmates that he is glad to be sober and does not regret doing the right thing, because he finally feels \"free\". He has kept in touch with Nicole and is reconnecting with his estranged son."
}