{
	"title": "Rush",
	"release_year": "2013",
	"runtime": "123",
	"tags": [
		"Action",
		"Biography",
		"Drama"
	],
	"rating": 8.1,
	"actors": [
		"Daniel Brühl",
		"Chris Hemsworth",
		"Olivia Wilde",
		"Alexandra Maria Lara",
		"Pierfrancesco Favino",
		"David Calder",
		"Natalie Dormer",
		"Stephen Mangan",
		"Christian McKay",
		"Alistair Petrie"
	],
	"staff": [
		"Ron Howard",
		"Peter Morgan",
		"Andrew Eaton",
		"Eric Fellner",
		"Brian Grazer",
		"Ron Howard",
		"Hans Zimmer",
		"Anthony Dod Mantle",
		"Daniel P. Hanley",
		"Mike Hill",
		"Nina Gold",
		"Mark Digby"
	],
	"links": [],
	"votes": 520687,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTZhOGQxM2ItNGQyYy00YzE5LWI5MjMtNmMzNGQzNDE1OTUzXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "25 drivers start every year in formula one, and each year 2 drivers die. No normal person would opt for a job like this. Hence it attracts rebels, dreamers and lunatics. People who are desperate to make a mark and are willing to die trying.James Hunt (Chris Hemsworth) and Niki Lauda (Daniel Bruhl) are two highly skilled race car drivers who first develop a fierce rivalry in 1970 at a Formula Three race at the Crystal Palace circuit in England, when both their cars spin out and Hunt eventually wins the race.\nLauda admonishes Hunt for his reckless driving and making a suicidal move on the tracks, but Hunt dismisses Lauda and says that Lauda does not have the courage to stay on the track.\nHunt wins the driver of the year trophy in 1970.Hunt is a brash young Englishman with a tendency to vomit before every race, while the Austrian Lauda is a cool, calculating technical genius who relies on precision.\nHunt is a ladies man and has brief relationships with many girls, one of them being Nurse Gemma (Natalie Dormer) who he met at a hospital after being cut in the abdomen by a fellow racer for having sex with his wife. Hunt believes that drivers are closer to death than others, and are hence more alive, which attracts women. Hunt's father is a stock-broker, his brother is a barrister and his sister is an accountant.After a falling out with his billionaire industrialist father who wants Nicki to follow him into the family business, Lauda takes a large bank loan and buys his way into the BRM Formula One team for 2 million Austrian Shillings, meeting teammate Clay Regazzoni (Pierfrancesco Favino) for the first time. The deal is only that Nicki will be a technical consultant to BRM in exchange for funding the team. Nicki's changes to the car (lighter engine using Magnesium parts) make it go faster by 2 seconds on track & astonishes the team owner. Nicki then demands that he be allowed to race alongside Clay (with an equal contract for 2 years), else he will not share the changes to the car with the BRM team. The owner relents & Nicki becomes a F1 driver.Meanwhile, Hesketh Racing owner by Lord Hesketh (Christian McKay), the fledgling racing team Hunt drives for, enters Formula One as well. Lauda then joins Scuderia Ferrari with Regazzoni and wins his first championship in 1975. Hesketh closes shop after failing to secure a sponsor, but Hunt manages to land a driving position in McLaren after Emerson Fittipaldi leaves the team. During this time, Hunt marries supermodel Suzy Miller (Olivia Wilde), while Lauda develops a relationship with socialite Marlene Knaus (Alexandra Maria Lara).The 1976 Formula One season starts with Lauda dominating the first two races while Hunt struggles to catch up. Hunt wins the Spanish Grand Prix but is disqualified after a post-race inspection rule that his car is too wide. Struggling to comply with F1 rules, McLaren suffers a series of setbacks on the next few races, and Hunt's situation is further exacerbated when Suzy is discovered to have a relationship with Richard Burton. Following his divorce, he regains his competitive spirit and his disqualification in Spain is overturned, reinstating the points he lost and putting him back into championship contention. Lauda marries Marlene in a private ceremony but begins to have concerns about the effects of his newfound happiness, worrying that he has become vulnerable as a racer, as he now has something to lose.At the German Grand Prix, Lauda urges the F1 committee to cancel the race due to heavy rain on the already notoriously dangerous Nurburgring; the request is vetoed by majority of the racers after Hunt convinces them that Lauda fears losing the points race. Hunt argues that Lauda is trying to personally benefit in competition by reducing the number of remaining races at a time where Lauda already has a significant points lead towards the season's championship.Both Hunt and Lauda start the race with rain tires, which becomes a costly tactic due to most of the track quickly drying up.They both pit to change tires during the second lap, but halfway through the third lap, a suspension arm in Lauda's Ferrari breaks, sending the car flying into an embankment before it bursts into flames and is further hit by other cars on the track. After being pulled out of the flaming wreckage, he is airlifted to the hospital with third-degree burns to his head and face and dangerous internal burns to his lungs. For the next six weeks, Lauda is treated for his injuries while he watches his rival dominate the races in his absence. Against his doctor's orders, he returns behind the wheel of his Ferrari at the Italian Grand Prix to finish fourth while Hunt fails to finish the race.The 1976 season comes to a climax at the rain-soaked Japanese Grand Prix on 1st Aug. Hunt's late rally in Lauda's absence has pulled him within three points of Lauda. At the end of the second lap, Lauda returns to the pits and retires from the race, opting to stay with Marlene instead of risking his life again on the track. Hunt now needs to finish third or better to win the championship. After facing stiff competition under grueling conditions and overcoming tire problems and injuring his hand due to the gear Shifter knob breaking, Hunt finishes third, giving him enough points to beat Lauda by one point and win the championship. He spends the rest of the year with fame, sex, and drugs, while Lauda takes an interest in flying private planes.At a private airfield in Bologna, Lauda suggests Hunt to focus on the next racing season, but later on realizes that Hunt no longer has anything to prove.Lauda reflects on how Hunt's continued hedonism led to limited future success (he retired from racing in 1979) and his eventual death at age 45, but also on how their great rivalry and personality differences spurred each other on that one season, and states that Hunt was the only person he ever envied."
}