{
	"title": "Aftersun",
	"release_year": "2022",
	"runtime": "102",
	"tags": [
		"Drama",
		"amazon",
		"netflix"
	],
	"rating": 7.6,
	"actors": [
		"Paul Mescal",
		"Frankie Corio",
		"Celia Rowlson-Hall",
		"Sally Messham",
		"Ayse Parlak",
		"Sophia Lamanova",
		"Brooklyn Toulson",
		"Spike Fearn",
		"Harry Perdios",
		"Frank Corio"
	],
	"staff": [
		"Charlotte Wells",
		"Charlotte Wells",
		"Mark Ceryak",
		"Amy Jackson",
		"Barry Jenkins",
		"Adele Romanski",
		"Oliver Coates",
		"Gregory Oke",
		"Blair McClendon",
		"Lucy Pardee",
		"Billur Turan"
	],
	"votes": 100938,
	"cover": "https://m.media-amazon.com/images/M/MV5BZWU5Y2MyZjQtNGVjYi00ZDRkLTk1MGYtYmNlMzI0MTFmNDU2XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In the late 1990s, Scottish 11-year-old Sophie Patterson travels to a Turkish holiday resort with her 30-year-old father, Calum, who moved to London after separating amicably from her mother. Sophie records the holiday on a MiniDV camera, the footage of which is interspersed throughout the film. Over the course of the holiday, Sophie befriends and observes various English tourists at the resort, often meeting and playing arcade games with a boy named Michael. Calum exhibits signs of depression, anxiety, and internal turmoil, which he tries to hide from Sophie beneath a facade of contentment. During his time alone, he practices Tia chi and reads self-help books; he also smokes, which he hides from Sophie.One day, Sophie and Calum go scuba diving and she loses her expensive scuba mask; Calum feigns nonchalance, but Sophie senses his actual feelings, says she knows the mask was expensive and comforts him. Calum later tells their diving instructor that he is surprised he has lived to be 30. Soon after, Calum and Sophie go to a rug shop, where she sees him grapple with the cost of one he likes. He declines to buy the rug, but later returns alone and buys it.The next night, Sophie and Calum attend a karaoke night and Sophie signs them up for a song. Calum refuses to sing with Sophie despite her insistence, and she sings \"Losing My Religion\" alone as Calum watches. Upset by being left alone by him, Sophie refuses to return to their room with him and hangs out with some other tourists she previously met playing billiards. Michael creeps up on Sophie from behind, frightening her. They later kiss beside a pool. Meanwhile, Calum goes to the beach and walks into the ocean. When Sophie returns to their room, she finds him asleep naked and gently covers him with a sheet.The two reconcile the next day while travelling to the mud baths, and Calum apologies for his behavior the previous night. Sophie surprises him by having other tourists sing \"For He's a Jolly Good Fellow\" for his birthday. Calum watches stoically. He is shown sobbing in the hotel room alone, with letters that apologies to Sophie strewn across the floor.On the last night of their holiday, Calum and Sophie dance to \"Under Pressure\" in a loving embrace. In the morning, at the airport, Calum waves goodbye and sends Sophie off on her flight home.In the present day, the adult Sophie lives with her wife and young child. The rug Calum bought is next to their bed. Sophie watches the video footage from the holiday in Turkey.Interspersed throughout the film are abstract, dreamlike sequences in which the adult Sophie stands in the middle of a crowded rave, catching glimpses of Calum dancing frantically through stroking lights. Throughout the sequences, Sophie attempts to get closer to him, eventually briefly embracing him; with their hands wrapped around each other, Calum ultimately falls from Sophie's grasp. In the final scene, Calum packs the video camera away and walks down the airport hallway after having waved goodbye to Sophie, opening the doors to the rave.",
	"links": [
		"https://www.amazon.com/Aftersun-Paul-Mescal/dp/B0B672PRKW",
		"https://www.netflix.com/title/81616082"
	]
}