{
	"title": "Thor: The Dark World",
	"release_year": "2013",
	"runtime": "112",
	"tags": [
		"Action",
		"Adventure",
		"Fantasy",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Chris Hemsworth",
		"Natalie Portman",
		"Tom Hiddleston",
		"Stellan Skarsgård",
		"Anthony Hopkins",
		"Christopher Eccleston",
		"Jaimie Alexander",
		"Zachary Levi",
		"Ray Stevenson",
		"Tadanobu Asano"
	],
	"staff": [
		"Alan Taylor",
		"Christopher L. Yost",
		"Christopher Markus",
		"Stephen McFeely",
		"Don Payne",
		"Kevin Feige",
		"Brian Tyler",
		"Kramer Morgenthau",
		"Dan Lebental",
		"Wyatt Smith",
		"Sarah Finn",
		"Charles Wood"
	],
	"votes": 734262,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTQyNzAwOTUxOF5BMl5BanBnXkFtZTcwMTE0OTc5OQ@@._V1_QL75_UY281_CR4,0,190,281_.jpg",
	"description": "Eons ago, Bor (Tony Curran), father of Odin (Anthony Hopkins), clashes with the Dark Elf Malekith (Christopher Eccleston), who seeks to destroy the universe using a weapon known as the Aether. Malekith wanted to transform the Universe back into one of eternal darkness. Aether is an ancient force of infinite destruction.\nThe Aether could be unleashed only when the nine realms coincided in a line, which happens every 5000 years. But just as when the event occurred, Bor took the Aether from Malekith's grasp using the Bifrost. With the battle all but lost, Malekith orders his ships to fall upon the Asgard army, which meant that Malekith's forces were sacrificed to inflict maximum possible damage on the Asgard army.After conquering Malekith's forces, including enhanced warriors called the Kursed (who had ingested a small part of Aether to transform into the Kursed), on their home world of Svartalfheim, Bor safeguards the Aether within a stone column. Aether could not be destroyed as its power was too great, and hence the order was to bury it in a place where no one could ever find it.\nUnbeknownst to Bor, Malekith, his lieutenant Algrim (Adewale Akinnuoye-Agbaje), and a handful of Dark Elves escape into suspended animation.In present-day Asgard, Loki (Tom Hiddleston) stands imprisoned for his war crimes on Earth. Loki claims that he wanted to rule Earth as his birthright, as a benevolent God. Odin spares Loki due to Frigga, and orders Loki to be imprisoned instead of being executed.\nMeanwhile, Thor, alongside warriors Fandral (Zachary Levi), Volstagg (Ray Stevenson), and Sif (Jaimie Alexander), repel marauders on Vanaheim, home of their comrade Hogun (Tadanobu Asano); it is the final battle in a war to pacify the Nine Realms following the reconstruction of Bifrost, the \"Rainbow Bridge\" between realms, which had been destroyed two years earlier. The Asgardians soon learn that the Convergence, a rare alignment of the Nine Realms, is imminent; as the event approaches, portals linking the worlds appear at random.In London, astrophysicist Dr. Jane Foster (Natalie Portman) and her intern Darcy Lewis (Kat Dennings) travel to an abandoned factory where such portals have appeared, disrupting the laws of physics around them. Ian Boothby (Jonathan Howard) is Darcy's intern.\nSeparating from the group, Jane is Teleported to another world, right next to the column where Bor stored the Aether, where she is infected by the Aether.\nHeimdall (Idris Elba) (the protector of the Asgard portal via the rainbow bridge) alerts Thor that Jane has moved beyond his near omniscient sight, leading Thor to Earth.\nJane is returned to Earth, but Darcy tells her that she was gone for 5 hours. Jane realizes that even rainwater would not touch her.When Thor finds Jane, he finds that Jane has inadvertently released an unearthly force which Thor cannot understand. Thor returns with her to Asgard where Asgard medical professionals conduct a full diagnostic on Jane. They find a huge amount of energy surging within her.\nOdin, recognizing the Aether, warns that the Aether will not only kill Jane, but that its return heralds a catastrophic prophecy.Odin says that the Nine realms are not eternal. They came into existence after the Universe began and will end in the future. But before the Nine Realms the Dark Elves reigned absolute over the Universe. The leader of the Dark Elves, Malekith, made a weapon called Aether out of the darkness. The other relics appear as stones, but Aether appears as a fluid and ever-changing. Aether changes matter into dark matter. Malekith wanted to use the Aether's power to return the Universe to darkness. Odin is adamant that the Dark Elves were killed by his father Bor.Malekith, awakened by the Aether's release, turns Algrim into a Kursed & sets up base on Svartalfheim. They attack Asgard by sneaking in Algrim as a prisoner. During the battle, Malekith and Algrim search for Jane, sensing that she contains the Aether.\nThor explains to Jane that during Convergence, the lines between realms becomes blurred and portals appear between them, which will vanish once the realms are out of alignment again.Thor's mother Frigga (Rene Russo) is killed by Malekith protecting Jane, and Malekith and Algrim are forced to flee without Jane. The Dark Elves hide behind an invisible shield and even Heimdall cannot see them. In their attack, Algrim damaged the force field generator that protected Asgard and as such the entire city is defenseless.\nOdin argues that since they have the Aether, Malekith will be forced to attack again, and he wants Thor to wait. But Thor wants to take the fight away from Asgard.\nDespite Odin's orders not to leave Asgard, Thor (Chris Hemsworth) reluctantly enlists the help of Loki, who knows of a secret portal to Svartalfheim, where they will use Jane to lure and confront Malekith, away from Asgard. In return, Thor promises Loki vengeance on Malekith for killing their mother. With Volstagg and Sif stalling Asgardian soldiers and Fandral assisting their escape, Thor, Loki, and Jane head to Svartalfheim.There, Loki tricks Malekith into drawing the Aether out of Jane, but Thor's attempt to destroy the exposed substance fails. Malekith merges with the Aether and leaves in his ship as Loki is fatally wounded while killing Algrim. Thor, cradling Loki in his arms, promises to tell their father of his sacrifice. Afterwards, Thor and Jane discover another portal in a nearby cave and reunite in London with Darcy and Jane's mentor Dr. Erik Selvig (Stellan Skarsgard) who was briefly institutionalized due to the mental trauma he suffered during Loki's attack on Earth.While Malekith was extracting the Aether, Jane learns that Malekith plans to destroy the universe and restore the Dark Elves to dominance by unleashing the Aether at the center of the Convergence in Greenwich. Thor battles Malekith through various portals and across multiple worlds until one portal separates them, leaving Malekith unopposed on Earth. Thor returns just in time to help his mortal comrades Erik and Jane to use their scientific equipment to transport Malekith to Svartalfheim, where he is crushed by his own damaged ship, which is also transported to Svartalfheim.Thor returns to Asgard, where he declines Odin's offer to take the throne and tells Odin of Loki's sacrifice. As he leaves, Odin's form transforms to that of a grinning Loki.\nIn a mid-credits scene, Volstagg and Sif visit the Collector and entrust the Aether to his care, commenting that, with the Tesseract already in Asgard, having two Infinity Stones so close together would be dangerous. As they leave, the Collector remarks, \"One down, five to go.\"In a post-credits scene, Jane and Thor reunite on Earth while somewhere in London a frost monster from Jotunheim, accidentally transported to Earth during the final battle, continues to run amok.",
	"links": [
		"https://www.amazon.com/Thor-Dark-World-Chris-Hemsworth/dp/B00IMYSVY8"
	]
}