{
	"title": "Gangs of Wasseypur",
	"release_year": "2012",
	"runtime": "321",
	"tags": [
		"Action",
		"Comedy",
		"Crime",
		"amazon"
	],
	"rating": 8.2,
	"actors": [
		"Manoj Bajpayee",
		"Nawazuddin Siddiqui",
		"Tigmanshu Dhulia",
		"Richa Chadha",
		"Reema Sen",
		"Piyush Mishra",
		"Huma Qureshi",
		"Jaideep Ahlawat",
		"Vineet Kumar Singh",
		"Pankaj Tripathi"
	],
	"staff": [
		"Anurag Kashyap",
		"Akhilesh Jaiswal",
		"Anurag Kashyap",
		"Sachin K. Ladia",
		"Zeishan Quadri",
		"Sunil Bohra",
		"Jyoti Kapur Das",
		"Anurag Kashyap",
		"Vikram Malhotra",
		"Sneha Khanwalkar",
		"G.V. Prakash Kumar",
		"Rajeev Ravi",
		"Shweta Venkat",
		"Mukesh Chhabra",
		"Wasiq Khan"
	],
	"votes": 105307,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTc5NjY4MjUwNF5BMl5BanBnXkFtZTgwODM3NzM5MzE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Prologue\nIn January 2004 , a gang of heavily armed men scour and finally narrow down on a house in Wasseypur. They surround the house and unleash a wave of bullets and grenades on it with the intention of killing the family inside it. After heavy firing on the house, they retreat from the crime scene in a vehicle, convinced they have killed everyone within. The leader of the gang then calls J.P. Singh on his cell phone and reports that the family has been successfully executed but he is double crossed by JP Singh as a fire fight erupts between them and a police check post blocking their escape route. The scene cuts abruptly for a prologue by the narrator, Nasir. The whole scene is then revealed in the sequel.Introduction of Wasseypur and Dhanbad\nNasir's narration describes the history and nature of Wasseypur. During the British Raj, Wasseypur and Dhanbad were located in the Bengal region. After India gained its independence in 1947, they were carved out of Bengal and redistricted into the state of Bihar in 1956. In 2000, Wasseypur and Dhanbad were redistricted for a second time into the newly formed state of Jharkhand where they remain. The village has been historically dominated by the Qureshi Muslims, a sub-caste of animal butchers who are feared by the non-Qureshi Muslims living there and Dhanbad by extension.During British colonial rule, the British had seized the farm lands of Dhanbad for coal which began the business of coal mining in Dhanbad. The region was a hotbed of the local faceless robber Sultana Qureshi who robbed British trains in the night and thus held some patriotic value for the locals.1940s\nIn 1941 , Shahid Khan (Jaideep Ahlawat), a Pathan, takes advantage of the mysteriousness of the faceless robber Sultana, a Qureshi, by impersonating his identity to rob British ferry trains. The Qureshi clans eventually find out and order the banishment of Shahid Khan and his family from Wasseypur. They settle down in Dhanbad where Shahid begins work as a laborer in a coal mine. He is unable to be at his wife's side during childbirth, and she dies. The enraged Shahid kills the coal mine's muscleman who had denied him leave on that day. In 1947, independent India begins to assert its authority over itself. The British coal mines are sold to Indian industrialists and Ramadhir Singh (Tigmanshu Dhulia) receives a few coal mines in the Dhanbad region. He hires Shahid Khan as the new muscleman of one of the coal mines. Shahid terrorizes the local population to seize their lands and extract compliance.On a rainy day, Ramadhir Singh overhears Shahid's ambitions of taking over the coal mines from him. Singh tricks Shahid into traveling to Varanasi for business but instead has him murdered by an assassin named Yadav Ji (Harish Khanna). Nasir (Piyush Mishra), Shahid's cousin, finds Ramadhir's umbrella with his initials near the door and concludes that Ramadhir eavesdropped on their conversation. He flees from the house with Shahid's son Sardar in the nick of time as Ehsaan Qureshi (Vipin Sharma), another associate of Ramadhir Singh and a member of the Wasseypur Qureshi clan, shows up to kill them but is too late. An unsuccessful Ehsaan lies to Singh that Shahid's family has been murdered, burnt, and buried. Under the care of Nasir, Sardar grows up along with Nasir's nephew Asgar (Jameel Khan). Sardar learns the truth about his father's death, upon which he shaves his head and vows not to grow his hair until he has avenged his father's murder.Early and Mid 1970s\nIn 1972 , the coal mines are nationalized. A mature Sardar Khan (Manoj Bajpai) and his kin start hijacking Ramadhir's coal trucks mid-transit. Ramadhir Singh suspects S.P. Sinha, a Coal India official, to be behind the hijackings and has him murdered. After Sinha's murder, Ramadhir's reputation for ruthlessness grows, and he becomes feared in Dhanbad.Sardar marries Nagma Khatoon (Richa Chadda). The pregnant Khatoon confronts Sardar Khan and a prostitute inside a brothel and chases him away. Later, Nagma gives birth to Danish Khan but gets pregnant immediately afterwards. Unable to have sex with a pregnant Nagma, Sardar confesses his sexual frustrations with his kin. At dinner, Nagma gives her consent to Sardar to sleep with other women but with the condition that he won't bring them home or dishonor the family name.Sardar, Asgar and Nasir start working for J.P. Singh (Satya Anand), Ramadhir Singh's son. They misuse their employment by secretly selling the company petrol in the black market. Later, they rob a petrol pump and a train bogey belonging to the Singh family. They usurp Singh's land, which forces the two families to confront each other for talks. The meeting ends in a scuffle, but Ramadhir Singh realizes that Sardar Khan is in fact the son of Shahid Khan who he had murdered in the late 1940s. Sardar and Asgar are jailed for assaulting J.P. Singh during the meeting.Early 1980s\nIn 1979 , Sardar and Asgar escape from jail. While hiding in Wasseypur, Sardar marries a Bengali Hindu woman named Durga (Reema Sen). Asgar informs Nagma that Sardar has taken a second wife, leaving Nagma helpless. Meanwhile, Wasseypur has merged with Dhanbad and the Qureshi clan continues to terrorize the non-Qureshi Muslims. The locals then approach Sardar Khan for help as he was well known for standing up to Ramadhir Singh. During Muharram, both Shias and Sunnis are out mourning, including the Qureshi clan. Sardar uses the opportunity to launch a major bomb attack on many Qureshi shops and houses. When word spreads about Sardar's raids, his reputation grows and he commands more fear than the Qureshi clan.Eventually, Sardar returns home to Nagma and she gets pregnant again. Sardar tries to initiate sex with a pregnant Nagma but she refuses, which prompts an angry Sardar to leave. He goes to stay with his second wife, Durga, and she gives birth to his son, Definite. Ramadhir Singh, noticing that Sardar has abandoned his first family, tries to reach out to Nagma through Danish by giving him money. An enraged Nagma beats Danish for taking the money while she breaks down in front of Nasir. A thirsty Faizal wakes up in the middle of the night to find Nagma and Nasir about to have sex. Angry, he storms out of the house and becomes a stoner, permanently seen with his cannabis. Nasir reveals that the desires were never consummated, but Faizal and Nasir never see eye to eye again.Mid and Late 1980s\nSensing Sardar's increasing clout, Ramadhir calls his old associate Ehsaan Qureshi who brokers a meeting between Sultan Qureshi(Pankaj Tripathi), his nephew and Ramadhir Singh where the two decide to become allies against their common enemy, Sardar. Sultan asks Ramadhir for modern automatic weapons which the latter promises to give.1990s\nSardar becomes the most feared man in Wasseypur and shifts his business to stealing iron ore. Danish Khan (Vineet Kumar Singh) joins the family business. A failed attack from Sultan Qureshi leaves Danish with a minor injury and causes reconciliation between Sardar and Nagma. Sardar finds Ramadhir and warns him of terrible consequences if anything ever happens to his family.A mature Faizal (Nawazuddin Siddiqui) is seriously affected by Bollywood movies as he starts behaving, talking and dressing like Bollywood characters. Sardar sends Faizal to Varanasi to buy guns, but Faizal is caught by the police and jailed. Upon release, he kills the gun seller Yadav, who unbeknownst to Faizal was the nameless assassin who had killed Shahid Khan (Faizal's grandfather) and who had implicated Faizal to police earlier. Meanwhile, Sardar seizes a lake belonging to a local temple and charges commission on fish sellers who make a catch in that lake. An uneasy peace is maintained between the Qureshi and Khan families when Danish Khan marries Shama Parveen, the sister of Sultan Qureshi. At the same time, Faizal begins romancing Mohsina Hamid (Huma Qureshi), another kin of Sultan.Epilogue\nFaizal reveals to his friend, Faizlu that his father Sardar would be travelling without security the next day. Unbeknownst to Faizal, Faizlu is actually an ally of Sultan. Late that night, while Faizal is still asleep, Faizlu calls up the Qureshis and tells them that Sardar's bodyguards wouldn't be with him the next day. The next morning, Sardar leaves home alone and reaches Durga's house where he gives her her expense allowance. Once Sardar leaves, Durga also calls up the Qureshis and tells them that he has just left her house. The Qureshi men follow Sardar's car, and when the latter stops at a petrol pump to refuel they start shooting as Sardar ducks in the car for cover. The Qureshi men put several close rounds through the car window ensuring a precise and unmistakable hit, after which they escape. A shocked Sardar opens the car door and stands up to reveal multiple bullet wounds, with one bullet embedded in his head. He steps out with his gun drawn to stop a cycle ferry on which he eventually collapses to his death.The second film resumes with the killing of Sardar Khan. Danish, his elder son Danish instantly kills the lone captured killer and vows to kill rest of the three killers. Sultan realizing the danger kills Danish. It is now up to Faizal to exact revenge. No one in the family thinks that Faizal would be able to do that since most of the time he is seen smoking weed, but he promises his mother that he would.Faizal stays low and waits for right opportunity. When his friend Fazlu (who had earlier leaked the news of Sardar Khan's visit to Durga ultimately leading to his death in the first part), wins local election Faizal meets him on pretext of congratulating him and kills him. This establishes that Faizal can indeed lead his father's business.Meanwhile Faizal marries his sweetheart Mohsina. Wasseypur is no more the town that was once consumed by the raging war between Sardar Khan and Ramadhir Singh. It has spawned a new generation of money squandering lobbyists, turning into foolhardy gangs overnight. A small time goon Shamshad Alam has his own transport business. He joins hands with Faizal Khan in his steel business. The deal is that Shamshad would fill Faizal's coffers with his astute knowledge of his scrap business and support Faizal's business with his transport business. Simultaneously Faizal makes truce with Ramadhir Singh. According to their agreement, Ramadhir would provide his political support to Faizal's business in Wasseypur region on condition he would not extract revenge of his kin. Although he is sympathetic with Sultan initially, he informs Sultan of the agreement and that he would be of little help to him. Ramadhir meanwhile is losing his faith in his son's (J.P.) ability to run his empire and J.P. often finds himself in line of fire for his inability. This results in waning of J.P.'s prominence and influence.Faizal's half brother (son of Sardar & Durga) Definate is turning out to be deadly as well as very cunning teenager. After death of Sardar Khan his mother (Durga) works as a cook at Ramadhir Singh's place and hence Ramadhir Singh thinks he has influence over Definate. Faizal's younger brother Perpendicular a school going teenager, is creating a menace in locality by looting shops in broad daylight. Although courageous like his father, he is stupid. Harassed with his antics, local shopkeepers Hire Sultan to assassinate Perpendicular. Shamshad on the other hand is keeping Faizal in dark about the transactions and pocketing some part of the profit for himself. One fine day his scheme is exposed and he is tensed. He decides to partner with Ramadhir Singh to save his skin. Faizal is arrested through Shamshad and at same-time Sultan kills Perpendicular. Definite feels that this is the right time to step into shoes of Faizal and before Shamshad claims this position he would have to kill him. Definate's gun jams right in the middle of the assassination attempt and he has to run for his life. Unfortunately he runs into bogey full of army personnel and sent to same jail, where he meets Faizal.Ramadhir advises Shamshad to bail Definate out of the jail and then instigate him against his own brother for his empire. Faizal realizes the plan and cautions Definate before he leaves the jail. Definate straight away bombs Shamshad's office in which Shamshad is badly injured and loses his leg. In rage, Sultan enters Faizal's house & upon finding none else, kills his own sister Shama Parveen. Faizal vows revenge. Sultan is cautioned by JP when Faizal is about to be released from jail and advises him to hit him before Faizal hits him. So Sultan along with his gang raids the house of Faizal and the first scene of part 1 is shown where Sultan is fiercely pounding Faizal's home with bombs and bullets. It is revealed that Faizal and his entire family has a lucky escape. JP arranges another attack in which Ashgar & Nagma are killed. Later Sultan is double crossed by JP and has run into hiding. Definate along with Faizal's gang track him down and kill him. On advice of Faizal, Definate surrenders and is jailed.Meanwhile Iqlakh an educated man enters Faizal's life. Iqlakh is actually a pawn of Ramadhir, who wants to extract revenge of forced divorce of his parent done by Sardar Khan and his father was later forced to marry the woman he had raped(Shown in part 1). Faizal initially impressed with Iqlakh skills is later made aware of Iqlakh's background, but decides to play along. Iqlakh has astute knowledge of business and bags scrap auction by force. This brings lot of profit on the table for Faizal without any risk, good enough for him to neglect Definate. This is actually a strategy of Ramadhir to create rift between Faizal and Definate. Iqlakh advises Faizal to enter politics, to give political protection to all his activities. Faizal decides to contest from Ramadhir's constituency to extract his revenge. With illegal profiteering through scrap trade auctions over the Internet, corrupt government officials, election rigging and hooliganism, the town gets murkier.Here Definate is frustrated in jail as he is not able to reach Faizal. Ramadhir for the first time is shaken by Faizal, with his decision to enter politics from his own constituency. He feels that it is time to use his ace pawn Durga and assures her that her son would retain his father's empire. Through JP he brokers a deal with Definate and bails him out of the jail. J.P. meanwhile has other plans and wants to double cross his father, of whom he is tired of with his insulting slurs.Definate goes straight to Faizal and informs him of the plan. As per the plan on the polling day Faizal is to be killed by Iqlakh and if he misses Definate has to take the hit. On the D-day Iqlakh leads Faizal to an isolated place for the hit and Definate arrives late on the scene. Here Definate double crosses Iqlakh and kills him. Later Faizal & Definate take an ambulance with large cache of weapons and heads towards the hospital where Shamshad is admitted and Ramadhir is there to hatch his new plan. A ruthless blood bath takes place in the hospital between gangs of Faizal, Ramadhir and the police.Ramadhir is easily outclassed by Faizal. Rest of the gang members are dead, while Faizal and Definate are arrested. En route to prison the police halts at roadside restaurant for refreshments, leaving Faizal alone in the police van. Next we see unsuspecting Faizal shot dead by Definate. It is later revealed that JP was the architect of the massacre and Definate is seen free, walking towards his mother.\nTowards the end it's shown that Mohsina and Nasir are living in Mumbai with Faizal's young son.",
	"links": [
		"https://www.amazon.com/Gangs-Wasseypur-Manoj-Bajpai-Bajpayee/dp/B073SGLD17"
	]
}