{
	"title": "The Hitman's Bodyguard",
	"release_year": "2017",
	"runtime": "118",
	"tags": [
		"Action",
		"Comedy",
		"Crime",
		"amazon"
	],
	"rating": 6.9,
	"actors": [
		"Ryan Reynolds",
		"Samuel L. Jackson",
		"Gary Oldman",
		"Elodie Yung",
		"Tsuwayuki Saotome",
		"Roy Hill",
		"Roy Hill",
		"Richard E. Grant",
		"Rod Hallett",
		"Yuri Kolokolnikov",
		"Nadia Konakchieva"
	],
	"staff": [
		"Patrick Hughes",
		"Tom O'Connor",
		"Mark Gill",
		"Matthew O'Toole",
		"John Thompson",
		"Les Weldon",
		"Atli Örvarsson",
		"Jules O'Loughlin",
		"Jake Roberts",
		"Elaine Grainger",
		"Mariana Stansheva",
		"Russell De Rozario"
	],
	"votes": 250320,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTc4NjAxMjU4OV5BMl5BanBnXkFtZTgwNzQyMzIwMjI@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Private European Union based bodyguard Michael Bryce (Ryan Reynolds), a triple A rated executive protection agent and former CIA officer, is hired to protect Takashi Kurosawa, a Japanese arms dealer. Bryce's job is to pick up Takashi and his 2 wives from his residence and deliver them to his private airplane. All apparently goes well as Takashi boards the plane, until Kurosawa is shot in the head through the airplane window. Bryce can do nothing but watch.Two years later, Bryce has fallen into disgrace and ekes out a living protecting drug-addicted corporate executives in London such as Mr Seifert (Richard E. Grant). The agency's motto is \"boring is always best.\" After every job, Bryce calls the agency clean-up crew to deal with the threats he eliminated on the way to his client.Meanwhile, Vladislav Dukhovich (Gary Oldman), the ruthless and bloodthirsty dictator of Belarus, is put on trial for crimes against humanity at the International Criminal Court. Dukhovich has systematically eliminated all voices that speak against him in his country. He eliminated the family of Professor Asimov (Rod Hallett) for writing a paper against his policies. Asimov testifies at the ICC that he was taken to one of Dukhovich's internment camps, where he was for 3 years till Dukhovich was overthrown.\nThe prosecution is unable to make headway against him, as they are unable to substantiate their allegations with physical evidence and Dukhovich assassinates any witnesses who could do so. Dukhovich is accused of implementing genocide at a massive scale.\nThe prosecution's last hope is notorious incarcerated hit-man Darius Kincaid (Samuel L. Jackson), who agrees to testify against Dukhovich in exchange for releasing his wife Sonia (Salma Hayek) from prison. Kincaid is a contract killer wanted for crimes under a dozen jurisdictions and knows that he will never breathe free air again if he does not make a deal for himself. Yet, he only insists on Sonia's freedom.Interpol Assistant Director Jean Foucher (Joaquim de Almeida) and Renata Casoria (Tine Joustra) (Director of Interpol) assigns Amelia Roussel (Elodie Yung), an inexperienced agent and Bryce's ex-girlfriend, to lead the transportation of Kincaid. A squad of Interpol agents composed of French GIPN and British AFO's from the National Crime Agency begin to escort Kincaid from Manchester to The Hague. The team has 27 hours to get Kincaid to the Hague court.However, the convoy is ambushed in Coventry and everyone except Kincaid and Roussel are killed. The two retreat to a safe house where Kincaid treats his bullet wound in the leg. They realize someone in Interpol must have betrayed them and they need someone from outside they can trust, so Roussel contacts Bryce.Bryce is reluctant to help, as he believes that Roussel was responsible for the death of Kurosawa two years previously (Bryce was in love with Roussel and revealed the Takashi mission to her. Bryce believes that Roussel ordered an Interpol hit on Takashi to further her own career, at the expense of Bryce), but ultimately agrees to aid them in exchange for the restoration of his reputation. Roussel maintains that Bryce blamed her for something that she was never involved with and that's why she left him.\nAfter a brief showdown with Kincaid which reveals that Bryce had multiple conflicts with him in the past, Roussel returns to Interpol to update them on the situation, while Bryce and Kincaid plan their escape to the Hague. Roussel knows that she cannot take Kincaid as there is a mole inside the Interpol.\nDukhovich's men attack the safe house when Foucher learns that the safe house was accessed without an identity confirmation. Kincaid and Bryce manage to fight their way out of it.Sonia is being held in a prison in Amsterdam and Casoria orders to triple the guard around her, as she believes Kincaid might go to rescue her.\nFoucher approaches Dukhovich, revealing himself to be the traitor, and demands his payment for selling out Kincaid; Dukhovich stabs him in the hand and informs him he will only be paid when Kincaid is dead.Casoria suspends Roussel for bringing in Bryce, but she says that she had no choice as Interpol is compromised. Foucher promises to help Roussel but wants no secrets from her. Foucher gives Bryce's car license plates to Dukhovich.Dukhovich's men track Kincaid's location through his cell phone and ambush him and Bryce. While they are able to fight them off, their vehicle is destroyed. The two hitchhike to a ferry terminal and take a ferry to Amsterdam, where Sonia is being held. Bryce tells the story of his reputation was ruined by his failure on an assignment. Kincaid can see that Bryce really loves Roussel, and this he understands as Kincaid has bet everything for Sonia.\nKincaid met Sonia at a bar in Honduras, where she was a waitress. He saw her take down a bunch of customers who were harassing her, in an awesome display of violence and beauty.The next morning Bryce and Kincaid reach Bryce's safe house in Amsterdam.\nKincaid escapes from Bryce to send flowers to Sonia (he delivers them to the top of a clock tower from where Sonia can see them from her cell), and Bryce tracks him down and kills several more hitmen who were tracking him. Bryce tells Kincaid that he and Roussel separated after the Takashi job. Kincaid reveals that he killed Kurosawa two years ago, having been at the airport only by chance after another job. Enraged at the revelation that he has spent two years blaming Roussel for \"betraying\" him when in reality the client's death was a sheer fluke, Bryce abandons him.As Bryce bemoans his failures, a group of hitmen attacks Kincaid. Bryce changes his mind and helps Kincaid escape but is captured. Dukhovich's men torture him in an attempt to find Kincaid, who tracks Bryce down and rescues him. After settling their differences aside, the two battle their way to The Hague, arriving just in time for Kincaid to testify. He testifies that Dukhovich tried to hire Kincaid to assassinate a political rival, but in the process, Kincaid witnessed the execution of a village, uploading photos of the massacre to a secret FTP site that he provides the court with access to.Dukhovich resorts to his backup plan; to bomb the court, allowing him to steal a gun and attempt to kill Kincaid. Bryce jumps in the way of the bullet and orders Kincaid to stop Dukhovich from escaping. Roussel notices Foucher acting suspiciously during the attack and deduces he is the traitor. She subdues him with Bryce's aid, and the two rekindle their relationship. Kincaid pursues Dukhovich to the roof of the building, where he attempts to escape by helicopter.Kincaid destroys the helicopter and corners Dukhovich. Dukhovich attempts to break Kincaid by claiming he will never be able to redeem himself for his sins, but Kincaid laughs it off, declares that Dukhovich should not have shot Bryce, and kicks Dukhovich off the roof to his death.In the aftermath, Bryce is recovered and has rekindled his relationship with Roussel and Sonia is released. Kincaid is rearrested for his previous crimes but breaks out of HMP Belmarsh so he and Sonia can celebrate their anniversary in the bar in Honduras where they first met.",
	"links": [
		"https://www.amazon.com/Hitmans-Bodyguard-Ryan-Reynolds/dp/B074VZK5TS"
	]
}