{
	"title": "Non-Stop",
	"release_year": "2014",
	"runtime": "106",
	"tags": [
		"Action",
		"Mystery",
		"Thriller",
		"amazon"
	],
	"rating": 6.9,
	"actors": [
		"Liam Neeson",
		"Julianne Moore",
		"Scoot McNairy",
		"Michelle Dockery",
		"Nate Parker",
		"Corey Stoll",
		"Lupita Nyong'o",
		"Omar Metwally",
		"Jason Butler Harner",
		"Linus Roache"
	],
	"staff": [
		"Jaume Collet-Serra",
		"John W. Richardson",
		"Christopher Roach",
		"Ryan Engle",
		"Alex Heineman",
		"Andrew Rona",
		"Joel Silver",
		"John Ottman",
		"Flavio Martínez Labiano",
		"Jim May",
		"Cathy Sandrich Gelfond",
		"Amanda Mackey",
		"Alec Hammond"
	],
	"votes": 278323,
	"cover": "https://m.media-amazon.com/images/M/MV5BOTI3NzcxMjkzMl5BMl5BanBnXkFtZTgwMDY0NTQ0MDE@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "Bill Marks (Liam Neeson) is an alcoholic U.S. federal air marshal; he enrolled in the Air Marshal service after he was discharged from the police force. On a non-stop flight from New York to London aboard British Aqualantic Flight 10, midway over the Atlantic Ocean, Marks receives text messages on his secure phone stating that someone on the plane will die every 20 minutes unless $150 million is transferred into a specific bank account.Breaking protocol, Marks consults with Jack Hammond (Anson Mount), the other air marshal on the flight. Hammond is revealed to be smuggling cocaine in a briefcase and following an altercation Marks ends up killing him in a lavatory. This occurs exactly at the 20-minute mark, resulting in the first death. As Marks attempts to stall for time with the Texter, he works with the flight crew and Jen Summers (Julianne Moore), who sits next to Marks, to discover the Texter's identity. When the time runs out again, the captain suddenly dies of poisoning.The public becomes convinced that Marks is hijacking the plane, as the bank account is in his name and a passenger uploads video footage of him treating passengers aggressively with no explanation. Co-pilot Kyle Rice (Jason Butler Harner) has been instructed by the TSA to ignore Marks and land in Iceland, the closest destination; he diverts the plane but continues to cautiously trust Marks. Marks has cell phone programmer Zack White (Nate Parker) design a hack that will cause the Texter's cell phone to ring. Ringing the phone, he discovers it in the pocket of a passenger, who claims to have never seen the phone before. Following a fight with Marks, the passenger dies in a similar fashion to the captain.In the lavatory, Marks finds a hole in the wall that allowed someone to shoot a poison dart at the captain; he finds that the most recently deceased passenger was struck with a dart as well. While Marks and Summers try to gain access to the Texter's phone, it suddenly activates, sending automated messages to TSA implying that Marks is suicidal and is going to detonate a bomb on the plane. Marks finds the bomb hidden in the cocaine smuggled by Hammond.Unable to land the plane in time, he attempts to initiate a protocol of least damage: by bringing the plane to 8,000 feet to equalize air pressure, placing the bomb in the rear of the plane, covering it with baggage and moving the passengers to the front in order to contain the explosion and minimize casualties. As he begins to initiate these actions, some of the passengers attempt to disable Marks, convinced by the media that he is a terrorist. They overpower Marks but are stopped when passenger Tom Bowen (Scoot McNairy) uses Marks' gun to make them move away. Marks finally explains the situation to them, and they agree to work with him.Watching a video clip of himself handling passengers, Marks notices Bowen, whom he had initially cleared of any suspicion, slipping the Texter's phone into the pocket of the second poison victim. Realizing that Bowen is the culprit, Marks engages him in a fight, and by then it is revealed that Bowen's father was killed in the 9/11 terrorist attacks and that he and White are ex-military. Bowen was appalled by the lack of security at U.S. airports after 9/11, hoping that framing Marks as a terrorist will lead to drastically increased security. Bowen is prepared to die with the plane and shoots White, who planned to get off the plane with the money, after Marks convinces him to disarm the bomb. Following another fight, Marks shoots Bowen in the head. White recovers and attacks Marks with a knife, but White dies in the explosion as Marks retreats to the front of the plane.Rice manages an emergency crash-landing at an air base in Iceland after the bomb explodes, disregarding orders from his fighter plane escort. Despite their warnings, the fighter planes do not shoot the plane down. The plane is damaged in the landing and a young girl named Becca (Quinn McColgan) is almost sucked out of the hole in the plane, but ultimately there are no casualties. Marks is hailed as a hero in the media, and the film ends with him and Summers beginning their friendship.",
	"links": [
		"https://www.amazon.com/Non-Stop-Liam-Neeson/dp/B00JYSJBGI"
	]
}