{
	"title": "Inside Out",
	"release_year": "2015",
	"runtime": "95",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"amazon"
	],
	"rating": 8.1,
	"actors": [
		"Amy Poehler",
		"Bill Hader",
		"Lewis Black",
		"Mindy Kaling",
		"Phyllis Smith",
		"Richard Kind",
		"Kaitlyn Dias",
		"Diane Lane",
		"Kyle MacLachlan",
		"Paula Poundstone"
	],
	"staff": [
		"Pete Docter",
		"Pete Docter",
		"Ronnie Del Carmen",
		"Meg LeFauve",
		"Josh Cooley",
		"Jonas Rivera",
		"Michael Giacchino",
		"Kevin Nolting",
		"Natalie Lyon",
		"Kevin Reher",
		"Ralph Eggleston"
	],
	"votes": 826062,
	"cover": "https://m.media-amazon.com/images/M/MV5BOTgxMDQwMDk0OF5BMl5BanBnXkFtZTgwNjU5OTg2NDE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "A girl named Riley (Kaitlyn Dias) is born in Minnesota, and within her mind, five personifications of her core emotions-Joy (Amy Poehler), Sadness (Phyllis Smith), Disgust (Mindy Kaling) (keeps Riley from being poisoned by consuming unknown items), Fear (Bill Hader) (keeps Riley safe), and Anger (Lewis Black) (wants things to be fair)-come to life. The emotions live in Headquarters, Riley's conscious mind, where they influence Riley's actions and memories via a control console. Each emotion takes control of the central console depending on the situation that Riley is in.\nHer new memories are housed in colored orbs, which are sent into storage at the end of every waking period.The most important or \"core\" memories are housed in a hub in Headquarters (each core memory represents an important event in Riley's life like when she scored her first goal) and each core memory powers a different personality Island. Currently there are five \"islands\" (Hockey, Goofball, Friendship, Family and Honesty Island), each of which reflects a different aspect of Riley's personality. Joy acts as the dominant emotion to keep Riley in a happy state, but she and the others do not understand Sadness's purpose, other than making Riley cry. Joy perceives Sadness as an unnecessary burden for Riley.When Riley is 11 years old, her family (mom (Diane Lane) and dad (Kyle MacLachlan)) moves to San Francisco after her father gets a new job. However, their new home is tiny, filthy, lifeless, and their belongings are still in a moving truck that ends up getting lost somewhere in Texas. Riley is a hockey player and used to open spaces, and fells confined in the urban congestion of San Francisco.\nJoy becomes concerned when Sadness begins touching happy memories, causing them to turn sad, so she tries to keep Sadness isolated.\nJoy believes that with Sadness out of the way, Riley will have a good day, a good week and then a good year and a good life.However, on Riley's first day at her new school, the teacher asks Riley to introduce herself. Joy brings up her Hockey memory to help Riley talk about it. Sadness comes out of her isolation and touches the Hockey memory and turns it into a sad memory, and accidentally causes Riley to cry in front of her class, creating a sad core memory.Joy attempts to dispose of the new core memory before it reaches the central hub, but she accidentally knocks the other core memories loose in her struggle with Sadness, shutting down the personality islands and making them unstable. Before Joy can put them back, she, Sadness, and the core memories are sucked out of Headquarters through the memory tube leading to the rest of Riley's mind. They end up in the labyrinthine storage area of Riley's long-term memories and set out to return to Headquarters.Anger, Disgust, and Fear attempt to maintain Riley's emotional state in Joy's absence, but inadvertently distance Riley from her parents, friends, and hobbies, resulting in her personality islands slowly crumbling and falling into the Memory Dump, an abyss where faded memories are disposed and forgotten. The Goofball personality island is the first to go.\nSadness had read the mind manuals and only she knew the way back to headquarters. So, Joy was stuck with her.After Riley has a fight with her friend in Minnesota, the Friendship Island also crumbles and falls away into the Memory Dump.\nMeanwhile, Anger, intending to restore Riley's happiness, convinces Disgust and Fear that Riley should run away to Minnesota, where her happy memories were formed.Meanwhile, Joy and Sadness find Bing Bong (Richard Kind), Riley's childhood imaginary friend (mostly made of cotton candy and part cat, part elephant, part dolphin), who is desperate to reconnect with her.\nAs Riley grew up, she forgot about her imaginary friend and he was discarded into the long term memory section.\nHe tells them they can get to Headquarters by riding the train of thought. After exploring different areas of Riley's mind, the three eventually catch the train, but it derails when another personality island falls. Joy, who is afraid all of the core memories will become sad, abandons Sadness.As Riley prepares to board a bus bound for Minnesota, Joy attempts to use a \"recall tube\" to return to Headquarters, but the last personality island falls and breaks the tube, sending Joy into the Memory Dump along with Bing Bong. While despairingly looking through old memories, Joy discovers a sad memory in Riley's life that becomes happy when her parents and friends come to comfort her over losing a hockey game, causing her to realize Sadness's true importance: alerting others when Riley needs help or comforting.Joy and Bing Bong try to use Bing Bong's discarded wagon rocket to get out of the Memory Dump, but after several failed attempts, Bing Bong realizes their combined weight is too much and jumps out and fades away, allowing Joy to escape. Joy uses various tools from Imagination Land to propel herself and Sadness to Headquarters, where they find that Anger's idea has disabled the control console, rendering Riley depressed and apathetic. At Joy's urging, Sadness takes control and successfully removes the idea, reactivating the console and prompting Riley to return home.As Sadness re-installs the core memories, Riley arrives home and breaks down in tears, confessing to her parents that she misses her old life, and she cannot keep pretending to be happy and content all the time.As her parents' comfort and reassure her, Joy and Sadness work the console together, creating a new core memory that is both happy and sad, and a new island forms, representing Riley's acceptance of her life in San Francisco. One year later, a 12-year old Riley has adapted to her new home, made new friends, and acquired new hobbies. Inside Headquarters, Riley's emotions admire her new personality islands, powered by core memories that contain a mixture of emotions, and are given an expanded console that has enough room for them to work as a team. Although they admit slight concern over a large red alarm marked puberty, they forget about it.",
	"links": [
		"https://www.amazon.com/Inside-Out-3D-Amy-Poehler/dp/B07P6H43BT"
	]
}