{
	"title": "Guardians of the Galaxy",
	"release_year": "2014",
	"runtime": "121",
	"tags": [
		"Action",
		"Adventure",
		"Comedy",
		"amazon"
	],
	"rating": 8.0,
	"actors": [
		"Chris Pratt",
		"Vin Diesel",
		"Bradley Cooper",
		"Zoe Saldana",
		"Dave Bautista",
		"Lee Pace",
		"Michael Rooker",
		"Karen Gillan",
		"Djimon Hounsou",
		"John C. Reilly"
	],
	"staff": [
		"James Gunn",
		"James Gunn",
		"Nicole Perlman",
		"Dan Abnett",
		"Andy Lanning",
		"Kevin Feige",
		"Tyler Bates",
		"Ben Davis",
		"Fred Raskin",
		"Hughes Winborne",
		"Craig Wood",
		"Sarah Finn",
		"Charles Wood"
	],
	"votes": 1288326,
	"cover": "https://m.media-amazon.com/images/M/MV5BM2ZmNjQ2MzAtNDlhNi00MmQyLWJhZDMtNmJiMjFlOWY4MzcxXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1988, following his mother's (Laura Haddock) death (who left him a present just before she died from a long illness), a young Peter Quill (Chris Patt) run outside the hospital in grief. As he lays crying, Peter is abducted from Earth by the Ravagers, a group of space pirates led by Yondu Udonta. Yondu was supposed to deliver Peter for bounty but ends up raising him and has a soft spot for him.Twenty-six years later on the planet Morag, Quill steals an orb, after which he is intercepted by Korath (Djimon Hounsou), a subordinate to the fanatical Kree, Ronan (Lee Pace). Quill is shown to be listening to old Earth songs on his portal cassette player, which conducting his heists. Peter considers himself to a legendary outlaw by the nickname Star Lord.\nAlthough Quill escapes with the Orb, Yondu (Michael Rooker) discovers his theft and issues a bounty for his capture (Yondu was under contract for the Orb, but Quill reached Morag earlier and stole it). Yondu has a whistle-controlled arrow as a weapon that he uses to devastating effect.Ronan sends the assassin Gamora (Zoe Saldana) after the orb. Assassins Gamora and Nebula are sisters, and adoptive daughters of Thanos. Asked by Thanos, both work for Ronan and have a jealous rivalry. Gamora snatches the orb assignment from Nebula after convincing Ronan that he is making a mistake.The Kree empire is on the verge of an historic peace treaty with the Nova Empire (& its capital Xandar) and Ronan (who also commands the Kree warship, the Dark Aster) will stop at nothing to prevent that from happening. Ronan wants to avenge the death of his father & forefathers in the 1000 years of war with the Xandarians.\nRonan continues to attack Xandarian outposts throughout the Galaxy, and the Kree refuses to restrain him. Irani Rael (Glenn Close) is the head of Nova Corps, known as Nova Prime.When Quill attempts to sell the orb on the Nova Empire capital world, Xandar, Gamora ambushes him and steals it. A fight ensues, drawing in a pair of bounty hunters looking for Quill: the genetically engineered raccoon Rocket (Bradley Cooper), and the tree-like humanoid Groot (Vin Diesel).\nThe Nova Corps arrives and arrests all four, imprisoning them in the Kyln. While there, a powerful inmate, Drax (Dave Bautista), attempts to kill Gamora due to her association with Ronan, who killed his family. Quill convinces Drax that Gamora can bring Ronan to him. Gamora reveals that she has betrayed Ronan, unwilling to let him use the orb's power to destroy planets, starting with Xandar. Learning that Gamora has a buyer for the orb, she, Quill, Rocket, Groot, and Drax work together to escape from the Kyln.\nWorking together, the group defeats Kyln's security apparatus and gain access to Quill's ship in the hangar. Quill goes back into the prison to get back his cassette player, which had been confiscated by a guard, before returning to the ship to escape.Elsewhere, Ronan meets with Gamora's adoptive father, Thanos (Josh Brolin), to discuss her betrayal. Thanos had recently lent Gamora & her sister Nebula (Karen Gillan) to Ronan to help acquire the orb. In return Thanos had promised to destroy Xandar.Accompanied by Drax, Quill's group escapes the Kyln in his ship - the Milano - and flee to Knowhere, a remote criminal outpost in space built in the giant severed-head of a Celestial. A drunken Drax summons Ronan while the rest of the group meet Gamora's contact, the collector Taneleer Tivan (Benicio Del Toro).\nTivan opens the orb, revealing an Infinity Stone, an item of immeasurable power that destroys all but the most powerful beings who wield it. The ones who can control the power of the stone have the power to destroy entire civilizations. Suddenly, Tivan's tormented assistant grabs the Stone, triggering an explosion that engulfs Tivan's archive. Gamora suggests taking the Orb to Nova Corps in a hope that they might be able to contain its power.Ronan arrives and easily defeats Drax, while the others flee by ship, pursued by Ronan's followers and Gamora's sister Nebula. Nebula destroys Gamora's ship, leaving her floating in space, and Ronan's forces capture the orb.\nQuill contacts Yondu before following Gamora into space, giving her his helmet to survive; Yondu arrives and retrieves the pair. Rocket, Drax, and Groot threaten to attack Yondu's ship to rescue them, but Quill negotiates a truce by convincing Yondu that they can recover the orb from Ronan & sell for a very large profit.Quill's group agrees that facing Ronan means certain death, but that they cannot let him use the Infinity Stone to destroy the galaxy. On Ronan's flagship, the Dark Aster, Ronan embeds the Stone in his Warhammer, taking its power for himself. He contacts Thanos, threatening to kill him after the destruction of Xandar; hateful of her adopted father, Nebula allies with Ronan. Quill alerts the Nova Corps & asks for their help to stop Ronan.Near Xandar, the Dark Aster is confronted by the Ravagers, the Nova Corps, and Quill's group, which breaches the Dark Aster. Ronan uses his empowered Warhammer to destroy the Nova Corps fleet. On the Dark Aster, after Gamora defeats Nebula (who escapes), she unlocks Ronan's chambers, but the group finds themselves outmatched by his power until Rocket crashes the Milano through the Dark Aster and into Ronan. The damaged Dark Aster crash-lands on Xandar, with Groot sacrificing himself to shield the group. Ronan emerges from the wreck and prepares to destroy Xandar, but Quill distracts him, allowing Drax and Rocket to destroy Ronan's Warhammer. Quill grabs the freed Stone, and with Gamora, Drax, and Rocket sharing its burden, they use it to destroy Ronan.In the aftermath, Quill tricks Yondu into taking a container supposedly containing the Stone, then gives the real Stone to the Nova Corps. As the Ravagers leave Xandar, Yondu remarks that it turned out well that they did not deliver Quill to his father per their contract. Quill's group, now known as the Guardians of the Galaxy, have their criminal records expunged, and Quill learns that he is only half-human, his father being part of an ancient, unknown species. Quill finally opens the last present he received from his mother: a cassette tape filled with her favorite songs.The Guardians leave in the rebuilt Milano along with a sapling cut from Groot.\nIn a post-credits scene, Tivan sits in his destroyed archive with two of his living exhibits: a canine cosmonaut and an anthropomorphic duck.",
	"links": [
		"https://www.amazon.com/Guardians-Galaxy-Vol-Chris-Pratt/dp/B0B6QTP755"
	]
}