{
	"title": "Rocketman",
	"release_year": "2019",
	"runtime": "121",
	"tags": [
		"Biography",
		"Drama",
		"Music",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"Taron Egerton",
		"Jamie Bell",
		"Richard Madden",
		"Bryce Dallas Howard",
		"Gemma Jones",
		"Steven Mackintosh",
		"Tom Bennett",
		"Matthew Illesley",
		"Kit Connor",
		"Charlie Rowe"
	],
	"staff": [
		"Dexter Fletcher",
		"Lee Hall",
		"Adam Bohling",
		"David Furnish",
		"David Reid",
		"Matthew Vaughn",
		"Matthew Margeson",
		"George Richmond",
		"Chris Dickens",
		"Pippa Ailion",
		"Jo Hawes",
		"Reg Poerscout-Edgerton",
		"Peter Francis",
		"Marcus Rowland"
	],
	"votes": 198182,
	"cover": "https://m.media-amazon.com/images/M/MV5BNDNmM2U1MDAtNmE3NS00ZWVjLWFiZDktZTkwZjY5YWU2ZjZkXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "Dressed in a flamboyant devil's outfit, Elton John (Taron Egerton) enters an addiction rehabilitation session, and begins to recount his life in a flashback (The B**ch Is Back).\nYoung Elton (born Reginald Dwight) grows up in 1950s England, raised by his cold, non-affectionate mother Sheila (Bryce Dallas Howard) and more loving grandmother Ivy (Gemma Jones). His father Stanley (Steven Mackintosh) is mostly absent from the home due to service in the Royal Air Force. Reginald shows interest in playing the piano and displays the ability to \"play by ear\" - instantly playing music perfectly on the piano after listening to it once. He hopes to perform for his father on his return, but Stanley takes no interest in his son or his talent for music (I Want Love).Reginald then begins formal training with Ivy's support, eventually leading to study at the Royal Academy of Music.\nStanley eventually abandons his family after Sheila has an affair with another man. Later, Reginald develops an interest in rock music artists such as Elvis Presley and begins performing in local pubs (Saturday Night's Alright). An adult Reginald then joins the band Bluesology.\nOne night, Bluesology is hired to play backup for a touring American soul band. One of the singers suggests that if Reginald wants to become famous, he must write some songs, change his name, put his old life behind him and start anew. This inspires Reginald to change his name to Elton John.Elton begins writing music and tries to find success with Dick James' (Stephen Graham) record label DJM Records under the management of Ray Williams (Charlie Rowe). Williams introduces Elton to songwriter Bernie Taupin (Jamie Bell) and the two quickly form a friendship (Border Song). Elton's former partners in the soul band out him as homosexual, but Bernie is disinterested in his partner's sexuality, and they move into a flat together to work on their songs. This tenancy ends abruptly after Elton ends his romantic relationship with their landlady.Elton and Bernie return to Elton's family home to continue writing and create \"Your Song.\" James is impressed by the song and sets up a performance for them at the Troubadour in Los Angeles.\nElton is nervous before his debut at the Troubador, but the audience eagerly embrace his performance (Crocodile Rock). Elton is overjoyed by his success but feels lonely and abandoned at an after-party at Mama Cass's home in the Hollywood Hills when Bernie leaves him to spend time with a woman (Tiny Dancer). He is approached by John Reid (Richard Madden), a music manager attracted to Elton. The two sleep together and reunite later (Take Me to the Pilot).\nReid's influence over Elton results in a downward spiral into a life of debauchery even as his career rises to new heights. Elton becomes one of the most successful musicians of the 1970s, with a flamboyant, over-the-top stage persona (Honky Cat).After Elton appoints him as his new manager, Reid's manipulation and control increases into abuse. Reid insists he come out as gay to his parents so they can help hide their sexual relationship from the press. Elton reconnects with Stanley, who is now remarried with two other sons. Stanley still displays no interest in Elton but is demonstrative and affectionate with his new family. Unhappy and hurt by this encounter, Elton storms away from Reid, calls his mother on a payphone, and tells her he is gay. Sheila bluntly informs him that she already knew, does not care, and ends the call by telling him he will be forever alone. Still more upset by his mother's reply, Elton turns to Reid for comfort. Reid responds by striking him and orders him to focus on his sold-out concert tour.Struggling with parental issues as well as Reid's increasing physical and emotional abuse, Elton becomes addicted to alcohol, cocaine, cannabis, shopping, and sex.\nLonely and grieving, Elton consumes large amounts of drugs and alcohol, and his short temper alienates the friends who do care for him (Pinball Wizard). He catches Reid cheating on him with another man and breaks off their relationship, but Reid retorts that he does not care as long as Elton continues to make money for him. Later that day during a house party, Elton binges on drugs and alcohol, and attempts suicide by jumping into his pool. He is rushed to the hospital, then thrust onstage at Dodger Stadium to perform. (Rocket Man).Elton has a short-lived marriage with a close female friend, but this relationship is doomed by his homosexuality. (Don't Let the Sun Go Down on Me). He falls out with his mother (Sorry Seems to Be the Hardest Word) and Bernie.\nInfuriated, agitated, and depressed, Elton's dependence on prescription pills and alcohol result in a heart attack. He is again rushed to the hospital, but Reid shrugs it off as a mild chest infection and forces Elton back onstage for his next performance. Realizing that his life is spiraling out of control, Elton leaves Madison Square Garden before the concert and seeks help (Goodbye Yellow Brick Road). He enters rehabilitation and realizes he no longer needs anything from his parents or Reid. Elton rekindles his friendship with Bernie, who brings him new song lyrics to try and help him back in action. At first, Elton is worried that he cannot perform or compose without alcohol or drugs as a crutch, but Bernie has confidence in him. Elton writes \"I'm Still Standing\" and returns to a successful career.The film's ending subtitles inform viewers that Elton has been sober for over 28 years. He remains good friends with Bernie, and is now married to David Furnish, with whom he has two children.",
	"links": [
		"https://www.amazon.com/Rocketman-Taron-Egerton/dp/B07S6Q1ML7"
	]
}