{
	"title": "American Sniper",
	"release_year": "2014",
	"runtime": "133",
	"tags": [
		"Action",
		"Biography",
		"Drama",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"Bradley Cooper",
		"Sienna Miller",
		"Kyle Gallner",
		"Cole Konis",
		"Ben Reed",
		"Elise Robertson",
		"Luke Sunshine",
		"Troy Vincent",
		"Brandon Salgado Telis",
		"Keir O'Donnell"
	],
	"staff": [
		"Clint Eastwood",
		"Jason Hall",
		"Chris Kyle",
		"Scott McEwen",
		"Jim DeFelice",
		"Bradley Cooper",
		"Clint Eastwood",
		"Andrew Lazar",
		"Robert Lorenz",
		"Tom Stern",
		"Joel Cox",
		"Gary Roach",
		"Geoffrey Miclat",
		"Charisse Cardenas",
		"James J. Murakami"
	],
	"votes": 536823,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTkxNzI3ODI4Nl5BMl5BanBnXkFtZTgwMjkwMjY4MjE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Growing up in Texas, Chris Kyle's (Bradley Cooper) father Wayne (Ben Reed) teaches him how to hunt deer and shoot a rifle. Wayne teaches Kyle to never leave his rifle in the dirt and encourages him to always stand up and protect the rights of those who cannot protect themselves from the bullies.\nYears later, Kyle is a rodeo cowboy and returns home early, to find his girlfriend in bed with another man. After telling her to leave, he is mulling it over with his brother Jeff (Keir O'Donnell), when he sees news coverage of the 1998 U.S. embassy bombings and enlists in the U.S. Navy, where he is eventually accepted for SEAL (Sea, Air and Land) training at the age of 30, becoming a U.S. Navy SEAL sniper. Kyle is driven by a deep sense of patriotism and believes that it is his duty to protect the country, which he believes is the greatest country on the planet.Kyle meets Taya Studebaker (Sienna Miller) at a bar. Tanya initially dislikes Kyle as she doesn't like any military types and specifically believes that SEALs are self-centered and arrogant. But Kyle manages to win her over with his charm and good manners. They begin dating more regularly as Kyle continues his Sniper school training.\nEventually they marry, and he is sent to Iraq after the September 11 attacks of 2001. Kyle reassures Taya that the tour will only last for 6 weeks.His first kills are of a woman and boy who attacked U.S. Marines on patrol with a Russian made RKG-3 anti-tank grenade. Kyle is extremely observant and is able to identify threats to the US Marine convoys that he is assigned to provide sniper cover for. Kyle is paired with US Marine Goat-Winston (Kyle Gallner) for his protection.\nKyle is visibly upset by the experience but earns the nickname \"Legend\" for his many kills. In every case, Kyle's quick and accurate decision-making saves lives of several Marines.\nIraqis have a sniper named \"Mustafa\" (a Syrian shooter who had participated in the Olympics) who has been taking out American targets from 500 yards out.Taya is pregnant with Kyle's first child and does not appreciate that Kyle is not there with the family and is very worried looking at the statistics of US armed forces personnel killed in Iraq. Kyle learns from Taya that Jeff also got deployed to Iraq.Kyle is assigned to hunt for Abu Musab Al-Zarqawi. Zarqawi leads an army of 5000 militants and is waging the largest urban assault against the US, since Vietnam. The strategy is to search for Zarqawi and his commanders door to door. The forces have a target to clear 10 structures an hour. Kyle is tired of seeing badly trained Marines being killed on the streets and joins them on the ground.\nDuring house-to-house searches in evacuated areas, Kyle interrogates a family and for $100,000 the father offers to lead the SEALs to \"The Butcher\" (Mido Hamada), second-in-command to Al-Zarqawi, and who's favorite torture device is a drill.\nThe plan goes awry when The Butcher captures the father Sheikh Al-Obodi (Navid Negahban) and son Omar, and they are both killed while Kyle is pinned down by a sniper using an SVD Dragunov sniper rifle. Meanwhile, the insurgents issue a bounty on Kyle.Kyle returns home to his wife and the birth of his son. He is distracted by memories of his war experiences and argues with Taya over bootleg footage of U.S. Marines shot dead by enemy sniper \"savages\". Taya expresses her concern for them as a couple and wishes Kyle would focus on his home and family.Kyle leaves for a second tour, promoted to chief petty officer. Kyle is involved in a shoot-out with The Butcher who is located operating out of a ground floor restaurant.\nKyle returns home from his second tour to a newborn daughter, and he is increasingly distant from his family. On his third tour, a unit member Ryan \"Biggles\" Job (Jake McDorman) is seriously injured by the Dragunov sniper, and the unit is evacuated back to base.\nThe unit decides to return to the field and continue the mission. Another SEAL Marc Lee (Luke Grimes) is killed by gunfire, compelling Kyle with guilt and duty to undertake a fourth tour. Taya doesn't understand his decision, tells him she needs him, and for a moment, implies that they should stay apart.On tour four the expert insurgent sniper who uses the SVD Dragunov sniper rifle is identified as \"Mustafa\" (Sammy Sheik), and Kyle is assigned to take him out. Mustafa has been sniping U.S. Army combat engineers building a barricade. Kyles sniper team is placed on a rooftop inside enemy territory.\nKyle spots Mustafa takes him out with a risky long distance shot at 2100 yards (adding his name to the Longest recorded sniper kills list) and exposes his team position to a large number of armed insurgents. In the middle of the firefight and low on ammunition, Kyle calls Taya and tells her he is ready to come home. A sandstorm provides cover for their chaotic escape in which Kyle is injured and almost left behind.Kyle returns home, on edge and unable to adjust fully to civilian life. He tells a Veterans Affairs psychiatrist he is \"haunted by all the guys he couldn't save\". The psychiatrist encourages him to help wounded veterans in the VA hospital. Kyle meets veterans who suffered severe injuries, coaches them at a shooting range in the woods, and gradually begins to adjust to home life.Years later, on February 2, 2013, Kyle, playful and happy, says goodbye to his wife and family as he leaves to spend time with a veteran Eddie Ray Routh at a shooting range. On-screen subtitles reveal: \"Kyle was killed that day by a veteran he was trying to help,\" followed by stock footage of thousands of people standing in line along the highway for his funeral procession. Thousands more are shown attending Cowboys Stadium for his memorial service.",
	"links": [
		"https://www.amazon.com/American-Sniper-Bradley-Cooper/dp/B00RFHVCFI"
	]
}