{
	"title": "Hacksaw Ridge",
	"release_year": "2016",
	"runtime": "139",
	"tags": [
		"Biography",
		"Drama",
		"History",
		"amazon"
	],
	"rating": 8.1,
	"actors": [
		"Andrew Garfield",
		"Sam Worthington",
		"Luke Bracey",
		"Teresa Palmer",
		"Richard Pyros",
		"Jacob Warner",
		"Milo Gibson",
		"Darcy Bryce",
		"Roman Guerriero",
		"James Lugton"
	],
	"staff": [
		"Mel Gibson",
		"Robert Schenkkan",
		"Andrew Knight",
		"Terry Benedict",
		"Paul Currie",
		"Bruce Davey",
		"William D. Johnson",
		"Rupert Gregson-Williams",
		"Simon Duggan",
		"John Gilbert",
		"Nikki Barrett",
		"Barry Robison"
	],
	"votes": 609120,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjQ1NjM3MTUxNV5BMl5BanBnXkFtZTgwMDc5MTY5OTE@._V1_QL75_UX190_CR0,6,190,281_.jpg",
	"description": "While growing up near Lynchburg, Virginia in 1929, a young Desmond Doss (Andrew Garfield) nearly kills his younger brother Hal. Doss and Hal were fighting, and Doss hit Hal with a metal bar on his head. Hal stopped breathing for a few seconds and was revived by their father.\nThis experience and his Seventh-day Adventist upbringing reinforce Desmond's belief in the commandment: Thou shalt not kill. The brothers are adventurous and brave, while their father Tom talks to the graves of his dead WWI buddies every day and tells them about the events in their community. Tom is married to Bertha and is very abusive and violent towards her.15 Years later, Doss takes a man injured by a car to the hospital and meets a nurse, Dorothy Schutte (Teresa Palmer). Doss had saved the man's life by making a tourniquet out of his belt, which stopped the profuse bleeding from the man's severed artery in the thighs.\nDoss keeps going back to the hospital to meet Dorothy and eventually musters the courage to ask her out. They enter into a relationship (Doss is head over heels in love with Dorothy and cannot take his eyes off her) and Doss tells her of his desire to do medical work. He was inspired when the doctor told him that he saved the man's life, and Doss felt good about it.At the outbreak of World War II, Doss is motivated to enlist in the Army. Hal has already enlisted in the army and argues that the army protects families back home, so it does not count as killing. His father Tom (Hugo Weaving), a troubled World War I veteran, is deeply upset by the decision. Tom displays symptoms of PTSD due to his memories of the death of his friends on the battlefield. Tom is adamant that there is no way that a thinker like Doss will survive the war.\nBecause he is a conscientious objector, Doss intends to serve as a combat medic. Before leaving for Fort Jackson, South Carolina, he asks for Dorothy's hand in marriage, and she accepts. Dorothy gives Doss her copy of the Bible and asks him to keep it close to his heart.Doss is placed under the command of Sergeant Howell (Vince Vaughn) at Fort Jackson. He excels physically but becomes an outcast among his fellow soldiers for refusing to handle a rifle and train on Saturdays. Other soldiers include \"Grease\" Nolan (Ben Mingay), \"Tex\" Lewis (Michael Sheasby), Vito Rinnelli (Firass Dirani), Milt 'Hollywood' Zane (Luke Pegler), Smitty Ryker, Ralph Morgan (Damien Thomlinson), \"Lucky\" Ford (Milo Gibson), Randall 'Teach' Fuller (Richard Pyros), Corporal Jessop (Ben O'Toole) and Andy 'Ghoul' Walker (Goran D. Kleut).During basic training, Doss refuses to carry firearms and says that he was never meant to be sent to a rifle company and he has volunteered for the medical corps. Captain Glover refuses to transfer Doss even thought he wont kill anyone, or work on Saturdays. Colonel Stelzer (Richard Roxburgh) orders that Doss can serve as a medic if he completes all other areas of his basic training.\nHowell and Captain Glover (Sam Worthington) attempt to discharge Doss for psychiatric reasons but fails. The camp doctor reports that Doss has unique religious views, but this does not qualify for a section 8 discharge.\nHowell then torments Doss by putting him through grueling labor, intending to get Doss to leave of his own accord. Howell tells the rest of the company about Doss's special requirements and tells them that they should not depend on Doss to save their lives in battle. Howell believes that Doss's beliefs will cost American lives.\nSmitty confronts Doss in the barracks and calls him a coward. Despite being beaten one night by his fellow soldiers; he refuses to identify his attackers and continues training.They complete basic training and are released on leave, during which Doss intends to marry Dorothy, but his refusal to carry a firearm leads to an arrest for insubordination by his company commander Lieutenant Colonel Cooney (Matt Nable). As a results, Doss misses his wedding to Dorothy.\nDorothy visits Doss in jail and tries to convince him to plead guilty so that he can be released without charge but Doss refuses to compromise his beliefs. At his trial, Doss pleads not guilty but before he is sentenced, his father barges into the tribunal with a letter from a former commanding officer (Brigadier General Musgrove) stating that his son's pacifism is protected by an Act of Congress. The charges against Doss are dropped, and he and Dorothy are married.\nDoss is given permission to head into a field of battle without a single weapon to protect himself or others.In May 1945, Doss' unit is assigned to the 77th Infantry Division and deployed to the Pacific theater. During the Battle of Okinawa, Doss' unit is informed that they are to relieve the 96th Infantry Division, which was tasked with ascending and securing the Maeda Escarpment (\"Hacksaw Ridge\"). The 96th tried to take Hacksaw ridge 6 times and were thrown back all times. Nothing was left of the 96th after the 6th attempt.\nIn the initial fight, both sides sustain heavy losses. Hacksaw Ridge is on top of a cliff. The naval batteries bombard the ridge before the army starts climbing. The enemy is well protected in bunkers and not impacted by the shelling. As soon as the army reaches the Ridge, they are hit by heavy machine gun fires and grenades. The army men are slaughtered. The unit gathers itself and starts to fight back one foot at a time. The Japanese suffered high losses as well.\nAfter a brutal fight, 2 enemy bunkers are destroyed, and the US forces have a foothold on the Ridge. The Japanese fight to the last man and no one surrenders.Meanwhile, Doss successfully saves several soldiers, including those with severe injuries. The Americans Bivouac for the night and Doss spends the night in a foxhole with Smitty (Luke Bracey), a squad mate who was the first to call Doss a coward. Doss reveals that his aversion to holding a firearm stems from nearly shooting his drunken father, who threatened his mother Bertha (Rachel Griffiths) with a gun. Smitty apologizes for doubting his courage and the two make amends.The next morning, the Japanese launch a massive counterattack and drive the Americans off the escarpment. Smitty is killed and many Americans, including Howell and several of Doss' squad mates, are injured and left on the battlefield. Doss hears the cries of the dying soldiers and decides to run back into the carnage. He starts carrying wounded soldiers to the cliff's edge and rappelling them down by rope, each time praying to save one more. The arrival of dozens of wounded once presumed dead comes as a shock to the rest of the unit below. Doss survives by discovering the network of Japanese tunnels.\nWhen day breaks, Doss rescues Howell and the two finally escape Hacksaw under enemy fire.Captain Glover tells Doss that the men have been inspired by his miraculous efforts, and that they will not launch the next attack without him. Despite the next day being Doss' Sabbath day, he joins his fellow soldiers after finishing his prayers. With reinforcements, they turn the tide of battle. During an ambush set by Japanese soldiers feigning surrender, Doss manages to save Glover and others by knocking away enemy grenades. Doss is eventually wounded by a grenade blast, but the battle is won. Doss descends the cliff, clutching the Bible Dorothy gave him.After rescuing 75 soldiers at Hacksaw Ridge, Doss is awarded the Medal of Honor by President Harry S. Truman. Doss stayed married to Dorothy until her death in 1991. He died on March 23, 2006, at the age of 87.",
	"links": [
		"https://www.amazon.com/Hacksaw-Ridge-Andrew-Garfield/dp/B01M3U7GJH"
	]
}