{
	"title": "Saving Mr. Banks",
	"release_year": "2013",
	"runtime": "125",
	"tags": [
		"Biography",
		"Comedy",
		"Drama",
		"amazon"
	],
	"rating": 7.5,
	"actors": [
		"Emma Thompson",
		"Tom Hanks",
		"Annie Rose Buckley",
		"Colin Farrell",
		"Ruth Wilson",
		"Paul Giamatti",
		"Bradley Whitford",
		"B.J. Novak",
		"Jason Schwartzman",
		"Lily Bigham"
	],
	"staff": [
		"John Lee Hancock",
		"Kelly Marcel",
		"Sue Smith",
		"Ian Collie",
		"Alison Owen",
		"Philip Steuer",
		"Thomas Newman",
		"John Schwartzman",
		"Mark Livolsi",
		"Ronna Kress",
		"Michael Corenblith"
	],
	"votes": 171132,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTc0MTQ3NzE4Nl5BMl5BanBnXkFtZTcwMzA4NDM5OQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In London in 1961, financially struggling author Pamela \"P. L.\" Travers (Emma Thompson) reluctantly agrees to travel to Los Angeles to meet with Walt Disney (Tom Hanks) at the urging of her agent Diarmuid Russell (Ronan Vibert). Disney has been courting Travers for 20 years, seeking to acquire the film rights to her Mary Poppins stories, on account of his daughters' request to make a film based on the character. Travers, however, has been extremely hesitant toward letting Disney adapt her creation to the screen because he is known primarily as a producer of animated films, which Travers openly disdains.Her youth in Allora, Queensland in 1906 is depicted through flashbacks, and is shown to be the inspiration for much of Mary Poppins. Travers was very close to her handsome and charismatic father Travers Robert Goff (Colin Farrell), who fought a losing battle against alcoholism.Upon her arrival in Los Angeles, Travers is disgusted by what she feels is the city's unreality, as well as by the naive optimism and intrusive friendliness of its inhabitants, personified by her assigned limo driver, Ralph (Paul Giamatti).\nAt the Walt Disney Studios in Burbank, Travers begins collaborating with the creative team assigned to develop Mary Poppins for the screen, screenwriter Don DaGradi (Bradley Whitford), and music composers Richard and Robert Sherman (Jason Schwartzman and B.J. Novak respectively). She finds their presumptions and casual manners as highly improper, a view she also reciprocates on the jocular Disney upon meeting him in person.Travers' working relationship with the creative team is difficult from the outset, with her insistence that Mary Poppins is the enemy of sentiment and whimsy. Disney and his associates are puzzled by Travers' disdain for fantasy, given the fantastical nature of the Mary Poppins story, as well as Travers' own richly imaginative childhood existence. Travers has particular trouble with the team's depiction of George Banks. Travers describes Banks' characterization as completely off-base and leaves a session distraught. The team begins to grasp how deeply personal the Mary Poppins stories are to Travers, and how many of the work's characters are directly inspired by Travers' own past.For ex Mr Bank's character is based on Traver's own father, who was an alcoholic & a manager at a Bank in Australia. Traver's father was not very successful at his job due to his drinking problem & is often ridiculed by his boss in front of his daughters & the public. Traver's father tries very hard, but is eventually diagnosed with liver trouble due to his drinking. Disney's creative team, going through her books, interprets Bank's character as a cruel banker, who is out to scam people. This does not go down well with Travers.In fact, the character Mary Poppins is also loosely based on the nanny that her parents hired when Travers's father was diagnosed with problems. The new nanny is a stickler to discipline & promises to fix everything. Even then, shortly thereafter, Travers's dad dies & she blames the nanny as she had \"promised to fix everything\".Travers' collaboration with the team continues, although she is increasingly disengaged as painful memories from her past numb her in the present. Seeking to find out what's troubling her, Disney invites Travers to Disneyland, which-along with her progressive friendship with Ralph, the creative team's revisions to George Banks, and the insertion of a new song to close the film-help to soften Travers. Her imagination begins to reawaken, and she engages enthusiastically with the creative team.This progress is upended, however, when Travers discovers that an animation sequence is being planned for the film, a decision that she has been adamantly against of accepting. She confronts and denounces a protesting Disney, angrily declaring that she will not sign over the film rights and returns to London. Disney discovers that Travers is writing under a pen name; her real name being Helen Goff. Equipped with new insight, he departs for London, determined to salvage the film. Appearing unexpectedly at Travers' residence, Disney opens up-describing his own less-than-ideal childhood, while stressing the healing value of his art-and urges her to shed her deeply-rooted disappointment with the world. Travers relents and grants him the film rights.Three years later, in 1964, Mary Poppins is nearing its world premiere at Grauman's Chinese Theatre. Travers has not been invited because Disney fears that she will give the film negative publicity. Goaded by her agent, Travers returns to Los Angeles, showing up uninvited in Disney's office, and finagles an invitation to the premiere. She watches Mary Poppins initially with scorn, reacting with particular dismay to the animated sequence. She slowly warms to the film, however, and is ultimately surprised to find herself overcome by emotion, touched by the depiction of George Banks' redemption, which clearly possesses a powerful personal significance for her.\nDuring the end credits, a surviving recording of one of the actual sessions between Travers, the Sherman Brothers and DaGradi plays out.",
	"links": [
		"https://www.amazon.com/Saving-Mr-Banks-Emma-Thompson/dp/B00IK6GX9S"
	]
}