{
	"title": "Horrible Bosses 2",
	"release_year": "2014",
	"runtime": "108",
	"tags": [
		"Comedy",
		"Crime",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Jason Bateman",
		"Jason Sudeikis",
		"Charlie Day",
		"Jennifer Aniston",
		"Kevin Spacey",
		"Jamie Foxx",
		"Chris Pine",
		"Christoph Waltz",
		"Jonathan Banks",
		"Lindsay Sloane"
	],
	"staff": [
		"Sean Anders",
		"Sean Anders",
		"John Morris",
		"Jonathan Goldstein",
		"John Francis Daley",
		"Chris Bender",
		"John Morris",
		"Brett Ratner",
		"John Rickard",
		"Christopher Lennertz",
		"Julio Macat",
		"Eric Kissack",
		"Rocio Aquino",
		"Rachel Tenner",
		"Clayton Hartley"
	],
	"votes": 186509,
	"cover": "https://m.media-amazon.com/images/M/MV5BYmY4Mjg2NzQtN2I3Zi00NGZiLWJjNDYtMDA5MzJkYTIyZWQ0XkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "Nick Hendricks (Jason Bateman), Dale Arbus (Charlie Day), and Kurt Buckman (Jason Sudeikis) decide to start their own business after tiring of working for ungrateful bosses. Their idea is a car-wash-inspired shower head called the \"Shower Buddy\". They have trouble finding investors until they are approached by Burt Hanson (Christoph Waltz) and his son Rex (Chris Pine). Burt admires their commitment to manufacturing the product themselves, while Rex prefers to outsource to China, and agrees to invest if they can make 100,000 units. Taking out a business loan, the three rent a warehouse, hire employees, and manage to produce their output, but Burt backs out of their deal at the last minute, claiming that he never signed an agreement, and he plans on taking their inventory in foreclosure and selling them (renamed the \"Shower Pal\") himself, while leaving the three in $500,000 debt with their outstanding loan.Seeking financial advice, Nick, Dale, and Kurt visit Nick's old boss Dave Harken (Kevin Spacey) in prison, who says the three have no feasible legal options to recover their losses. The three then resolve to kidnap Rex and hold him for ransom. They seek the help of \"Motherf**ker\" Jones (Jamie Foxx), who says the best way to pull off kidnapping someone who knows them is to keep him unconscious for the duration of the kidnapping. The three create a ransom note of $500,000 and go to the office of Dale's old boss Dr. Julia Harris (Jennifer Aniston) to steal a tank of Nitrous oxide.While there, Kurt and Dale are almost caught by Julia's sex addiction group meeting; after the group leaves, Nick has sex with Julia, providing the distraction that allows Dale and Kurt to escape the building. The trio goes to Rex's house, but while they hide in the closet, Dale accidentally turns on the tank and pass out. When they wake up in the morning, they find Rex gone.When they arrive back at the warehouse, they find Rex tied up in the trunk of their car. Rex gets out and reveals he found them hiding in his closet but decides to stage his own kidnapping with them due to his strained relationship with his dad. Rex sent the ransom note to his dad and increased the ransom to $5 million. The three are uncertain of Rex's plan, but Rex threatens to go to the police if they are back out. They call Burt to inform him of Rex's kidnapping, after which Rex is confident that Burt will not involve the cops; however, the police, led by Detective Hatcher, subsequently arrive at their warehouse to question Nick, Dale, and Kurt due to their involvement with Burt. When the police leave, Rex breaks down knowing Burt cares more about his money than his son. Now sympathetic to Rex, the trio agrees to work with him in the fake kidnapping, and all four devise a plan to outsmart the police and take the ransom money, utilizing untraceable phones, a basement garage to block out any tracking signal, and Kurt disguising himself as Burt.While the plan is in motion, Nick, Dale, and Kurt find that Kurt left Burt his own phone instead of the untraceable one. They nevertheless call Burt on Kurt's phone to give him the instructions. Before they leave, Julia arrives at their hotel room and demands to sleep with Dale or else she will report them for breaking into her office. Unfortunately, Dale's wife Stacy then arrives via \"Find My Phone\" app and, believing Dale is cheating on her with Julia, storms off. Dale angrily locks Julia in the bathroom so the three can leave. In the basement garage, Nick, Dale, and Kurt, wearing masks, tell Burt to give back the cell phone. Burt is then killed by Rex, who reveals that, after seeing that his father did not care about him, he decided to kill Burt and frame Nick, Dale, and Kurt so Rex can inherit the family business. Rex forces Kurt to switch pants as Rex's pants have Burt's blood on them.As the trio are about to be cornered by the police, Jones arrives, as he anticipated that the three would be betrayed and killed and was seeking to claim the ransom money for himself. He attempts to help them get back to the warehouse where Rex is supposed to be tied up, with the police chasing them, before Rex does so they can prove their innocence. When they get back to the warehouse, Jones escapes with the money and the police arrive to find Rex tied up. Before the police arrest Nick, Dale, and Kurt, Kurt's phone rings in Rex's pocket, and the police recognize the ringtone as the same phone that was left to Burt by the kidnappers. Rex tries to claim the phone is his, but when Hatcher asks why Rex did not bother to call the police if he had a phone, Rex takes Hatcher hostage. Dale attempts to attack Rex, but Rex shoots him, which distracts Rex long enough for Hatcher to subdue him.A few days later, Dale wakes up to find out that the three did get in trouble, but because Dale helped save Hatcher's life, the police dropped the charges. He also finds out that Julia helped make amends with Stacy. In the aftermath, their business goes into foreclosure, but is subsequently purchased by Harken in prison, who allows the three of them to stay employed. Jones, meanwhile, uses the ransom money to invest in Pinkberry.",
	"links": [
		"https://www.amazon.com/Horrible-Bosses-2-Jason-Bateman/dp/B00S7HRCKY"
	]
}