{
	"title": "The Monuments Men",
	"release_year": "2014",
	"runtime": "118",
	"tags": [
		"Comedy",
		"Drama",
		"War",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"George Clooney",
		"Matt Damon",
		"Bill Murray",
		"Cate Blanchett",
		"John Goodman",
		"Jean Dujardin",
		"Hugh Bonneville",
		"Bob Balaban",
		"Dimitri Leonidas",
		"Justus von Dohnányi"
	],
	"staff": [
		"George Clooney",
		"George Clooney",
		"Grant Heslov",
		"Robert M. Edsel",
		"Bret Witter",
		"George Clooney",
		"Grant Heslov",
		"Alexandre Desplat",
		"Phedon Papamichael",
		"Stephen Mirrione",
		"Simone Bär",
		"Luise Eigner",
		"Jina Jay",
		"Jim Bissell"
	],
	"votes": 143425,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjMxMjk4NTM1M15BMl5BanBnXkFtZTgwNjg0MjQ3MDE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1943 during World War II, the Allies are making good progress driving back the Axis powers in Italy.\nThe Nazis are in full retreat and as they vacate towns, they steal the precious artwork from private collections and churches as war spoils. The priests' resort to removing their artwork from the walls and the window panels to hide them from the rampaging Nazis.However, Frank Stokes (George Clooney) persuades the US President Roosevelt that victory will have little meaning if the art treasures of Western civilization are lost in the fighting, either as collateral damage in combat or looted. Stokes makes a case that even the allied forces are guilty of bombing historical monuments in Europe, which represent the best historical achievements known to man. He makes the case that the Nazis have stolen the Ghent masterpiece, the defining monument of the Catholic Church.Stokes says that in the coming months armies of Allies and Russia will advance through some of the greatest cultural cities of Europe, in Italy, France and Poland. And yet there is no one to ensure that the Mona Lisa and the Statue of David survive the war.To minimize that threat, Stokes is directed to assemble an Army unit nicknamed the \"Monuments Men\" comprising seven museum directors, curators, and art historians to both guide Allied units and search for stolen art to return it to the rightful owners. In 1944, the team is ready and is deployed to Europe. The team includes Lieutenant James Granger, Architect Sergeant Richard Campbell, Sculptor Sergeant Walter Garfield, Director of Design at the Chalet School of Arts 2nd Lieutenant Jean-Claude Clermont, Private Preston Savitz and 2nd Lieutenant Donald Jeffries. The men are given basic weapons training before being sent to Europe.Stokes tells the team that Hitler is stealing the art from France for his Fuhrermuseum, but the museum is not ready yet. So, they are stealing the art and hiding it somewhere. Stokes believes that the art is being stored in the Eastern part of the German empire. In July 1944, the team lands on the empty beaches of Normandy.In occupied France, Claire Simone (Cate Blanchett), a curator in Paris, is forced to allow Nazi officers like Viktor Stahl (Justus Von Dohnanyi) to oversee the theft of art for either Adolf Hitler's proposed Fuhrermuseum in Linz, or as the personal property of senior commanders like Herman Goering.Simone is nearly arrested by Stahl for helping her Maquis brother (who is part of the French resistance) unsuccessfully recapture such items. Stahl informs her that her brother was shot trying to steal a truck with the stolen artwork going to Germany and suspects Simone for divulging the information.\nAll seems lost when she discovers that Stahl is taking all of her gallery's contents to Germany as the Allies approach Paris. When she runs to the rail-yard to confront Stahl, he fires on her with his pistol; although she does not seek cover, she is not hit but can only watch helplessly as Stahl escapes with the stolen artwork.As for Stokes' unit, it finds its work is frustrated by its own side's combat units which refuse to restrict their tactical options for the sake of preserving architecture, while James Granger (Matt Damon) finds that Simone will not cooperate with those whom she suspects are art looters themselves. Simone was arrested by the Allies for being a collaborator and was held in prison when Granger met her.\nOne of the US units find a dozen crates of stolen artwork, each with 12 paintings. Stokes team finds from the German captives that the artwork is headed to a town named Seigel.The unit splits up for various objectives with varying degrees of success. Donald Jeffries (Hugh Bonneville) of the British Army attempts to arrange the safety of a Belgian church with valuable artwork. He begs the British Army Colonel for an escort to the church and argues that the Germans will destroy Brugges as they did while they were retreating from Florence. The Colonel does not agree and says that the Germans have agreed to retreat from the town, and he does not want to jeopardize the agreement. Donald has to enter the town alone where he gets to the church and hides the Madonna sculpture with the help of the priests. He is killed attempting to prevent the Nazi Colonel Wegner (Holger Handtke) from stealing a statue of the Madonna and Child by Michelangelo.Richard Campbell (Bill Murray) and Preston Savitz (Bob Balaban) attempt to track down a stolen Belgian panel set of religious artworks (the Van Eyck altarpiece looted from Ghent cathedral. Ghent Altarpiece was removed by the priests of Ghent Cathedral for safekeeping, but their truck was stopped and the panels taken), and in doing so, find and arrest Viktor Stahl, hiding as a farmer, when they identify the paintings in his house as originals stolen from the Rothschild Collection.\nSavitz uncovers Stahl's loyalties by tricking his indoctrinated children into saluting Hitler when prompted with \"Heil Hitler\".Walter Garfield (John Goodman) and Jean Claude Clermont (Jean Dujardin) blunder into a Wehrmacht patrol and Clermont is mortally wounded. Meanwhile, Simone reconsiders when Granger shows her the Nero Decree to destroy all German possessions if Hitler dies or Germany falls, and when she sees Granger return a painting looted from a Hebrew family murdered in the death camps to its rightful place as a symbolic gesture. Realizing the Americans are serious in their intentions, she eventually provides a comprehensive ledger that provides valuable information to identify stolen art.\nThe team has 2 leads for the storage locations of the stolen art, the towns of Seigen and Merkers.Even as the team learns that the artwork is being stored in various salt mines and castles, it also learns that it must now compete against the Soviet Union which has units of its own seizing artwork as war reparations. The Russians lost 20 million people in the war and want their own pound of flesh from the Germans.\nMeanwhile, Colonel Wegner is systematically removing and destroying whole art collections as per orders. Eventually, the team has some success as it discovers at least one mine with over 16,000 art pieces as well as grotesque caches as barrels of gold teeth from victims of the death camps. In addition, it also discovers gold assets of the Nazi German national treasury, the capture of which effectively bankrupts the regime.Finally, the team finds a mine in Austria that seems destroyed and is in what should become part of the Soviet occupation zone. However, the team discovers that only the entrances were damaged by the locals in order to fool the Nazis and it manages to gain entry even as its fellows delay the oncoming Soviets. As a result, the team evacuates as much artwork as possible, including the sculpture Jeffries died defending, before the Soviets arrive.Finally, Stokes reports back to President Truman that the team has recovered vast quantities of artwork and various other culturally significant items. As he requests to stay in Europe to oversee further searching and restoration, Truman asks Stokes if his efforts were worth the lives of the men that he lost. Stokes firmly replies that they were.In 1977, the elderly Stokes (Nick Clooney) takes his grandson to see Michelangelo's Madonna sculpture, amid large crowds of youth appreciating the pieces of humanity's creativity that his men sacrificed so much to preserve in war.",
	"links": [
		"https://www.amazon.com/Monuments-Men-George-Clooney/dp/B00II399HG"
	]
}