{
	"title": "Dawn of the Planet of the Apes",
	"release_year": "2014",
	"runtime": "130",
	"tags": [
		"Action",
		"Adventure",
		"Drama",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Gary Oldman",
		"Keri Russell",
		"Andy Serkis",
		"Kodi Smit-McPhee",
		"Jason Clarke",
		"Toby Kebbell",
		"Kirk Acevedo",
		"Nick Thurston",
		"Terry Notary",
		"Karin Konoval"
	],
	"staff": [
		"Matt Reeves",
		"Mark Bomback",
		"Rick Jaffa",
		"Amanda Silver",
		"Peter Chernin",
		"Dylan Clark",
		"Rick Jaffa",
		"Amanda Silver",
		"Michael Giacchino",
		"Michael Seresin",
		"William Hoy",
		"Stan Salfas",
		"Debra Zane",
		"James Chinlund"
	],
	"links": [
		"https://www.amazon.com/Dawn-Planet-Apes-Andy-Serkis/dp/B00LP9EUTC"
	],
	"votes": 490345,
	"cover": "https://m.media-amazon.com/images/M/MV5BNWNjYzQ4ZGItZTg1My00NTM2LTg1NDUtYThjOTQwMTYyNjU1XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Ten years after the worldwide pandemic of the deadly ALZ-113 virus, human civilization is completely destroyed following martial law, civil unrest and the economic collapse of every country in the world. The virus was sourced to the Gen-Sys Laboratories in San Francisco. The virus was dubbed the Simian Flu and spread rapidly all over the world. The survival rate was 1 in 500. Due to the lack of skilled technicians, nuclear power plants went out of control and encountered a fuel meltdown.The apes, all bestowed with genetically enhanced intelligence by the virus, establish a colony in the Muir Woods National Monument near San Francisco, led by Caesar (Andy Serkis), along with his lieutenants Maurice (Karin Konoval), Rocket (Terry Notary), and Koba (Toby Kebbell). Caesar is unrelenting in his belief that every ape is better than a human. The apes have organized themselves into a society and conduct hunts for deer meat.\nCaesar's son Blue Eyes is resentful towards his father for not treating him like an adult. Caesar is overprotective of Blue Eyes and doesn't believe that he is ready to start acting independently.\nThe apes have established a \"city\" in the middle of the jungle and have heavily fortified it against potential attacks. Maurice and Caesar discuss that they have not seen any humans for 2 years now and believe that they have been eradicated from the planet.While walking through the forest, Caesar's son Blue Eyes (Nick Thurston) and his friend Ash (Doc Shaw) (Ash is Rocket's son) encounter a human named Carver (Kirk Acevedo), who panics and shoots Ash, wounding him.\nCarver calls for the rest of his small party of armed survivors, led by a man named Malcolm (Jason Clarke), while Blue Eyes calls for the other apes. Caesar orders the humans to leave, and this angers Rocket who wanted revenge for Ash.\nThe remaining humans in San Francisco, who are genetically immune to the virus, are living in a guarded tower within the ruined city. Malcolm reports the encounter to their leader Dreyfus.\nCaesar is against war as he knows that in a war the apes can lose everything they have built.Prompted by Koba, a scarred bonobo who holds a grudge against humans for his mistreatment, Caesar brings a large group of the apes to the city where he conveys the message that while the apes do not want war, they will fight to defend their home. He then demands that the humans stay in their territory and states the apes will stay in theirs too.\nDreyfus knows that the human colony is out of fuel. He had sent the expedition into the jungle to find and make a dam operational that would provide them with hydro-electric power. Dreyfus wants to fight the apes to get access to the dam, as it is a question of human survival and power is also their only means of connecting with other human survivors across the world.Malcolm convinces his fellow leader Dreyfus (Gary Oldman) to give him three days to reconcile with the apes to gain access to a hydroelectric dam in their territory, which could provide long-term power to the city. Dreyfus, distrustful of the apes, arms survivors using an abandoned armory. Malcolm then travels into the ape village, but is captured by gorilla guards, who bring him to Caesar. After a tense discussion, Caesar allows Malcolm to work on the dam's generator, provided they surrender their guns.\nCaesar reasons that the humans are desperate and if they are refused, they will attack, and many apes will be lost in the battle. Koba is against this policy and believes that the apes must attack while the humans are weak.\nAs Malcolm, his wife Ellie (Keri Russell) and son Alexander (Kodi Smit-McPhee) work, they bond with the apes.Mutual distrust of both sides gradually subsides; the truce is endangered when Carver threatens Caesar's sons with a concealed shotgun, but the two sides reconcile when Ellie offers to help treat Caesar's ill wife Cornelia (Judy Greer) with antibiotics. Meanwhile, Koba discovers the armory and confronts Caesar (who still refuses to attack the humans), questioning his allegiance and taunting him over his \"love\" for humans. In response, Caesar severely beats Koba, but at the last moment refrains from killing him; adhering to his philosophy that \"ape shall not kill ape\", Caesar hesitantly forgives Koba. The furious Koba then returns to the armory, where he steals an assault rifle and murders two human guards. Returning home, he secretly kills Carver, stealing his lighter and cap.The dam is eventually repaired, restoring power to the city. During the celebration, Koba sets fire to the apes' home, then, unseen to anyone else, shoots Caesar in the shoulder, causing him to fall from the settlement's main tree. In the panic of the loss of the alpha and the fire, Koba takes charge, and having planted Carver's cap at the scene of the shooting, orders the apes to war against the humans.Malcolm's group hides as Koba leads the apes into San Francisco. The apes plunder the armory and charge the tower's gates. Despite heavy casualties, the apes breach the gates using a hijacked Bradley Fighting Vehicle, overrun the tower and imprison all the humans as Dreyfus flees underground. When Ash refuses Koba's orders to kill unarmed humans, citing Caesar's teachings, Koba kills Ash and imprisons all those known to be loyal to Caesar.Malcolm's group finds Caesar barely alive and transport him to his former home in San Francisco. Caesar reveals to Malcolm that Koba shot him, realizing his notion that all apes were better than humans was naive. As he enters the city to find medical supplies for Caesar, Malcolm encounters Blue Eyes.Disenchanted with Koba's leadership, the young ape spares Malcolm's life and returns to the house with him, where he reconciles with his father. Caesar grows nostalgic watching video clips from his childhood on his former owner and father figure Will Rodman's old camcorder as Malcolm learns of Caesar's past. A plan is put into action: Blue Eyes returns to the tower and frees the caged humans and apes loyal to Caesar, then Malcolm leads the apes, unseen, into the tower from below.After accomplishing this, Malcolm encounters Dreyfus, who informs him that his men have made radio contact with more survivors at a military base to the north, who are on their way to help fight the apes. Caesar confronts Koba at the top of the tower, but as they battle, Malcolm fails to prevent Dreyfus from detonating C-4 underneath the tower. The resulting explosion kills Dreyfus and collapses part of the tower. Caesar overpowers Koba, with Koba hanging over the edge of the tower. Pleading for his life, Koba reminds Caesar that apes do not kill apes, but Caesar states that Koba is not an ape and lets him fall to his death.Malcolm informs Caesar of the impending arrival of human military reinforcements, and both lament the lost opportunity for peace. Caesar tells Malcolm that the humans will never forgive the apes for the war they started and advises him to leave with his family for safety as the two of them acknowledge their friendship. As Malcolm disappears into the shadows, Caesar stands before a kneeling mass of apes, awaiting the war to come."
}