{
	"title": "Long Shot",
	"release_year": "2019",
	"runtime": "125",
	"tags": [
		"Comedy",
		"Romance",
		"amazon"
	],
	"rating": 6.8,
	"actors": [
		"Charlize Theron",
		"Seth Rogen",
		"June Diane Raphael",
		"O'Shea Jackson Jr.",
		"Ravi Patel",
		"Bob Odenkirk",
		"Andy Serkis",
		"Randall Park",
		"Tristan D. Lalla",
		"Alexander Skarsgård"
	],
	"staff": [
		"Jonathan Levine",
		"Dan Sterling",
		"Liz Hannah",
		"A.J. Dix",
		"Evan Goldberg",
		"Beth Kono",
		"Seth Rogen",
		"Marco Beltrami",
		"Miles Hankins",
		"Yves Bélanger",
		"Melissa Bretherton",
		"Evan Henke",
		"Francine Maisler",
		"Kalina Ivanov"
	],
	"votes": 123361,
	"cover": "https://m.media-amazon.com/images/M/MV5BZjA1NzI3NjEtMmM5My00Y2RiLWE1MmMtMjYzZmIyNWFkMGQ1XkEyXkFqcGc@._V1_QL75_UY281_CR3,0,190,281_.jpg",
	"description": "In 2019, U.S. Secretary of State Charlotte Field (Charlize Theron) learns from President Chambers (Bob Odenkirk) that he does not plan on running for a second term. Chambers was a TV star before becoming President and now wants to transition into a career in the movies.\nSeeing an opportunity, she convinces him to endorse her as a potential presidential candidate. Charlotte is a Rhodes scholar and a Pulitzer winner. She is the youngest Secretary of State in US history. Charlotte works extremely hard and barely had any time for a personal life.Katherine (Lisa Kudrow) is the head of Field's polling team. Katherine asks Charlotte to hire a funny speech writer to get her scores up, and to pick an issue that people care about. Katherine also proposes a high-profile political hook-up (like dating the Canadian PM James Steward (Alexander Skarsgard)) for Charlotte to create a media buzz and more publicity.Meanwhile, New York City journalist Fred Flarsky (Seth Rogen) learns that the newspaper he works for has been bought by Parker Wembley (Andy Serkis), a wealthy media mogul whose ethics directly oppose Fred's. Fred is an undercover investigative journalist that specializes in producing stories that expose the lies of big media and exposes hate groups such as white supremacists, anti-Semitics and so on.\nSo, to be bought out by big media is ironic!! Furious, he promptly quits but cannot find another job.Depressed, he turns to his more successful best friend Lance (O'Shea Jackson Jr.), who takes him to a charity fund-raising event that Charlotte is also attending. She and Fred recognize each other, as she was his babysitter (She was 16, and he was 13 back then) and secret love interest when they were teenagers. While they catch up, Wembley interrupts them to plan a meeting with Charlotte, leading Fred to condemn Wembley's actions (Fred tells Wembley that he represents what is wrong with the USA) and beliefs before leaving.Upon reading some of Fred's columns, Charlotte decides to hire him to write her speeches over the protests of her manager Maggie (June Diane Raphael). Maggie says that Fred looks like a homeless hobo.\nCharlotte wants Fred to write her speech for her upcoming visit to King Gustav of the Swedish Royal family. Charlotte wants to use the visit to announce a comprehensive environmental deal with the world's 3 largest polluters, calling it the Global Rehabilitation Initiative. With this initiative as a springboard, she will announce her run for the Presidency. Despite voicing skepticism of her ethics, Fred takes the job. Fred is not sure if Charlotte's initiative is real, or just talk, as he believes that most environmental initiatives are watered down eventually.At a world leaders' summit, Charlotte is forced to revise a speech involving a planned environmental revision to appease some of her constituents. When Fred objects and calls her out on abandoning her morals, she changes her mind, and the speech is a success.As the two continue to spend time together under the pretext of Fred learning more about Charlotte for his writing, they start to get close. Charlotte is on a 20-nation tour to garner more support for her environmental initiative, and this gives her time to bond with Fred. Finally, after surviving a revolution in Manila (where they are rescued by the secret service and locked into a basement warehouse for safety), they begin a relationship together when they are evacuated to a secluded Island for safety.Upon finding out, Maggie tries to warn both that the public will never accept them as a couple. Maggie says that Charlotte belongs with someone like James Steward.\nWhen Chambers orders Charlotte to remove plans to preserve the trees, as some friends of his asked, she lets off steam with Fred by getting high on ecstasy. A hostage crisis occurs (when a US U-2 spy plane goes down in the country of Kashtari and the pilot is taken hostage by their military) soon after and, despite still being high, Charlotte manages to talk the captors down and free the hostage.Even though the incident increases Charlotte's approval rating, Chambers is livid when she chooses to ignore his orders and call him out. He confronts her in his office alongside Wembley, who has a vested interest in removing the trees as part of her plan. Wembley wants to build a server farm in Alaska by clearing the land of trees, which would not be possible now.\nThe two blackmail her with a hacked video from Fred's webcam of him discussing their relationship and masturbating to a video of one of her speeches.\nShe shows Fred the video and informs him that she has agreed to the ultimatum, and that she wants to introduce him and their relationship publicly once his image is cleaned up. Disappointed and unable to change, Fred refuses, and they break up.Back in New York, Fred talks with Lance, who tells him that he has been too stubborn with his principles and refusal to consider other people's needs and opinions. Fred decides to accede to Charlotte's ideas.\nDuring her announcement to run for president in 2020, Charlotte changes her mind and opts for her original plan, also revealing the blackmail from Wembley and Chambers and describing the content of the video before its release. The video is released and Fred is nicknamed \"cum guy\" by the news media.Fred searches for Charlotte and finds her waiting at his apartment. They admit that they love each other and meet the press outside where Charlotte introduces Fred as her boyfriend. In 2021, the couple marry, and Charlotte is sworn in as the first female president with Fred as \"First Mister\", him having taken her last name.",
	"links": [
		"https://www.amazon.com/Long-Shot-Seth-Rogen/dp/B07RD5JK3S"
	]
}