{
	"title": "San Andreas",
	"release_year": "2015",
	"runtime": "114",
	"tags": [
		"Action",
		"Adventure",
		"Thriller",
		"max",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Dwayne Johnson",
		"Carla Gugino",
		"Alexandra Daddario",
		"Colton Haynes",
		"Ioan Gruffudd",
		"Archie Panjabi",
		"Paul Giamatti",
		"Hugo Johnstone-Burt",
		"Art Parkinson",
		"Will Yun Lee"
	],
	"staff": [
		"Brad Peyton",
		"Carlton Cuse",
		"Andre Fabrizio",
		"Jeremy Passmore",
		"Beau Flynn",
		"Andrew Lockington",
		"Steve Yedlin",
		"Bob Ducsay",
		"Deborah Aquila",
		"Tricia Wood",
		"Barry Chusid"
	],
	"links": [
		"https://www.max.com/movies/san-andreas/be5a703f-8fb6-4cd3-847b-9791bf557bce",
		"https://www.amazon.com/San-Andreas-Dwayne-Rock-Johnson/dp/B00YGNYBAC"
	],
	"votes": 260482,
	"cover": "https://m.media-amazon.com/images/M/MV5BYmQzNDEzMzMtM2U5OS00YTUzLWI2NDYtYjI2NjAyNWE5YzMzXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Raymond \"Ray\" Gaines (Dwayne Johnson) is a Los Angeles Fire Department Air Rescue pilot in the middle of a divorce from Emma (Carla Gugino) and planning a trip to San Francisco with his daughter Blake (Alexandra Daddario).\nRay has over 600 documented rescues combining his military service and his civilian career as an Air rescue worker. Ray works with winch-man Joby O'Leary (Colton Haynes) and co-pilot Harrison Rhodes (Matt Gerald).Meanwhile, Caltech seismologist Lawrence Hayes (Paul Giamatti) and his colleague Dr. Kim Park (Will Yun Lee) are at Hoover Dam doing research for a new earthquake predicting model.Hayes says that 1.3 million Earthquakes occur each year. The one quake that hit Japan in 1900 was so powerful that it shifted the entire Island by 8 feet. The most powerful quake to hit the US was in Anchorage, Alaska, in 1964 and measured 9.1 on the Richter scale. The energy released was equal to 10 million atom bombs of the size dropped on Hiroshima.The biggest quake in human history was in Valdivia, in Southern Chile in 1960, which measured a 9.5. This quake lasted 11 minutes and spawned a Tsunami 82 feet high. It leveled Hilo, Hawaii, 8000 miles away.\nThe San Andreas Fault is the demarcation line between 2 tectonic plates that are constantly shifting. And a major quake on this fault is supposed to happen every 150 years. California is about 100 years overdue.Hayes says that by observing the smaller quakes, if the magnetic pulse rate goes up before the quakes, their model can be deemed predictive. Kim is able to prove his theory, but then the magnetic pulse rates spike up again, indicating a major quake.A nearby and heretofore unknown fault ruptures. This triggers a 7.1 magnitude earthquake that collapses the dam. Park sacrifices himself to save a young girl and gets swept away by the water.When Ray is called into work because of this, Blake goes with her mother's new boyfriend Daniel Riddick (Ioan Gruffudd) to San Francisco, instead of Ray. Daniel is a real estate developer and is constructing the tallest tower in San Francisco.\nRay and Emma had a daughter named Mallory (Arabella Morton), who drowned in a rafting accident.Back in his office, Hayes discovers that the San Andreas Fault is shifting and will soon cause a major earthquake, thereby destroying cities along the fault line. He begins racing to warn the population of California, along with his students Alexi (Alec Utgoff) and Phoebe (Marissa Neitling) and the reporter Serena Johnson (Archie Panjabi). Serena was meeting Hayes to learn more about the recent Earthquake that destroyed the Hoover dam.Emma is having lunch with Daniel's sister Susan (Kylie Minogue) when the fault slips triggering a 9.1 magnitude earthquake, with Susan among the casualties during the event. Emma was on the phone with Ray, and Ray heads right over to Emma's location. Ray saves Emma from the collapsing building, and they barely escape the city aboard his helicopter.In San Francisco, Daniel brings Blake to his office where she meets Ben (Hugo Johnstone-Burt), an engineering student from England seeking employment with his brother, Ollie (Art Parkinson). Ben and Ollie live in England, but Ben was in SFO for the interview and brought Ollie along for sightseeing.Daniel and Blake leave the premises but become trapped in their car in the parking garage after a string of earthquakes. Rubble from the collapsing parking garage pins her in Daniel's car. Daniel leaves Blake to find help for her but then panics and ultimately abandons her in an act of cowardice. Blake is found by Ben and Ollie, who help her escape. They then find a working phone in Chinatown and Blake calls Ray and Emma, who fly to San Francisco to save her.On route, Ray's helicopter suffers a gearbox failure, forcing him to make an emergency landing at a shopping mall in Bakersfield. In the middle of the chaos of looting, he steals a truck and he and Emma escape. They come across an older couple broken down on the side of the road where the San Andreas Fault has opened up, blocking the road and the couple, who happen to own an airplane agree to give it up in exchange for Ray's vehicle. San Andreas Fault had torn a large fissure through the highway and extends for the perceivable length of the fault in either direction.Ray and Emma exchange the truck for an airplane the couple owns. As Blake, Ben, and Ollie attempt to reach Nob Hill to signal the pair after finding their previous meeting point at Coit Tower engulfed in flames, Ray and Emma parachute into AT&T Park just before a 9.6-magnitude quake hits, which becomes the largest recorded earthquake in history.As the quake subsides, having destroyed much of the city, Ray and Emma commandeer a boat to reach the group, only to realize that a tsunami is approaching San Francisco Bay. Alongside a handful of other survivors in small ships, the two cross the wave before it crests, barely avoiding a container ship caught up in the tsunami wave. The ship crashes into the Golden Gate Bridge's center span, killing everyone on the bridge, including Daniel, who gets crushed by a falling shipping container.The tsunami strikes the ruined city, which capsizes a cruise ship and kills thousands more. Blake, Ben, and Ollie enter the Gate, a building whose construction Daniel had been overseeing, but they are still caught by the wave. As the building begins to collapse, trapping Blake underwater, Ray dives in, rescues her, and performs CPR. Emma crashes the boat through a window and drives the five of them out of the collapsing building as Ray resuscitates Blake.The survivors regroup at a relief camp on the other side of the bay, where the reconciled Ray and Emma talk about their future. On the remains of the Golden Gate Bridge, an American flag unfolds and gives hope that the city will recover and rebuild as rescue vehicles descend on the destroyed landscape of the San Francisco Bay Area, which now extends from San Jose to Santa Cruz, with the San Francisco Peninsula having been turned into an island."
}