{
	"title": "22 Jump Street",
	"release_year": "2014",
	"runtime": "112",
	"tags": [
		"Action",
		"Comedy",
		"Crime",
		"max",
		"amazon",
		"netflix"
	],
	"rating": 7.0,
	"actors": [
		"Channing Tatum",
		"Jonah Hill",
		"Ice Cube",
		"Nick Offerman",
		"Peter Stormare",
		"Wyatt Russell",
		"Amber Stevens West",
		"Jillian Bell",
		"Keith Lucas",
		"Kenneth Lucas"
	],
	"staff": [
		"Phil Lord",
		"Christopher Miller",
		"Michael Bacall",
		"Oren Uziel",
		"Rodney Rothman",
		"Jonah Hill",
		"Jonah Hill",
		"Neal H. Moritz",
		"Channing Tatum",
		"Mark Mothersbaugh",
		"Barry Peterson",
		"Keith Brachmann",
		"David Rennie",
		"Nicole Abellera",
		"Jeanne McCarthy",
		"Steve Saklad"
	],
	"links": [
		"https://www.max.com/movies/22-jump-street/8278df88-4b15-4e17-a1ed-fd3fe459712d",
		"https://www.amazon.com/22-Jump-Street-Christopher-Miller/dp/B0D9MJB4CB",
		"https://www.netflix.com/title/70298992"
	],
	"votes": 412151,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTcwNzAxMDU1M15BMl5BanBnXkFtZTgwNDE2NTU1MTE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Following their success in the 21 Jump Street program, Schmidt (Jonah Hill) and Jenko (Channing Tatum) are back on the streets chasing narcotics. However, after failing in the pursuit of a group of drug dealers led by Ghost (Peter Stormare), Deputy Chief Hardy (Nick Offerman) puts the duo back on the program to work for Captain Dickson (Ice Cube) - now located across the street at 22 Jump Street. Their assignment is to go undercover as college students and locate the supplier of a drug known as \"WHYPHY\" (Work Hard Yes Play Hard Yes) that killed a student, Cynthia, photographed buying it on campus from a guy with a very specific tattoo.At college, Jenko quickly makes friends with a pair of jocks named Zook (Wyatt Russell) and Rooster (Jimmy Tatro), the latter being a prime suspect of the investigation. Jenko starts attending parties with the jocks who do not take as kindly to Schmidt. Meanwhile, Schmidt gets the attention of an art student, Maya (Amber Stevens), by feigning an interest in slam poetry. The two sleep together, to the disapproval of Maya's roommate Mercedes (Jillian Bell), and it is revealed that Maya is the daughter of the vehemently disapproving Captain Dickson. Despite sleeping together, Maya tells Schmidt not to take it seriously, and he starts to feel left out as Jenko bonds more and more with Zook who encourages him to join the football team.When Schmidt and Jenko feel as if they have no clue to who the dealer is because they have no leads, they decide to pay a visit to Mr. Walters (Rob Riggle) and Eric (Dave Franco) in jail for advice on how to look for the WHYPHY supplier. Walters tells the two to look more closely as he notices a unique tattoo on the arm of the dealer in the photograph showing it is a guy shooting a bazooka with the big boldest part of the tattoo that reads \"BOOM!\". He insists that if they find the tattoo, they will have found their man. Whilst hanging out with Zook and Rooster, Jenko notices that Rooster does not have the tattoo but sees it on Zook's arm. Schmidt and Jenko are invited to join the fraternity led by the jocks but Schmidt refuses, furthering the tension between the Schmidt & Jenko. Schmidt wants to investigate Zook, but Jenko resists the idea saying that many people could have the same tattoo.At a counseling session, they realize that maybe Zook isn't the dealer but was buying the drugs rather than selling them. They summarize that Cynthia was the supplier on campus & she was getting the drugs through an outside agent who would put the drugs in library books, that were checked out by Cynthia.Soon afterwards they stake the library find Ghost and his men on campus. A chase ensues and Ghost again evades the pair. Jenko reveals to Schmidt that he's been offered a football scholarship with Zook and is unsure whether or not he wants to continue to be a police officer. Schmidt decides for him by telling officers on the scene that Jenko had nothing to do with the melee caused by the chase. Immediately afterwards, Schmidt moves out of the dorm and Maya finds out who he really is.In the aftermath, Schimdt's cover as an undercover cop is blown & he is pulled out of the college, while Jenko continues practicing football with Zook. Schimdt tries convincing his seniors to complete the investigation, but they don't pay him any attention.Spring Break arrives and Schmidt prepares to go after Ghost alone. Jenko asks to help so that the two can have one final mission together, and the pair head to the beach where Ghost is likely to be dealing WHYPHY. Inside a bar, they find Mercedes, revealed to be Ghost's daughter, giving instructions to other dealers. The pair, backed up by Dickson, ambush the meeting and give chase as they flee. Mercedes is able to handcuff Dickson and take him hostage, pursued by Schmidt.Meanwhile, Jenko goes after Ghost. After a fist fight with Mercedes, Schmidt is held at gunpoint by her but Maya sneaks up and knocks her out. Schmidt goes to help Jenko who is now on the roof of the college in pursuit of Ghost, who shoots Jenko in the shoulder. Ghost attempts to escape in a helicopter and Jenko jumps across to it but struggles to hold on with his injured arm. Schmidt makes the same jump and the two fall into the sea, but not before Jenko is able to throw a grenade into the helicopter, killing Ghost.Back on land, Jenko tells Schmidt that he still wants to be a police officer as he believes their differences help their partnership, and the two reconcile in front of a cheering crowd. Dickson approaches them claiming to have a new mission undercover at a med school.\nDuring the credits, a series of mock clips are shown depicting the two going undercover in various places.\nIn a post-credit's scene, Mr. Walters and Eric are shown cuddling in prison, with the former telling a terrified latter that he's \"late\"."
}