{
	"title": "A Haunting in Venice",
	"release_year": "2023",
	"runtime": "103",
	"tags": [
		"Crime",
		"Drama",
		"Horror",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Kenneth Branagh",
		"Michelle Yeoh",
		"Jamie Dornan",
		"Tina Fey",
		"Dylan Corbett-Bader",
		"Amir El-Masry",
		"Riccardo Scamarcio",
		"Fernando Piloni",
		"Lorenzo Acquaviva",
		"David Menkin"
	],
	"staff": [
		"Kenneth Branagh",
		"Michael Green",
		"Agatha Christie",
		"Kenneth Branagh",
		"Judy Hofflund",
		"Simon Kinberg",
		"Ridley Scott",
		"Hildur Guðnadóttir",
		"Haris Zambarloukos",
		"Lucy Donaldson",
		"Lucy Bevan",
		"John Paul Kelly"
	],
	"votes": 120019,
	"cover": "https://m.media-amazon.com/images/M/MV5BOTgwODdhZTMtYTFiNy00NzI1LTkwZWEtNjI2NWZiMzFmMjJlXkEyXkFqcGc@._V1_QL75_UY281_CR17,0,190,281_.jpg",
	"description": "Venice, Italy, 1947Belgian private detective Hercule Poirot (Kenneth Branagh) awakens from a nightmare. He has retired from detective work and currently lives in post-World War 2 Venice, but people continue to hound him for help in solving mysteries due to his past reputation (as referenced in the previous films 'Murder on the Orient Express' and 'Death on the Nile'). Poirot is now accompanied by a bodyguard, former police officer Vitale Portfoglio (Riccardo Scarmacio), who keeps the people from pestering him.One day, Poirot is visited by an old friend, named Ariadne Oliver (Tina Fey). She is an author whose last few books have not seen much success. Ariadne invites Poirot to attend a Halloween party at a palazzo belonging to former opera singer Rowena Drake (Kelly Reilly). The main event will be a seance performed by renowned medium Joyce Reynolds (Michelle Yeoh), described in the press as \"The Unholy Mrs. Reynolds\".Poirot and Vitale accompany Ariadne across the canal as they arrive at the palazzo. A group of children are there, being told a story about how the palazzo used to be an orphanage, but the doctors and nurses abandoned the children to die there during the Plague, leading to the belief that the spirits of the children haunt the palazzo. There is said to be a curse, the Children's Vendetta, and any victim is marked with a slash on them as a sign. One of the children, Leopold (Jude Hill), is taken care of by the housemaid, Olga Seminoff (Camille Cottin), as he does not join the other children and prefers to read a Poe book. Leopold goes to see his nervous father, Dr. Leslie Ferrier (Jamie Dornan). Poirot and Ariadne see Rowena, and Ariadne notes that the previous year, Rowena lost her daughter Alicia (Rowan Robinson) in what is believed to be a suicide after she fell from the balcony. Because of this, Rowena has had trouble selling the palazzo. Olga and Dr. Ferrier also feel a sense of loss since they knew and cared for Alicia as well.Joyce arrives to the palazzo, accompanied by her assistant Desdemona Holland (Emma Laird). Arriving seemingly uninvited is Alicia's ex-fiance Maxime Gerard (Kyle Allen). Rowena and Ferrier clearly don't like him but he claims someone else invited him.The seance begins with everyone gathered in a circle, and Joyce sitting in the middle. Olga tells Poirot that before her death, Alicia had begun to see hallucinations of the dead children. Joyce appears to be channeling Alicia's spirit, with any indication of her communication coming from keys seemingly being pressed on a typewriter. Poirot cuts the charade by revealing a second assistant in the chimney, Desdemona's half brother Nicholas (Ali Khan), who was flipping a switch to make the typewriter keys press automatically. Then, Joyce begins to spin around and make horrific noises and motions, before talking to Rowena with what sounds like Alicia's voice, which frightens some of the guests.Poirot attempts to leave, despite Ariadne's protests. He then talks to Joyce, who says that it would be easier and less painful for her if she was a fraud, but she knows that Poirot has seen enough death to understand her. She puts her mask on him along with her robe and encourages him to lighten up. Poirot then goes by the pot where the children were bobbing for apples, and he attempts to do so himself, only for an unseen figure to push his head into the water in an attempt to drown him, but the culprit flees before Poirot loses consciousness. He is found by Vitale, and they then hear a scream. Outside, Joyce's body falls and is impaled on a statue's hand.A storm begins outside, flooding the canals and ensuring that nobody can leave the palazzo. The guests begin to panic and grow paranoid, believing that there might be a supernatural force that killed Joyce. Poirot locks everyone inside and begins to suspect that one of them murdered her. Poirot brings Ariadne with him to begin to interview the suspects. They find a stuffed rabbit called Baba that belonged to Alicia, which had previously been missing.Poirot and Ariadne begin by speaking to Olga, then Dr. Ferrier, who suffers from PTSD and is haunted by his time at the liberation of Bergen-Belsen Nazi concentration camp due to his guilt over not being able to save the victims of that time. He says that him taking on Alicia was a favor to Rowena because he was in love with Rowena.Poirot excuses himself to go to the bathroom, where he believes he sees Alicia's ghost in the mirror behind him. He finds Leopold outside, who tells him he is jumpy like Dr. Ferrier, and the boy claims to hear the voices of the ghost children.Poirot and Ariadne then interview Nicholas and Desdemona separately to get unbiased accounts. They give their accounts of the evening, as well as their history being Romani refugees trying to make it to America. Poirot also learns that the siblings stole from Joyce and were possibly threatened by her. Desdemona attempts to make a run for it after punching Vitale, but Olga trips her and knocks her down.The phone in the foyer begins to ring, but when Poirot and Vitale answer, there is nobody on the other end. Poirot then appears to see one of the ghost children, until Ariadne calls him and he finds nobody after turning his head back. He also thinks he hears the sound of a child singing, which Leopold also claims to hear. Poirot thinks it is coming from the basement, but Rowena says there is no basement in the house.The group moves downstairs and finds a hidden room, with the word \"dottore\" (Italian for 'doctor') written on the wall, further alluding to the Children's Vendetta. Dr. Ferrier begins to have a panic attack, and when Maxime tells him to keep it together, they get into a fight until Ferrier almost kills Maxime before Leopold calms him down. Ferrier goes to lie down in the music room and is locked inside, with Poirot having the only key. Poirot and Ariadne then speak to Maxime, who has a half of a ripped picture of Alicia. He claims he had to break off his engagement to her because Rowena did not approve of him, and Alicia seemed desperate to keep her mother happy.Poirot inspects the invitation that Maxime received, decoding the word \"apple\" from it. When Ariadne showed up at his home, she brought an apple with her. Poirot confronts her and Vitale, saying he has figured out that they conspired with Joyce to bring him to the palazzo. Vitale was the officer that pulled Alicia out of the canal and investigated her death, so he knew the ins and outs of the palazzo, while Ariadne was hoping to use the seance and Poirot's inability to solve it as the basis for her new story. Ariadne admits to him that she needed a good new story after a string of flops. Desdemona then bursts in and tells Poirot to hurry with the key.The group finds Ferrier dead with a knife in his back. Leopold is devastated at the sight. After the group disperses, Olga talks to Poirot and says that Rowena was always by Alicia's side before her death, but prior to it, Olga heard voices coming from her room. Poirot then looks at photos of Alicia and notices one of her as a little girl, the same little girl he thought he saw in the house earlier. He also notices a specific type of flower in one of the pictures. In another brief state of delusion, Poirot turns around as the house's pet parrot knocks over a teacup. Poirot goes to clean it up and then finds the other half of Maxime's picture, which is of himself and Alicia.Poirot then gathers the guests together, as he has solved the mystery. The killer is none other than Rowena herself. Poirot explains that Rowena had planted rhododendrons in her garden and extracted a honey from it that she used to drug Alicia, keeping her under care against her will following her returning after breaking things off with Maxime. The honey also caused hallucinations, which made Alicia believe that she saw the ghost children, and it is the same honey that Poirot earlier consumed with tea and made him see ghosts too. When Alicia was having a psychotic break, Olga administered more honey because she believed it was calming to her, but she accidentally gave her a fatal overdose. Rowena threw Alicia's body into the canal and staged it as a suicide. The revelation causes Olga to feel extreme guilt. Rowena later learned she was being blackmailed and suspected either Joyce or Ferrier. She was the one who attempted to drown Poirot, believing it was Joyce since he was wearing her mask and robe. When she did find Joyce, she pushed her off the balcony to her death, and she used a hand rake to mark her back with the so-called Children's Vendetta, as she did with Alicia. But since Rowena was nowhere near Ferrier when he died, Poirot explains this as her finding out that he blackmailed her, and she threatened Leopold's life unless he did what she said, so Ferrier walked backwards into a knife to spare his son. Poirot figures that Rowena was hoping that blaming the deaths on ghosts would get her off easy.Rowena begins to make a run for it. Poirot pursues her to the balcony, where she aims a weapon at him. A flash of thunder strikes, and Poirot sees what looks like Alicia's ghost appear behind Rowena. The ghost then seems to pull Rowena down, sending her plunging into the canal to her death.In the morning, the canal clears up, and the guests begin to leave. Poirot and Ariadne have one last conversation before parting ways, apparently forever. Olga adopts Leopold, and Poirot learns that he was the blackmailer after deducing that Rowena was making a poison. He had also been trying to support his father by using the money Rowena sent from the blackmail.Poirot returns to his home, having his faith somewhat restored. A man that earlier approached him comes into his home, hoping for Poirot to solve the deaths of his parents and brother. Poirot already deduced from minor facts that the family doctor was involved in the hopes of earning their inheritance, and the great detective jumps on the case.",
	"links": [
		"https://www.amazon.com/Haunting-Venice-Kyle-Allen/dp/B0CGVRSDY6"
	]
}