{
	"title": "Transcendence",
	"release_year": "2014",
	"runtime": "119",
	"tags": [
		"Action",
		"Drama",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.2,
	"actors": [
		"Johnny Depp",
		"Rebecca Hall",
		"Morgan Freeman",
		"Cillian Murphy",
		"Paul Bettany",
		"Kate Mara",
		"Cole Hauser",
		"Clifton Collins Jr.",
		"Cory Hardrict",
		"Falk Hentschel"
	],
	"staff": [
		"Wally Pfister",
		"Jack Paglen",
		"Kate Cohen",
		"Broderick Johnson",
		"Andrew A. Kosove",
		"Annie Marter",
		"Mychael Danna",
		"Jess Hall",
		"David Rosenbloom",
		"John Papsidera",
		"Chris Seagers"
	],
	"votes": 240221,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTc1MjQ3ODAyOV5BMl5BanBnXkFtZTgwNjI1NDQ0MTE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Dr. Will Caster (Johnny Depp) is a scientist motivated by curiosity about the nature of the universe. He researches the nature of sapience, including artificial intelligence. Max is Will's colleague.\nSome experiments had already been done in extracting consciousness from the chimpanzee and uploading it into a computer.Will's wife Evelyn (Rebecca Hall), whom he loves deeply, joins him in their garden where he has built a Faraday cage to keep out wireless signals. The cage is large enough to cover the entire garden. Will made the cage as Evelyn wanted a place to have fewer distractions.\nJoseph Tagger is Will and Evelyn's mentor.Being part of a team working to create a sentient computer, he predicts that such a computer will create a technological singularity, or in his words \"Transcendence\". Evelyn supports Will completely and says that a higher level of intelligence is required to solve the problems facing mankind, to heal poverty and disease and to heal the planet.Will postulates that the collective thinking power of humans has remained unchanged for 130,000 years and that pales in comparison to the most basic AI. A sentient machine can overcome the limits of biology and would have an intelligence greater than every single person born in the history of the world.An anti-technology terrorist group called \"Revolutionary Independence From Technology\" (R.I.F.T.) carry out synchronized attacks on A.I. laboratories all over the country. R.I.F.T. considers A.I. to be a threat to humanity and believes that Will is trying to create a God. R.I.F.T. shoots Will with an irradiated bullet and Will is given no more than a month to live.Ironically, with the attack, only Will's A.I. lab is left without any substantial damage. Tagger visits Will's lab and observes his sentient computer called PINN (Physically Independent Neural Network). Tagger and the FBI offer to share their research into A.I. with Will (including the experiments with Chimpanzee consciousness), so he can program it into his computers and advance the progress on a sentient computer. The only thing PINN is missing is consciousness and self-awareness.With time running out on Will, in desperation, Evelyn comes up with a plan to upload Will's consciousness into the quantum computer PINN that the project has developed. His best friend Max Waters (Paul Bettany), also a researcher, questions the wisdom of this choice. Max helps Evelyn with the transfer of consciousness. Will and Evelyn spend the remaining weeks mapping his brain wave patterns in response to various stimuli and also recording sound samples of Will reciting specific keywords.\nEventually Will passes away and PINN shuts down, seemingly unable to process through the sheer volume of raw data thrown at it.Then, after several days, when Evelyn is ready to shut down the project and wipe the drives clean, she and Max read a message on the screen from Will.\nWill's likeness survives his body's death and requests that he be connected to the Internet so as to grow in capability and knowledge. Will says that he needs more power, he reorders his own code and designs a new core to exponentially increase his computing capabilities. Access to the internet will connect him to the financial markets and educational & research databases.\nMax panics, insisting that the computer intelligence is not Will. Evelyn is convinced that it is Will as she can see memories of their time spent together on screen. Evelyn forcibly ejects Max from the building.Max is almost immediately confronted by Bree (Kate Mara), the leader of R.I.F.T. Max is captured by the terrorists and eventually persuaded to join them. They use his cellphone to track down Evelyn's location.\nWhen R.I.F.T. discovers where Evelyn has established her project, she connects the computer intelligence to the Internet via satellite and escapes before R.I.F.T. destroys the equipment.In his virtual form, and with Evelyn's help, Will uses his new-found vast intelligence to build a technological utopia in a remote desert town called Brightwood, where over the course of the next 2 years, he spearheads the development of groundbreaking new technologies in the fields of medicine, energy, biology, and nanotechnology. But even Evelyn begins to grow fearful of Will's motives when he displays the ability to remotely connect to and control people's minds after they have been subjected to his Nano-particles.After visiting Evelyn and the underground facility Will has built, and seeing the capabilities of the hybrids Will has created, FBI agent Donald Buchanan (Cillian Murphy), with the help of government scientist Joseph Tagger (Morgan Freeman), prepares to stop the technological singularity from spreading. The government is also deeply suspicious of what Will's uploaded person will do and plans to use the terrorists to take the blame for the government's actions to stop Will.As Will has spread his influence to all of the networked computer technology in the world, R.I.F.T develops a computer virus with the purpose of deleting Will's source code, killing him and, as a necessary side-effect, destroying his technological civilization. Evelyn plans to upload the virus by infecting herself and then having Will upload her consciousness.All of the characters, Bree, Max, Tagger, Evelyn, and even Will Caster himself, are forced to choose between uploading the virus or risking assimilation into Will's Transcendence, which holds the promise of ending pollution, disease, and human mortality. Evelyn escapes from the data center but is captured by Government forces who are now working with RIFT. She meets Max who turns her over to RIFT's cause & makes her see that Will is slowly taking over the world & needs to be stopped. Eventually Evelyn agrees & offers her body to be used to take the virus to Will & upload it into Will's system.When Evelyn goes back to the research center, she is taken aback seeing Will in a newly created organic body identical to his old one. Will welcomes her but is instantly aware that she is carrying the virus and intends to destroy him. The FBI and the activists of R.I.F.T. attack the base with mortars, fatally wounding Evelyn. Evelyn tells Will that he can protect her by uploading her mind as she did his.When Bree threatens to kill Max unless Will uploads the virus, Will explains that he has only enough power either to heal Evelyn's physical body or upload the virus. Evelyn tells Will that Max should not die because of what they've done, so Will uploads the virus to save Max.As Will is dying, he explains to Evelyn that he did what he did for her: saving the planet was her wish, to learn the secrets of the universe was his. In their last moment, he tells Evelyn to think about their garden. Then, the virus kills both Will and Evelyn, and a global technology collapse and blackout ensues.Three years later, in Will and Evelyn's garden outside their old home in Berkeley, Max notices that their sunflowers are the only blooming things in it. Upon closer examination, he notices that a drop of water falling from a sunflower petal instantly cleanses a puddle of oil - and realizes that the Faraday cage has also protected a sample of Will's Nano-particles. The audience are left to infer that Will and Evelyn's consciousnesses are still alive within the active Nano-particles, giving the world a second chance at Transcendence.",
	"links": [
		"https://www.amazon.com/Transcendence-Johnny-Depp/dp/B00K6RYG7K"
	]
}