{
	"title": "Money Monster",
	"release_year": "2016",
	"runtime": "98",
	"tags": [
		"Action",
		"Crime",
		"Drama",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"George Clooney",
		"Julia Roberts",
		"Jack O'Connell",
		"Dominic West",
		"Caitríona Balfe",
		"Giancarlo Esposito",
		"Christopher Denham",
		"Lenny Venito",
		"Chris Bauer",
		"Dennis Boutsikaris"
	],
	"staff": [
		"Jodie Foster",
		"Jamie Linden",
		"Alan DiFiore",
		"Jim Kouf",
		"Lara Alameddine",
		"George Clooney",
		"Daniel Dubiecki",
		"Grant Heslov",
		"Dominic Lewis",
		"Matthew Libatique",
		"Matt Chesse",
		"Avy Kaufman",
		"Kevin Thompson"
	],
	"votes": 106854,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjQzMzQ3Nzg5MV5BMl5BanBnXkFtZTgwMDExOTI4NzE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Flamboyant television financial expert Lee Gates (George Clooney) is in the middle of airing the latest edition of his show, Money Monster.\nLess than 24 hours earlier, IBIS Clear Capital's stock inexplicably cratered, apparently due to a glitch in a trading algorithm that was managing the company's stock portfolio, costing investors $800 million. Lee planned to have IBIS CEO Walt Camby (Dominic West) appear for a softball interview about the crash, but Camby unexpectedly left for a business trip in Geneva. Camby's chief communications officer Diane is filling in for him for the interview with Lee and will join the show over a video chat.\nLee believes that Camby is a proven performer and has made a lot of money for his investors in the past, and the IBIS capital stock will eventually bounce back.Lee Gates is super busy and is dealing with 100s of different pieces of information to process and to come up with a solid set of recommendations for his viewers on the show. It is strongly indicated that most of the recommendations are not based on any proper analysis, but rather on rumors, hearsay, backroom chats and so on.Midway through the show, a deliveryman wanders onto the set, pulls a gun and takes Gates hostage, forcing him to put on a vest laden with explosives. He is actually Kyle Budwell (Jack O'Connell), who invested $60,000-his entire life savings, inherited from his deceased mother-in IBIS after Lee endorsed the company on the show. Kyle claims that Lee endorsed the high frequency trading model of IBIS and encouraged investors to put all their savings into the stock and had declared that the stock was safer than a savings account.Kyle insists that the live camera feeds should be turned back on, else he will shoot Lee. He then orders the doors of the studio to be closed and locks the entrances so that the police cannot interrupt him.\nThe Director Patty secretly orders all non-essential staff to clear the studio. Patty is also constantly talking to Lee through an earpiece, which Kyle is not aware of.Kyle was wiped out along with the other investors. Kyle says that it is people like Lee who are stealing from the poor. Kyle knows that once he entered the studio and took Lee hostage, he is not going to walk out alive.\nUnless he gets some answers, he will blow up Lee before killing himself. Kyle says that he doesn't understand what the computer glitch was that wiped out $800 million from stock value and wants an explanation.\nOnce police are notified, they discover that the receiver to the bomb's vest is located over Lee's kidney. The only way to destroy the receiver-and with it, Kyle's leverage-is to shoot Lee and hope he survives.\nCaptain Marcus Powell (Giancarlo Esposito) is in charge of the police operation to bring the situation under control.With the help of longtime director Patty Fenn (Julia Roberts), Lee tries to calm Kyle and find Camby for him. Diane had logged off the program as soon as the hostage situation began and was ducking calls from Patty. Patty ends up sending a cameraman, along with Ron (the producer of the show), to the IBIS office to get Diane on camera.\nDiane's colleagues, including the CFO Avery (Dennis Boutsikaris) tell her to stay put till they hear from Camby, but she refuses to be a bystander as the crisis unfolds and goes down to the building's lobby to talk to Kyle via Ron. Avery is shown to be secretly in touch with Camby.Kyle is not satisfied when both Lee and IBIS chief communications officer Diane Lester (Caitriona Balfe) offer to compensate him for his financial loss. He also is not satisfied by Diane's insistence that the algorithm is to blame.\nDiane is not satisfied by her own explanation and defies Avery to contact a programmer who created the algorithm, reaching a man in Seoul named Won Joon (Aaron Yoo), who insists that an algorithm could not take such a large, lopsided position unless a human meddled with it. Won says that the algorithm was designed to move in and out of hundreds of positions in a small amount of time, and not to accumulate a large position in any one stock, that could lose the company $800 million in one trading session.Lee appeals to his TV viewers for help to buy IBIS stock, seeking to recoup the lost investment, but is dejected by their response.\nNew York City police find Kyle's pregnant girlfriend Molly (Emily Meade) and allow her to talk to Kyle through a video feed. When she learns that he lost everything, she viciously berates him before the police cut the feed. Kyle says that he works for $14 / hour and cannot support a kid on this income. This is why he invested in the stock in the first place.\nLee, seemingly taking pity on Kyle, agrees to help his captor discover what went wrong.Once Camby finally returns, Diane flips through his passport, discovering that he did not go to Geneva but to Johannesburg. With this clue, along with messages from Camby's phone, Patty and the Money Monster team contact a group of Icelandic hackers to seek the truth. After a police sniper takes a shot at Lee and misses, he and Kyle resolve to corner Camby at Federal Hall, where Camby is headed according to Diane.\nThey head out with one of the network's cameramen, Lenny (Lenny Venito), plus the police, and a mob of fans and critiques alike. Kyle accidentally shoots and wounds producer Ron Sprecher (Christopher Denham) when Ron throws Lee a new earpiece. Kyle and Lee finally confront Camby with video evidence obtained by the hackers.It turns out that Camby bribed a South African miners' union, planning to have IBIS make an $800 million investment in a platinum mine while the union was on strike. The strike lowered the mine's owners' stock, allowing Camby to buy it at a low price. If Camby's plan had succeeded, IBIS would have generated a multi-billion-dollar profit when work resumed at the mine and the stock of the mine's owner rose again. The gambit backfired when the union stayed on the picket line. Camby attempted to bribe the union leader, Moshe Mambo (Makhaola Ndebele), in order to stop the strike, but Mambo refused and continued the strike causing IBIS' stock to sink under the weight of its position in the flailing mining company.Despite the evidence, Camby refuses to admit his swindle until Kyle takes the explosive vest off Lee and puts it on him. Camby admits to his wrongdoing to Kyle on live camera. Satisfied with the outcome, Kyle gets shot by the police after throwing the detonator away, much to Lee's dismay.\nIn the aftermath, the SEC announces that IBIS will be put under scrutiny and Camby on trial for violations of the Foreign Corrupt Practices Act, as Lee and Patty reveal at the hospital that Ron will survive the gunshot.",
	"links": [
		"https://www.amazon.com/Money-Monster-George-Clooney/dp/B01ESAO0IA"
	]
}