{
	"title": "Big Hero 6",
	"release_year": "2014",
	"runtime": "102",
	"tags": [
		"Action",
		"Adventure",
		"Animation",
		"amazon"
	],
	"rating": 7.8,
	"actors": [
		"Ryan Potter",
		"Scott Adsit",
		"Jamie Chung",
		"T.J. Miller",
		"Daniel Henney",
		"Damon Wayans Jr.",
		"Genesis Rodriguez",
		"James Cromwell",
		"Alan Tudyk",
		"Maya Rudolph"
	],
	"staff": [
		"Don Hall",
		"Chris Williams",
		"Jordan Roberts",
		"Robert L. Baird",
		"Daniel Gerson",
		"Man of Action",
		"Roy Conli",
		"Henry Jackman",
		"Rob Dressel",
		"Tim Mertens",
		"Jamie Sparer Roberts",
		"Paul A. Felix"
	],
	"votes": 511627,
	"cover": "https://m.media-amazon.com/images/M/MV5BYjQ3YzUyOGQtNjdlYS00YmRhLWIyOWYtMGQ3YjkwMjJiYzRjXkEyXkFqcGc@._V1_QL75_UY281_CR4,0,190,281_.jpg",
	"description": "In the futuristic city of San Fransokyo, Hiro Hamada (Ryan Potter), a 14-year-old high school graduate and robotics prodigy, spends his time competing in illegal underground robot fights. Hiro cleverly lures Yama (Paul Briggs)) (who is also a notorious gangster) by losing the first fight easily, prompting Yama to bet even bigger when offered by Hiro. Hrio's robot for modular in design and could assemble itself in various configurations suited to a particular mission. Hiro's robot destroys the reigning champion Yama's robot. Yama and his goons try to beat up Hiro, but Tadashi arrives in time with his scooter to rescue him.Hiro graduated high school when he was 13 and Tadashi is not happy with what he is doing with his life. Since robot betting is illegal, both Hiro and Tadashi are arrested and have to bailed out by Aunt Cass (Maya Rudolph), their legal guardian. The boys have been living with Cass for 10 years. Hiro is not interested in college as he believes that they teach only things that he already knows.Hiro's elder brother Tadashi (Daniel Henney), hoping to get Hiro out of this dangerous lifestyle, takes him to attend the San Fransokyo Institute of Technology.\nTadashi takes Hiro to the institute's research lab. Hiro meets Tadashi's closest friends - Go Go Tomago (Jamie Chung) (a tough and athletic student who specializes in electromagnetic), Wasabi (Damon Wayans Jr.) (a smart and slightly neurotic youth who specializes in lasers), Honey Lemon (Genesis Rodriguez) (a chemistry enthusiast), and Frederick \"Fred\" Frederickson IV (T.J. Miller) (a comic book fan and slacker who is also a team mascot).\nThe lab has several futuristic inventions such as a bike with Electro-magnetic suspension developed by Go Go. Wasabi has built a laser induced plasma with ultra-precision for fine cuts. Honey Lemon is working on chemical Embrittlement of metals.Tadashi introduces Baymax (Scott Adsit), an inflatable health-care robot, which he invented. Baymax is still in development phase and his software is not as fast as it could be. Baymax comes coded with over 10,000 medical procedures which are stored on his chip. Baymax looks like a walking marshmallow and Tadashi says that he wanted Baymax to be Huggable. Baymax has a carbon fiber skeleton and Hyperspectral cameras. Baymax can lift 1000 pounds. It uses a Lithium-Ion battery.Tadashi also introduce his mentor Prof. Robert Callaghan (James Cromwell). Callaghan is the father of modern robotics and all the concepts that Hiro used to create his fighting robot, came originally from Callaghan. Callaghan turns Hiro down by saying that his program is not easy and that his students are the ones who shape the future.\nTadashi tells Hiro that the University has an annual showcase and if Hiro can come up with something that impresses Callaghan, then he will be in.\nHiro applies to the university, impressing the school's showcase with his project: a swarm of tiny Microbots that can link together in any configuration using a neural transmitter. Microbot technology has limitless technology to solving human problems in construction, transportation etc. Alistair Krei approaches Hiro after his demonstration and wants to purchase the technology. Callaghan intervenes and tells Hiro not to trust Alistair whom he believes is only guided by a profit motive.\nHiro is accepted, but the celebration is short-lived when a fire breaks out with Callaghan caught in it. Tadashi rushes back into the building to save him, but an explosion occurs. A funeral is subsequently held for Tadashi and Callaghan.Two weeks later, Hiro, who has isolated himself in grief, is not eating any food and is missing classes which have already started at the University. Hiro throws away his acceptance letter into trash.\nHiro inadvertently activates Baymax when he drops a heavy object on his foot and cries out in pain. Baymax scans Hiro and diagnoses that Hiro is going through puberty (as he has elevated hormone levels and mood swings).\nHiro's only remaining Microbot (which was in his jacket pocket from the night Tadashi died in the showcase) begins to move on its own (which cannot happen until it is in the vicinity of the other Microbots and that should be impossible since all Microbots were destroyed in the fire). Hiro and Baymax follow it to an abandoned warehouse.\nThey discover that a Kabuki masked man \"Yokai\" is mass-producing the Microbots. The warehouse had a section where millions of Microbots were stored in large drums. Yokai tries to dispose of the duo, but they narrowly escape. Hiro suspects that Yokai caused the fire to cover up the theft of the Microbots and caused Tadashi's death. Hiro reports the theft to the police, but they do not take his complaint seriously. Baymax is not able to testify as he deactivates due to low battery.Determined to avenge Tadashi, Hiro equips Baymax with armor and a chip programmed with martial arts for defense. Hiro also manufactures an armor for Baymax who says that the armor compromises his Huggable and non-threatening design.\nHiro and Baymax return to the warehouse and find it empty. They follow Hiro's Mircobot to the docks, where they are attacked by Yokai. Yokai was hunting for parts from underwater and bringing them out.\nBaymax contacts Tadashi's friends, who meet up with Hiro. Yokai pursues the group through the streets, but Baymax saves them when the car crashes into the water. Baymax removes his armor and takes everybody with him to the surface.\nAt Fred's family home (turns out Fred's family is really rich, and he lives in a huge mansion), Hiro upgrades Baymax's armor and the group convert their own inventions into weapons to combat Yokai. Go Go improves her tire design to create 2 tires one of each leg, that gives her super speed. Honey Lemon creates a portable machine that can mix various chemicals on the fly, with specific properties such as a sticky glue, slippery surface and so on. Fred gets a suit that breathes fire. Baymax gets Thrusters in his legs and even rocket fists, wings and improved sensors. Wasabi creates a handheld laser device that can cut through anything.Baymax had scanned Yokai on their last encounter, and now with his improved sensors, Baymax scans the entire city and finds a match on a remote Island.\nBelieving Yokai is tech mogul Alistair Krei (Alan Tudyk), who had wanted to buy Hiro's Microbots, the group tracks him to an abandoned Krei Tech laboratory on a remote island. They find a chamber in which a device is being assembled from broken pieces.They discover (the control center in the chamber had a video recording of the previous experiment) the laboratory was used for Teleportation research, but the government shut down the lab after a test pilot disappeared inside an experimental portal. The group are soon ambushed by Yokai, but the friends work together to fight Yokai and defeat him. Hiro knocks off his mask. Yokai is revealed to be Callaghan, who had faked his death by using the Microbots to protect himself from the explosion. Callaghan blames Tadashi for going into the fire to save him.Realizing that Tadashi died in vain, an enraged Hiro violates Baymax's health-care protocol by removing his health-care chip and orders Baymax to terminate Callaghan, despite his friends' objections. Baymax obeys Hiro's commands before Honey manages to reinsert his health-care chip, returning him to his usual personality as Callaghan escapes. Feeling betrayed by his friends' actions, Hiro flies off with Baymax, intent on avenging Tadashi.Back at home, Hiro tries to remove the health-care chip again, but Baymax recognizes Hiro's impulsiveness and blocks his access port. Baymax shows Hiro footage of how Tadashi developed him (it took Tadashi 84 tests to get a working prototype of Baymax, but he never gave up), reminding Hiro that Tadashi's goal was to help others. Hiro apologizes to Baymax and his friends.\nThrough research, they discover that the lost test pilot was Callaghan's daughter Abigail (Katie Lowes). Having stolen the Microbots to seek revenge on Krei, Callaghan reactivates the Teleportation portal but assembling it on top of the HQ, to demolish Krei's company headquarters. The reactivated portal did not have a contained magnetic field and was sucking in everything into the portal. Hiro, Baymax and their friends work together to defeat Callaghan and save Krei. Since they were not able to get to Callaghan's mask (that was controlling the Microbots), they attack the Microbots themselves which get sucked into the portal, weakening Callaghan.Baymax detects that Abigail is still alive inside the portal. Despite Krei's protests about the portal being too unstable, Baymax and Hiro enter the portal and find Abigail trapped in hyper-sleep. Baymax and Hiro bring Abigail towards the portal gate, navigating the debris inside the portal. Close to gate, Hiro takes his eyes off the debris and Baymax is struck by debris, causing his armor to break and forcing Hiro to leave him behind. After a sad goodbye, Baymax uses his rocket fist to propel Hiro and Abigail out of the portal before it is destroyed. In the aftermath, Abigail is taken to the hospital, while Callaghan is arrested.Sometime later after beginning his tenure at the institute with his friends, Hiro discovers Baymax's health-care chip clenched in the rocket fist. Hiro rebuilds Baymax and they and their friends continue to protect the city as a team of high-tech superheroes called Big Hero 6.\nIn a post-credits scene, Fred stumbles upon a secret superhero lair in his mansion, where he is reunited with his father (Stan Lee).",
	"links": [
		"https://www.amazon.com/Big-Hero-6-4K-UHD/dp/B0813Z39S6"
	]
}