{
	"title": "Valerian and the City of a Thousand Planets",
	"release_year": "2017",
	"runtime": "136",
	"tags": [
		"Action",
		"Adventure",
		"Fantasy",
		"amazon"
	],
	"rating": 6.4,
	"actors": [
		"Dane DeHaan",
		"Cara Delevingne",
		"Clive Owen",
		"Rihanna",
		"Ethan Hawke",
		"Herbie Hancock",
		"Kris Wu",
		"Sam Spruell",
		"Alain Chabat",
		"Rutger Hauer"
	],
	"staff": [
		"Luc Besson",
		"Pierre Christin",
		"Jean-Claude Mézières",
		"Luc Besson",
		"Luc Besson",
		"Virginie Besson-Silla",
		"Alexandre Desplat",
		"Thierry Arbogast",
		"Stéphane Garnier",
		"Julien Rey",
		"Nathalie Cheron",
		"Hugues Tissandier"
	],
	"votes": 199418,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTkxMDAxNDUyNV5BMl5BanBnXkFtZTgwOTc3MzcxMjI@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In the 28th century, the former International Space Station has become \"Alpha\", a city where millions of creatures from different planets live peacefully and exchange their knowledge and cultures. The humans form a special police division to preserve peace through the universe, including officers Valerian (Dane DeHaan), a happy-go-lucky major, and his partner Laureline (Cara Delevingne), a no-nonsense sergeant.En route to a mission, Valerian dreams of a planet, where a low-tech humanoid race lives peacefully. They fish for pearls containing enormous amounts of energy, and use small animals to replicate them. Wreckage begins plummeting from the sky, and as the humanoids investigate the derelicts, one enormous ship crashes into the planet, triggering an apocalypse. A female humanoid, a princess of her people, separated from her group after the door to the spaceship wreck being used as shelter breaks, manages to send a telepathic signal just as the explosion consumes her and the surface.Shaken, Valerian wakes. He learns that his mission is to retrieve a \"Mül converter\", so called for being able to replicate anything it eats, even currency. It is the last one in the entire universe, from a black market dealer. Before setting out, he asks Laureline to marry him, but she brushes him off, knowing of his many affairs with female colleagues and citing his inability to take things seriously.\nTravelling to a virtual market called \"Big Market\", Valerian disrupts a meeting between the dealer and hooded figures seeking the converter - two humanoids, with the \"converter\" being one of the animals he saw in his dream. He and Laureline recover the converter, and he surreptitiously steals one of the pearls that had been given as payment for the dealer, hoping to gift it to Laureline as a wedding present.They return to Alpha, where their superior, frosty Commander Filitt (Clive Owen), informs them the center of the station has been infected by an unknown force, rendering it highly toxic, that troops sent into the area have not returned, and that the infection is spreading. Laureline and Valerian are assigned to protect the commander during an inter-station summit to discuss the crisis. The commander asks for the converter, but Valerian says that Laureline should hold onto it while they are protecting him.\nDuring the summit, the humanoids suddenly attack - incapacitating everyone before kidnapping Filitt. Valerian frees himself and the others and chases the kidnappers, who head for the infected area. Valerian loses control of his vehicle, and Laureline loses contact with him.Evading arrest for insubordination, Laureline finds Valerian unconscious at the edge of the infected zone. She wakes him, but is kidnapped after by a primitive tribe that lives in the center of Alpha. Valerian infiltrates the tribe's territory with the help of a shape-shifting dancer, Bubble (Rihanna). He saves Laureline and they escape, but Bubble is mortally wounded. She encourages him to keep pursuing Laureline, before dying.Valerian and Laureline venture further into the infected area, realizing that it is not radioactive. They reach a large, shielded hall where they find the humanoids with an unconscious Filitt. Their leader explains that his people lived peacefully on the planet Mül, when a battle broke out in orbit between the human government's fleet and another alien race. The human commander, Filitt, ordered the firing of a doomsday weapon that, despite knowledge that Mül was populated by a civilization, annihilated both the enemy fleet and Mül, as seen in Valerian's dream, sent to him by the princess and daughter of the humanoids' leader. A small group of survivors sheltered in a crashed spaceship and managed to repair it, learning much about technology and the history of other races in the process. They eventually came to Alpha, where they assimilated more knowledge and constructed a spaceship that could recreate their former home, their \"paradise\". The hall they are standing in is that spaceship, and they have kidnapped Filitt in order to recover the converter and the pearl they need to launch the ship. Filitt admits to his role in the genocide, but argues that the doomsday strike was necessary to halt the war, and that the cover-up was necessary to prevent the human race from being expelled from Alpha, as well as prevent reparations that would bankrupt the human government.Valerian has the pearl he took during the black market deal, and Laureline has the converter. Valerian gives them his pearl, but is reluctant to hand over the converter, as it is government property. Laureline convinces him to return it after pointing out the injustice their government perpetrated. While the spacecraft prepares for takeoff, Filitt's Pre-programmed robot soldiers attack both the humanoids, the government soldiers sent to assist Valerian, and their support staff, but are defeated by the support staff and Valerian's efforts. The spacecraft departs with the duo on-board, while Filitt is arrested. In a final scene in their own spaceship, Valerian and Laureline confess their love and expect to land at their own paradise in two hours.",
	"links": [
		"https://www.amazon.com/Valerian-City-Thousand-Planets-Besson/dp/B0DC28RRY6"
	]
}