{
	"title": "Rampage",
	"release_year": "2018",
	"runtime": "107",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Dwayne Johnson",
		"Naomie Harris",
		"Malin Akerman",
		"Jeffrey Dean Morgan",
		"Jake Lacy",
		"Joe Manganiello",
		"Marley Shelton",
		"P.J. Byrne",
		"Demetrius Grosse",
		"Jack Quaid"
	],
	"staff": [
		"Brad Peyton",
		"Ryan Engle",
		"Carlton Cuse",
		"Ryan J. Condal",
		"Adam Sztykiel",
		"Beau Flynn",
		"Hiram Garcia",
		"Brad Peyton",
		"John Rickard",
		"Andrew Lockington",
		"Jaron Presant",
		"Bob Ducsay",
		"Jim May",
		"Denise Chamian",
		"Barry Chusid"
	],
	"votes": 188570,
	"cover": "https://m.media-amazon.com/images/M/MV5BNDA1NjA3ODU3OV5BMl5BanBnXkFtZTgwOTg3MTIwNTM@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Athena-1, a research space station owned by gene manipulation company Energyne, is destroyed after Larry, a laboratory rat mutates and wreaks havoc. Dr. Kerry Atkins (Marley Shelton), the lone surviving crew member, is ordered to retrieve research canisters containing a pathogen by CEO Claire Wyden (Malin Åkerman) . Atkins is able to flee in the escape pod when the station imploded, but it disintegrates upon re-entry, killing her, and leaving a trail of debris across the United States, including the Everglades, where a canister is consumed by an American crocodile, and a forest in Wyoming, where a gray wolf is exposed to the pathogen.Primatologist Davis Okoye (Dwayne Johnson), a former US Army Special Forces soldier and member of an anti-poaching unit, works at a San Diego wildlife preserve. He befriends a rare albino gorilla named George, whom he saved from poachers. One night, one of the canisters crash-lands in George's habitat and George is exposed to it.George grows considerably larger and more aggressive over time. Davis is contacted by Dr. Kate Caldwell (Naomie Harris), a genetic engineer, who explains that the pathogen was developed by Energyne to rewrite genes on a massive scale. She had hoped to advance CRISPR research as a potential cure for disease but discovered that Energyne planned to use it as a biological weapon. The company fired her and got her sent to prison for attempting to expose them. George escapes from captivity and goes on a rampage at the preserve. Davis calms him down, but George is captured by a government team led by Agent Harvey Russell (Jeffrey Dean Morgan), and is put on an airplane. Meanwhile, Claire and her brother, Brett (Jake Lacy), send a squad of mercenaries led by Burke (Joe Manganiello) to capture the mutated wolf, Ralph, but they are all killed.Claire, hoping to capture Ralph and use George to kill Kate so they can cover up their plans, uses a massive transmitter atop the Willis Tower to lure the animals, who have been engineered to respond aggressively to a certain sound frequency, to Chicago. George reacts violently to the sound and crashes the plane. Davis, Kate, and Russell manage to parachute from the plane before it crashes. George, who survived the crash, joins Ralph as they make their way to Chicago. Davis and Kate convince Russell to help them steal a military medical helicopter, so they can get ahead of George.By the time they arrive, George and Ralph are attacking the city. The military are overwhelmed when the mutated crocodile, Lizzie, arrives, and causes more casualties. Davis and Kate attempt to steal a serum with the hope that they can turn the mutated animals back to normal. They are able to reach Energyne headquarters at the Willis Tower and steal a handful of serums, but they are spotted by Claire and Brett. Claire reveals that the serum only eliminates the animals' aggressiveness rather than revert them to their normal sizes, and she shoots Davis, though he survives. When George climbs up to the top of the tower and causes chaos, Claire orders Davis to distract him while she attempts to escape with Kate held hostage at gunpoint. During the escape, Kate slips the serum into Claire's handbag and pushes her towards George, who devours her alive, and thus the serum. George and the other animals destroy the transmitter, and consequently, the entire tower topples to the ground, which Davis and Kate survive by hovering in a damaged helicopter over the falling tower.With George returned to his normal personality, Davis stays to help him defeat the other two animals, while Kate flees to prevent the military from dropping a MOAB (Mother of All Bombs) bomb on the city. Russell is able to take a laptop of incriminating evidence from Brett, before Brett is crushed to death by falling rubble from the collapsing building. George and Davis trick Ralph into flying into Lizzie's jaws, which decapitates him, then George pierces Lizzie's eye with an iron bar, killing her. With the threat neutralized, the airstrike is aborted, and George helps in clearing the city of debris.",
	"links": [
		"https://www.amazon.com/Rampage-Blu-ray-UHD/dp/B07CLPFS5R",
		"https://www.amazon.com/Rampage-Dwayne-Johnson/dp/B07C5V9TFC"
	]
}