{
	"title": "Home",
	"release_year": "2015",
	"runtime": "94",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Jim Parsons",
		"Rihanna",
		"Steve Martin",
		"Jennifer Lopez",
		"Matt Jones",
		"Brian Stepanek",
		"Brian Stepanek",
		"Brian Stepanek",
		"April Lawrence",
		"Stephen Kearin",
		"Lisa Stewart",
		"April Winchell"
	],
	"staff": [
		"Tim Johnson",
		"Tom J. Astle",
		"Matt Ember",
		"Adam Rex",
		"Suzanne Buirgy",
		"Christopher Jenkins",
		"Mireille Soria",
		"Lorne Balfe",
		"Stargate",
		"Nick Fletcher",
		"Leslee Feldman",
		"Christi Soper",
		"Kathy Altieri"
	],
	"links": [
		"https://www.amazon.com/Art-Home-Ramin-Zahed/dp/1608873846"
	],
	"votes": 113449,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjExOTQ4MDMyMV5BMl5BanBnXkFtZTgwMTE3NDM2MzE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "On the run from their enemy, the planet-destroying Gorg, the Boov (the best species ever at running away) find Earth a suitable place to call \"home\". Led by Captain Smek (Steve Martin), they commence their \"friendly\" invasion of the planet, relocating the humans (By reversing the gravity of the planet temporarily and sucking people out of their homes with huge vacuums), whom the Boov deem as simple and backwards, to other parts of the planet (a large colony in Australia, Humanstown) while the Boov inhabit their homes in a quick and bloodless conquest.\nOne of the Boov, named Oh (Jim Parsons), is a more excited, freethinking member of the species, who decides to invite the Boov to his apartment for a housewarming party, despite the race's antipathy towards him. The Boovs have a peculiar habit of changing colors as per their moods.\nNot far from Oh is a preteen human girl named Tip (Rihanna), who drives away through her home city to find her mother Lucy (Jennifer Lopez) after being separated from her during the invasion, leaving her with only her calico cat Pig and fueling her hatred for the Boov.Oh runs into the street to meet up with a Boov cop named Kyle (Matt Jones), who, like the rest of the Boov, refuse to befriend him. Oh invites him to the party and decides to send a mass invite to every Boov on Earth. However, the \"send all\" button he pressed actually sends the invite to absolutely every alien race in the entire galaxy including the Gorg. Everyone, aggravated with Oh for revealing their location to the enemy, starts chasing him down. The E-invite will reach the Grog in 40 hrs.\nOh runs into a convenience store to hide just as Tip and Pig enter the same store to grab supplies. They come across each other (Tip is angry with Oh for stealing her planet and stealing her mom but has no choice but to work with Oh as he can fix her car), and after Tip's car fails to start, Oh transforms it into a fantastical, hovering craft that literally runs on Slushies and names it Slushious. Oh hitches a ride with Tip when he promises to help her find Lucy (and also Tip does not know how to handle the hovering car), but unfortunately, they must to go to the Boov Command Center in Paris and locate her from there.Smek meanwhile tries to log into Oh's account and cancel the E-invite, since all passwords are \"password\". But Oh had a unique password and that stymies Smek's plans. Oh tells Tip about how the Gorg invited Smek for a peace meeting. But Smek got scared and ran away with the Shusher, an artifact that Smek now has lodged in his royal stick.\nKevin catches up with Tip and Oh, but Tip manages to evade Kevin and is furious to learn that Oh wanted to ditch Tip and leave for Antarctica, the only place on the planet with no Boovs. On the way Oh realizes that Tip misses her mom and that in Boov world there are no mothers. Mimom and sad-mad.\nTip disguises Oh with makeup once they get into Paris.After reaching the Boov Command Center, which is in the now-floating Eiffel Tower, Oh manages to get into his account, and deletes the message just seconds before it reaches the Gorg. He then plugs in Tip's brain to help her find Lucy. They eventually trace her location to Australia, where she is also looking for her daughter. The other Boov then find the two and try to \"erase\" Oh, while Tip grabs the gravity manipulation system and flips it over, causing the whole Tower to tilt upside down.As Oh and Tip head off to Australia, they see other Boov riding by them in fear, and realize that a Gorg ship is close behind them. Tip and Oh manage to knock it down, but in the process a chunk of it hits them and they lose their Slushie fuel. They come across the fallen Gorg ship and find out that it is actually a drone. Oh recovers a special chip and uses it to get their car up and running.\nTip and Oh make it to Australia and see the Boov evacuating to their mothership. When they land the car, Tip starts to run for her mother, but Oh insists on evacuating with the other Boov instead. Oh declares that Lucy is in one of the ships, but Tip knows he's lying. Tip thought that Oh would help find Lucy, but hurt her feelings for lying to her. Tip gets angry at him for trying to break the promise, and she declares that they were never friends.Heartbroken, Oh returns to the ship. The Gorg mothership comes close to the Boov ship, but Oh pulls out the Gorg chip and uses it to fly the ship further away from the Gorg. The Boov become astonished at Oh's plan. Smek becomes upset and reminds everyone that he is the captain. Kyle grabs Smek's \"Shusher\" (a scepter with a rock on top of it) and gives it to Oh, declaring him the new captain.Tip rushes aimlessly around the city to find Lucy, but no one can help her. Oh returns to her side and helps her track down Lucy. The mother and daughter finally reunite and thank Oh. The Gorg mothership descends upon the planet, and Oh realizes that they want the rock on the Shusher, since Smek had previously stolen it from them. Oh runs to the ship to try and get its attention, locking Tip and Lucy in the car for safety. Tip breaks out of the car and shines a light in the Gorg Commander's face to bring his attention to Oh as he holds the rock up.The Gorg Commander (Brian Stepanek) halts the ship as it crunches down on the ground, with Oh in its path. Tip rushes to rescue him, but Oh gets seemingly crushed beneath the machine. It backs up and Oh is revealed to be unharmed. The Gorg Commander emerges from his armor to show that he is actually a harmless starfish-like creature. Oh returns the rock to him, which turns out to contain millions of developing Gorg larvae; the next generation of Gorg, revealing that this Gorg is the last of his kind. He thanks Oh and eventually departs.Two weeks later, the humans have returned to their original homes, and Oh finally gets to have his party at his apartment, with humans and Boov in attendance. Tip plays her music and gets the rest of the Boov to experience dancing for the first time, while other Boov, including a reformed Smek, party on the moon, and thousands of ships from other planets, including the Gorg, head to Earth for Oh's party upon receiving his invite."
}