{
	"title": "Minions",
	"release_year": "2015",
	"runtime": "91",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"amazon",
		"netflix"
	],
	"rating": 6.4,
	"actors": [
		"Sandra Bullock",
		"Jon Hamm",
		"Michael Keaton",
		"Pierre Coffin",
		"Allison Janney",
		"Steve Coogan",
		"Jennifer Saunders",
		"Geoffrey Rush",
		"Steve Carell",
		"Katy Mixon Greer"
	],
	"staff": [
		"Kyle Balda",
		"Pierre Coffin",
		"Brian Lynch",
		"Janet Healy",
		"Christopher Meledandri",
		"Heitor Pereira",
		"Claire Dodgson",
		"Eric Guillon"
	],
	"votes": 265382,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTUwNjcxNzAwOF5BMl5BanBnXkFtZTgwNzEzMzIzNDE@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "Minions are small, yellow pill-like creatures who have existed since the beginning of time, evolving from single-celled organisms into beings who have only one purpose: to serve history's most villainous bosses. They successfully find great masters, including a T. Rex, a caveman, an Egyptian pharaoh, Dracula, and Napoleon, but after accidentally executing them all soon after, they decide to isolate themselves from the world and start a new life in Antarctica.By 1968, the lack of a master drives them into depression, so fearless lead Minion Kevin comes up with a plan to find a new one for his Minion-kind. He is joined by rebellious teenage Minion Stuart (who unwittingly was selected) and lovable kid Minion Bob (due to his begging) and lack of volunteers).After a long journey, the Minions arrive at New York, where at a shopping center on TV, they learn about Villain-Con, a villain convention where super-villains from around the world gather, which is to be held in Orlando, Florida. They manage to hitch a ride to Orlando, where coincidentally, the family who drove them are criminals heading to Villain-Con as well. After seeing various super-villains, they finally become the henchmen for Scarlet Overkill, the world's first female super-villain.Scarlet takes the Minions to her residence in London, where she instructs the Minions to steal St Edward's Crown from Queen Elizabeth II for her, threatening to execute them if they fail. With the help of the weapons of Herb, Scarlet's husband, the Minions successfully break into the Tower of London, However, the crown has already been delivered to the palace. The Minions steal the crown from the Queen's carriage, destroying the carriage in the process, while pursued by the police. In the process, Bob crash lands on the mythical Sword in the Stone, where he pulls the sword Excalibur out easily to defend himself. Elizabeth is then removed from the throne, and Bob is crowned as the new King of the United Kingdom.Convinced they are traitors, Scarlet confronts the Minions, attempting to execute them, then she craves her revenge. King Bob eventually abdicates in Scarlet's favor. However, Scarlet ultimately betrays the Minions, locking them in the palace dungeon where they are to be tortured by Herb, although this backfires due to their unusual shapes and abilities. When Herb goes to attend his wife's coronation, the Minions escape the dungeon through a sewer, intending on apologizing to Scarlet.At Westminster Abbey, the Minions accidentally interrupt Scarlet's coronation by unscrewing a chandelier, which falls and crushes Scarlet before she could be crowned. Scarlet orders the attendees of the coronation, some of which are super-villains, to execute the Minions. Stuart and Bob are captured while Kevin hides in a bar, where he finds Elizabeth working there. After learning that Scarlet is going to execute Stuart and Bob, Kevin breaks into Herb's laboratory, where he triggers a machine which turns him into a giant and destroys the Overkill residence.\nSimultaneously, the rest of the Minions in Antarctica encounter a few Yetis. The Minions begin to work for the leader of the Yetis, but once again accidentally kill their leader when a piece of ice falls on his head, causing the remaining Yetis to pursue the Minions in anger. The Minions travel around the world, eventually landing in Britain.Kevin rescues his companions from execution as the army of Minions arrive in London. Scarlet is distracted by the army of Minions and Kevin knocks her away, however the super-villain attempts to escape with Herb using her dress rocket. Before escaping, Kevin is able to hold onto her rocket, seemingly killing her and Herb and shrinking himself back to his original size.Elizabeth is once again crowned Queen of the United Kingdom and, in front of a crowd, presents Bob, Stuart, and Kevin with their rewards: a tiny crown for Bob, an electric guitar (later replaced by a snow globe) for Stuart and a knighthood respectively for Kevin. Scarlet is suddenly revealed to be alive and snatches the Queen's crown with Herb, but she is stopped and frozen by young Gru. Scarlett is disappointed until Bob gives her his tiny crown. At the end of the film, the Minions see Gru as their new potential boss and chase after him, setting up the plot for Despicable Me.",
	"links": [
		"https://www.amazon.com/Minions-Sandra-Bullock/dp/B011802KGM",
		"https://www.netflix.com/title/80033394"
	]
}