{
	"title": "Don Jon",
	"release_year": "2013",
	"runtime": "90",
	"tags": [
		"Comedy",
		"Drama",
		"Romance",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Joseph Gordon-Levitt",
		"Scarlett Johansson",
		"Julianne Moore",
		"Tony Danza",
		"Glenne Headly",
		"Brie Larson",
		"Rob Brown",
		"Jeremy Luke",
		"Paul Ben-Victor",
		"Italia Ricci"
	],
	"staff": [
		"Joseph Gordon-Levitt",
		"Joseph Gordon-Levitt",
		"Ram Bergman",
		"Nathan Johnson",
		"Thomas Kloss",
		"Lauren Zuckerman",
		"Venus Kanani",
		"Mary Vernieu",
		"Meghan C. Rogers"
	],
	"links": [
		"https://www.amazon.com/Don-Jon-Joseph-Gordon-Levitt/dp/B00GJ0GOVO"
	],
	"votes": 248718,
	"cover": "https://m.media-amazon.com/images/M/MV5BNDgwMTU2NDctODI0YS00ZmIxLWFiNjEtZDI2ZGE3NWFlZDY2XkEyXkFqcGc@._V1_QL75_UX190_CR0,8,190,281_.jpg",
	"description": "Jon Martello is a modern day Don Juan (Joseph Gordon-Levitt), with a short list of things he cares about: \"my body, my pad, my ride, my family, my church, my boys, my girls, my porn\". Although he has an active sex life with women he meets at nightclubs, he looks at pornography on the Internet habitually, preferring it to sex.During a typical night out with his two best friends, Jon sees Barbara Sugarman (Scarlett Johansson), and although she finds him interesting he fails to pick her up for a one-night stand. He finds out who she is through Facebook, and asks her to lunch. The attraction is mutual, but Barbara insists on a traditional long-term courtship, which proceeds for over a month without sex. She encourages him to take night classes to get an office job outside the service industry (Don works at a restaurant as a waiter and has no real skills), and Jon indulges her love for romance movies, which he usually dismisses as unrealistic fantasy. They meet each other's families and Jon's parents immediately love her.Eventually, they have sex, but as with other women, Jon is dissatisfied and gets up while Barbara sleeps to watch pornography in the other room. Barbara catches him and is shocked that he would do such a thing. He denies that he watches pornography and claims it was a joke sent to him by a friend.Their relationship resumes, with Jon continuing to watch pornography, but doing so primarily outside his apartment, where Barbara is often around. He is caught watching a video on his cell phone before a class by Esther (Julianne Moore), a middle-aged woman who attempts to apologize for an earlier awkward incident in which Jon encountered her weeping by herself at the college. Jon politely brushes her off. Barbara continues to assert control over him, insisting that cleaning his own apartment-a task Jon finds personally satisfying-is not manly. One night she looks at the browser history on his computer, confronts him with proof that he has been continuing to compulsively watch pornography, and ends their relationship.Jon tries to return to his old lifestyle, but it's not the same. Esther continues to reach out to Jon, trying to offer him the benefit of her experience, and lends him an erotic video that she believes has a more realistic depiction of sexual relations. He responds by initiating a sexual encounter in her parked car. She persuades him to try masturbating without pornography, but he is unable to. She invites him to her home, where she reveals that her husband and son had died in a car crash 14 months before. She counsels him further about the need for sex to be a mutual experience, and with her, Jon finally has sex that doesn't leave him restless to watch pornography.Jon's weekly confessional tallying his one-night stands and pornography sessions is replaced by one in which he proudly reports abstinence from porn and just the one instance of fornication, which he describes as being more like making love. He finally tells his parents about the break-up with Barbara, and they are devastated. His teenage sister breaks her silence, saying that Barbara didn't really care about Jon and was just using him to live out her romance movie fantasy.Jon asks to meet with Barbara and apologizes for lying to her about the pornography. But her selfish attitude and inability to see it confirms for him that he is better off without her. On his next visit to the gym he forgoes his weightlifting routine to shoot hoops with his friends. Jon takes Esther as his girlfriend. Neither has any interest in getting married anytime soon, and Jon denies being in love, but he does confirm that they get \"lost\" in each other."
}