{
	"title": "The Grand Budapest Hotel",
	"release_year": "2014",
	"runtime": "99",
	"tags": [
		"Adventure",
		"Comedy",
		"Crime",
		"amazon"
	],
	"rating": 8.1,
	"actors": [
		"Ralph Fiennes",
		"F. Murray Abraham",
		"Mathieu Amalric",
		"Adrien Brody",
		"Willem Dafoe",
		"Jeff Goldblum",
		"Harvey Keitel",
		"Jude Law",
		"Bill Murray",
		"Edward Norton"
	],
	"staff": [
		"Wes Anderson",
		"Stefan Zweig",
		"Wes Anderson",
		"Hugo Guinness",
		"Wes Anderson",
		"Jeremy Dawson",
		"Steven Rales",
		"Scott Rudin",
		"Alexandre Desplat",
		"Robert D. Yeoman",
		"Barney Pilling",
		"Douglas Aibel",
		"Antoinette Boulat",
		"Simone Bär",
		"Luise Eigner",
		"Adam Stockhausen"
	],
	"votes": 899540,
	"cover": "https://m.media-amazon.com/images/M/MV5BMzM5NjUxOTEyMl5BMl5BanBnXkFtZTgwNjEyMDM0MDE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In the present, a teenage girl approaches a monument to a writer in a cemetery. In her arms is a memoir penned by a character known only as \"The Author\". She begins reading a chapter about a trip he made to the Grand Budapest Hotel in 1968.\nLocated in the fictional Republic of Zubrowka, a European alpine state ravaged by war and poverty, The Author discovers that the remote, mountainside hotel has fallen on hard times. Many of its lustrous facilities are now in a poor state of repair, and its guests are few. The Author encounters the hotel's elderly owner, Zero Moustafa (Tony Revolori), one afternoon, and they agree to meet later that evening. Over dinner in the hotel's enormous dining room, Zero tells him the tale of how he took ownership of the hotel and why he is unwilling to close it down.The owner's story begins in 1932, during the hotel's glory days, when he worked as a lobby boy. Zubrowka is on the verge of war, but this is of little concern to Gustave (Ralph Fiennes), the Grand Budapest's devoted concierge. When he is not attending to the needs of the hotel's wealthy clientele or managing its staff, Gustave courts a series of aging women who flock to the hotel to enjoy his \"exceptional service\". One of the ladies is Madame Céline Villeneuve \"Madame D\" Desgoffe Und Taxis, and Gustave spends the night with her prior to her departure.One month later, he is informed that Madame D has died under mysterious circumstances. Taking Zero along, he races to her wake and the reading of the will, where he learns that she bequeathed him Boy with Apple, a very valuable painting, in her will. This enrages her family, all of whom hoped to inherit it. Her son, Dmitri Desgoffe Und Taxis (Adrien Brody), lashes out at Gustave. With the help of Zero, Gustave takes the painting and returns to the Grand Budapest, securing the painting in the hotel's safe. During the journey, Gustave makes a pact with Zero - in return for the latter's help, he makes Zero his heir. Shortly thereafter, Gustave is arrested and imprisoned for the murder of Madame D after forced testimony by Serge X, Madame D's butler, which basically says that Serge saw Gustave at the night of the crime near Madame X's chambers. Serge is a good friend of Gustave & he is unwilling to believe the story. Gustave has an alibi, in another rich old woman, but cant use her to prove his innocence as she is married to someone presently.Zero aids Gustave in escaping from Zubrowka's prison by sending a series of stone-working tools concealed inside cakes made by Zero's fiance Agatha. Along with a group of hardened convicts, Gustave digs his way out of his cell. Gustave teams up with Zero to prove his innocence. After Gustave's escape, Dmitri realizes that the painting has been stolen & asks Jopling to trace them down.\nTheir adventure takes them to a mountaintop monastery where they meet with Serge X, the only person who can clear Gustave of the murder accusations. They are pursued by J.G. Jopling (Willem Dafoe), a cold-blooded assassin working for Dmitri, who kills Serge. Jopling also killed the attorney executing Madame X's will as he suspected a crucial document was missing which could alter the allocation of the entire estate and not just the painting (boy with apple). Dmitri was angry with the attorney and got Jopling to silence him forever. Zero and Gustave steal a sled and chase Jopling as he flees the monastery on skis. During a face-off at the edge of a cliff, Zero pushes the assassin to his death and rescues his mentor.Back at the Grand Budapest, the outbreak of war is imminent and the military have commandeered the hotel and are in the process of converting it into a barracks. A heartbroken Gustave vows to never again pass the threshold. They are joined by Agatha, who agrees to go inside and retrieve the painting but is discovered by Dmitri. A chase and a chaotic gunfight ensue before Gustave's innocence is finally proved by discovery of the copy of Madame D's second will which she gave to Serge and he subsequently hid in the back of the painting. This will was to take effect if she was murdered. The movie does not make it clear who actually killed Madame D (although there is, earlier in the film, a suggestive shot of a bottle labeled \"strychnine\" on Jopling's desk) or exactly how Gustave is proved innocent. The will also reveals that she was the mysterious owner of the Grand Budapest. She leaves much of her fortune, the hotel, and the painting to Gustave, making him fabulously wealthy in the process. He becomes one of the hotel's regular guests.During a train journey across the border, enemy soldiers inspect Gustave and Zero's papers. Narrating the story, Zero describes Gustave being taken out and shot after defending Zero, as he did on the initial train ride in the beginning of the movie. Agatha succumbs to \"the Prussian grippe\" and dies two years later, as does her infant son. Zero inherits the fortune Gustave leaves behind and vows to continue his legacy at the Grand Budapest, but a Communist takeover of Zubrowka and the ravages of time slowly begin to take their toll on both the building and its owner.An aged and devastated Zero confesses to the Author that he cannot bring himself to close the hotel because it is his last link to the best years of his life. The Author later departs for South America and never returns to the hotel.\nBack in the present, the girl continues reading in front of the statue of the author.",
	"links": [
		"https://www.amazon.com/Grand-Budapest-Hotel-Ralph-Fiennes/dp/B00JB3AOEY"
	]
}