{
	"title": "Kung Fu Panda 3",
	"release_year": "2016",
	"runtime": "95",
	"tags": [
		"Action",
		"Adventure",
		"Animation",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Jack Black",
		"Bryan Cranston",
		"Dustin Hoffman",
		"Angelina Jolie",
		"J.K. Simmons",
		"Jackie Chan",
		"Seth Rogen",
		"Lucy Liu",
		"David Cross",
		"Kate Hudson"
	],
	"staff": [
		"Alessandro Carloni",
		"Jennifer Yuh Nelson",
		"Jonathan Aibel",
		"Glenn Berger",
		"Melissa Cobb",
		"Hans Zimmer",
		"Clare Knight",
		"Leslee Feldman",
		"Christi Soper",
		"Raymond Zibach"
	],
	"votes": 194781,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTUyNzgxNjg2M15BMl5BanBnXkFtZTgwMTY1NDI1NjE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In the Chinese Spirit Realm, Master Oogway (Randall Duk Kim) is meditating (searching for Inner Peace) when he is attacked out of the blue by Kai. Oogway fights against Kai (J. K. Simmons) (whom Oogway addresses as an \"old friend\"). Kai has been in the spirit realm for 500 years now and already has collected Chi of several Kung Fu Masters to grow much stronger. Kai needs Oogway's Chi to return to the mortal world and this time Oogway won't be there to stop him. Kai has 2 blades made of Jade which he uses to capture his victims and steal their Chi.Oogway willingly gives in and has his Chi stolen but not before warning Kai that the Dragon Warrior, Po (Jack Black), will stop him. Oogway says that it was never his destiny to stop Kai, but of the Dragon Warrior.\nKai uses this as a challenge to steal the Chi from the Dragon Warrior and returns to the mortal world using Oogway's Chi.Po basks in the glory of being the Dragon Warrior and the defender of the valley. He and the Furious Five are friends and comrades in arms.\nMeanwhile, Master Shifu (Dustin Hoffman) announces his retirement and passes the role of teacher to Po. Po wanted Tigress to be the teacher as she is anyways telling everyone what to do. But Shifu says that Tigress is not the Dragon Warrior.\nPo is excited at first but discovers that teaching Kung Fu is not as easy as he expected, as the Furious Five members Tigress (Angelina Jolie), Crane (David Cross), Mantis (Seth Rogen), Viper (Lucy Liu), and Monkey (Jackie Chan) are injured as a result of following Po's confused and contradictory instructions. They learn that Po cannot teach, and that Tigress is flammable.Po is demoralized as a teacher, which makes him question who he really is and whether he is the Dragon Warrior. Shifu tells Po that the Dragon Warrior is more than just a defender of the valley and a Kung Fu Master. Shifu is certain that Oogway had a higher vision for Po, which will reveal itself in due course of time.\nIn response, Shifu advises Po that instead of trying to be a teacher, he should try to be himself. Shifu teaches Po about Chi, the energy that flows through all living things. Shifu says that mastery of Chi requires mastery of self.Meanwhile, Kai arrives in the mortal world. He used to be the Supreme Warlord of all China and is irritated to find that nobody remembers him now, but everyone remembers Oogway. He sends his captured masters (Their Jade Statues) to search for Oogway's students and to bring them to him.Po heads home to his adoptive father, Mr. Ping (James Hong), at his noodle shop, where a panda named Li Shan (Bryan Cranston) breaks Po's dumpling-eating record by eating 103 dumplings in one go. They both soon learn that Li is Po's biological father, and they bond with each other, much to Ping's jealousy. Li says that Po's given name at birth was Little Lotus. Li and Po do a belly pong together. Li says that he lives in a secret panda village where he got a message from the Universe to find Po.\nPo takes Li to the Jade palace where they see the priceless Kung Fu artifacts from the Hall of Heros such as Urn of Whispering Warriors, Master Rhino's battle armor, Master Ram's crossbow the infamous Gate Smasher, battle helmets of Master Rat's army, Master Dolphin's waterproof armor, the battle rickshaw of Master Hawk, and so on. The father son duo tries on the various armors and have a fun afternoon.After introducing Li to Shifu and his friends, the valley is suddenly attacked by jade statues controlled by Kai. Po notices that some of the statues resemble past Kung Fu masters. For example, Master Porcupine died more than 100 years ago. When the jade statues are defeated, Kai announces his presence through them and then retreats the statues.The team then learns through research that Kai was Oogway's old friend who fought with him as brothers-in-arms long ago. They both fought together in the same army. When Oogway was injured, Kai carried him until they reached a secret village of pandas, who healed Oogway using their Chi.The pandas taught Oogway how to give Chi, but jealous and power-hungry Kai wanted the power all to himself and taught himself how to take Chi from others. He betrayed Oogway but was defeated and banished to the spirit realm for 500 years.In order to defeat Kai, Po must learn to channel Chi himself (and become a true master of Chi), which Li offers to teach him in exchange for going to Li's secret panda village. Po agrees as Shifu said that to master Chi Po would have to learn to be himself, be a Panda.\nPo and Li, along with Mr. Ping (who was a stowaway in Po's backpack), travel to the village while Shifu and the Furious Five stay behind. The secret village is accessed via a wooden escalator, and not stairs, which relieves Po.Upon arrival, Po befriends the villagers among them, a ribbon dancer named Mei-Mei (Kate Hudson). Although Po is eager to learn Chi, he first learns the life of a panda in the village, which he feels grateful to be a part of. He learns the Panda way of life like Pandas don't walk, they roll. Eating to his full potential, sleeping in his bed till late morning. Li tells Po that being a Panda involves a lot of relaxing and being yourself.\nOther inhabitants include kids Ku Ku (Knox Jolie-Pitt), Meng Meng (Zahara Jolie-Pitt), and Shuai Shuai (Shiloh Jolie-Pitt), Lei Lei (Liam Knight), Yoo (Pax Jolie-Pitt), Big Fun (Wayne Knight), cousins Dim (Al Roker) and Sum (Willie Geist), Bao (Steele Gagnon), and others.Meanwhile, Ping is kept busy by the Panda babies who invade his kitchen. Li shows Po a photo of him with his mother on his 100th day. Li says that he was lucky to have all the happiness in the world till that one moment when everything was taken away from him.After learning that many Kung Fu masters are missing, Shifu sends Crane and Mantis, along with Master Bear (Fred Tatasciore), Master Croc (Jean-Claude Van Damme) and Master Chicken (Stephen Kearin), to find Kai. They locate Kai at an abandoned ship in the middle of the desert, but they all have their Chi stolen by Kai. Kai then arrives at the Jade Palace and destroys it (along with the huge statue of Oogway), but not before stealing the Chi of Monkey, Viper and Shifu (with the help of Jade Statues of Crane and Mantis). Tigress escapes to find Po and warns him about Kai.Afraid, Li and the pandas prepare to run away. When Po demands that Li teach him Chi, he responds that he does not know Chi (and that it is a lost knowledge), and that he lied so he would not lose his son again. Infuriated, Po leaves and trains to fight Kai alone. Tigress is able to convince Po that he is unable to defeat Kai. Po's plan is to get close enough to Kai and use the Wuxi finger hold on him to send him back to the Spirit Realm.\nHowever, Li and the villagers decide to stay and ask Po to train them so they can fight back. Po accepts and decides that Pandas need to be themselves to fight Kai. he teaches them using their everyday activities as their assets and begins their plan to save their village.Kai arrives and confronts Po, who had been waiting for him. Kai sends his minions to capture Po, but they are held off by the pandas and Tigress, distracting Kai. The plan works at first, but ultimately fails when Po tries to use the Wuxi finger hold on Kai, who reveals that it can only work on mortals, which he is not.\nKai gains the upper hand in their fight, but Po uses the Wuxi finger hold again on himself (while wrapping himself around Kai), sending them both to the spirit realm. They fight again in the Spirit Realm, with Kai regaining the advantage to subdue and he prepares to take away his Chi.Using what they learned from Po and about who they are, Li, Tigress, Mr. Ping and the pandas are able to use their Chi to save Po. As the Pandas heal Po with their Chi, Po becomes a true master of Chi and by using his Chi creates a giant dragon figure which he uses to overload Kai with Chi and destroys him.With the death of Kai, the Kung Fu masters are released and are sent back to the mortal world. Oogway is also released and confronts Po in the Spirit Realm. He tells him that he has grown so much as a dragon warrior and that he was the one that sent the message to his father. It revealed that Po was chosen as a dragon warrior because of Po's descent of ancient pandas who used Chi. He said that he was both sides of Yin Yang circle.After hearing this, Po goes back to the mortal world and reunites with his friends and take his role as a teacher and continue teaching Chi to his friends and family (including Shifu).",
	"links": [
		"https://www.amazon.com/Kung-Fu-Panda-Blu-ray-italien/dp/B01DMUG9KE"
	]
}