{
	"title": "The Hobbit: The Battle of the Five Armies",
	"release_year": "2014",
	"runtime": "144",
	"tags": [
		"Adventure",
		"Fantasy",
		"max",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Ian McKellen",
		"Martin Freeman",
		"Richard Armitage",
		"Cate Blanchett",
		"Ken Stott",
		"Graham McTavish",
		"William Kircher",
		"James Nesbitt",
		"Stephen Hunter",
		"Dean O'Gorman"
	],
	"staff": [
		"Peter Jackson",
		"Fran Walsh",
		"Philippa Boyens",
		"Peter Jackson",
		"Guillermo del Toro",
		"Carolynne Cunningham",
		"Peter Jackson",
		"Eric Monette",
		"Fran Walsh",
		"Howard Shore",
		"Andrew Lesnie",
		"Jabez Olssen",
		"Victoria Burrows",
		"Amy Hubbard",
		"John Hubbard",
		"Liz Mullane",
		"Dan Hennah"
	],
	"links": [
		"https://www.max.com/movies/hobbit-the-battle-of-the-five-armies-extended-edition/61d40ad2-098d-4546-9cd6-172918c605d5",
		"https://www.amazon.com/Hobbit-Trilogy-Unexpected-Desolation-Reg/dp/B00XLSD8BQ"
	],
	"votes": 580727,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTYzNDE3OTQ3MF5BMl5BanBnXkFtZTgwODczMTg4MjE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Bilbo (Martin Freeman) and the Dwarves watch from the Lonely Mountain as the dragon Smaug (Benedict Cumberbatch) attacks Laketown. Bard the Bowman (Luke Evans) manages to break out of prison, fights Smaug, and eventually kills him with the black arrow given to him by his son Bain (Ken Stott). Smaug's falling body crushes the fleeing Master of Laketown, along with his cronies, who were escaping Laketown on a boat with the town's gold.\nBard becomes the new leader of the Laketown people as they seek refuge in the ruins of Dale, while Legolas (Orlando Bloom) travels to investigate Mount Gundabad with Tauriel (Evangeline Lilly). Thorin (Richard Armitage), now struck with \"dragon sickness\", searches obsessively for the Arkenstone, which was stolen by Bilbo, during his encounter with Smaug. Bilbo learns from Balin (Ken Stott) that it would be best if the Arkenstone remains hidden from Thorin, who orders the entrance of the Lonely Mountain to be sealed off.Meanwhile, Galadriel (Cate Blanchett), Elrond (Hugo Weaving) and Saruman (Christopher Lee) arrive at Dol Guldur and free Gandalf (Ian McKellen), sending him to safety with Radagast (Sylvester McCoy).\nAfter battling and defeating the Nazgul, Sauron himself confronts the group, but Galadriel uses the Light of Earendil and banishes Sauron and the Ringwraiths to the East. Azog (Manu Bennett), marching on Erebor with his vast Orc army, sends Bolg (John Tui) to Gundabad to summon their second army. Legolas and Tauriel witness the march of Bolg's army, bolstered by Goblins and giant bats.While Bard and the Laketown survivors shelter in Dale, Thranduil (Lee Pace) arrives with an elf army, supplies and aid, and forms an alliance with Bard, wishing to claim an Elven necklace of white gems from the Mountain. Bard attempts to negotiate and reason with Thorin to avoid war, but the dwarf refuses to cooperate. After Gandalf arrives at Dale to warn Bard and Thranduil of the Orc army who will take Erebor as part of a campaign to revive the kingdom of Angmar (secretly led by Sauron who seeks to reclaim his kingdom), Bilbo sneaks out of Erebor to hand the Arkenstone over to Thranduil and Bard.When Bard and Thranduil's armies gather at the gates of Erebor, offering to trade the Arkenstone for Thranduil's gems and Laketown's share of the gold, Thorin is shocked to learn of the Arkenstone in the Elves' hands and he nearly kills Bilbo in a furious rage. After Gandalf forces Thorin to release Bilbo, the arrival of Thorin's cousin Dain (Billy Connolly) with his Dwarf army worsens matters. A battle of Dwarves against Elves and Men is on the verge of starting, when Wereworms emerge from the ground releasing Azog's army from their tunnels. With the Orcs outnumbering Dain's army, Thranduil and Bard's forces, along with Gandalf and Bilbo, join the battle as some of the Orcs attack Dale.Inside Erebor, initially refusing to fight, Thorin suffers a hallucination before regaining his sanity and leading his company into battle. While the other dwarfs of the company aid Dain's forces, Thorin rides towards Ravenhill with Dwalin (Graham McTavish), Fili (Dean O'Gorman) and Kili (Aidan Turner) to kill Azog and force the Orc army to retreat.Meanwhile, after being banished by Thranduil, despite her and Legolas warning him of Bolg's army, Tauriel (Evangeline Lilly) leaves with Legolas (Orlando Bloom) to warn the dwarfs of Bolg's approaching army, with Bilbo following them using the One Ring. Thorin sends Fíli and Kíli to scout, not knowing they are about to be overrun by a second army of Gundabad Orcs. Bilbo and the Elves arrive too late as Fíli is captured by the Orcs and is executed by Azog.\nKíli, who is hiding underneath the cliff, sees his brother's body dropping down and battles Orcs in a rage. As Thorin battles Azog to avenge Fili's death, Bolg knocks Bilbo unconscious, overpowers Tauriel and then kills Kili who had come to her aid. After Legolas kills Bolg, the Great Eagles arrive with Radagast (Sylvester McCoy) and Beorn (Mikael Persbrandt), and the Orc armies are finally destroyed.Bilbo regains consciousness and finds that Azog has been killed by Thorin, who makes peace with him before succumbing to his own injuries. On Thranduil's suggestion, Legolas leaves to meet with a young Dunedain ranger going by the name Strider. As Tauriel mourns Kili, Thranduil tells her that her love for Kili was real. Grieved by the deaths of Thorin, Fili, and Kili, the people of Laketown, the elves, and the dwarfs bury them inside the tombs of Erebor. As a result, Thorin's cousin Dain is crowned King Under the Mountain, the citizens of Laketown are given the riches promised to them by Thorin, and Dain restores to the elves the riches that King Thror had stolen from them years ago.Following these events, Bilbo bids farewell to the remaining members of Thorin's company and journeys home to the Shire with Gandalf. As the two parts on the outskirts of the Shire, Gandalf admits his knowledge of Bilbo's ring and cautions him against using it. Bilbo returns to Bag End to find his belongings being auctioned off by relatives' family because he was presumed dead. He aborts the sale and tells the other hobbits to leave but finds his home has been almost totally pillaged.Sixty years later, Bilbo receives a visit from Gandalf and runs out to greet him, thus setting in motion the events of The Fellowship of the Ring."
}