{
	"title": "PK",
	"release_year": "2014",
	"runtime": "153",
	"tags": [
		"Comedy",
		"Drama",
		"Sci-Fi",
		"netflix"
	],
	"rating": 8.1,
	"actors": [
		"Aamir Khan",
		"Anushka Sharma",
		"Sanjay Dutt",
		"Boman Irani",
		"Saurabh Shukla",
		"Sushant Singh Rajput",
		"Parikshit Sahni",
		"Amardeep Jha",
		"Plabita Borthakur",
		"Maanvi Gagroo"
	],
	"staff": [
		"Rajkumar Hirani",
		"Rajkumar Hirani",
		"Abhijat Joshi",
		"Vidhu Vinod Chopra",
		"Rajkumar Hirani",
		"Atul Gogavale",
		"Shantanu Moitra",
		"C.K. Muraleedharan",
		"Rajkumar Hirani",
		"Mukesh Chhabra",
		"Nadeem Siddiqui",
		"Snigdha Basu",
		"Sumit Basu",
		"Rajnish Hedao"
	],
	"votes": 204577,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTYzOTE2NjkxN15BMl5BanBnXkFtZTgwMDgzMTg0MzE@._V1_QL75_UY281_CR2,0,190,281_.jpg",
	"description": "A humanoid alien (Aamir Khan) lands on Earth on a research mission in Rajasthan but is stranded when his beacon to his spaceship, a locket around his neck, is stolen. PK, not knowing Earth's customs, learns to fit in among humans by wearing clothes and using money that he steals from couples having sex in \"dancing cars\". He attempts to learn to communicate by grabbing peoples' hands and absorbing their memories through touch, but they chase him away when he tries, (wrongly) interpreting him to be a pervert.The passenger vehicle that carries Bhairon Singh (Sanjay Dutt) strikes him and renders him unconscious. Bhairon takes him to a doctor who declares PK is a person suffering from amnesia. Bhairon assumes the amnesia is as a result of the collision PK has had with his vehicle. Bhairon now knows that the victim of the accident won't be able to complain about the accident. So Bhairon decides to run away. Later, he takes pity, changes his mind and takes PK along with his troop. Over time PK becomes his friend. Later, interpreting the alien's hand-grabbing as sexual interest, Bhairon takes him to a brothel. There, the alien holds a prostitute's hand for six hours and thus learns the Bhojpuri language.The alien travels to Delhi in search of his stolen remote. Due to his strange behavior, the people in the city assume he is tipsy (tipsy translates to Pee-Kay in Hindi) and call him PK. Delhi turns out to be a very large city, and people tell him that only God can help him find his remote. PK tries to find God but is confused by India's various religions and their confusing traditions. He later discovers that a God-man, Tapasvi Maharaj (Saurabh Shukla), has his remote & is publishing it as a lost part of Shivji's Damru that he found in the Himalayas. However, Tapasvi falsely claims to have attained the object from God in the Himalayas and refuses to return it to PK. Bewildered, PK concludes that Tapasvi and other religious heads must be calling a \"wrong number\" to God and, as a result, spreading misunderstandings and meaningless rituals.Meanwhile in Bruges, Jaggu (Anushka Sharma) falls in love with a man named Sarfaraz (Sushant Singh Rajput). Jaggu's father (Parikshit Sahni) objects to their relationship because Sarfaraz is a Muslim from Pakistan; he consults Tapasvi (the family religious consultant & a general commercialized Godman) who predicts that Sarfaraz will betray Jaggu. Determined to prove them wrong, Jaggu proposes to Sarfaraz. She is heart-broken at the wedding chapel when she receives a letter calling off the marriage due to their differences. She returns to India where she becomes a television reporter; she is intrigued while watching PK distributing leaflets about a missing God. Jaggu is angry at running meaningless stories & challenges her boss Cherry Bajwa (Boman Irani) to have her pursue PK's story, who reluctantly agrees. After hearing PK's story, Jaggu devises a plan to expose Tapasvi and recover PK's remote.Jaggu takes PK to a public Durbar held by Tapasvi. There PK proves publicly that Tapasvi's calls to God are going to a wrong number & that the person on the other side is giving him wrong advise. Tapasvi sees that PK's arguments are instantly winning over the public. Jaggu records the entire proceeding & goes to air with PK. PK says on national television that the Managers of God are not able to solve people's problems & they should simply help one another to solve their own problems.Tapasvi tries to intimidate PK & Jaggu, but Jaggu is able to rally public support & PK argues that Managers of God are using fear of God to run a business.Jaggu encourages thousands of people to send in videos of their own experiences with religious heads, calling them \"wrong numbers\". Meanwhile, PK contacts Bhairon Singh who says he will come to Delhi the next day but dies in a bomb blast. Terrorists had planted the bomb to protect their faith in retaliation to PK's protests. Finally, Tapasvi is forced to come into the studio and confront PK on-air. Tapasvi claims he has a direct connection to God and refers to his prediction of Sarfaraz's betrayal as proof. However, PK, who earlier absorbed Jaggu's memories, discovers that Sarfaraz did not write the letter she received. Jaggu contacts the Pakistan Embassy in Belgium where Sarfaraz worked part-time; the embassy tells her that Sarfaraz still loves her and calls them daily to inquire whether she has called. Jaggu and Sarfaraz reconnect and Tapasvi, exposed as a fraud, is forced to return PK's device.In the course of the film, PK falls in love with Jaggu but refrains from telling her because she loves Sarfaraz. He instead records tapes of her voice and fills his suitcases with batteries so that he can listen to the tapes on his home planet. While departing, he lies to Jaggu regarding the content of the tapes; Jaggu, despite knowing the truth, keeps quiet. She later publishes a book about PK.\nOne year later, PK returns to Earth on a new research mission with other several aliens.",
	"links": [
		"https://www.netflix.com/title/70303496"
	]
}