{
	"title": "Predestination",
	"release_year": "2014",
	"runtime": "97",
	"tags": [
		"Action",
		"Drama",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Ethan Hawke",
		"Sarah Snook",
		"Noah Taylor",
		"Madeleine West",
		"Christopher Kirby",
		"Christopher Sommers",
		"Kuni Hashimoto",
		"Sara El-Yafi",
		"Paul Moder",
		"Grant Piro",
		"Grant Piro"
	],
	"staff": [
		"Michael Spierig",
		"Peter Spierig",
		"Michael Spierig",
		"Peter Spierig",
		"Robert A. Heinlein",
		"Paddy McDonald",
		"Tim McGahan",
		"Michael Spierig",
		"Peter Spierig",
		"Peter Spierig",
		"Ben Nott",
		"Matt Villa",
		"Leigh Pickford",
		"Matthew Putland"
	],
	"votes": 310764,
	"cover": "https://m.media-amazon.com/images/M/MV5BY2VhODM5OTUtZDJhMi00MTc5LThjNjYtZWY1M2NlNWU0N2NjXkEyXkFqcGc@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "A time-traveling agent (Ethan Hawke) goes back in time to 1970 in order to catch an infamous terrorist known as the \"Fizzle Bomber\". The agent stops the bomb but is severely injured. The Fizzle Bomber escapes and the agent travels into the future, to 1992, using a Coordinate Transformer Field Kit - a time machine disguised as a violin case - with the help of an unknown person. The agent's face was burned and needs to be repaired using plastic surgery.\nIt is revealed that the agent works for a mysterious organization known as the Temporal Bureau, that sends the so-called \"Temporal Agents\" through time to prevent major crimes. The Fizzle Bomber is the only criminal to elude them thus far. In March 1975, the Fizzle Bomber kills 11,000 people in New York City.After the agent heals, he is sent on a final mission before his mandatory retirement. He travels to the 1970s to work as a bartender in New York City. A male customer, whose \"Unmarried Mother\" (Sarah Snook) pen name is used for writing magazine confessional testimonials, enters the bar to drink alcohol. Cajoled by the bartender, the Unmarried Mother proceeds to tell a story that he considers remarkable: He was born in 1945, abandoned at birth, and placed in an orphanage. Identified as a female, he is raised as \"Jane\". As a young woman, Jane later tries to join the Space Corps and excels in the recruitment tests; but Jane is disqualified when Space Corps doctors discover something about her physiology. A guy named Robertson, informs Jane that he will be in touch with her in case future opportunities present themselves.After being expelled from Space Corps, Jane attends night classes in Cleveland, OH, where she meets and becomes pregnant by an older man who eventually disappears. At this point Robertson meets Jane again & reveals that Spacecorp is just a front used by the agency to recruit talented individuals. After finding out that she is pregnant by the older man, Jane's pregnancy proceeds to full term and, during the delivery of her child, the doctors discover the condition that led to her expulsion: Jane was born inter-sex, with both female and male reproductive organs, allowing Jane to give birth to a baby with her female reproductive organs. However, her baby is kidnapped by an unknown man while still in the hospital. Without her consent, the physician forces Jane to undergo further procedures to remove her female sexual organs - irreparable after birth complications - thereby becoming a man named John.Unmarried Mother concludes the story, and the bartender suddenly reveals that he knows the identity of the older male who left Jane and offers John the chance to kill him under the agreement that Jane will take on the bartender's real job afterwards. They both travel back in time to Cleveland 1963 and the bartender gives John a gun to enact the killing. However, John instead meets Jane, his younger female self, while the bartender/temporal agent uses his time machine to travel into the future (1970) in his final attempt to catch the Fizzle Bomber.However, the agent is knocked unconscious by the bomber. When the agent comes around, he goes back to the bomb location to see the first version of himself trying to defuse the bomb & getting injured in the process. The future version of the agent is the unknown person who helped the past version of the agent to survive the bombing accident (shown in the beginning of the movie)John has sex with his earlier self, Jane, and it is later shown that the bartender is the kidnapper of Jane's baby. The bartender then convinces John to abandon Jane and start working as a Temporal Agent at the Temporal Bureau. The bartender takes John from 1963 to 1985, where he enters the Temporal agent program run by Robertson.Having completed his final mission, the bartender is instructed to choose the time and place of retirement. Upon his arrival at that location, his field kit will be automatically decommissioned. He chooses to retire in a New York City apartment, around the time of the Fizzle Bomber's March 1975 bombing. Before taking his final temporal trip, he receives an envelope from his supervisor, Robertson (Noah Taylor). Upon his arrival, the field kit displays an error message after it is decommissioned (meaning that the field kit did not decommission); however, the retired agent does not report the error and opens the envelope, which contains an instruction related to the March 1975 bombing.The agent eventually discovers that the Fizzle Bomber is an older version of himself. After arguing with his older self, he kills him in a laundromat with a handgun. The older version of the agent argues that he traveled back in time to kill all those people to prevent accidents & deaths those people would have caused in the future.A flashback scene then reveals that the agent is in fact Jane/John - completely changed after the reconstructive surgery at the beginning of the film where he was injured in the blast (Robertson had asked the agent to travel back in time to the bar, & take his final assignment as a bartender to convince his own past self, John, to take up the job at the agency & to conceive his own self by mating John with Jane, kidnapping the baby & then depositing her at the orphanage) - and finishes with John seated in the New York City apartment that he had requested for retirement.At the conclusion of the film a chronological flash of faces occurs of Jane/John. One realizes that not only the baby is conceived by Jane and John themselves, but John also steals the baby and places the child at the orphanage creating a complete loop. The baby placed at the orphanage is his original female self.",
	"links": [
		"https://www.amazon.com/Predestination-Ethan-Hawke/dp/B00QGKXTGU"
	]
}