{
	"title": "Spectre",
	"release_year": "2015",
	"runtime": "148",
	"tags": [
		"Action",
		"Adventure",
		"Thriller",
		"amazon"
	],
	"rating": 6.8,
	"actors": [
		"Daniel Craig",
		"Christoph Waltz",
		"Léa Seydoux",
		"Ralph Fiennes",
		"Monica Bellucci",
		"Ben Whishaw",
		"Naomie Harris",
		"Dave Bautista",
		"Andrew Scott",
		"Rory Kinnear"
	],
	"staff": [
		"Sam Mendes",
		"John Logan",
		"Neal Purvis",
		"Robert Wade",
		"Jez Butterworth",
		"Barbara Broccoli",
		"Michael G. Wilson",
		"Thomas Newman",
		"Hoyte Van Hoytema",
		"Lee Smith",
		"Debbie McWilliams",
		"Dennis Gassner"
	],
	"votes": 471043,
	"cover": "https://m.media-amazon.com/images/M/MV5BMzA5MzFiNDAtYTI0NC00MDE5LTljYTctYTNkODk1OTZlODI5XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "A posthumous message from the previous M (Judi Dench) leads MI6 agent James Bond (Daniel Craig) to carry out an unauthorized mission in Mexico City on the Day of the Dead, where he stops a terrorist bombing plot. Estrella (Stephanie Sigman), a Mexican agent who accompanies Bond on his mission to assassinate Marco Sciarra. Bond kills Marco Sciarra (Alessandro Cremona), the terrorist leader (who makes a reference to the Pale King, and Bond overhears it), and takes his ring, which is emblazoned with a stylized octopus.\nUpon his return to London, Bond is suspended from field duty by Gareth Mallory (Ralph Fiennes), the current M, who is engaged in a power struggle with Max Denbigh (Andrew Scott) (whom Bond dubs \"C\"), the Director-General of the new, privately backed Joint Intelligence Service formed by the merger of MI5 and MI6. C campaigns for Britain to join the global surveillance and intelligence initiative \"Nine Eyes\", and uses his influence to close down the '00' field agent section, which he believes is outdated. Secretly C is an agent for Spectre, heavily involved with their plan to merge nine national intelligence agencies into the Nine Eyes Committee, thus allowing Spectre the power to take over the worldBond calls Moneypenny & shows her a video from the previous M (Judi Dench), sent to Bond, after her death. In that M asked Bond to track Marco if she were to die. She also asks Bond to attend his funeral. Bond asks Moneypenny to investigate Macro's history & associates. The previous M also left Bond a personal folder, which had the letter of guardianship for Bond to his foster father. and a photo, in which the picture of the foster father's real son was burnt.Bond disobeys M's orders and travels to Rome to attend Sciarra's funeral (As that was also mandated by the previous M in her video message to Bond). He seduces Sciarra's widow, Lucia (Monica Bellucci), who tells him Sciarra belonged to an organization of businessmen with criminal and terrorist connections. Bond first saves Lucia from the hit-men send to kill her, & then he seduces her to extract information that the Organization Marco worked for never met, but they called an emergency meeting in Rome to chose Marco's replacement.\nBond uses Sciarra's ring to infiltrate a meeting to select Sciarra's replacement, where he identifies the leader, Franz Oberhauser (Ernst Stavro Blofeld (Christoph Waltz)).\nAfter hearing Oberhauser give the order for the \"Pale King\" to be assassinated. When Oberhauser addresses Bond by name, Bond is pursued across the city in his Aston Martin DB10 by the organization's assassin, Mr. Hinx (Dave Bautista), driving a Jaguar C-X75. Eve Moneypenny (Naomie Harris) informs Bond that the Pale King is Mr. White (Jesper Christensen), a former member of the organization's subsidiary Quantum who had fallen afoul of Oberhauser. Bond asks her to investigate Oberhauser, who was presumed dead 20 years earlier.\nMeanwhile C presents his vision of the 9 eyes initiative to the security heads of 9 countries in Tokyo. But South Africans vote against the initiative and since the resolution is not unanimous it is not adopted. M is happy & tries to counsel C that 9 eyes will be against the spirit of privacy.Bond locates White in Altaussee, Austria, where he is dying of thallium poisoning. He admits to growing disenchanted with Quantum and He tells Bond to find and protect his daughter, psychiatrist Dr. Madeleine Swann (Léa Seydoux), who will take him to L'Américain in order to locate Oberhauser; White then commits suicide. Bond confronts Swann and rescues her from Hinx and his forces. The pair meet Q (Ben Whishaw), who links Oberhauser to Bond's previous missions, identifying Le Chiffre, Dominic Greene and Raoul Silva as agents of the same organization, which Swann identifies as SPECTRE. Swann reveals that L'Américain is a hotel in Tangiers (L'Americain is a place & not a person).\nAt the same time news breaks of a massive terrorist strike in South Africa, which inevitably leads to an emergency meeting of the security heads of state, called by C which leads to 9 Eyes program being sanctioned unanimously. C also closes down the OO program with immediate effect. This pisses M off.Swann takes Bond to L'Américain, a hotel in Tangier, and they discover that White left evidence directing them to Oberhauser's base at a crater in the Sahara (They find a hidden Chamber in Mr White's usual room, which had the coordinates for the base). Taking a train to a remote station, Bond and Swann encounter Hinx, who gets ejected from the train in the ensuing fight (Bond and Swann fight together in tandem and Swann even shoots Hinx in the shoulder), and later they are escorted to Oberhauser's base (after they get down at the nearest train station, a car comes to pick them up). Oberhauser reveals that SPECTRE has funded the Joint Intelligence Service while staging terrorist attacks around the world, creating a need for the Nine Eyes program.In return, C will give SPECTRE unlimited access to intelligence gathered by Nine Eyes, allowing them to anticipate and counteract investigations into their operations. Bond is tortured as Oberhauser discusses their shared history: after Bond was orphaned, Oberhauser's father, Hannes, became his temporary guardian. Jealous of his father's affection for Bond, Oberhauser killed his father, staged his own death, adopted the name Ernst Stavro Blofeld and went on to form SPECTRE and target Bond; he reveals that he is ultimately responsible for several tragedies in Bond's life, such as the deaths of M and Vesper Lynd. Blofeld also shows Swann the video of Bond confronting her father and helping him commit suicide. Blofeld then proceeds to torture Bond on a modern rack. Bond and Swann stun Blofeld by setting off an explosive wristwatch in his face, and the two escape to London to prevent Nine Eyes from going online.In London, Bond and Swann meet M, Q, Bill Tanner (Rory Kinnear) and Moneypenny with the intention of arresting C. Swann and Bond are separately abducted by SPECTRE operatives, while the rest of the group proceed with the plan. After Q succeeds in preventing Nine Eyes from going online, a struggle between M and C ends with C falling to his death. Bond is taken to the ruins of the old MI6 building, scheduled for demolition after Silva's bombing. Blofeld - still alive, but now scarred over his right eye - tells Bond that he must escape before explosives are detonated in three minutes' time, or die trying to save Swann. Bond finds Swann and they escape by boat as the building collapses. Bond shoots down Blofeld's helicopter, which crashes onto Westminster Bridge. Blofeld survives and manages to crawl away from the wreckage, only for Bond to confront him at gunpoint. Blofeld dares Bond to kill him, but Bond refuses and instead leaves him to be arrested by M; he reunites with Swann and the two leave the bridge.The next morning, Bond collects the repaired Aston Martin DB5 from Q and drives away with Swann.",
	"links": [
		"https://www.amazon.com/Spectre-Dave-Bautista/dp/B017HYSN0A"
	]
}