{
	"title": "Olympus Has Fallen",
	"release_year": "2013",
	"runtime": "119",
	"tags": [
		"Action",
		"Thriller",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Gerard Butler",
		"Aaron Eckhart",
		"Morgan Freeman",
		"Angela Bassett",
		"Finley Jacobsen",
		"Dylan McDermott",
		"Rick Yune",
		"Melissa Leo",
		"Radha Mitchell",
		"Cole Hauser"
	],
	"staff": [
		"Antoine Fuqua",
		"Creighton Rothenberger",
		"Katrin Benedikt",
		"Gerard Butler",
		"Ed Cathell III",
		"Antoine Fuqua",
		"Mark Gill",
		"Trevor Morris",
		"Conrad W. Hall",
		"John Refoua",
		"Cathy Sandrich Gelfond",
		"Ryan Glorioso",
		"Amanda Mackey",
		"Derek R. Hill"
	],
	"votes": 295122,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzg3Mjc0YzItZWQyOS00ODY4LTgwZjUtYWRmYzM1MDg1ZDA5XkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Former U.S. Army Ranger Mike Banning (Gerard Butler is the lead Secret Service agent assigned to head the Presidential Detail. He maintains a personal, friendly relationship with President Benjamin Asher (Aaron Eckhart), First Lady Margaret Asher (Ashley Judd) and particularly their son Connor Asher (Finley Jacobsen). During a Christmas evening drive from Camp David to a campaign fundraiser, a tree falls in front of the President's convoy, making the vehicles skid out of control on black ice on a bridge. The lead vehicle in the convoy falls into an icy river while the Presidential limousine teeters on the edge for a minute before falling as well with Margaret still unconscious inside. Banning is able to save President Asher, but Margaret and two other agents die in the crash.Eighteen months later, Banning works at the Treasury Department, within eyesight of the White House. He has been demoted from the Presidential Detail as the sight of him triggers Asher's memories of the night Margaret died. During a meeting between Asher and South Korean Prime Minister Lee Tae-Woo (Keong Sim), Korean-led guerrilla forces, aided by treasonous members of Prime Minister Lee's own detail, which include Dave Forbes (Dylan McDermott), an ex-US Secret Service agent turned private contractor, mount an air and ground assault that results in the capture of the White House.The remaining Secret Service agents within the White House mount an unsuccessful counterattack but inflict casualties on the terrorists. Asher and several top officials are held hostage in the White House bunker where Prime Minister Lee is killed. Before he is killed, Agent Roma (Cole Hauser) alerts the Director of the Secret Service Lynne Jacobs (Angela Bassett) that \"Olympus has fallen.\"\nThe attack has been masterminded by Kang Yeonsak (Rick Yune), an ex-North Korean terrorist who appears to be motivated by hope for a reunification of Korea. Kang seeks to use Asher's hostage status as leverage to force the U.S. military to withdraw from the Korean Peninsula, allowing the civil war to end. He also seeks to destroy all of America's nuclear weapons in their silos and turn the United States into an irradiated wasteland as revenge for the death of his parents when his mother was killed by an American landmine and his father was executed for crimes against North Korea.\nTo accomplish this, he requires the access codes to a system in the bunker called Cerberus: a fail-safe device that self-detonates any U.S. nuclear missiles during an abort, which are held by three top government officials within the bunker, including the President. Asher orders the other two officials to reveal their codes to save their lives, certain that he will not give up his code.During the assault by Kang's forces on the front lawn, Banning joins the side of the White House's defenders. He falls back into the White House, disables the internal surveillance and gains access to Asher's satellite phone, which he uses to maintain contact with Allan Trumbull (Morgan Freeman), the Speaker of the House who is now the Acting President. Authorized to proceed, Banning's first act is to save Connor, who Kang plans to use to force Asher to reveal his Cerberus code since Trumbull notes that Asher would not be able to hold out under those circumstances. Despite resistance, he finds Connor hiding in the walls, thanks to the training Banning had given him, and sneaks him out of the White House before beginning reconnaissance and reducing the terrorists' numbers one by one.This includes Forbes, but not before convincing the traitor to report to Kang that Banning is dead. Meanwhile, Trumbull orders an aerial SEAL assault on the White House, but Kang's team deploys an advanced anti-aircraft gun system in his possession owned by the United States, called the Hydra 6. Discovering this, Banning advises Trumbull and Army Chief of Staff General Edward Clegg (Robert Forster) to abort the mission, but it proceeds, and Kang's henchman Lim (Malana Lea) annihilates the assault force before Banning can stop it. Kang retaliates for the attempted infiltration by killing Vice President Charlie Rodriguez (Phil Austin).After Banning disables Kang's communications, the terrorist tries to execute Secretary of Defense Ruth McMillan (Melissa Leo) outside the front door in front of the media but Banning rescues her and takes out several more of Kang's men in the process. With Kang's forces dwindling, he fakes his own death as well as Asher's death by sacrificing several of his men and the remaining hostages. Kang, Asher, and the few remaining terrorists stay in the bunker, unknown to the outside world. Kang eventually cracks Asher's code knowing that hacking all three codes would have taken more time than Kang had, but focusing on one gave him the time he needed. With that, Kang activates Cerberus as Banning realizes that his apparent suicide was staged. As Kang attempts to escape, Banning kills the remaining terrorists and Kang shoots Asher in the stomach.Banning and Kang then engage in a violent knife fight which ends in Banning killing Kang by stabbing him in the head. He then ultimately disables Cerberus with the assistance of Trumbull. Banning and Asher escape the White House. After the events, Washington begins to heal from the attack and Banning once again becomes head of the Presidential Detail with Banning observing President Asher as he addresses the public.",
	"links": [
		"https://www.amazon.com/Olympus-Has-Fallen-Gerard-Butler/dp/B00ECU39AC"
	]
}