{
	"title": "Homefront",
	"release_year": "2013",
	"runtime": "100",
	"tags": [
		"Action",
		"Crime",
		"Thriller",
		"max",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Jason Statham",
		"James Franco",
		"Winona Ryder",
		"Kate Bosworth",
		"Izabela Vidovic",
		"Marcus Hester",
		"Clancy Brown",
		"Omar Benson Miller",
		"Rachelle Lefevre",
		"Frank Grillo"
	],
	"staff": [
		"Gary Fleder",
		"Sylvester Stallone",
		"Chuck Logan",
		"Sylvester Stallone",
		"Kevin King Templeton",
		"John Thompson",
		"Mark Isham",
		"Theo van de Sande",
		"Padraic McKinley",
		"Barbara Fiorentino",
		"Greg Berry"
	],
	"links": [
		"https://www.max.com/movies/homefront/7287dcbd-0a86-42fb-a067-d7ef7ee3ffbc",
		"https://www.amazon.com/Homefront-Jason-Statham/dp/B00IFQOM32"
	],
	"votes": 132304,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTUwOTAzNzAwMl5BMl5BanBnXkFtZTgwOTc1NDIyMDE@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "In Shreveport, Louisiana, DEA Agent Phil Broker (Jason Statham) is undercover in a biker gang, led by Danny T (Chuck Zito). The bikers go to a bar where they cook crystal Meth. The DEA invade the bar and Broker is revealed to be a DEA agent and escapes during a shootout, along with Danny T and his son Jojo. Broker chases them and Danny T is arrested. Broker shoots Jojo in the leg and he commits suicide by cop. Disturbed, Broker quits his job.2 years later, Broker and his daughter Maddy (Izabela Vidovic) have moved to a small town, where Maddy's deceased mother grew up. Broker has set up a contracting business with his friend Teedo (Omar Benson Miller). One day, while Maddy is playing at school, a classmate named Teddy Klum pushes Maddy and makes fun of her. She responds by punching him and breaking his nose. Broker and Teddy's parents are called by school counselor Susan (Rachelle Lefevre). Susan tells Broker that Teddy is a special needs child, while his parents, Cassie (Kate Bosworth) and Jimmy (Marcus Hester), can be a handful. The local sheriff (Clancy Brown) arrives and attempts to keep the peace. Cassie convinces Jimmy to confront Broker, but Broker attacks him.Susan warns Broker that he needs to be careful. Meanwhile, drug dealer Gator Bodine (James Franco) confronts some local teens for doing business in his area. That night, Cassie, who is Gator's sister, goes to his home and asks him to scare Broker. It is also revealed that she has a drug problem and Gator is her main supplier. The next day, while Broker is horse riding with Maddy, Gator breaks into their home and steals Maddy's cat and one of her stuffed animals. Looking through Broker's personal belongings, he discovers that Broker is a former cop. He finds a photo of an undercover Broker and takes it. He realizes that Broker is responsible for Danny T's arrest.A few days later, Broker asks Susan to help him plan Maddy's birthday party. She apologizes to Teddy by inviting him to the party. Broker is approached by two of Gator's thugs but defeats them. He accuses Jimmy of breaking into his home, but he denies it. Gator tells his ex-girlfriend Sheryl Mott (Winona Ryder) about Broker, since she knows people searching for him. Sheryl meets with Cyrus Hanks (Frank Grillo), a hit-man for Danny T's gang. Sheryl manages to convince Cyrus and he manages to get the information to Danny T, who demands they kill Broker.Broker asks Teedo about Gator, and he learns that Gator is a small-time criminal, who gets away with his crimes because he pays the sheriff. He also mentions that he and Gator eat breakfast every day at the same time at a local diner. The next day, Broker confronts Gator, who is having breakfast with Sheryl. Broker takes a photo of Sheryl and sends it to an old DEA colleague. He goes to Gator's house to investigate. After setting a booby trap, he finds the stuffed animal and Maddy's cat. While playing with the cat, he is knocked out by Gator's thugs. After they torture him, he manages to escape and decides he and Maddy need to leave town. Broker asks Teedo to help him.Sheryl receives a phone call from Cyrus, who says they will kill Broker that night. Gator is on the other side of town, playing pool, therefore creating an alibi, and Cyrus forces Sheryl to go to the house with them. Teedo sees a member of Cyrus's crew in the barn and impales him on a pitchfork. Broker hears the commotion and hides Maddy in the basement, while he takes out the attackers, except for Cyrus. Teedo is shot and Maddy is abducted by Sheryl. Broker and Cyrus fight, but Broker stabs him. The police arrive and Broker chases after Sheryl in the sheriff's car.Cassie arrives at Gator's house to tell him that she plans to quit drugs. When she learns that Gator has kidnapped Maddy, she attempts to save her, but Gator shoots her. Broker arrives, but Gator escapes. Broker chases Gator to a bridge, which is closed off. When Broker's car flips, Gator attempts to shoot Broker, but he misses, and Broker beats him. Before he can shoot Gator, he looks at Maddy and spares his life. Sheryl and Gator are arrested, while Teedo and Cassie are taken to hospital to be treated. Broker visits Danny T in prison and says that when Danny T gets out, he will be waiting."
}