{
	"title": "Wild",
	"release_year": "2014",
	"runtime": "115",
	"tags": [
		"Adventure",
		"Biography",
		"Drama",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Reese Witherspoon",
		"Laura Dern",
		"Gaby Hoffmann",
		"Michiel Huisman",
		"Thomas Sadoski",
		"Keene McRae",
		"W. Earl Brown",
		"Kevin Rankin",
		"Brian Van Holt",
		"Cliff De Young"
	],
	"staff": [
		"Jean-Marc Vallée",
		"Nick Hornby",
		"Cheryl Strayed",
		"Bruna Papandrea",
		"Bill Pohlad",
		"Reese Witherspoon",
		"Yves Bélanger",
		"Martin Pensa",
		"Jean-Marc Vallée",
		"David Rubin",
		"John Paino"
	],
	"links": [
		"https://www.amazon.com/Wild-Reese-Witherspoon/dp/B00RVC0S1G"
	],
	"votes": 140621,
	"cover": "https://m.media-amazon.com/images/M/MV5BZTJlNTQ5NDUtOTVkNi00ODA5LTkyMjktMzM5YTU4N2Y5YzVlXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1995, Cheryl Strayed (Reese Witherspoon) decides to hike more than a thousand miles of the Pacific Crest Trail alone as a way to heal herself following her divorce, the death of her mother Barbara Grey (Laura Dern), and years of reckless, destructive behavior.\nThe film presents a multi-linear narrative, presenting events from Cheryl's hike in chronological order, with frequent flashbacks to earlier points in her life, featuring her (as a child, teenager, and young adult), her mother and brother Leif (Keene McRae), her former husband Pual (Thomas Sadoski), and other people she has known.Before starting the hike, Cheryl checks into a motel & provides her last known address as that to be of her ex-husband. At the motel she packs her gear, which gets really heavy & then hits the trail the next day, fully intending to cover 1000 miles in 3 months. On day 8 Cheryl runs out of food and fuel & has to take the highway to locate some place to have food and to restock. She meets Frank (W. Earl Brown), who is working in the wilderness & asks him for food. Frank takes Cheryl home, where his wife gives her a decent dinner. Cheryl already has bruises all over her body. She re-stocks & rejoins the trail the next day.She then meets Greg (Kevin Rankin), who has been hiking alongside Cheryl & much faster. He tells her to avoid the Sierra Mountain range, which has witnessed the heaviest snowfall in a decade.She remembers her youth when she was on drugs and had sex with boyfriend Joe (Ray Buckley) who got her pregnant, & Cheryl was so angry that she got an abortion. On day 14, Cheryl reaches Kennedy Meadows (100 miles from start point) where Greg is already waiting for her. Ed (Cliff DeYoung) is a helper at Kennedy Meadows and help Cheryl figure out that her boots are too tight & her backpack too heavy. She then remembers the time when her mother was diagnosed with spine cancer & given only a few months to live.On the trail, she meets Jimmy Carter (Mo McRae) who interviews hobos. Day 32 & Cheryl is deep in snow covered mountains & lost for a while. She emerges out of snow & loses her toenail on the rugged mountain terrain. She loses her shoes & is angry as she is reminded of the time when her mother decided to donate her corneas before her death without telling or consulting Cheryl. Cheryl fashions temp boots out of sandals and duct tape & makes it to her next pit stop at 600 miles on day 49. She gets her new boots (the ones she ordered in Kennedy Meadows).Cheryl meets Stacy (Cathryn De Prume) at the 2nd pit stop, who is also hiking the PCT. Stacy tells Cheryl that Greg quit the trail in the snow mountains. Cheryl is proud that she is still there.\nShe then remembers her time in $10/hour therapy with her therapist (Randy Schulman) after her mum died. The therapist tries to counsel Cheryl out of drug use & from having sex with random strangers. Cheryl remembers that she was married to Paul at the time & Paul eventually found out about her sex & drug binges. Paul confronts her & when Cheryl refuses to change, he initiates divorce proceedings against her.Cheryl enters a long desert & quickly runs out of water. The water tank in the middle of the trail, supposed to hold water, turns out to be empty. She finds a water body & meets TJ (Charles Baker) a threatening hunter. TJ leaves her alone in the day but stalks her & comes around just before nighttime & makes rude sexist remarks. Cheryl is scared & is saved by TJ's partner who comes around pulling TJ away back to the hunt. Day 62, she reaches Oregon. In Ashland she meets & sleeps with Jonathan (Michiel Huisman). In Ashland she received a package from her best friend Aimee (Gaby Hoffmann), which encourages her to enjoy a well-deserved rest. Eventually she moves on to cover the remaining 300 miles to her end point.On the trail there is a store which has another package with fresh supplies waiting for Cheryl. The Ranger (Brian Van Holt) does a huge favor for Cheryl by opening the store after it was closed. She meets a few young men, who has been following Cheryl's notes on the trail books & is a huge fan. Cheryl enjoys a drink with his group for a night. She also meets Kyle (Evan Toole) a young boy trekking in the wood with his grandmother (Anne Gee Byrd).On day 94, Cheryl completes the hike & walks across the Bridge of Gods."
}