{
	"title": "No Time to Die",
	"release_year": "2021",
	"runtime": "163",
	"tags": [
		"Action",
		"Adventure",
		"Thriller",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"Daniel Craig",
		"Ana de Armas",
		"Rami Malek",
		"Léa Seydoux",
		"Lashana Lynch",
		"Ralph Fiennes",
		"Ben Whishaw",
		"Naomie Harris",
		"Rory Kinnear",
		"Jeffrey Wright"
	],
	"staff": [
		"Cary Joji Fukunaga",
		"Neal Purvis",
		"Robert Wade",
		"Cary Joji Fukunaga",
		"Phoebe Waller-Bridge",
		"Barbara Broccoli",
		"Michael G. Wilson",
		"Hans Zimmer",
		"Linus Sandgren",
		"Tom Cross",
		"Elliot Graham",
		"Debbie McWilliams",
		"Jemima McWilliams",
		"Mark Tildesley"
	],
	"votes": 451236,
	"cover": "https://m.media-amazon.com/images/M/MV5BZGZiOGZhZDQtZmRkNy00ZmUzLTliMGEtZGU0NjExOGMxZDVkXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "A young Madeleine Swann (Léa Seydoux) (A psychotherapist, daughter of Mr. White, and Bond's love interest who assisted him in his mission in the film Spectre) witnesses the murder of her mother (Mathilde Bourbin) by terrorist Lyutsifer Safin (Rami Malek) (a terrorist on a revenge mission against Spectre who later becomes Bond's adversary) in a failed attempt to murder her father Mr. White (safin claims that White killed his family). Madeleine shoots Safin, but he survives. She flees onto a nearby frozen lake and falls through the ice, but he rescues her.In the present, after the capture of Ernst Stavro Blofeld (Christoph Waltz) (Bond's arch-enemy and foster brother. He is the founder and head of the criminal syndicate Spectre and is now in MI6 custody), Madeleine is in Matera with James Bond (Daniel Craig). Spectre assassins ambush Bond when he visits Vesper Lynd's tomb. Though Bond and Madeleine escape the assassins (one of the assassins tells him that Madeleine is the daughter of Spectre) (Madeleine also gets a call from Blofeld commending her on her sacrifice, while she was in the care with Bond, trying to escape), he believes she has betrayed him, and forces her to board a train out of Matera, ending their relationship.Five years later, the MI6 scientist Valdo Obruchev (David Dencik) is kidnapped by Spectre (he got a call from Safin just before his kidnapping and told him to transfer the research files into a pen drive). The Spectre team is led by the same assassin Primo (Dali Benssalah) who attacked Bond. He makes Valdo steal a vial before kidnapping him.\nWith M's (Ralph Fiennes) approval, Obruchev had developed Project Heracles, a bio-weapon containing nanobots that infect like a virus upon touch and are coded to an individual's DNA, rendering it lethal to the target and their relatives but harmless to others. Bond has retired to Jamaica, where he is contacted by Felix Leiter (Jeffrey Wright) and his CIA colleague Logan Ash (Billy Magnussen), who ask for Bond's help finding Obruchev. They say Obruchev is in Cuba, and that Spectre is gathering there, which cannot be a coincidence.\nBond initially declines, but after Nomi (Lashana Lynch) (A new \"00\" agent who entered active service some time after Bond's retirement and was assigned the 007 number), an MI6 agent and his successor as 007, tells him about Project Heracles. Bond is furious at M for some reason for keeping Obruchev on MI6 payroll and agrees to help Felix.\nTurns out M had sanctioned the development of Heracles off the MI6 books. Not even the British PM knew about its existence.Bond goes to Cuba and meets Paloma (Ana De Armas), a CIA agent working with Leiter. They infiltrate a Spectre meeting to retrieve Obruchev. Still imprisoned in Belmarsh, Blofeld uses a disembodied \"bionic eye\" to view the meeting and release a nanobot mist to kill Bond, but it kills all the Spectre members instead, as Obruchev had reprogrammed the nanobots to infect them on Safin's orders. Bond captures Obruchev and rendezvouses with Leiter and Ash, who is discovered as a double agent working for Safin. Ash kills Leiter and escapes with Obruchev.Bond returns to MI6 HQ and meets M. Bond wants a meeting with Blofeld. Bond insults M, who flatly refuses to arrange a meeting with Blofeld.\nEve Moneypenny (Naomie Harris) (M's secretary and Bond's ally) and Q (Ben Whishaw) (MI6's Quartermaster who outfits \"00\" agents with equipment for use in the field) arrange a meeting between Bond and Blofeld to find Obruchev. Q looks at the USB Bond recovered from Obruchev and tells Bond that the files are a database of DNA info of millions of people from around the world. Using this database, and the weapon, the holder of the weapon can eliminate their targets with precision. But Obruchev modified the coding to eliminate anyone related to the target, so entire families are wiped out. it is now a weapon of mass destruction.Safin coerces Madeleine (he approaches her as her new psychotherapist patient and reveals that he was the man who saved her from drowning in the ice all those yrs ago) to infect herself with a nanobot dose to kill Blofeld, with whom she has been in contact since his imprisonment (Blofeld has been pretending to be mad, and Madeleine was appointed as his doctor). Safin indicates that he knows about MAdeleine's daughter and threatens her, to get Madeleine to do his bidding\nBond is furious to learn that Blofeld has access to Madeleine.\nWhen Bond encounters Madeleine at Blofeld's prison cell, he touches her and unknowingly infects himself with nanobots before she leaves. Blofeld tells Bond that he staged the ambush at Vesper's tomb to make it appear as if Madeleine had betrayed him, continuing his vendetta against his former foster brother. Enraged, Bond attacks Blofeld, unintentionally allowing the nanobots to infect and kill him.Bond tracks Madeleine to her childhood home in Norway and learns she has a five-year-old daughter, Mathilde (Lisa-Dorah Sonnet), whom Madeleine claims is not his. Madeleine tells him that her father murdered Safin's family on Blofeld's orders. She tells Bond that Safin's family owned an island, that was taken over by Spectre and now Safin has it back. Q determines that the Island is in disputed waters between Japan and Russia and has a chemical plant dating back to WW II.\nHaving avenged his family by killing Blofeld and destroying Spectre, Safin and his entourage are in pursuit of Bond, Madeleine and Mathilde. Though Bond defeats the thugs and kills Ash, Safin captures Madeleine and Mathilde.Q enables Bond and Nomi to infiltrate Safin's headquarters on an island missile base, converted to a nanobot factory, where Obruchev is mass-producing the Heracles technology for Safin to kill millions of people. Madeleine is separated from Mathilde. Bond and Nomi put explosives all around Obruchev's lab, when Bond is threatened by Safin to surrender, else he will hurt Mathilde. Bond has no option but to surrender and literally bow before Safin, for the sake of Mathilde, whom he knows is his daughter. But Bond launches a counter attack, when Safin is distracted and forces Safin to retreat with Mathilde.\nDuring the ensuing gunfight, Nomi kills Obruchev by pushing him into a nanobot vat. Madeleine escapes from captivity, while Safin releases Mathilde to die in the explosions about to set off by Bond and Nomi. Madeleine finds Mathilde purely by chance..\nNomi takes Madeleine and Mathilde away from the island to safety; Bond stays to open the island's blast-resistant silo doors. He calls in a missile strike from HMS Dragon to destroy the factory, then kills Safin's men.Safin ambushes and wounds Bond by shooting him. He fights Bond infecting him with a vial containing nanobots programmed to kill Madeleine and Mathilde. Bond kills Safin and opens the silos. Bond contacts Madeleine by radio to say goodbye and tell her he loves her. Madeleine confirms that Mathilde is his daughter. Missiles hit the island, destroying the factory and killing Bond.\nAt MI6, M, Moneypenny, Nomi, Q and Bill Tanner (Rory Kinnear) (M's chief of staff) drink to Bond's memory. As Madeleine takes Mathilde to Matera, she tells her about her father, James Bond.",
	"links": [
		"https://www.amazon.com/Time-Die-Cary-Joji-Fukunaga/dp/B09KFYSFH2"
	]
}