{
	"title": "Blue Jasmine",
	"release_year": "2013",
	"runtime": "98",
	"tags": [
		"Comedy",
		"Drama",
		"Romance",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"Cate Blanchett",
		"Alec Baldwin",
		"Peter Sarsgaard",
		"Sally Hawkins",
		"Joy Carlin",
		"Richard Conti",
		"Glen Caspillo",
		"Charlie Tahan",
		"Annie McNamara",
		"Daniel Jenks"
	],
	"staff": [
		"Woody Allen",
		"Woody Allen",
		"Letty Aronson",
		"Stephen Tenenbaum",
		"Edward Walson",
		"Javier Aguirresarobe",
		"Alisa Lepselter",
		"Patricia DiCerto",
		"Juliet Taylor",
		"Santo Loquasto"
	],
	"votes": 213934,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTc0ODk5MzEyMV5BMl5BanBnXkFtZTcwMzI0MDY1OQ@@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Jasmine (Cate Blanchett) disembarks in San Francisco from a flight that took her away from her old life in New York and arrives at her adopted sister's cluttered apartment in a poor part of the city. A woman who had been sitting next to her on the flight tells her husband that Jasmine had been talking to herself and that she had been buttonholed after mistakenly responding to Jasmine's chatter. Jasmine's sister, Ginger (Sally Hawkins), is shocked to learn that Jasmine traveled first class despite being completely broke.Jasmine reflects on the rich yet trying life that she has lost and tries to start a new one but is constantly drawn back into her expensive habits. In flashbacks, she remembers her past life in New York with her husband, Hal (Alec Baldwin), a wealthy businessman.Some years ago, Ginger and her working-class husband, Augie, (Andrew Dice Clay), visited New York, their first time there in many years. Jasmine rented them a limousine to tour the city and let them stay in the Marriott hotel in order to avoid spending any time with them. When they announced that they had won $200,000 in the lottery and that Augie intended to start a construction business, Jasmine offered Hal's help in investing the money instead. While touring New York, Ginger saw Hal kisses another woman.The woman later appeared at Jasmine's birthday party, and it became clear that Hal was cheating on Jasmine. Ginger debated on whether to say anything to Jasmine, but in the end decided to stay quiet, hoping to spare her sister's marriage.It is later revealed that Hal swindled the money Ginger and Augie had given him. Ginger does not blame Jasmine, but Augie resents her and blames her for the loss of his one chance to have a business of his own. We also learn that Hal committed suicide after being sent to prison for fraud, while Ginger divorced Augie, who physically abused her, and began dating a mechanic called Chili (Bobby Cannavale).Jasmine fancies the idea of becoming an interior designer. She needs to take an online class but has no computer skills. Jasmine takes a job with a dentist, Dr. Flicker (Michael Stuhlbarg), who pesters her with unwanted sexual advances. He tries to force himself on her, but she fights him off and quits the job.Jasmine's life improves when, at a party, she meets a wealthy widower, Dwight (Peter Sarsgaard), a diplomat who aspires to become a congressman. Ginger, influenced by Jasmine's snide remarks about Chili, has an affair with Al (Louis C.K.), whom she meets at the same party. Jasmine seems on a path to happiness with Dwight, who shares her tastes. Jasmine lies to him about her past life, saying that her husband was a doctor who died of a heart attack and that they were childless.After a whirlwind romance, Dwight is about to buy an engagement ring for Jasmine when Augie happens to see them on the street and rails at her over what Hal did to him. Augie also tells Jasmine that her estranged stepson, Danny (Alden Ehrenreich), is living and working nearby in Oakland. Dwight is upset that Jasmine lied to him and calls off their engagement. Jasmine asks to get out of the car, and he leaves her by the side of the road. Jasmine walks all the way to Oakland to see Danny. Danny does not welcome the visit, telling her that he asked Augie not to reveal his location. He says that he is married, finally off drugs, and looking forward to the future, while Jasmine is part of the past he wants to leave behind. Danny then tells her that Augie told him \"The whole story\" and he never wants to see Jasmine again.In a flashback, we see Jasmine finally learning of Hal's many affairs throughout their marriage and confronting him. Hal wants to leave her for a teenage Au Pair. In a moment of blind rage, she called the FBI and informs them about Hal's fraudulent business dealings; this leads to his arrest (and suicide). Danny, while having been extremely bitter at the revelation that the father he had been proud of turned out to be a crook, also does not forgive Jasmine for having denounced him.\nJasmine returns to her sister's apartment and is put out by seeing Ginger back with Chili; she had reunited with him after learning that Al was married. Jasmine and Chili needle each other, and she is furious that Ginger takes his side. Jasmine lies to Ginger and claims that she is going to marry Dwight and moves out immediately.The film ends with Jasmine sitting alone on a park bench, talking to herself about her troubles.",
	"links": [
		"https://www.amazon.com/Blue-Jasmine-Alec-Baldwin/dp/B00H57OXSG"
	]
}