{
	"title": "12th Fail",
	"release_year": "2023",
	"runtime": "147",
	"tags": [
		"Biography",
		"Drama",
		"netflix"
	],
	"rating": 8.9,
	"actors": [
		"Vikrant Massey",
		"Medha Shankr",
		"Anant Joshi",
		"Anshuman Pushkar",
		"Geeta Agrawal Sharma",
		"Harish Khanna",
		"Sarita Joshi",
		"Priyanshu Chatterjee",
		"Vikas Divyakirti",
		"Abhishek Sengupta"
	],
	"staff": [
		"Vidhu Vinod Chopra",
		"Vidhu Vinod Chopra",
		"Anurag Pathak",
		"Aayush Saxena",
		"Vidhu Vinod Chopra",
		"Shantanu Moitra",
		"Rangarajan Ramabadran",
		"Vidhu Vinod Chopra",
		"Jaskunwar Kohli",
		"Mukesh Chhabra",
		"Aayush Saxena",
		"Prashant Bidkar"
	],
	"votes": 128126,
	"cover": "https://m.media-amazon.com/images/M/MV5BNTE3OTIxZDYtNjA0NC00N2YxLTg1NGQtOTYxNmZkMDkwOWNjXkEyXkFqcGc@._V1_QL75_UY281_CR12,0,190,281_.jpg",
	"description": "Born in dacoit-infested Chambal, Manoj Kumar Sharma is the son of a clerk. His father, an honest man, is suspended for hitting a corrupt officer. Manoj prepares cheat slips for his Class 12 exams, as do all his batchmates. The teachers at the local school help students cheat. However, a newly transferred police officer, DSP Dushyant Singh, stops cheating at the school. As a result, all the students, including Manoj, fail the exam. Meanwhile, his father goes to challenge his suspension in the High Court. Manoj and his brother decide to run a travelling rickshaw to help out at home. Manoj's brother is falsely accused of smuggling alcohol on his rickshaw after hitting the local henchman of the MLA after he tries to get their passengers to travel on a bus; for which the police officers frame him. However, Manoj bails his brother out with the help of DSP Dushyant, who advises Manoj to \"stop cheating\" to become an officer like him.One year later, Manoj passes his exams without cheating and pursues a B.A. to become a DSP. His paternal grandmother gives him all her savings as he sets out to study in Gwalior, but he loses all his belongings on the way to a woman who steals them while he dozes off in the bus he is travelling in. He then comes to know that the government has decided to stop the Group I exams for MPPSC for the next three years. This destroys his dream of becoming a DSP. He roams around the streets until he is about to faint, but a local hotel owner near the local railway station feeds him. There he meets Pritam Pandey, who had also come to study for the PSC exam. Pandey's father calls him and tells him to prepare for the UPSC exam in Delhi. Manoj learns about UPSC and travels with Pritam to Delhi to study and become an IPS officer. He meets Gauri Bhaiya, a fellow aspirant on his last attempt to pass, who provides Manoj with work and a place to study. Gauri Bhaiya is unable to clear his final attempt and opens a tea shop named \"Restart\" and also provides guidance to other UPSC aspirants.In his first attempt, Manoj fails the preliminary examination, but with Gauri's help, he reappears and manages to clear it the following year. During a visit to a coaching centre, he meets Shraddha Joshi, a UKPSC aspirant, and falls in love with her. She assumes him to be an aeronautical engineer, and he doesn't clarify that he is a literature graduate. Despite hard work, Manoj fails to clear his main examinations that year; his relationship with Shraddha also suffers when she learns of his deception. Disheartened, Manoj travels to Mussoorie to apologise to Shraddha and confess his love. She advises him to return to Delhi and continue preparing. Instead, Manoj visits his home and finds that his grandmother has passed away. He returns to Delhi, determined to pass the examination.Frustrated, Gauri moves Manoj to his own house and tells him to give up working odd jobs and focus completely on his studies. He finally clears the main examinations, while Shraddha clears her UKPSC examinations as well to become a Deputy Collector. Meanwhile, Pritam, who failed his exams, spreads rumours to Shraddha's family that she has been sleeping with Manoj. Manoj becomes very angry with Pritam but realises that Pritam really wants to be a reporter, but his father pressured him to pursue the UPSC. Manoj advises Pritam to stand up to his father.During the interview round, Manoj answers every question honestly. He reads the letter written and given to him by Shraddha before the interview, asking him to marry her, irrespective of the outcome of the interview. Two months later, the results are declared, with Manoj qualifying for the rank of IPS officer. One year later, Manoj, now an IPS officer, meets DSP Dushyant Singh at the police station in Mandsaur to thank the DSP for encouraging him. Manoj marries Shraddha, and Pritam begins working as a news reporter.",
	"links": [
		"https://www.netflix.com/title/81761732"
	]
}