{
	"title": "Mission: Impossible - Rogue Nation",
	"release_year": "2015",
	"runtime": "131",
	"tags": [
		"Action",
		"Adventure",
		"Thriller",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Tom Cruise",
		"Rebecca Ferguson",
		"Jeremy Renner",
		"Simon Pegg",
		"Ving Rhames",
		"Sean Harris",
		"Simon McBurney",
		"Jingchu Zhang",
		"Tom Hollander",
		"Jens Hultén"
	],
	"staff": [
		"Christopher McQuarrie",
		"Bruce Geller",
		"Christopher McQuarrie",
		"Drew Pearce",
		"J.J. Abrams",
		"Bryan Burk",
		"Tom Cruise",
		"David Ellison",
		"Joe Kraemer",
		"Robert Elswit",
		"Eddie Hamilton",
		"Mindy Marin",
		"Lucinda Syson",
		"Jim Bissell"
	],
	"votes": 415989,
	"cover": "https://m.media-amazon.com/images/M/MV5BZjUwZjg2ZjAtY2RhZi00YmZjLTlhNGQtOWQwNDk1MjhhM2NhXkEyXkFqcGc@._V1_QL75_UX190_CR0,5,190,281_.jpg",
	"description": "After intercepting nerve gas being sold to terrorists (Ethan Hunt get on-board an aircraft, with the nerve gas package, taking off with Benji and Luther helping open the doors remotely. Ethan gets on the plane and secures the nerve gas palette by parachuting it off the plane), Impossible Mission Force agent Ethan Hunt (Tom Cruise) is convinced he can prove the existence of the Syndicate, an international criminal consortium.\nEven the IMF now believes that the Syndicate is a shadow organization committed to inciting revolution in nation states, by enabling acts of terror in countries friendly to Western interests. Ethan has been tracking the Syndicate for over a year.Reporting to an IMF substation to receive his next orders, Hunt is captured by the Syndicate operative Solomon Lane who traps Hunt in a gas chamber. Hunt escapes a torture chamber operated by Syndicate member Janik \"Bone Doctor\" Vinter (Jens Hultén) with the help of disavowed MI6 agent and Syndicate operative Ilsa Faust (Rebecca Ferguson).Meanwhile, CIA director Alan Hunley (Alec Baldwin) and IMF agent William Brandt (Jeremy Renner) appear before a Senate oversight committee, and Hunley succeeds in having the IMF disbanded and absorbed into the CIA, boasting that Hunt will be captured within 24 hours. Hunley argues that the IMF bombed the Kremlin and knowingly gave nuclear launch codes to a known terrorist, and the resultant Russian nuclear warhead came within Milli-seconds of hitting San Francisco.\nBrandt argues that IMF has operated without oversight for 40 years and has brought peace and stability to the world. But the committee says that IMF's methods are indistinguishable from chance.\nCut off from the IMF, Hunt starts following his only lead: a blond man in glasses who captured Ethan at the London Sub Station. The man is not yet identified by the IMF as Solomon Lane (Sean Harris).\nHunley tells Brandt that the Syndicate is a figment of Ethan's imagination that he has created to justify the existence of the IMF.Six months later, Hunt remains on the run. Hunley attacks Ethan's base in Cuba (while he was already in Paris) and finds his research on the Syndicate. Ethan had identified Government agents of every nationality, who were declared dead, and suspected them of working for the Syndicate. He also finds a whole series of worldwide financial disasters, accidents, acts of terrorism, that were linked to these dead agents.\nUnable to find the Syndicate without help, he enlists former colleague Benji Dunn (Simon Pegg), arranging for him to attend the opera Turandot in Vienna to search for Lane, whom he suspects is the Syndicate's leader. Benji and Ethan discover that the opera is being attended by the Austrian Chancellor.\nAs Benji scans the camera feeds, he guides Ethan towards a potential assassin. Ethan also notices a woman moving around the backstage and taking position to shoot at the Chancellor. Ethan attacks the assassin and notices that he is wearing an eye camera, and his pics are being transmitted to Solomon Lane. Ethan notices a 3rd assassin moving into position. He takes the gun of the first assassin and shoots the Chancellor in the shoulder to save his life. Benji attacks the 3rd shooter, and Ilsa shoots him, saving Benji.\nDespite stopping three shooters including Faust, the Austrian Chancellor is killed by a car bomb. Hunt helps Ilsa escape the Opera. Ilsa says that saving Ethan in London put her in a bad position and she had to take the Vienna job to regain her employer's trust, whose identity she won't reveal.\nIlsa jumps out of Ethan's care to make it look like an escape. Lane summons Ilsa and says that she has allowed Ethan to escape twice now. Ilsa tells Lane that Ethan knows about Morocco, but not what's there.Ethan tells Benji that he has been tracking the blond man all over the world. Everywhere he goes he creates an incident that leads to a crisis, a riot or a coup. He says that the Syndicate is Rouge Nation. Since the IMF was shut down, they have been escalating unchecked. Benji agrees to help Ethan find the blond man. Ethan starts by tracking Ilsa. Ilsa had left him a pen drive with directions to Morocco.\nIlsa meets Ethan in Morocco and tells him that the blond man is Solomon Lane and is a former British agent. He created the Syndicate. Lane kept a ledger of all his operatives which was stolen by one of his operatives and is now kept in a secure server of a Moroccan power plant for safe keeping. Lane killed the operative for double crossing him.\nThe secure server can only be accessed if your profile is already Preloaded into the security system. All security data is stored offline in a liquid cooled, underwater server.Brandt recruit's former agent Luther Stickell (Ving Rhames) to find Hunt and prevent Hunley's team from killing him. Using a likeness of Faust created by Hunt, Brandt and Stickell are able to track Hunt, Dunn, and Faust to Morocco, where the three are infiltrating a secure underwater security server beneath a power station.\nAfter having stolen what they believe to be a ledger containing the names of all Syndicate agents, Faust takes the drive from Benji and rides away on a bike. Ethan was clinically dead by being underwater too long, before Ilsa jumped into the water to save him and revive him.\nEthan chases Ilsa followed by his group, and the Syndicate members. Faust manages to escape, but Dunn reveals he had already made a copy of the data.Faust returns to London and attempts to pass the file to her MI6 handler, Attlee (Simon McBurney), who compels her to return to the Syndicate and finish her mission. Attlee says that there is no way to determine if the ledger is authentic and maybe Lane wanted Attlee to have it. He wants Ilsa to authenticate the ledger with Lane. Attlee says that Ilsa has no choice as only a few people know her true identity as an undercover British agent.\nIlsa returns to Lane, only to find that Attlee has wiped the drive, which in fact contained an encrypted, British government \"red box\" (used to transport state secrets) that requires the Prime Minister's bio-metrics in order to be unlocked.\nThe IMF agents know that to open the red box, Lane will try to abduct the British PM.Ilsa is sent by Lane to distract Ethan (and she realizes that it was Attlee who deleted the files from the disc). Ilsa says Hunt has 3 choices, hand her & and the disc over to the CIA, let Ilsa loose to an uncertain fate, or go with her leaving everything behind. Ilsa behind that nobody cares about them and that there will always be a Lane and people to face him.\nLane's men abduct Dunn. They are told they must deliver a Decrypted copy of the drive to Lane by night. Despite the objections of the others, Hunt realizes Lane will always have a plan to acquire the files; believing the only certain way to stop him is to confront him, Hunt agrees to the ultimatum.Brandt contacts Hunley and reveals their location. At a charity auction, the two try to prevent Hunt from attacking the Prime Minister, whom they and Attlee take to a secure room. Hunt, having posed as Attlee, reveals himself and has the Prime Minister confirm the existence of the Syndicate, a classified project to perform missions without oversight, though the Prime Minister said he had ordered the project canceled before it could leave the planning stages, as he considered it to be too extreme. When the real Attlee arrives, Hunt subdues him, and he admits that he had been covering up the existence of the Syndicate since Lane hijacked the project and went rogue. Hunt was finally able to convince Hunley about the existence of the syndicate.Stickell discovers the file actually contains access to billions in currency. Hunt destroys the file and tells Lane he memorized the data, in order to force Lane to release Dunn and Faust in exchange for what he knows. Dunn escapes to Stickell and Brandt while Ethan and Faust are chased by Vinter and his men across the streets of London where they are separated. Faust kills Vinter in a knife fight while Ethan draws Lane into the open and lures him into a tunnel system revealed to be a bulletproof cell where he is gassed, like he did to Ethan at the beginning of the film and taken into custody.Later in the film it is shown that IMF and its operations are being restored and Brandt congratulates Hunley on joining the IMF.\nSometime later, Hunley and Brandt return to the oversight committee, where Hunley secures the reinstatement of the IMF, claiming that his previous efforts to have it disbanded were all to allow Hunt to go undercover. The committee, though skeptical, approves, and outside the chambers, Brandt addresses Hunley as \"Mr. Secretary\".",
	"links": [
		"https://www.amazon.com/Mission-Impossible-V-Rogue-Nation/dp/B012PJVQ7Y"
	]
}