{
	"title": "The Huntsman: Winter's War",
	"release_year": "2016",
	"runtime": "114",
	"tags": [
		"Action",
		"Adventure",
		"Drama",
		"max",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Chris Hemsworth",
		"Chris Hemsworth",
		"Jessica Chastain",
		"Charlize Theron",
		"Emily Blunt",
		"Nick Frost",
		"Rob Brydon",
		"Sheridan Smith",
		"Alexandra Roach",
		"Sope Dirisu",
		"Sam Hazeldine"
	],
	"staff": [
		"Cedric Nicolas-Troyan",
		"Evan Spiliotopoulos",
		"Craig Mazin",
		"Evan Daugherty",
		"Joe Roth",
		"James Newton Howard",
		"Phedon Papamichael",
		"Conrad Buff IV",
		"Lucy Bevan",
		"Dominic Watkins"
	],
	"links": [
		"https://www.max.com/movies/huntsman-winters-war/c955a1dd-632a-415a-80ab-3be9b2ca9644",
		"https://www.amazon.com/Huntsman-Winters-War-Chris-Hemsworth/dp/B01E7RPWKO"
	],
	"votes": 121000,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjY0YTM4ZTAtZjliYS00YzgwLTg0NWEtYzgwNWViMTNiOTQ1XkEyXkFqcGc@._V1_QL75_UY281_CR1,0,190,281_.jpg",
	"description": "With the Mirror at her command, Ravenna was invincible. Ravenna had just conquered a Kingdom by killing its King in a game of chess. Ravenna takes over the Kingdom with her sister Freya at her side.\nRavenna tells Freya that all the women of their blood line are gifted and in time Freya will find her powers, as Ravenna did hers.Long before her death, the evil Queen Ravenna (Charlize Theron) learns that her younger sister Freya (Emily Blunt) is not only engaged in an illicit affair with Andrew: Duke of Blackwood (Colin Morgan), but is carrying his child, who is destined to become fairest of them all.\nRavenna tells Freya that Andrew is engaged to someone else and in time he will deny Freya as well as her daughter.\nSometime after Freya gives birth to a baby girl, Freya discovers that Andrew has murdered their child (Andrew came to meet Freya with the promise to marry her but ends up setting fire to the baby's crib when Freya was not there. When caught, he simply says that he had no choice) and, in a grief-fueled rage, kills him with her long-suppressed ice powers.Freya abandons the kingdom and builds herself a solitary ice palace deep in the north, murdering anyone who opposes her while amassing an army of children and training them so their hearts will be forever hardened. Her army is called the Huntsmen. Freya forbids love in her Kingdom.\nFreya built a castle of ice and turned the lush green lands of the North into a frozen wasteland.\nAs time passed, the children grew to become soldiers.\nThe soldiers include Eric, Sara, Tull (Sope Dirisu), Pippa (Sophie Cookson), Leifr (Sam Hazeldine), and others. The queen sent her army to wage war against the Kings of the North and they repeatedly emerged victorious.Eric (Chris Hemsworth) and Sara (Jessica Chastain), two of her most exceptional warriors, fall in love and plan to elope (Sara gifts Eric a medallion that belonged to her mother), only to learn that Freya is aware of their secret. She confronts them and creates a massive ice wall to separate them before forcing Eric to watch as Sara is killed by her fellow huntsmen. Eric is banished from the Kingdom and his near lifeless body thrown into the river.As Freya's Kingdom continues to rise, Ravenna's Kingdom falls at the hands of Snow White and the Huntsman.\nSeven years later and after Ravenna's death, King William (Sam Claflin) of Tabor comes across Eric who has been living as an outlaw in his Kingdom. William informs him that the Magic Mirror was taken while in route to a place known as \"Sanctuary\". William says that Ravenna's dark magic lives in the mirror and Snow White had vowed to be rid of it, before its darkness cannot be stopped. Eric is the best tracker William knows and wants him to locate the Mirror as it should not fall into the hands of the wrong person. William says that Snow White is unwell, and he suspects that it has to do with the Mirror.Eric reluctantly sets off with Snow White's (Kristen Stewart) (William's wife) dwarf ally Nion (Nick Frost) and his half-brother Gryff (Rob Brydon) to find the Magic Mirror. Eric becomes aware that Freya has been secretly observing their conversation through a mask that projects her consciousness in the form of a Snowy owl, and he destroys it.\nEric asks William to move all his armies to the Northern borders to protect against any attacks from Freya.Since Freya has seen Eric alive, she sends her Huntsman after him. Freya also wants the Mirror which belonged to Ravenna. She knows that the Mirror holds great powers, and she wants the Mirror for her own conquests.Eric tracks the Mirror and comes upon a camp where the Queen's guard (in charge of transporting), killed each other. Eric also finds one arrow (embedded with diamonds) which did not belong to the bandits and those creatures are the ones who have the Mirror now.\nWhile in route, the trio are attacked by a legion of Freya's huntsmen but are rescued by Sara who is revealed to have been alive the entire time. Sara believes she saw Eric run away from the palace and feels betrayed by him. Eric concludes her death was a vision conjured by Freya in order to trick him. Freya made them both see what she wanted them to see.\nSara was in Freya's dungeons for 7 years before she escaped and vowed to find Eric and take her revenge. He reveals that he never stopped loving Sara and they agree to work together.\nSometime later, the quartet is ensnared in a trap laid out by female dwarfs Bromwyn (Sheridan Smith) and Doreena (Alexandra Roach). They convince the female dwarfs to help find the Mirror, who say that the Mirror was stolen by the Goblins (after analyzing the arrow that Eric recovered at the location of the massacred Queen's guard) and agree to take them to their hideout, close to the Sanctuary. Goblins are famed to have a lot of treasure and the female dwarfs ask for the right to carry back as much loot as they can, while Eric and Sara look for the Mirror.The group reaches the Sanctuary, and they defeat the goblins (Sara finds that Eric still wears the Medallion she gave him. Eric was willing to sacrifice his own life to protect Sara, and in turn Sara goes back to save Eric when he gets left behind) who possess the Magic Mirror.\nThe group takes rest in the forest and decide to take the Mirror back at daybreak. That night Sara and Eric make love. The next day, the group is ambushed by Freya. Freya reveals that Sara was just using them to find the mirror the entire time.In the chaos that follows, Nion and Doreena are turned into ice statues and Sara fires an arrow into Eric's chest at Freya's order. Freya departs with the Magic Mirror, but she is unaware that Sara intentionally shot the arrow at a medallion she gave Eric long before, and that he is still alive.Meanwhile, Freya approaches the Mirror and recites a spell that causes a golden liquid to emerge and transform into Ravenna. Ravenna reveals that she sent her spirit into the Mirror before Snow White took her life.Meanwhile, Eric has infiltrated the icy kingdom with help of Gryff and Bromwyn. He attempts to murder Freya but is stopped by Ravenna. When Freya realizes that Sara hadn't actually killed Eric, she sentences them both to death because of Ravenna's influence.\nHowever, Eric is able to convince a few huntsmen to fight against Ravenna and Freya, claiming the love of brethren. After this, Ravenna begins killing many of the huntsmen. Freya realizes that she loves her huntsmen and forms an ice wall between the huntsmen and the sisters. As the remaining huntsmen climb over the wall, the two sisters argue over the icy kingdom.Freya discovers that Ravenna cursed Andrew into murdering her child rather than risk someone being more beautiful than she. Freya is filled with fury at this and turns against her sister, joining forces with Eric and Sara. Freya is fatally wounded, but not before she freezes the magic mirror, as Eric throws his ax, breaking the mirror and destroying Ravenna's spirit.\nAs she dies, Freya witnesses Eric and Sara together and states they are \"lucky\" and then succumbs to her wounds.As the kingdom's inhabitants and huntsmen celebrate their victory, Eric and Sara kiss as they can now be together while Doreena and Nion, and Gryff and Bromwyn, confess their love to each other. Meanwhile a mysterious golden bird flies overhead, hinting that possibly Ravenna's spirit still lives."
}