{
	"title": "White House Down",
	"release_year": "2013",
	"runtime": "131",
	"tags": [
		"Action",
		"Drama",
		"Thriller",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Channing Tatum",
		"Jamie Foxx",
		"Maggie Gyllenhaal",
		"Jason Clarke",
		"Richard Jenkins",
		"Joey King",
		"James Woods",
		"Nicolas Wright",
		"Jimmi Simpson",
		"Michael Murphy"
	],
	"staff": [
		"Roland Emmerich",
		"James Vanderbilt",
		"Roland Emmerich",
		"Bradley J. Fischer",
		"Larry Franco",
		"Laeta Kalogridis",
		"Harald Kloser",
		"Thomas Wander",
		"Anna Foerster",
		"Adam Wolfe",
		"Andrea Kenyon",
		"John Papsidera",
		"Randi Wells",
		"Kirk M. Petruccelli"
	],
	"votes": 238909,
	"cover": "https://m.media-amazon.com/images/M/MV5BNTZkMmRiY2EtOTljZS00MjJjLWFiNDQtNjEwYWE0NWNkYjI4XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "John Cale (Channing Tatum) is a U.S. Capitol Police officer assigned to Speaker of the House Eli Raphelson (Richard Jenkins) after Cale saved Raphelson's nephew's life during a tour in Afghanistan. Cale is struggling to develop a better relationship with his daughter Emily (Joey King), who has a strong enthusiasm for politics. He hopes to impress her by getting a job with the Secret Service, but his hopes are dashed when the interview is conducted by Carol Finnerty (Maggie Gyllenhaal), a former college acquaintance of his who believes him to be unqualified due to a lack of respect for authority and follow-through. After lying to Emily about the outcome of the interview, she and Cale join a tour of the White House. At the same time, U.S. President James Sawyer (Jamie Foxx) proposes a controversial peace treaty between allied countries to remove military forces from the Middle East.Meanwhile, a mercenary disguised as a janitor places a time bomb into a cart, rolls it into the center of the rotunda at the center of the U.S. Capitol building and leaves it just before it explodes, killing scores of innocents and destroying the building's dome. Raphelson, who was in the Capitol, remains unharmed and is taken to an underground command center with Finnerty while Vice President Alvin Hammond (Michael Murphy) is taken aboard Air Force One.The White House is put on lock-down separating Cale from Emily (who had left the tour group to use the restroom). Meanwhile, mercenaries led by Emil Stenz (Jason Clarke) who were disguised as video technicians start killing off most of the Secret Service and take the tour group hostage, but Cale manages to take a gun and escapes a mercenary named Killick (Kevin Rankin) to go find his daughter. Following protocol, retiring Head of the Presidential Detail Martin Walker (James Woods) escorts President Sawyer and his detail to the Presidential Emergency Operations Center. Once Sawyer gains access, Walker kills Sawyer's detail, revealing himself to be the real leader and his desire for revenge over his son who was killed in a botched black ops mission. Cale, who fails to find Emily, kills a mercenary and takes his gun and radio. Using the radio, Cale locates and rescues President Sawyer.Walker and Stenz bring in Skip Tyler (Jimmi Simpson) to hack into the defense system, but they still require Sawyer to activate the nuclear football. They locate the remaining presidential line of succession, kill the Secretary of Defense, and place rest of the line of succession with the hostages. Emily, while hiding, records a video of the mercenaries and uploads it to YouTube before eventually being captured after being accidentally seen by Killick. Walker demands $400 million from the Federal Reserve as ransom for the hostages. Cale and Sawyer manage to reach out to command which tells Cale to get Sawyer out through underground tunnels.At the command center, Finnerty uses Emily's video to discover the mercenaries' identities, discovering that they used to work for various government agencies and radical political groups. They are informed that Stenz, a former Special Forces operative, was disavowed and burned on mission, leading to his capture by the Taliban, making his involvement one of retribution. They also discover that Walker has an inoperable tumor, suggesting his involvement to be a suicide mission and that the attack is not for ransom. Cale and Sawyer find the tunnel gate rigged with an explosive and are forced to escape with a presidential limousine. After giving chase with Stenz on the White House lawn, Cale and Sawyer are flipped into the White House pool after Cale gets distracted by Killick holding Emily at gunpoint. A gunfight erupts which results in an explosion that leaves Sawyer and Cale presumed dead. Hammond is then sworn in as President.When Cale and Sawyer reveal they are still alive, they learn Hammond has approved an aerial incursion by Delta Force to take back the White House. Knowing the mercenaries have Javelin surface-to-air missiles, Cale tries but fails to stop the mercenaries from shooting down the helicopters. Cale gets into a fight with Stenz and ends up dropping his White House passes for himself and Emily while escaping. Having already learned of Emily from the video, Stenz, knowing that she is Cale's daughter, takes her to Walker in the Oval Office. Meanwhile, Tyler finishes the upload to NORAD and launches a missile at Air Force One, killing everyone on board, including Hammond. Raphelson is then sworn in as President and orders an air strike on the White House. Finnerty informs Cale of Raphelson's decision.Walker tells Cale over the White House intercom to surrender Sawyer, or he will kill Emily. Sawyer ultimately surrenders himself to save Emily, knowing Cale could still save them if he was free. Walker reveals to Sawyer that his motive for the attack is to convey a message of American power. Because of Sawyer's dislike for military force, and his backing out of the mission that killed his son, Walker had grown to believe Sawyer was too weak to be president. By launching a nuclear assault on Iran, Walker hoped to regain international respect for America. However, Sawyer refuses to activate the football, though he appeals to Walker that his son didn't die in vain, that the peace treaty was victory. When Walker threatens to kill Emily again, the alarms and sprinklers are set off by Cale setting various rooms on fire.Tyler tries to escape by deactivating the bomb on the tunnel gate but discovers that it has been tampered with, so it goes off rather than disarms when he leaves. Killick finds Cale and tries to kill him but is ambushed by Donnie the White House tour guide (Nicolas Wright), who bludgeons Killick to death with a bronze clock. After freeing the hostages and entrusting Donnie to get them out safely, Cale kills Stenz with a grenade belt after a confrontation. Sawyer attacks a distracted Walker, who ultimately gains the upper hand and uses Sawyer to activate the football before apparently shooting him dead.Using updated launch codes received by an anonymous source, Walker targets various cities in Iran, but before he initiates the launch, Cale crashes into the office in a presidential escort vehicle and kills Walker with a mini-gun. When Emily is told of the air strike, she takes a presidential flag and waves it on the front lawn and gets the fighters to call off the attack. Sawyer reveals himself to be alive as the bullet that hit him hit a pocket watch his wife (Garcelle Beauvais) had given him. Finnerty calls them to reveal that the mercenaries were not called in by Walker and that there is another mastermind behind the attack. Cale realizes who it is and asks Sawyer for his help in exposing the traitor.When Finnerty arrives at the White House with Raphelson, Cale tells them Sawyer was killed. Raphelson then orders troops to be placed back into the Middle East, which would go against Sawyer's peace treaty. Cale reveals Raphelson had orchestrated the attack because of Raphelson's disagreement with Sawyer's treaty and proves it by having Finnerty call the call-back number on Walker's pager. Sawyer then reveals himself and has Raphelson taken into custody, treating his taking of the Presidency as a coup. Sawyer officially employs Cale into the Secret Service and takes him and Emily on a personalized aerial tour of Washington, D.C. on his way to the hospital.",
	"links": [
		"https://www.amazon.com/White-House-Down-Channing-Tatum/dp/B00EVW013E"
	]
}