{
	"title": "Brooklyn",
	"release_year": "2015",
	"runtime": "117",
	"tags": [
		"Drama",
		"Romance",
		"max",
		"amazon"
	],
	"rating": 7.5,
	"actors": [
		"Saoirse Ronan",
		"Emory Cohen",
		"Domhnall Gleeson",
		"Jim Broadbent",
		"Hugh Gormley",
		"Brid Brennan",
		"Maeve McGrath",
		"Emma Lowe",
		"Barbara Drennan",
		"Gillian McCarthy"
	],
	"staff": [
		"John Crowley",
		"Nick Hornby",
		"Colm Tóibín",
		"Finola Dwyer",
		"Amanda Posey",
		"Michael Brook",
		"Yves Bélanger",
		"Jake Roberts",
		"Fiona Weir",
		"François Séguin"
	],
	"links": [
		"https://www.max.com/movies/brooklyn/972eccc1-5962-4772-83cd-c30eba596ae6",
		"https://www.amazon.com/Brooklyn-Saoirse-Ronan/dp/B01A1IZJV0"
	],
	"votes": 151920,
	"cover": "https://m.media-amazon.com/images/M/MV5BMzE4MDk5NzEyOV5BMl5BanBnXkFtZTgwNDM4NDA3NjE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1951, Eilis (pronounced EH-Lish) Lacey (Saoirse Ronan) is a young woman from Enniscorthy, a small town in southeast Ireland. She works weekends at a shop run by the spiteful Miss Kelly (Bríd Brennan). Kelly is extremely judgmental and has a habit of making her customers feel bad about the choices they make in life. She yells at a customer for trying to buy shoe polish on a Sunday, stating that it is already too late and that the customer should have bought it on Saturday, to be ready for Sunday church.Eilis lives with her older sister Rose and mother Mary (Jane Brennan). Rose (Fiona Glascott) has arranged for Eilis to go to the US to find a better future. The trip itself is arranged by Father Flood, who lives in New York.\nKelly admonishes Eilis for being selfish as this would be the end of the road for Rose, and she would be looking after Mary for the rest of her life.\nNancy (Eileen O'Higgins) is Eilis's friend and confidant. Nancy and Eilis attend a community dance party, where Eilis is not asked for a dance. Eilis returns home disappointed and determined to move on with her life.She departs but begins to suffer from seasickness (due to the rough seas) and food poisoning. Her cabin and the neighboring cabin share a common bathroom. Eilis ends up being locked out of the toilet by her cabin neighbors. She is desperate and defecates and then vomits in the first empty bucket that she can find.\nThe woman in the bunk below her, an experienced traveler, helps her, giving her advice. She understands the dirty trick played by their neighbors and locks them out of the bathroom.\nShe supports Eilis's entry to the US (by putting on make up to avoid looking sick, as that would lead to a quarantine upon arrival) and life in Brooklyn, the new home to many Irish immigrants.Eilis lives at an Irish boarding house where she dines each night with the traditionalist landlady Mrs Kehoe (Julie Walters) and her fellow residents, all young women including Diana (Eve Macklin), Patty (Emily Bett Rickards), Dolores (Jenn Murray), Sheila (Nora-Jane Noone) and Miss McAdam (Mary O'Driscoll).\nShe also has a job at a department store Bartoccis but is shy and quiet when interacting with customers, earning the gentle scolding of Miss Fortini (Jessica Paré), her supervisor. Her letters from her sister Rose, back in Ireland, give her homesickness. Eilis is not interested in boys hitting on her in the beginning.When Fortini sees that Eilis is distraught, she calls Father Flood. Eilis is visited by Father Flood (Jim Broadbent), the priest who arranged for her job and accommodation, and he tries to help by enrolling her in bookkeeping classes at the Brooklyn college. Father Flood also pays her tuition for the first semester. He says that Eilis is too clever to work at a department store.\nShe works with Father Flood to arrange a meal for the homeless Irish on Christmas. Father Flood says that these are the men who built the tunnels, the bridges, the skyscrapers and yet have nowhere to go to now in their old age.\nMrs Kehoe respects Eilis as a sensible girl and gives her a room with its own entrance which means that Eilis can come and go as she pleases.At a dance at Parish Hall, she meets Tony (Emory Cohen), from an Italian family. Tony admits that he is Italian and came to the Irish dance as he likes Irish girls. Tony is quickly interested with her and becomes her boyfriend. Tony is a plumber, while Elis is studying to be an accountant. Tony supports Eilis's ambitions and helps her to study by not imposing too much on her time. With these developments, Eilis begins to feel more comfortable in New York.Fortini notices that Eilis has changed into a different girl, much more vibrant and charismatic. Eilis is invited to meet Tony's parents and is trained in Italian table manners by the girls of her boarding house. Tony's family includes father Mr Fiorello (Paulino Nunes), Mrs Fiorello (Ellen David), brothers Frankie (James DiGiacomo) and Laurenzio (Christian De La Cortina). Frankie is a young boy who lets loose that the Italians don't like the Irish.\nEilis is slow to return Tony's declaration of love. When Tony declares his love to Eilis, she only thanks him for a wonderful evening. Eilis realizes her mistake and reciprocates her feelings to Tony the following evening.\nEilis tells Rose about Tony but asks her not to tell anything to their mother. Eilis clears the first-year exams and shares the news with Father Flood.\nTony invites Eilis for a day at Coney Island. Fortini arranges a bathing costume for her, and the girls help to dress her and get prepared. Even Mrs Kehoe says that this is the most Tony will see of her, and she can't afford to put him off. The bathing suit is a hit, and Tony kisses Eilis for the first time.Father Flood informs Eilis that Rose has died suddenly of an undisclosed illness. Father Flood says that Rose only wanted a good life for Eilis. After a trans-Atlantic phone call with her mother reveals that she is struggling to cope, Eilis decides to return home for a visit. Tony insists that if she is leaving, they must get secretly married first. They enter a civil marriage without telling family and friends.Back in Ireland, everybody seems to be conspiring to keep Eilis from returning to Brooklyn. Her best friend is getting married a week after her scheduled return journey, and her mother has already accepted the invitation on her behalf. She is set up on dates with eligible bachelor Jim (Domhnall Gleeson), who is about to inherit property. She takes her sister's place as a bookkeeper on an emergency basis. Eilis starts to feel that she now has the future in Ireland that did not exist when she left and stops opening the letters she receives from Tony.Miss Kelly, her former employer, meets with Eilis and says she has learned that she is already married. Eilis is reminded of the small-town mentality she had escaped, where there are no secrets. She informs her mother of her marriage and that she is leaving for Brooklyn the next day. On the crossing, she plays the role of the experienced traveler, offering words of guidance to a first-time immigrant to the US. The film ends with Eilis and Tony reuniting and happily embracing."
}