{
	"title": "Rio 2",
	"release_year": "2014",
	"runtime": "101",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Jesse Eisenberg",
		"Anne Hathaway",
		"Jemaine Clement",
		"Andy Garcia",
		"Jake T. Austin",
		"Carlinhos Brown",
		"Kristin Chenoweth",
		"Jim Conroy",
		"Rachel Crow",
		"Bernardo De Paula",
		"Bernardo De Paula"
	],
	"staff": [
		"Carlos Saldanha",
		"Don Rhymer",
		"Carlos Kotkin",
		"Jenny Bicks",
		"Yoni Brenner",
		"Bruce Anderson",
		"John C. Donkin",
		"John Powell",
		"Renato Falcão",
		"Harry Hitner",
		"Randy Trager",
		"Christian Kaplan"
	],
	"votes": 102552,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTgzMDczMDYzNl5BMl5BanBnXkFtZTgwMzk2MDIwMTE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The film begins with a vibrant New Year's celebration filling the skies of Rio do Janeiro. In the bustling bird community, we reconnect with Blu (Jesse Eisenberg) and Jewel (Anne Hathaway) they are dancing happily. Jewel tells Blu you're my one and only, Blu to which Blu answers that's a good thing, since I'm the only other one, but on the other side are their children: Carla (Rachel Crow), Bia (Amandla Stenberg), and Tiago (Pierce Gagnon). As they dance and sing with friends Raphael (George Lopez), Pedro (will.i.am), and Nico (Jamie Foxx), Blu realizes their kids are missing. After a chaotic search, he discovers they're with their mischievous babysitter, Tiny (Kate Micucci), tied up to a set of fireworks. In an attempt to prevent disaster, Blu grabs the match, but he accidentally ignites the fireworks, launching himself into the sky and putting on an unexpected pyrotechnic display for the entire city.Meanwhile, Blu's owner Linda (Leslie Mann) and her husband Tulio (Rodrigo Santoro) are navigating the jungle to return a red bird to its home. When they nearly plunge down a waterfall, they're unharmed but find a blue feather drifting down-a clue of more blue macaws in the Amazon. This news sends a ripple of excitement through the bird community, and Jewel is particularly thrilled. She feels Blu's domestic lifestyle is making their kids lose touch with their wild roots, so she suggests a journey to the Amazon to reconnect. Nico and Pedro also tag along to scout for new talent for their Carnival show, hoping to find more than just Raphael's off-key wife, Eva (Bebel Gilberto). But their plans don't go unnoticed by Big Boss (Miguel Ferrer), a sinister logging tycoon who will stop at nothing to continue deforesting the area.As they journey to the Amazon, Blu relies on human tools like a GPS, though the group still manages to get lost. On the ground, they catch the attention of Nigel (Jemaine Clement), the villainous cockatoo turned flightless fortune-teller, along with Gabi, his loyal (and lovesick) poisonous tree frog companion (Kristin Chenoweth), and Charlie, a mute anteater. Eager for revenge on Blu, Nigel hatches a plan to follow them, much to Gabi's delight, and stows away on a boat with them, dreaming of his comeback.Upon reaching the Amazon, Blu is snatched up and taken to a massive flock of blue macaws led by Eduardo (Andy Garcia), who, to Blu's surprise, is Jewel's long-lost father. There's a joyful reunion as Eduardo and Jewel reminisce, though Eduardo is initially skeptical of Blu, who he sees as overly domesticated and overly reliant on human tools. The reunion also introduces Jewel's old friend, the dashing Roberto (Bruno Mars), who charms everyone with his song and remodels a tree for Blu and his family. Blu struggles to fit in and feels overshadowed by Roberto, who embodies the wildness Eduardo values. Eduardo even suspects Blu might be a danger to their way of life and secretly tests him through a series of rigorous jungle tasks to \"prove his worth.\"Meanwhile, Nico and Pedro keep searching for talent, with Carla showing her passion for performance. Their auditions bring unexpected chaos, with predator and prey showing up together, often eating each other mid-performance. They're thrown for a loop when Nigel, disguised, auditions with Gabi, stealing the show with a dynamic rendition of \"I Will Survive.\"Back in the jungle, Blu's attempts to blend in result in a clash with the rival scarlet macaws, led by Felipe (Philip Lawrence). Blu, mistaken for an intruder, unintentionally causes a bet on a high-stakes bird soccer match between the tribes. Despite his efforts, Blu scores the winning goal for the opposing team, deepening Eduardo's disappointment. A disheartened Blu decides to say goodbye to his human roots to support Jewel's happiness in the wild. As he prepares to leave, he senses something is wrong and discovers Linda and Tulio held captive by the loggers. Blu frees them, and the group realizes Big Boss's logging operation is destroying the Amazon.At Blu's urging, Eduardo unites the blue and scarlet macaws to confront Big Boss, and all the animals launch a full-scale resistance. During the chaos, Big Boss himself enters with dynamite, while Blu and Nigel face off for a climactic fight. Gabi attempts to poison Blu with a dart, but she accidentally hits Nigel instead, leading him to perform a dramatic \"final scene,\" believing he's dying. But Bia reveals a twist: Gabi was never poisonous. Overjoyed, Gabi declares her love for a horrified Nigel, while Big Boss meets his end, swallowed by a snake.The jungle is saved, and Eduardo embraces Blu as a true member of the tribe. Jewel and Blu are dancing, Jewel asks to Blu are you sure you can make the Amazon our home with the heath and the creepy bugs, Blu answers I am Mr jungle. Totally wild and very bird, suddenly Blu gets scared when he sees a tarantula and runs to be hugged by Jewel, she tell him maybe we can do summers in Rio, Blu tell to Jewel You're my one and only, Jewel, she is touching her beak with his and exclaims aw!As the film concludes, Nico and Pedro's long-awaited Carnival show kicks off, with Carla joining them for a spectacular finale, while Nigel and Gabi, subdued, are taken back to Rio for further study.",
	"links": [
		"https://www.amazon.com/Rio-2-Anne-Hathaway/dp/B00JM6W5RE"
	]
}