{
	"title": "Need for Speed",
	"release_year": "2014",
	"runtime": "132",
	"tags": [
		"Action",
		"Crime",
		"Thriller",
		"amazon"
	],
	"rating": 6.4,
	"actors": [
		"Aaron Paul",
		"Dominic Cooper",
		"Imogen Poots",
		"Kid Cudi",
		"Rami Malek",
		"Ramón Rodríguez",
		"Harrison Gilbertson",
		"Dakota Johnson",
		"Stevie Ray Dallimore",
		"Michael Keaton"
	],
	"staff": [
		"Scott Waugh",
		"George Gatins",
		"John Gatins",
		"John Gatins",
		"Patrick O'Brien",
		"Mark Sourian",
		"Nathan Furst",
		"Shane Hurlbut",
		"Paul Rubell",
		"Scott Waugh",
		"Ronna Kress",
		"Jon Hutman"
	],
	"votes": 179953,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTQ3ODY4NzYzOF5BMl5BanBnXkFtZTgwNjI3OTE4MDE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Tobey Marshall (Aaron Paul) is a former race car driver who owns a Mount Kisco, New York garage which was owned by his late father, where he and his friends service and tune cars. Struggling to make ends meet, he and his crew, consisting of \"Little Pete\" Coleman, Tobey's protege, Benny \"The Maverick\", the team's air recon pilot, Joe Peck, the team's mechanic, and Finn, the team's computer genius race at night using their modified cars.After a local racing gathering, Dino Brewster (Dominic Cooper), Tobey's former rival also from Mt. Kisco, arrives at his garage with an offer to complete the build of a rare Ford Shelby Mustang worked on by the late Carroll Shelby along with Ford. Dino wants Tobey and his crew to complete the project in exchange for 25% of the car's estimated selling price of $2 million. Tobey is first reluctant, since Dino is his rival and also took Anita, his former girlfriend and Pete's older sister, from him. However, due to the mortgage problems, he accepts the deal.Upon completion of the project, the Shelby Mustang is put up for auction at a party. Tobey, Pete and Dino meet Julia (Imogen Poots), an Englishwoman who agrees to pay $3 million if the car can go over 230 mph, as Tobey claims. The next morning at a nearby track, Tobey drives the Mustang against Dino's objections and sets it to 234 mph, which prompts Julia to buy it for 2.7 million. Enraged by Tobey's humiliation and further by Pete's comments that Tobey is a better driver than him, Dino challenges Tobey and Pete to race his uncle's three Koenigsegg Ageras, illegal in the United States because of their powerful and fast engines, from his uncle's mansion to a bridge over Interstate 684. If Tobey wins, he gets Dino's 75% of the Mustang deal; if he loses, he gives up his 25%.The guys agree to the deal and decide to race. They manage to outmatch Dino, as they race through the highway. However, Dino, who actually took the deal to get revenge on Tobey, T-Bones Pete, causing him to crash the car and sending it over the bridge, killing Pete. Dino escapes, framing Tobey and reporting that they stole his cars, but that there was no third car (Dino had managed to hide his car somewhere, so that Tobey couldn't prove his story) and that they only stole two cars, resulting in Tobey being sent to prison for car theft and involuntary manslaughter.Two years later, Tobey is released on parole, and he sets out to avenge Pete's death. With the help of Benny, he is able to borrow the Shelby Mustang he had worked on from Julia. Tobey wants to enter the De Leon, a winner-take-all race organized by Monarch (Michael Keaton), an anonymous race enthusiast who created it with the winner taking the cars of all the losers; for this, they have to reach San Francisco before the race starts in two days. Julia is adamant to join Tobey as she wouldn't leave her car in the hands of an ex-con. On his way to Detroit, Tobey drives like a maniac, hoping to scare Julia off. Julia is in tears but persists.Meanwhile Dino is a premier car dealership owner which is in trouble. He needs big financing to rescue the venture, but the investor asks Dino to win the De Leon again. On the way with Tobey, Julia realizes that Tobey is racing in the De Leon to avenge Pete.With his crew reassembled, Tobey and Julia initiate a high-speed chase on the streets of Detroit, where Finn works. Using the video footage of the chase and Julia's reasoning about Tobey's innocence, they manage to get an invite from Monarch to the De Leon. However, Dino learning of Tobey's plan, offers his rare Lamborghini Sesto Elemento to anyone who can prevent Tobey from entering the race, and uploads the pictures of the Elemento and Tobey's Mustang to Monarch's site.The pair reach Utah, only to have their Mustang forced off-road by a couple of trucks that surround it by a cliff, whose drivers are also for Dino's prize, but Benny appears in a Sea King helicopter he stole from the National Guard and tows the Shelby Mustang mid-air to the Bonneville Salt Flats, where Peck and Finn await them. Benny is later arrested by the military for theft of the helicopter.After a long drive, Tobey and Julia manage to arrive in San Francisco to register for the race, but Julia has to be hospitalized as a result of the murder attempt by Dino's right-hand man by ramming the Mustang with a truck. Meanwhile, Anita has become aware of Dino's plans after hearing the bet with the Elemento. She searches his computer and discovers the Agera R, which Dino drove when Pete was killed, is stored in a local warehouse in San Francisco. Anita gives Tobey the location of the car, as well as her engagement ring from Dino, and tells him to inform Dino that she is through with him for the death of her brother. Tobey professes his love for Julia and proceeds to take the Koenigsegg to the De Leon.The next morning, Tobey arrives at the meeting on the Pacific Coast Highway and surprises Dino by not only showing up in the Koenigsegg Agera R, but also giving him Anita's ring, revealing to him that Anita knows the truth about Pete's death. The De Leon race is grueling, with the battle between the racers and the California Police Department wrecking a number of cop cars and the racers' cars one by one, leaving Tobey and Dino to race side by side along the Pacific Coast Highway.Tobey manages to take the lead and when Dino tries to T-Bone his car, Tobey slams the brakes, causing Dino's Elemento to flip and crash. However, arriving near the lighthouse, Tobey changes his mind and drives back to the wrecked Elemento and rescues Dino from the burning wreckage, also knocking him out as revenge for Pete's death. Tobey does finish and win the race, but then both of them are arrested by the California Highway Patrol while Tobey looks at the lighthouse, realizing that it's the home of the reclusive Monarch as well as realizing that Little Pete's vision that he spoke about earlier on has become a reality. With the missing Koenigsegg found, Dino is sent to prison for murdering Pete.Tobey serves six months in prison for illegal street racing before he is once again released and reunites with Julia in a brand new red 2015 Ford Mustang. Peck and Finn contact them, saying that they have to go back to Utah to pick up Benny from prison, as Benny is being released for good behavior since he started a fitness program for the inmates. Tobey sits behind the wheel and the two drive off.",
	"links": [
		"https://www.amazon.com/Need-Speed-Theatrical-Aaron-Paul/dp/B00MFDMM3I"
	]
}