{
	"title": "Extremely Wicked, Shockingly Evil and Vile",
	"release_year": "2019",
	"runtime": "110",
	"tags": [
		"Biography",
		"Crime",
		"Drama",
		"netflix"
	],
	"rating": 6.7,
	"actors": [
		"Lily Collins",
		"Zac Efron",
		"Angela Sarafyan",
		"Sydney Vollmer",
		"Macie Carmosino",
		"Ava Inman",
		"Morgan Pyle",
		"James Hetfield",
		"Richard K. Jones",
		"Justin Inman"
	],
	"staff": [
		"Joe Berlinger",
		"Elizabeth Kendall",
		"Michael Werwie",
		"Joe Berlinger",
		"Nicolas Chartier",
		"Michael Costigan",
		"Ara Keshishian",
		"Marco Beltrami",
		"Dennis Smith",
		"Brandon Trost",
		"Josh Schaeffer",
		"Neely Eisenstein",
		"Brandon Tonner-Connolly"
	],
	"votes": 105689,
	"cover": "https://m.media-amazon.com/images/M/MV5BZjc2NGE2NWEtNDhkNy00YTA4LWIyZWMtM2I5NjQ3YjRhZTc4XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1969 Seattle, law student Ted Bundy (Zac Efron) meets Liz Kendall (Lily Collins), a college student and single mother who works as a secretary. Ted plays a song on the jukebox and shares a dance with Liz. Liz takes Ted home where they have sex. The next morning, Liz finds Ted having breakfast with her daughter Molly. The two begin dating and Ted helps Liz raise her young daughter, Molly. Ted drove a Volkswagen Beetle.By 1974, news reports announce the murders of multiple young women, including two (Janice Ott and Denise Naslund) who disappeared in broad daylight at Lake Sammamish. A man resembling Ted, with his hand in a cast, was seen by several people asking women to help him load a sailboat onto a Volkswagen Bug. A composite sketch of the attacker is released and, following hundreds of phone calls, Ted is arrested in 1975.\nIn Ted's possession were trash bags, gloves, a searchlight, ropes, and a crowbar.Carol DaRonch (Grace Victoria Cox) picks Ted out of a police lineup, claiming he had kidnapped her and threatened to kill her before she managed to escape.\nTed gets a lawyer, John O'Connell (Jeffrey Donovan), who gets his bail reduced so he can be back with Liz soon. Ted is released on bail, returning home to Liz who is upset after reading an article about him in the newspaper. He tells her that someone had given the cops his name in Utah that led to his arrest. Ted and Liz are not yet married, though they got engaged when Ted proposed.Ted also sees a black car that has been following him since he got back. He later goes to a library to research law books for his own defense and is kicked out after a patron recognizes Ted from the newspaper, after which he spots the black car outside driving off as Ted approaches it.Ted explains that Carol was shown his picture before the lineup took place, which is why he looked familiar to her, and believes he is being set up.\nJust before the kidnapping trial, O'Connell brings up the disappearance of the women at Lake Sammamish and how his name ended up on the suspect list. DaRonch testifies in court and identifies Ted as her kidnapper. O'Connell tries to defend him by insinuating that she was set up to frame Ted.\nAfter a four-day bench trial, Ted is found guilty of aggravated kidnapping and is sentenced to serve a minimum of one to a maximum of 15 years in the Utah State Prison.\nIn prison, Ted is harassed by other inmates since he committed crimes against women. Detective Mike Fisher (Terry Kinney) from Colorado wants answers from Ted regarding the other murders and also contacts Liz regarding the case.A few weeks later, Colorado authorities charge Ted with the murder of Caryn Campbell, and he is transferred to Aspen, Colorado in 1977. Liz refuses to believe Ted is guilty but the events start to take a toll on her, and she begins drinking alcohol regularly. Even O'Connell gives up on being Ted's lawyer as things get worse. He argues that he is not licensed in Colorado. Liz starts finding comfort with friend and coworker Jerry Thompson.At Pitkin County Courthouse, Ted is soon on trial for the murder of Caryn Campbell. Liz refuses to travel to Colorado for the trial. He is held without bail while the death penalty is being sought against him. His new lawyer, Jim Dumas (Justin McCombs), thinks this is just circumstantial. Ted elects to serve as his own attorney and, as such, is excused from wearing handcuffs or leg shackles.\nDuring a recess, Ted escapes from the courthouse by jumping out of a second story window and running to the mountains but is recaptured after six days. Liz goes to visit him just to tell him that she can't keep supporting him as his case only gets worse (his Utah appeal was also rejected, and he faces 90 years more for the crimes in Colorado). She leaves him with a drawing that Molly made for him.Ted later escapes again after sawing a square in his cell's ceiling. Two women at a sorority house are murdered in Florida, followed by vicious attacks on two more. After Ted is arrested in Florida, he tries to contact Liz, but she hangs up on him.\nSherriff Ken Katsaris (Kevin McClatchy) promises to make sure Ted is put away for a long time. He forcibly has pictures of his teeth taken as he has a chip in the front, which matches a bite mark on one of the victims.\nHe starts to receive a following of women who are fascinated by him, some even claiming they love him. Ted is visited by an old friend, Carole Ann Boone (Kaya Scodelario), who believes he is innocent and moves to Florida to be closer to him.A Pre-trial plea bargain is negotiated in which Ted would plead guilty to killing the two sorority girls, Lisa Levy and Margaret Bowman, and twelve-year-old Kimberly Leach, in exchange for a 75-year prison sentence instead of the death penalty. Ted refuses the bargain. Ted and Carole Ann grow closer as she visits him regularly; the two begin a relationship but Ted continues to reach out to Liz, who is following his trials via television. She carries the guilt of being the person who gave Ted's name to the Seattle authorities in 1975. Ted later proposes to Carole Ann and they marry. Carole Ann gets pregnant with Ted's child.Incriminating physical evidence is provided in court, including a match of a plaster cast of Ted's teeth to the impressions of bite wounds on Levy's buttocks. In under seven hours, the jury convicts Ted of the murders of Levy and Bowman, three counts of attempted first-degree murder, and two counts of burglary. Trial judge Edward Cowart imposes death sentences for the murder convictions to be carried out with an execution by electrocution.Ten years later, Liz receives a letter from Ted and visits him in prison, taking a photograph given to her by a detective. Liz demands the truth, but Ted continues to deny having anything to do with the murders. She then shows Ted the photograph - a crime scene image of one of his decapitated victims - and Ted admits that he sawed her head off. He writes the word \"HACKSAW\" on the moisture laden Plexiglas barrier between the prisoner and the visitors.\nLiz leaves the prison in shock but is met outside by her teenage daughter Molly (Grace Balbo) and her husband Jerry (Haley Joel Osment), and she proclaims that she is okay.As the film ends, archival footage and on-screen text say that Ted was executed in January 1989, aged 42 years old. Ted had confessed to over 30 murders days before, and his ashes were scattered in the Cascade Mountains where he had deposited the remains of numerous victims.Liz and Molly Kendall still live in Washington State, and Liz has been sobered for decades. Carole Ann Boone gave birth to Ted's daughter Rose while he was on death row. A list is also shown of Bundy's known victims.Footage of Bundy's trial is shown, as well as pictures of him with Liz and a number of people cheering for his execution.",
	"links": [
		"https://www.netflix.com/title/81028570"
	]
}