{
	"title": "Atomic Blonde",
	"release_year": "2017",
	"runtime": "115",
	"tags": [
		"Action",
		"Thriller",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Charlize Theron",
		"James McAvoy",
		"John Goodman",
		"Eddie Marsan",
		"Toby Jones",
		"James Faulkner",
		"Roland Møller",
		"Sofia Boutella",
		"Bill Skarsgård",
		"Sam Hargrave"
	],
	"staff": [
		"David Leitch",
		"Kurt Johnstad",
		"Antony Johnston",
		"Sam Hart",
		"A.J. Dix",
		"Eric Gitter",
		"Beth Kono",
		"Kelly McCormick",
		"Tyler Bates",
		"Jonathan Sela",
		"Elísabet Ronaldsdóttir",
		"Lucy Bevan",
		"Zsolt Csutak",
		"Luise Eigner",
		"Marisol Roncali",
		"David Scheunemann"
	],
	"votes": 209799,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjM5NDYzMzg5N15BMl5BanBnXkFtZTgwOTM2NDU1MjI@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "In 1989, before the collapse of the Berlin Wall, MI6 agent James Gasciogne (Sam Hargrave) is shot and killed by KGB agent Yuri Bakhtin, who steals the List, a piece of microfilm concealed in a wristwatch that contains the names of every active field agent in the Soviet Union. The list was provided to Gasciogne by a informant code-name Spyglass, who was promised immunity by the MI6. The list can extend the cold war for another 40 years, so all governments are after it and Yuri is still in Berlin.\nTen days later, Lorraine Broughton (Charlize Theron), a top-level spy for MI6, is brought in to be interrogated by MI6 executive Eric Gray (Toby Jones) and CIA agent Emmett Kurzfeld (John Goodman) about her mission to Berlin. The rest of the movie is in flashback.The day after Gasciogne's death, Lorraine is dispatched to Berlin to recover the List and assassinate Satchel, a double agent who has sold intelligence to the Soviets for years and who betrayed Gascoigne. The list is supposed to contain the identity of Satchel, which is why MI6 is interested in it.\nMeanwhile Spyglass has contacted David Percival MI6 top man in Berlin to inform him that he has delivered the list to Gasciogne. Percival refuses to take Spyglass since Gasciogne didn't show up and he still doesn't have the list. Spyglass says that he has it memorized.\nWhen she arrives in Berlin, she is immediately ambushed by KGB agents working for arms dealer and KGB associate Aleksander Bremovych (Roland Møller), but is able to escape thanks to her main contact, agent David Percival (James McAvoy), showing up to help. Percival says that he has never met Spyglass. Bremovych is also looking for Bkahtin for the list and knows Bakhtin is trying hard to sell it.\nAfter failing to find any immediate leads, Lorraine searches Gascoigne's apartment and discovers a picture of him and Percival, and is then ambushed by the West German police. She realizes only Percival knew she was going to the apartment, and begins to suspect him of being Satchel. Lorraine also encounters Delphine Lasalle (Sofia Boutella), a naive French agent, and enters into a relationship with her. Lasalle has been tracking Lorraine since she landed in Berlin.Bakhtin declares his intention to sell the List to the highest bidder. Percival, having been tipped off, kills him and takes the List for himself. He then meets with Bremovych, which Lasalle photographs.\nPercival meets Lorraine & now informs her that Spyglass has memorized the list and wants to defect. Lorraine is upset that Percival did not reveal this before, else she would have prioritized the extraction of Spyglass. The same night Percival called Eric and told him that he had the list and knew the identity of Satchel. This was not known to Lorraine.\nPercival offers to escort the defector who stole and memorized the List, a Stasi officer code-named Spyglass (Eddie Marsan), and his family across the border to West Berlin. Lorraine offers to help & makes her own arrangements. Percival has shooters on top to take out Spyglass, but Lorraine hides herself and Spyglass behind umbrellas to thwart the shooters. However, Pervical shoots Spyglass and tips off Bremovych's men, and despite Lorraine's best efforts, Spyglass is killed. At this point, it is very clear to Lorraine that Pervical has betrayed her and Spyglass.\nIt turns out that Lasalle was following Lorraine on Percival's instructions. But now Lasalle knows that Percival has met Bremovych & threatens him. Percival warns her that she doesn't know who she is dealing with (referring to Lorraine).\nPercival then goes to Lasalle's apartment and kills her to cover his own tracks. When Lorraine arrives too late to save her, she discovers the photographs taken by Lasalle proving Percival to be Satchel. As Percival burns his safe-house and attempts to flee, Lorraine tracks him down, kills him, and takes the List. Lorraine reveals that he had met Bremovych as the real target that day was not Spyglass, but Lorraine. Percival wanted the KGB to eliminate Lorraine. He knew that Spyglass was a liability to everyone and thus had to eliminated as well and that Lorraine was the real Satchel.Returning to the MI6 debriefing, Lorraine presents photographs as well as spliced audio recordings painting Percival as a traitor, and denies knowing the List's current whereabouts, forcing the agency to close the case. Three days later, she meets with Bremovych in Paris, revealing herself to be Satchel. Lorraine gives him a fake List, but Bremovych admits he knows she set him up. Lorraine kills his henchmen, and before killing him reveals she was manipulating events from the very beginning.\nLater in Paris she meets with Kurzfeld, revealing herself to be an American triple agent planted by the CIA, before returning with him to Langley.",
	"links": [
		"https://www.amazon.com/Atomic-Blonde-Charlize-Theron/dp/B073VD9SWD"
	]
}