{
	"title": "Joy",
	"release_year": "2015",
	"runtime": "124",
	"tags": [
		"Biography",
		"Drama",
		"max",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Jennifer Lawrence",
		"Robert De Niro",
		"Bradley Cooper",
		"Edgar Ramírez",
		"Diane Ladd",
		"Virginia Madsen",
		"Isabella Rossellini",
		"Dascha Polanco",
		"Elisabeth Röhm",
		"Susan Lucci"
	],
	"staff": [
		"David O. Russell",
		"David O. Russell",
		"Annie Mumolo",
		"John Davis",
		"Megan Ellison",
		"Jonathan Gordon",
		"Ken Mok",
		"David Campbell",
		"West Dylan Thordson",
		"Linus Sandgren",
		"Alan Baumgarten",
		"Jay Cassidy",
		"Tom Cross",
		"Christopher Tellefsen",
		"Lindsay Graham",
		"Lisa Lobel",
		"Mary Vernieu",
		"Judy Becker"
	],
	"links": [
		"https://www.max.com/movies/joy/88936403-3039-4fa2-91ff-37abf185ea53",
		"https://www.amazon.com/Joy-Jennifer-Lawrence/dp/B019SG48W2"
	],
	"votes": 146965,
	"cover": "https://m.media-amazon.com/images/M/MV5BNmEyMWJiNzMtZjU3Mi00YzBjLTk3ZDgtMDZkYWVjNmZjMjQ3XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1989, Joy Mangano (Jennifer Lawrence) is a divorced mother of two, working as a booking clerk for Eastern Airlines. She lives with her two young children, her mother, Terri (Virginia Madsen), her grandmother, Mimi (Diane Ladd), and her ex-husband, Tony (Édgar Ramírez), in Quogue New York.\nHer parents are divorced, and her mother and father fight whenever her father shows up at her home. Joy's older half-sister, Peggy (Elisabeth Rohm), is an overachiever who constantly humiliates Joy in front of her children.Peggy and Joy's father Rudy (Robert De Niro) are very close. Terri spends all-day lying-in bed watching soap operas as a means of escape from her life, leaving Joy to run the household. Only Joy's grandmother and her best friend Jackie (Dascha Polanco) encourage her to pursue her inventing ambitions and become a strong successful woman.Mimi knew that Joy was a creator and inventor since her early childhood. Joy was convinced that she didn't need a man in her life to be successful. Mimi wanted Joy to have a life of her own, instead she got mired in the soap opera of her own family's life. Joy had created a dog collar and a flea collar as a kid, but Terri never got her a patent lawyer to guide her properly.\nAll the family members live in the same house and mooch off Joy's meager earnings.\nRudy runs a garage and Joy helps him with the books and accounts, while Peggy helps Rudy in running the business.\nRudy and Tony share the basement. Tony was a singer, when Joy met her through Jackie. Joy was attracted to Tony as he was a dreamer just like herself. Rudy was not supportive of her marriage to Tony, and made snide remarks at her ceremony, and gave her 50:50 odds at his toast. Further along, Tony and Joy have 2 kids, but Tony is useless around the house, and is frequently drunk, and his singing gigs don't earn any money for the house. Soon thereafter they get divorced.After divorcing his third wife, Joy's father starts dating Trudy (Isabella Rossellini), a wealthy Italian widow with some business experience. While on Trudy's boat, Joy drops a glass of red wine, attempts to mop up the mess, and cuts her hands on the broken glass while wringing the mop. Joy returns home and creates blueprints for a self-wringing mop. She builds a prototype with help from the employees at her father's shop.\nShe then convinces Trudy to invest in the product. Peggy is against Trudy funding Joy's product as she argues that Joy has no experience in running a business. She says that the garage is a better business as Peggy has 10 years of experience running it.Trudy helps Joy with a patent attorney, who finds that a Hong Kong man has a similar design for a mop and has a representative in Texas. The same guy owns a manufacturing plant in California. Tony finds this strange but is overruled by Peggy and Rudy.\nJoy and Rudy make a deal with the Texan to manufacture the mop's parts at a low price. In order to avoid a potential lawsuit, Joy also pays $50,000 in royalties to a man in Hong Kong who supposedly has created a similar product.\nWhen the manufacturing company repeatedly bills Joy for faulty parts they create, Joy refuses to pay the increased fees and tells her father, Trudy, and Peggy not to pay them.The shops won't advertise her product, and the big companies don't want to buy her superior product, as they would rather sell mops that break repeatedly, so that their customers keep coming back to them.\nJoy tries to demonstrate her product outside K-Mart but is stopped by the police and even Tony admonishes her for being a bad role model for her children.Joy needs a quick, easy way to advertise her product, and is able to meet with QVC executive Neil Walker (Bradley Cooper), through Tony. Neil is impressed and shows Joy his infomercials, where celebrities sell entrepreneur's products through a telethon system. Neil tells Joy to manufacture 50,000 mops. Neil introduces Joy to his top sellers Joan (Melissa Rivers), Cindy (Drena De Niro) and Todd.\nJoy is advised by Trudy to take out a second mortgage on her home, in order to pay her production costs for the 50,000 mops.The first infomercial (done by Todd) fails. Joy begs Neil for another change citing her 2nd mortgage and $200,000 of additional debt. When Joy goes on QVC herself, Joy and her product become an overnight success. Joy wears her traditional blouse and pants instead of any fancy dress. She freezes on TV but is bailed out by Jackie who calls into the show from New York and breaks Joy out of her stupor by asking a few seed questions to get her going.Things look up for the family, with the mop earning thousands of dollars on QVC, and Terri falls for Toussaint (Jimmy Jean-Louis), a Haitian plumber Joy hired earlier in the film to fix up a leak in Terri's bedroom.Joy's grandmother dies suddenly. Rudy and Trudy send Peggy to California to conduct Joy's company business. Afterwards Peggy tells Joy that she paid the manufacturer when they raised the production fees. Joy says that she is contracted to sell the mops to QVC at a certain price and the increases that Peggy signed up for will put Joy out of business, as she will lose money on every sale. Joy is angry and travels to California to meet with the manufacturer, who refuses to pay her back.Joy also discovers that the manufacturer is about to fraudulently patent her design. Her lawyer reveals that there is nothing they can do to prevent this, and Joy is forced to file for bankruptcy. Rudy and Trudy blame Joy for making the wrong decisions, when they were the ones who advised her on everything. Joy goes through all the contracts and the invoices and discovers that the manufacturers have been defrauding her the entire time she has dealt with them.\nShe confronts the Texan owner and forces him to pay her back. Joy proves that the manufacturers had taken advance royalty from her but had not paid the same to the owner of the patents. She speaks to the Hong Kong owner of the patents directly and figures out that the manufacturer was defrauding him as well.\nJoy gets her molds back for her product, $50,000 in patent payments, the royalties on the overlapping patent, and $50,000 on top, and all of this with interest.Several years later, Joy is wealthy and runs a successful business. She had a 100 other patents to her name. She continues to take care of her father, even though he and Peggy had unsuccessfully sued her for ownership of the company. Terri is the only family member who does not live off Joy, finally finding stability through her relationship with Toussaint.\nJackie and Tony remain Joy's most valued advisers, and the film ends with her helping a young mother develop a new invention."
}