{
	"title": "Philomena",
	"release_year": "2013",
	"runtime": "98",
	"tags": [
		"Biography",
		"Comedy",
		"Drama",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Judi Dench",
		"Steve Coogan",
		"Sophie Kennedy Clark",
		"Mare Winningham",
		"Barbara Jefford",
		"Ruth McCabe",
		"Peter Hermann",
		"Sean Mahon",
		"Anna Maxwell Martin",
		"Michelle Fairley"
	],
	"staff": [
		"Stephen Frears",
		"Steve Coogan",
		"Jeff Pope",
		"Martin Sixsmith",
		"Steve Coogan",
		"Tracey Seaward",
		"Gabrielle Tana",
		"Alexandre Desplat",
		"Robbie Ryan",
		"Valerio Bonelli",
		"Leo Davis",
		"Lissy Holm",
		"Alan Macdonald"
	],
	"votes": 104353,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjA5ODgyNzcxMV5BMl5BanBnXkFtZTgwMzkzOTYzMDE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Journalist Martin Sixsmith (Steve Coogan) has lost his job as a Labor government adviser and is contemplating writing a book on Russian history. The debacle with the government was publicly reported and such Martin essentially made himself unemployable. Kate (Simone Lahbib) is Martin's wife and supports him during his difficult period.\nHe is approached at a party by Jane (Anna Maxwell Martin) who is the daughter of Philomena Lee (Judie Dench). She suggests that he write a story about her mother, who was forced to give up her baby boy, Anthony, fifty years ago. Although he initially scorns the idea of writing a human-interest story, he eventually meets with Philomena and after hearing her shocking story, he decides to investigate further.After a tryst with a young man at a fair in 1951, Philomena becomes pregnant and is sent by her father to Sean Ross Abbey in Roscrea in Ireland. Philomena's mother had died 10 years ago and there was no one to give proper sex education to her. Her father was so ashamed that he told everyone that she was dead and never made any attempts to contact her at the Abbey.During birth, the baby is in breech, but the Reverend Mother refuses to call a doctor and instead declares that Philomena is in God's hands and her pain is also her penance for her sin. Sister Anunciata (Amy McAllister) saved Philomena and her son's life by successfully delivering the baby.\nAfter giving birth, she is forced to work in their laundry for four years to pay off the cost of her stay, with little contact with her son as she was only allowed to see her son for 1 hour a day. Kathleen (Charlie Murphy) was Philomena's best friend. Philomena's son Anthony was best friends with Kathleen's daughter Mary.One day she is distraught to discover that the nuns have adopted out her 3 years old son to a couple without warning or a chance to say goodbye. The couple had come for Mary, but Mary and Anthony were inseparable, so they took Anthony too.\nPhilomena had kept her adopted son secret from her family for fifty years but had visited the convent periodically to try and find him. However, they had repeatedly told her that they were unable to help her find him.\nShe believed the man at the fair was married to her mother's neighbor and that he had been watching her from afar, often following her home at nights.Martin and Philomena begin their search by trying one more time at the convent. The nuns led by Sister Claire (Cathy Belton) are once again polite but unhelpful and claim that the adoption records had been lost in a fire years earlier. They did not, however, lose the contract she was forced to sign decades ago forbidding her from contacting her son. Martin wanted to speak to some of the older nuns to see if they remembered anything about Anthony, but Claire tells Martin that the older nuns are not accessible.However later at a pub, the locals tell him that the convent had deliberately destroyed the records in a bonfire, and that most of the children had been sold for 1000 pounds to rich Americans. Even the famous American actress Jane Russell bought one from the Abbey. He learns that many birth mothers came to Abbey to find their babies, but not one was ever successful.\nPhilomena still defends the nuns and say that they were trying to give the kids a better life.Martin's inquiries reach a dead end in Ireland, and he invites Philomena to accompany him on a trip to the US to search for Anthony. His contacts there help him discover that Anthony was adopted by Doc and Marge Hess, who had renamed him Michael (Sean Mahon). He grew up to be a lawyer and senior official in the Reagan and George H.W. Bush administrations. When Philomena notices Martin in the background of a photo of Michael, he remembers that he met him years earlier while working in the US. They also learn that he has been dead for eight years.Although distraught, Philomena decides that she wants to meet people who knew Michael. They visit a former colleague and discover that he was gay and died of AIDS. They also visit his sister Mary (Mare Winningham), who was adopted at the same time from the convent and learn that they were both emotionally and physically abused by their adoptive parents. Philomena learns about his lover Pete Olssen (Peter Hermann).After avoiding Martin's attempts to contact him, Pete agrees to talk to Philomena. He shows Philomena some videos of his life with Michael. To Martin and Philomena's surprise, they see footage of Michael, dated shortly before he died, at the Abbey where he was adopted, and Pete explains that, although he never told his family, Michael had privately wondered about his birth mother all his life, and had returned to Ireland in his final months to try to find her. Pete informs them that the nuns had told Michael that his mother had abandoned him and that they had lost contact with her. He also reveals that, against his parents' wishes, he had Michael buried in the convent's cemetery.Philomena and Martin go to the convent to ask them where Michael's grave is. Despite Philomena's pleas, Martin angrily breaks into the private quarters and argues with an elderly nun, Sister Hildegarde McNulty (Barbara Jefford), who worked at the convent when Anthony was forcibly adopted. He accuses her of lying to Anthony and denying him the chance to finally reunite with Philomena, purely out of self-righteousness. Hildegarde is unrepentant, saying that losing her son was Philomena's penance for having sex out of wedlock.Martin demands an apology, telling her that what she did was not at par with Christian values, but is speechless when Philomena instead chooses to forgive her of her own volition. Philomena then asks to see her son's grave, where Martin tells her he has chosen not to publish the story. Philomena tells him to publish it anyway.",
	"links": [
		"https://www.amazon.com/Philomena-Judi-Dench/dp/B00IIVK3ZU"
	]
}