{
	"title": "Carol",
	"release_year": "2015",
	"runtime": "118",
	"tags": [
		"Drama",
		"Romance",
		"amazon",
		"netflix"
	],
	"rating": 7.2,
	"actors": [
		"Cate Blanchett",
		"Rooney Mara",
		"Sarah Paulson",
		"Kyle Chandler",
		"Jake Lacy",
		"John Magaro",
		"Cory Michael Smith",
		"Kevin Crowley",
		"Nik Pajic",
		"Carrie Brownstein"
	],
	"staff": [
		"Todd Haynes",
		"Phyllis Nagy",
		"Patricia Highsmith",
		"Elizabeth Karlsen",
		"Christine Vachon",
		"Stephen Woolley",
		"Carter Burwell",
		"Edward Lachman",
		"Affonso Gonçalves",
		"Laura Rosenthal",
		"Judy Becker"
	],
	"links": [
		"https://www.amazon.com/Carol-Cate-Blanchett/dp/B0B8NHHHX3",
		"https://www.netflix.com/title/80058700"
	],
	"votes": 144144,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTczNTQ4OTEyNV5BMl5BanBnXkFtZTgwNDgyMDI3NjE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1952, Therese Belivet (Rooney Mara), a temporary shop-girl and aspiring photographer, is working in Frankenberg's department store in Manhattan during the Christmas season. She sees a glamorous woman across the room looking at a model train set display. Based on Therese's recommendation, the woman, Carol Aird (Cate Blanchett), purchases a set for her daughter as a Christmas present. Carol engages Therese in friendly conversation and when she departs accidentally leaves her gloves behind. Therese takes the gloves home and, using Frankenberg's sales slip with Carol's name and address, mails them to her.Therese's boyfriend, Richard (Jake Lacy), wants her to go to France with him and hopes they will marry, but she feels ambivalent about their relationship. A mutual friend, Dannie (John Magaro), invites Therese to his workplace, The New York Times, offering to introduce her to a photo-editor friend. During the visit, Dannie seizes the opportunity to kiss her. Therese lets him but becomes uncomfortable and leaves. Meanwhile, Carol is going through a difficult divorce from her neglectful husband, Harge (Kyle Chandler), with whom she has a young daughter, Rindy. Carol calls the store to thank the person who returned the gloves and invites Therese to lunch. The two find themselves intrigued with one another. Carol then invites Therese to her home in New Jersey for Christmas. Carol stops to purchase a Christmas tree and Therese takes candid photos of her. Harge arrives unexpectedly to take Rindy to Florida with him and becomes suspicious of Therese because Carol had an affair years before with her best friend, Abby (Sarah Paulson). Therese witnesses their argument and, after Rindy is gone, a distressed Carol takes Therese to the train station and Therese returns home.Carol later calls to apologize and the two agree to meet at Therese's apartment, where Carol surprises her with a gift: a Canon camera and film. Carol had learned that Harge is petitioning the judge to consider a \"morality clause\" against her, threatening to expose her homosexuality and give him full custody of Rindy. She decides to take a road trip West to escape the stress of her divorce proceedings and invites Therese along. Richard, feeling threatened, accuses Therese of having a crush on Carol and predicts that she will soon grow tired of Therese. The two argue and their relationship comes to an end. Therese and Carol depart on their trip. On the second night together in a motel, Therese meets a traveling salesman, Tommy Tucker (Cory Michael).On New Year's Eve, in a motel room in Waterloo, Iowa, Carol kisses Therese for the first time. The two finally acknowledge their strong feelings for each other and make love. The next morning, they discover that the salesman they met is actually a private investigator hired by Harge to obtain evidence against Carol. Carol confronts Tucker, threatening him at gunpoint, but his secret tape recordings have already been sent to Harge. The next day, Therese learns that Carol has flown to New York during the night to fight for custody of her daughter, having asked Abby to drive Therese home. Back in New York, Therese telephones Carol, but knowing that she cannot continue her relationship with Therese if she wants any chance to see Rindy again, Carol remains silent and hangs up, leaving Therese in tears.Therese creates a portfolio of her photos and gets a job at The New York Times, partly based on those she took of Carol. Carol has been seeing a psychotherapist as a condition of the divorce settlement. During a confrontational meeting with both lawyers present, Carol suddenly admits the truth of what the tapes contained and refuses to deny her own nature. Not wanting the legal battle to make a mess of their child's life, she tells Harge that he can have permanent custody of Rindy but demands regular visitation even if supervised. Carol tells Harge that if he were to contest her offer it would get ugly and they were not \"ugly people.\"Carol writes to Therese asking to see her, and they meet in the lounge of the Ritz Tower Hotel. Carol reveals she is going to work as a buyer for a furniture house and has taken an apartment on Madison Avenue. She says the apartment is big enough for two and hopes Therese might like to live with her. Therese declines and a silence hangs between them. Carol informs Therese that she is meeting associates in the Oak Room and if she changes her mind, they can have dinner. Therese remains still and Carol whispers, \"I love you.\" The moment is interrupted by a colleague, Jack, who had not seen Therese in months. Carol rises to leave and touches Therese's shoulder before walking away.Therese accepts Jack's invitation to a party, where she finds that she cannot socially connect with anyone despite the interest of another woman there. Therese rushes to the Oak Room. She enters, scans the crowd, then sees Carol at a table at the rear of the room. Their eyes lock. Carol tilts her head, with a knowing smile that grows as Therese moves toward her."
}