{
	"title": "The Magnificent Seven",
	"release_year": "2016",
	"runtime": "132",
	"tags": [
		"Action",
		"Adventure",
		"Drama",
		"amazon"
	],
	"rating": 6.9,
	"actors": [
		"Denzel Washington",
		"Chris Pratt",
		"Ethan Hawke",
		"Vincent D'Onofrio",
		"Lee Byung-hun",
		"Manuel Garcia-Rulfo",
		"Martin Sensmeier",
		"Haley Bennett",
		"Peter Sarsgaard",
		"Luke Grimes"
	],
	"staff": [
		"Antoine Fuqua",
		"Akira Kurosawa",
		"Shinobu Hashimoto",
		"Hideo Oguni",
		"Nic Pizzolatto",
		"Roger Birnbaum",
		"Todd Black",
		"Simon Franglen",
		"James Horner",
		"Mauro Fiore",
		"John Refoua",
		"Jo Edna Boldin",
		"Elizabeth Coulon",
		"Lindsay Graham",
		"Mary Vernieu",
		"Derek R. Hill"
	],
	"votes": 231755,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTUzNTc0NTAyM15BMl5BanBnXkFtZTgwMTk1ODA5OTE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1879, robber baron & gold mining tycoon Bartholomew Bogue (Peter Sarsgaard) besieges the mining town of Rose Creek. Accompanied by an army of hired guns he forces the residents to work as cheap labor for his gold mine. The townsfolk meet in the church to discuss what they ought to to protect their land and families from Bogue.Being denounced by the residents, Bogue argues that there is little profit in the land that makes up Rose Creek, so he intends to return within three weeks to see that the town has turned up more profit. The men then fire their guns and burn the church down.\nAs the people evacuate, Matthew Cullen (Matt Bomer) calls Bogue out and asks what kind of man he is to harm innocent people. Bogue responds by shooting Matthew dead in front of his wife Emma (Haley Bennett), leading to a number of other citizens being killed by Bogue's men in front of their families. Before leaving, Bogue orders his men to leave the bodies where they lay so that the townspeople can get a good look at them for the next few days.Matthew's wife, Emma Cullen, and her friend Teddy Q (Luke Grimes) ride to the nearest town in search of someone who can help them.In another town, warrant officer Sam Chisolm (Denzel Washington) rides his horse into town. Chisolm enters a saloon and asks the bartender (Chad Randall) about an outlaw \"Powder Dan\". The other men in the saloon draw their weapons on Chisolm, but he is quick with his gun and gets all of the men. He then shoots the bartender dead, knowing that this is Powder Dan. Chisolm orders the people to fetch the sheriff, and all of them run out of the place terrified, except for one man, a gambler named Josh Faraday (Chris Pratt).After Chisolm proves he caught Powder Dan, Faraday is caught up by two brothers that feel he cheated them in a card game. The brothers bring Faraday outside of town to kill him. Faraday distracts them with a card trick, which ends with him shooting one of the brothers dead and shooting the other one in the ear.Emma and Teddy Q come upon US Marshal and warrant officer Sam Chisolm of Wichita, Kansas. She explains the town's situation with Bogue and their desperation in finding someone who can help. Emma and Teddy give Chisolm all the money they have. Still, Chisolm initially declines their proposal until he learns of Bogue's involvement.Chisolm sets out to recruit a group of gunslingers who can help him, starting with gambler & trick shooter Joshua Faraday (Chris Pratt). Chisolm offers to pay for Faraday's horse in exchange for Faraday joining their cause. He agrees. Chisolm then instructs Faraday to travel to Volcano Springs to find a man by the name of Goodnight Robicheaux.Faraday and Teddy arrive at Volcano Springs to witness a gunfight between two men. The first man believes that the second, Billy Rocks, didn't fairly win, so he demands a legit gunfight. As they are set to fire, Billy instead grabs his hairpin and throws it into the other man's chest, killing him. Robicheaux goes around collecting every man's bet. One man refuses until he learns Robicheaux's name, and then pays double out of fear. Robicheaux has a reputation for being a notorious sharpshooter. Faraday and Teddy approach the two men as Robicheaux gets a shave to discuss them joining the team. The two agree after learning it's a paid job.Chisolm and Emma come across a house with a dead man inside. They find Vasquez, a Mexican outlaw who's been squatting in the house. Chisolm is aware of the bounty on Vasquez, but he offers the outlaw a chance to avoid being captured by Chisolm in exchange for joining the team. Vasquez complies.After both parties reunite, they search for a tracker named Jack Horne. They speak to two outlaw brothers on Horne's whereabouts. One brother is struck in the chest with a hatchet, and the other is shot dead. Horne shows up and takes the hatchet. Chisolm asks him to join their team, but Horne walks away without a response.On the road back to town, the group encounters a Comanche named Red Harvest. Chisolm, knowing a little Comanche, speaks to him and asks for his help. Red drops his kill on the ground and cuts out one of its organs to offer it to Chisolm. He reluctantly bites into the organ to prove his loyalty, so Red agrees to join. Horne then joins after tracking the group down.The 7 include Confederate sharpshooter Goodnight Robicheaux (Ethan Hawke), knife-wielding Billy Rocks (Lee Byung-Hun), notorious Mexican outlaw Vasquez (Manuel Garcia-Rulfo), skilled tracker & mountain man Jack Horne (Vincent D'Onofrio), and Comanche warrior Red Harvest (Martin Sensmeier).Arriving in Rose Creek, the seven engage in a gunfight with Bogue's enforcer McCann (Cam Gigandet) and his men, shoot dead 22 of them (Blackstone private detectives guarding the town). Red fires his arrows, Horne chucks his hatchets, Billy stabs several men, and the rest fire their guns at the villains. Robicheaux is more hesitant in shooting, allowing McCann to get away on his horse. They drive the corrupt sheriff Mr Harp (Dane Rhodes) back to Bogue in Sacramento and tell him that Chisolm is waiting for him.Chisholm tells the terrified townspeople that they have seven days before Bogue's army arrives as the ride between Rose Creek and Sacramento takes three days. The seven round up the townsfolk with Emma's help to inspire them to fight for their town and their families.\nSome flee but most are determined to fight. The Seven liberate the men held at the mine, take the explosives stockpiled there and spend the next week fortifying the town and training the people.\nMeanwhile, Bogue kills Harp and orders his Comanche enforcer, Denali (Jonathan Joss), and his right-hand man McCann, to assemble an army.The seven train the townspeople to defend their home and grow fond of them. Billy instructs them on using knives, while Faraday and Robicheaux teach them to shoot. The inexperienced citizens don't get it immediately, but they pick up and do better. Emma manages to be a better shot after having learned from her father as a child. Traps are laid out and people are at their stations.\nRobicheaux, haunted by the horrors of the Civil War and fearing the killing he will be a part of. He tells Chisolm he wants no part of this and he decides to ride away into the night before the battle. Emma offers to take Robicheaux's place.Bogue arrives with an army of mercenaries and attacks the city, which has been rigged with multiple bombs and traps. A massive shootout ensues, during which Robicheaux rejoins the group. McCann shoots and wounds Faraday but is killed by Vasquez.Bogue then unveils his secret weapon, a Gatling gun, with which he decimates the town and kills many of both sides. Realizing they're outgunned, the seven evacuate the townspeople and mount their last stand.\nHorne protects a wounded Teddy from gunfire but is killed by Denali. Denali then prepares to kill Emma. An enraged Red Harvest kills Denali, calling him \"a disgrace.\"Faraday, wounded in the gut, tells Chisolm the have to take out the Gatling Gun, and says Chisholm owes him cover, the two rush out, Faraday grabs a horse and begins a long sweeping charge toward the machine gun. Robicheaux and Billy provide covering fire from the Steeple. The gun crew is bemused as the lone attacker gets closer; they shoot at him.Robicheaux and Rocks are killed by a second round of gunfire. Faraday then rides up to the remainder of Bogue's men and the Gatling gun. After he is riddled with bullets, he makes a final attempt to destroy the Gatling gun, by detonating a stick of dynamite destroying the Gatling gun, the rest of Bogue's men, and himself.Bogue flees into town, where he is confronted by Chisolm. Chisolm quickly takes out the two hired guns confronts Bogue right in front of the burnt-down church. They have a duel, with Chisolm shooting Bogue's gun out of his hand. He shoots Bogue in the leg as he tries running into the church.\nAs Chisolm is strangling Bogue, he reveals that Bogue, and his men sexually assaulted and murdered his mother and sisters during a raid several years earlier. Chisholm has a neck scar; he had barely survived a lynching. After imploring Bogue to repent, Chisholm begins to garrote him. Bogue tries to draw a hidden revolver in his boot, but Emma kills him.In the aftermath, Faraday, Robicheaux, Rocks and Horne are buried in town and honored by the people of Rose Creek as heroes.\nCullen remarks that their heroism made them legends and that it was \"magnificent\".",
	"links": [
		"https://www.amazon.com/Magnificent-Seven-Antoine-Fuqua/dp/B0D5BTBZ3P"
	]
}