{
	"title": "Hell or High Water",
	"release_year": "2016",
	"runtime": "102",
	"tags": [
		"Crime",
		"Drama",
		"Thriller",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Chris Pine",
		"Ben Foster",
		"Jeff Bridges",
		"Gil Birmingham",
		"Dale Dickey",
		"William Sterchi",
		"Buck Taylor",
		"Kristin K. Berg",
		"Keith Meriweather",
		"Jackamoe Buzzell"
	],
	"staff": [
		"David Mackenzie",
		"Taylor Sheridan",
		"Peter Berg",
		"Carla Hacken",
		"Sidney Kimmel",
		"Julie Yorn",
		"Nick Cave",
		"Warren Ellis",
		"Giles Nuttgens",
		"Jake Roberts",
		"Jo Edna Boldin",
		"Richard Hicks",
		"Tom Duffield"
	],
	"votes": 256457,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTg4NDA1OTA5NF5BMl5BanBnXkFtZTgwMDQ2MDM5ODE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In West Texas, divorced father Toby Howard (Chris Pine) and his ex-con brother Tanner (Ben Foster) carry out early morning robberies of two branches of the Texas Midlands Bank. At the first branch in Archer City they attack the bank when the teller Elsie (Dale Dickey) opens the doors for the first time in the morning. Then they wait for the bank manager Mr Clauson (William Sterchi) to arrive, who has the keys to the safe, which carries all the cash.\nThen they travel to the Olney branch and Tanner pulls a gun on the teller (Kristin Berg) to empty the cash counters. They take only small bills and avoid the 50's and the 100's. No bundles (as they have ink packs in them), only loose cash.\nThough the robberies are well-planned, Tanner's wild nature leads to him taking unnecessary risks, frustrating Toby. Toby insists that they should hit the banks early in the morning when they are empty. The brothers bury the car used on the first day, after the 2 robberies are done, in a huge hole in the ground on their ranch.Two Texas Rangers, Marcus Hamilton (Jeff Bridges) and Alberto Parker (Gil Birmingham), are on the case. Hamilton, who is close to retirement, quickly determines the brothers' methods and personalities. Since the amount involved is too small (a few thousand dollars) and Texas Midland has no branches outside of Texas, the FBI are not looking to get involved in the case. Hamilton determines that the criminals are after a predetermined amount they are trying to raise, and it will take them a few branches to get there.Tanner was in jail, while Toby looked after their sick mother. Due to the medical expenses, the ranch went into debt and disrepair. Toby had to take out loans through a reverse mortgage to survive. Toby lost his wife to divorce, along with his 2 sons, during this period. Tanner had gone to jail for killing his own father, who was very abusive towards Tanner's mother. Tanner's mother never forgave Tanner for this.\nToby has not seen his own sons for over a year now.Meanwhile, Tanner robs another bank (not a Texas Midland branch) while Toby unknowingly waits at a nearby diner where he chats with a waitress Jenny Ann (Katy Mixon). Toby leaves $200 for the waitress. Toby is livid with Tanner and has to bury this car as well. They take a Cadillac that was stored at their ranch.\nHamilton interviews the teller Natalie (Amber Midthunder) and the waitress.The brothers take the stolen money to an Indian casino in Oklahoma to be laundered. They exchange the stolen bills for chips, some of which Tanner uses to gamble. While at the casino, a prostitute (Melanie Papalia) tries to work Toby, but Tanner intervenes and chases her off.\nToby then has the casino convert them into a check made out to the Texas Midlands Bank - the same bank they robbed. With untraceable funds and gambling as a cover for how they were acquired, the brothers head back to Texas.It is revealed that the brothers' mother died recently, leaving their ranch in debt due to a reverse mortgage provided by the Texas Midlands Bank. If the debt is not paid off in a few days, the ranch will be foreclosed.\nToby is determined to pay off the mortgage to ensure a comfortable life for his estranged sons because oil has recently been discovered on their land. They rob Texas Midlands as a form of frontier justice.\nThe brothers need $43,000 to pay off the reverse mortgage and the taxes, which the bank has paid. Their lawyer tells them that the bank swindled their mother by paying her only $25,000 on the reverse mortgage and keeping the entire land as lien against the loan. The lawyer also tells them that to really cover their tracks, they should get Texas Midland bank to handle the trust funds.\nThe boys use the loose cash from the casino to purchase another car for their last set of robberies.Hamilton stakes out another branch of the Texas Midlands Bank, but the brothers don't show. Hamilton figures a pattern to the robberies and determines their next target. Hamilton and Parker are in route when the final robbery indeed occurs there. Pressed for time, the brothers proceed with the heist even though the bank is full of customers. A shoot-out ensues when a security guard and an armed civilian fire at the brothers and Tanner kills the guard and the civilian, but Toby is shot in the hip.The brothers race out of town, with a posse of armed townspeople in hot pursuit. After gaining some distance, Tanner stops and fires an automatic rifle at the posse, forcing them to retreat. The brothers then split, with Toby taking the money using another vehicle, while Tanner creates a diversion. He draws the lawmen off the trail to a desert mountain ridge where he takes potshots with a sniper rifle, killing Parker. Hamilton uses a local resident's knowledge of the area to circle behind Tanner and kills him with a single head shot using the local's rifle.During the standoff, Toby (concealing his bleeding, but minor, hip bullet wound) passes through a police checkpoint without incident, then successfully launders the stolen cash at the casino, where he sees the news report of his brother's death on TV. He takes the casino's check to the bank just in time to avoid the ranch's foreclosure and deeds the ranch into a family trust.After retirement, Hamilton visits his former office to learn that the Rangers have cleared Toby as a suspect, as his record is clean, and he has no motive to steal since the new oil wells earn more in a month than the total stolen in all of the robberies. The money from the ranch's oil wells is deposited at the Texas Midlands Bank, which refuses to co-operate with the investigation for fear of losing management of the family's trust fund.Hamilton visits Toby's ranch, and while they stay civil, Hamilton states that he knows Toby masterminded and took part in the robberies but wishes to know the reason. Toby does not explain, only implies that he did what he did for his sons. Their conversation is interrupted when Toby's ex-wife Debbie (Marin Ireland) and sons arrive. The ranch belongs to the trust and thus to them; Toby is only there to visit and fix up the house. As Hamilton departs, Toby suggests they meet again soon to \"finish the conversation,\" to which Hamilton agrees.",
	"links": [
		"https://www.amazon.com/Hell-High-Water-Jeff-Bridges/dp/B01K5CB2DG"
	]
}