{
	"title": "Crimson Peak",
	"release_year": "2015",
	"runtime": "119",
	"tags": [
		"Drama",
		"Horror",
		"Mystery",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Mia Wasikowska",
		"Jessica Chastain",
		"Tom Hiddleston",
		"Charlie Hunnam",
		"Jim Beaver",
		"Burn Gorman",
		"Leslie Hope",
		"Doug Jones",
		"Doug Jones",
		"Jonathan Hyde",
		"Bruce Gray"
	],
	"staff": [
		"Guillermo del Toro",
		"Guillermo del Toro",
		"Matthew Robbins",
		"Guillermo del Toro",
		"Callum Greene",
		"Jon Jashni",
		"Thomas Tull",
		"Fernando Velázquez",
		"Dan Laustsen",
		"Bernat Vilaplana",
		"Robin D. Cook",
		"Thomas E. Sanders"
	],
	"votes": 159994,
	"cover": "https://m.media-amazon.com/images/M/MV5BNjg2NzcxYzAtZDdjYS00ZTZiLTg5ZmMtZmQ1ZjBhNGQxMDI0XkEyXkFqcGc@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "In 1887 Buffalo, N.Y., Edith Cushing (Mia Wasikowska), the young daughter of wealthy American businessman Carter Cushing (Jim Beaver), is visited by her mother's ghost who warns her, \"beware of Crimson Peak.\" Edith was still just 10 years old, and her mother had died a few years ago by black cholera. Edith did not understand the warning at the time.Fourteen years later, Edith is now a budding author who prefers penning ghost stories to writing the romance novels that her editor Ogilvie (Jonathan Hyde) wants. Edith is a free spirit and is not afraid to challenge the social conventions of the time.\nEdith realizes that her feminine handwriting gives her away and decides to type her stories from now on.\nShe meets Sir Thomas Sharpe (Tom Hiddleston), an English baronet who has come to the United States seeking investors, including Edith's father, for his clay-mining invention. Thomas likes Edith's writing and charms his way into her good books.\nDisdaining privileged aristocracy and unimpressed with Sharpe's prototype and previous failures to raise capital, Cushing rejects Thomas's proposal. Cushing says that he worked as a steel worker on buildings before he owned them, and Thomas never worked a single day in his life.\nCushing tells Edith that there is something about Thomas that he doesn't like.\nEdith notices that Thomas and his sister, Lucille (Jessica Chastain), wear expensive but outdated and somewhat-frayed fashions. Edith notices that Thomas's coat is hand stitched but at least a decade old.\nShortly after, Edith once again is visited by her mother's spirit bearing the same warning.Sir Thomas is determined to persuade Mr. Cushing to change his mind. However, he and Edith become romantically attached. Thomas takes Edith to a ball in front of the entire high society and chooses Edith over Eunice (Emily Coutts), a high society debutante who fancies Thomas. Thomas and Edith perform a Waltz for everyone to see. Edith had never been given so much attention in her life and was never in the spotlight before. It was exhilarating for her.Cushing and Edith's childhood friend, Dr. Alan McMichael (Charlie Hunnam), disapprove. Cushing was always fond of Alan and had hoped that he and Edith would end up together. Alan is an Ophthalmologist. Alan also asks Edith to be careful with Thomas, but Edith does not look at Alan any more than a good friend.\nLucille also questions Thomas's choice and says Edith is just a child. But Thomas takes an engagement ring from Lucille to propose to Edith, promising to return it.Mr. Cushing hires a private detective Holly (Burn Gorman) who uncovers unsavory facts about the Sharpes. Mr. Cushing confronts the siblings and bribes them into returning to England. As Cushing insisted, Sir Thomas abruptly and cruelly ends his and Edith's relationship (by insulting her writing and calling it immature and childish) at a dinner hosted by Mr Cushing, but the next morning, he sends her a note explaining his actions. Thomas claims that Cushing had told him that he did not have the means to provide for Edith.Not long after, Mr. Cushing is brutally murdered, though his death is ruled accidental as his body was found in a bathroom and it seemed like he slipped and bashed his own head open upon the bathroom sink. Alan wants to perform an autopsy, but Edith stops Alan as she considers it disrespectful to her father's memory.\nEdith and Sir Thomas eventually marry and return to Cumberland, England. They arrive at Allerdale Hall, the Sharpes' dilapidated mansion, which sits atop a red clay mine. As Edith settles in, she finds that Lucille acts somewhat cold toward her while Sir Thomas remains physically distant. Edith is left confused and uncertain by their behavior.\nEdith is not given copy of the house keys and is told never to go below the ground level of the house.Gruesome ghosts begin appearing to Edith throughout the mansion. To help calm Edith, Sir Thomas takes her into town. After being snowed in for the night, they finally consummate their marriage. Lucille angrily lashes out when they return the next morning, frightening Edith. By the time Sir Thomas mentions that the estate is also referred to as \"Crimson Peak,\" due to the warm red clay seeping up through the snow, Edith is growing increasingly weaker and coughing up blood.Edith explores the mansion and begins piecing clues together, discovering that Sir Thomas previously married three wealthy women who were fatally poisoned for their inheritances. She realizes she, too, is being poisoned. She also discovers the siblings have had a long-term incestuous relationship, resulting in a sickly infant that died.\nLucille murdered their mother after she had discovered her children's incest. Sir Thomas inherited the family manor that, like many aristocratic estates of the era, is no longer profitable; the Sharpes are virtually penniless. The brother and sister began the \"marriage and murder\" scheme to support themselves and to fund Thomas's inventions.Back in the United States, the detective that Mr. Cushing had hired tells Alan what he uncovered about the Sharpes, including Thomas's multiple marriages (to Enola Sciotti, Margaret McDermott, and Pamela Upton) and Lucille's time in a mental institution.\nRealizing Edith is in danger, Alan arrives at Allerdale Hall to rescue her. Lucille stabs him in the left armpit, then demands that Sir Thomas finish him off. Sir Thomas, who has fallen in love with Edith and does not want her harmed, inflicts a second, non-fatal stab wound to Alan before hiding him in the cellar.\nLucille forces Edith to sign a transfer deed granting the Sharpes ownership of the Cushing estate and also confesses to her that she was the one who murdered Edith's father. After Edith signs the deed, she stabs Lucille in the chest with a pen and tries to flee. Sir Thomas burns the deed and promises to protect Edith so that she and Alan can escape.Lucille, jealous over Sir Thomas falling in love with Edith, murders him in a rage. She then pursues Edith. Aided by Sir Thomas' ghost, Edith kills Lucille with a shovel. Sir Thomas bids Edith a silent farewell as his spirit departs.\nEdith and Alan are rescued, and Lucille's ghost now haunts Allerdale.The end credits imply that Edith has written a novel titled Crimson Peak based on her experiences.",
	"links": [
		"https://www.amazon.com/Crimson-Peak-Mia-Wasikowska/dp/B016Q1LVIG"
	]
}