{
	"title": "A Million Ways to Die in the West",
	"release_year": "2014",
	"runtime": "116",
	"tags": [
		"Comedy",
		"Western",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Seth MacFarlane",
		"Charlize Theron",
		"Liam Neeson",
		"Amanda Seyfried",
		"Giovanni Ribisi",
		"Neil Patrick Harris",
		"Sarah Silverman",
		"Christopher Hagen",
		"Wes Studi",
		"Matt Clark"
	],
	"staff": [
		"Seth MacFarlane",
		"Seth MacFarlane",
		"Alec Sulkin",
		"Wellesley Wild",
		"Jason Clark",
		"Seth MacFarlane",
		"Scott Stuber",
		"Joel McNeely",
		"Michael Barrett",
		"Jeff Freeman",
		"Sheila Jaffe",
		"Stephen J. Lineweaver"
	],
	"votes": 201679,
	"cover": "https://m.media-amazon.com/images/M/MV5BMDI4YmE2MTktOWUxMy00MDNmLTliNDItMDE3Y2IwMWM3YjkzXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1882, the town of Old Stump, Arizona, is the American frontier of the West. Life is hard as food is hard to come by and disease is rampant. Law enforcement is unheard of and men are routinely lynched by self-proclaimed protectors of the law.\nA cowardly sheep farmer named Albert Stark (Seth MacFarlane) is dumped by his beloved girlfriend Louise (Amanda Seyfried) as a result of his withdrawal from a duel. Albert wanted to sit down and find a peaceful solution to the dispute, but the challenger Charlie was in no mood to relent. Albert is given 2 days by Charlie to sell his sheep and come up with the money to make good the losses that Albert caused Charlie.\nLouise says that Albert should have fought Charlie and adds that Albert is not even a good sheep farmer as his sheep roams all over the place.Albert lives with his parents Elsie (Jean Effron) and George (Christopher Hagen).\nEdward (Giovanni Ribisi) is Albert's best friend and Ruth's (Sarah Silverman) boyfriend. Ruth is a prostitute. Millie (Alex Borstein) runs the brothel where Ruth works. Edward is a shoe salesman and is OK with Ruth having sex with 15 guys each day and getting paid to do it. Edward has never had sex with Ruth as Ruth wants to wait till she gets married.\nAlbert prepares to leave for San Francisco, believing that the frontier holds nothing for him. He says that out on the frontier everyone wants to kill everyone else, outlaws, angry drunk people, scorned prostitutes, hungry animals, cholera, or even the doctor. The town pastor Wilson (John Aylward) killed 2 people and then killed the dead man's son to prevent the possibility of a revenge when he grows up. The miners inhale poisonous gases in the mines. The Mayor's dead body has not been moved for a week.Meanwhile, infamous outlaw Clinch Leatherwood (Liam Neeson) robs and kills an old prospector for a nugget of gold. The prospector was willing to part with the gold, but Clint wanted to shoot for it. He makes the old man pick up his gun, to shoot at 3, but then Clint cheats and shoots at 2, killing the old man.\nHe orders one of his men, Lewis (Evan Jones), to escort his wife Anna (Charlize Theron) to Old Stump to lie low while he continues his banditry. Clint promises to come pick-up Anna in 12 days.\nAnna doesn't like that Clinch is a bully but is unable to oppose him as everybody in the gang worships Clinch.\nLouise is now dating her new boyfriend Foy (Neil Patrick Harris), who owns a mustache accessory shop & is filthy rich (having a mustache in 1882 is expensive business with the creams, the waxes and the lotions required to maintain it).\nMeanwhile Albert has paid off Charlie but is now too depressed and has not left his sheep farm for several days. Edward drags Albert to town.Lewis and Anna arrive in Old Stump under the guise of two siblings intending to build a farm, but Lewis is arrested after shooting Charlie in a saloon after Charlie knocked over Lewis's drink and refused to apologize. During the ensuing brawl, Albert saves Anna from being crushed by two of the brawlers and the two form a friendship & Anna even agrees to help Albert to try and win Louise back.\nAnna learns that Louise and Foy are going to the country fair and offers to accompany Albert. She says that Louise will be jealous when she sees Albert with a smoking hot girl like herself.Anna visits Lewis in lockup and makes her disgust for Clint clear to Lewis and says that she hopes Clint meets a faster shooter who shoots him dead. She knows that Lewis will be hanged much before Clint ever reaches town.They attend a county fair at which Albert says that accidents happen routinely, and people die. Anna is introduced to Louise and Foy, and Anna says that she is having regular intercourse with Albert. Louise's new boyfriend, the foppish Foy, challenges Albert to a shooting contest at the shooting gallery. Albert is defeated, but Anna steps up and defeats Foy. Foy insults Albert, who angrily challenges Foy to a duel in a week's time. Anna tells Albert that Louise is aroused to see the fight in Albert.Anna teaches Albert how to shoot. Anna also teaches Albert to respect himself & says that Louise is not doing him a favor by dating him. She says that Albert is a guy with many virtues & that any girl would be lucky to have him.\nDuring a barn dance the night before the duel, Anna slips Foy a Mickey. After leaving the dance, Albert and Anna kiss before heading home. Upon breaking out of jail and murdering the sheriff, Lewis sees the kiss and reports it to Clinch.\nOn the day of the duel, Foy arrives late and goes into convulsions due to the laxative he had unknowingly imbibed. Albert, who has decided that Louise is not worth the trouble, once again forfeits the duel.He retires to the saloon, but Clinch arrives and demands to know who kissed his wife. When no one comes forward, Clinch shoots a nearby cowboy. He reveals that Anna is his wife and threatens to continue killing unless his wife's lover duels him at noon the next day. Clinch later compels Anna to reveal Albert's name and then prepares to have sex with her, but she knocks him unconscious and escapes.Anna returns to Albert's farm where he confronts her. Clinch pursues Anna to the farm and recaptures her, but Albert escapes. While fleeing, he is captured by a tribe of Indians who threaten to burn him to death. The Indians spare him when he reveals that he can speak their language. They give him a bowl of Peyote, which sends him flashing back to his birth and through traumatic events of his childhood before making him realize that he loves Anna.Albert returns to Old Stump and confronts Clinch. He wounds Clinch with a bullet poisoned with rattlesnake venom before having his own gun shot out of his hand but manages to stall until Clinch lethally succumbs to the poison. Louise attempts to win back Albert, but he rejects her and instead enters a relationship with Anna. Albert also receives a bounty for killing Clinch and uses the money to buy more sheep.At the fair, the proprietor of a racially charged shooting game asks who would like to take a shot. Django Freeman (Jamie Foxx) steps up and shoots the man while commenting that a lot of people die at the fair.",
	"links": [
		"https://www.amazon.com/Million-Ways-Die-West/dp/B00MQNLOK4"
	]
}