{
	"title": "Me and Earl and the Dying Girl",
	"release_year": "2015",
	"runtime": "105",
	"tags": [
		"Comedy",
		"Drama",
		"amazon"
	],
	"rating": 7.7,
	"actors": [
		"Thomas Mann",
		"RJ Cyler",
		"Olivia Cooke",
		"Nick Offerman",
		"Connie Britton",
		"Molly Shannon",
		"Jon Bernthal",
		"Matt Bennett",
		"Katherine Hughes",
		"Masam Holden"
	],
	"staff": [
		"Alfonso Gomez-Rejon",
		"Jesse Andrews",
		"Jeremy Dawson",
		"Dan Fogelman",
		"Steven Rales",
		"Brian Eno",
		"Nico Muhly",
		"Chung-hoon Chung",
		"David Trachtenberg",
		"Angela Demo",
		"Gerald Sullivan"
	],
	"votes": 140011,
	"cover": "https://m.media-amazon.com/images/M/MV5BNTA1NzUzNjY4MV5BMl5BanBnXkFtZTgwNDU0MDI0NTE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Greg Gaines attempts to tell the story of his senior year at high school and is struggling to figure out where to begin. He tells the story of how he destroyed his life and made a film so bad that it literally killed a person.Awkward, lanky, and self-loathing, Greg Gaines (Thomas Mann) is a senior at Pittsburgh's Schenley High School who appears to drift through life while only seeming to broadly associate himself with the various cliques within Schenley's halls. The head nods of Jock Nation, the fist bumps of the Kingdom of Stoners, the innocuous witticisms of the People's Republic of Theatre Dorks, and so on. Since no one clique offered full security, Greg found a way to be part of them all. He was on low key good terms with everyone, with casual interactions every once in a while, and in a way that is invisible to everyone else. Greg had connected with even the most downtrodden cliques like the goths or the Nation of One Ill Phil (Masam Holden).\nGreg avoided the cafeteria and ate lunch in the office of his history teacher Mr. McCarthy (Jon Bernthal).He learns that a fellow student and former childhood friend of his, Rachel Kushner (Olivia Cooke), has been diagnosed with leukemia, and is forced by his overbearing parents Victor Gaines (Nick Offerman) and Marla Gaines (Connie Britton) to befriend her in her time of need. Greg calls Rachel to set up a time but she refuses to meet. Marla is adamant and forces Greg to go to Rachel's house. Denise (Molly Shannon) is Rachel's mother and believes that Greg is the right friend for Rachel at this time.\nDespite neither of them truly wanting the other's company, Greg manages to strike up a conversation about her pillow collection. Greg admits that his mother is forcing him to spend time with her. Greg spins a whole imaginary story made up of pillow-based characters and manages to bring a smile to Rachel's face. She finds his quirky personality endearing, and they make plans to meet on a regular basis.Over time, Greg introduces Rachel to his longtime friend and partner Earl (RJ Cyler), with whom he makes short films parodying a more popular film's title. Earl is African American from a tough neighborhood and lives a short distance away from Greg. They met in kindergarten and have hung out together since then. It was Greg's father, a professor, who introduced them to the classics of foreign cinema.\nGreg and Earl would assign a stupider title and make a new film to reflect the new stupid title. Like \"My dinner with Andre the Giant\", \"Senior Citizen Cane\", \"Eyes Wide Butt\", \"Rosemary Baby Carrots\", \"Pooping Tom\", \"The Seven Seals\", \"Death in Tennis\" and so on. Together, they have made 42 films.\nGreg and Rachel get along as Greg is able to look past Rachel's illness and is able to make jokes about it without being weird or insulting. Greg says at school Rachel is part of the \"boring senior Hebrew girls, subgroup 2A\". Greg shares that he is not looking forward to college and may not apply.At Greg's reluctance, Earl convinces Greg to share their collection of short films with her, which she finds entertaining. As Rachel begins chemotherapy her disease worsens, Greg begins spending less time at school and more time caring for her. Though Rachel suffers through her treatment and seems to get worse and worse, Greg, who often breaks the fourth wall, assures viewers that she does not die in the end.Discovering them shooting another film, Greg's high-school crush Madison (Katherine C. Hughes) convinces Greg and Earl to make a film dedicated to Rachel, and Rachel persuades Greg to apply to a local college. Despite being accepted by the college, Greg continues to ignore schoolwork, and eventually school altogether, in order to finish the film. After realizing that her chemotherapy is doing more harm than good, Rachel opts to discontinue her treatment.\nGreg and Rachel have a heated argument over her choice where Greg accuses Rachel of giving up on herself and in return Rachel points out his unwillingness to do anything selfless unless he is told to do so. He leaves, devastated that he can no longer help her.In a fit of blind rage, Greg confronts Earl, blaming him for the events leading to the end of his friendship with Rachel, with Earl admonishing Greg's unwillingness to do anything selfless unless he's told to do so. Afterward Earl gives Greg a heartfelt testimonial for Rachel before letting him know that he's finished with their friendship. Greg is also told that due to his failing grades, he has been rejected by the college he thought he would attend.Later in the year, Greg's mom lets him know that Rachel has been moved into hospice as she begins to succumb to her disease. Taking pity on him, Madison invites him to the prom. However, after dressing up in a tuxedo, he decides not to go to pick up Madison but instead goes to the hospital where Rachel is receiving hospice care. During the journey there, Greg is asked by the limousine driver if he loves the girl he is going to see, a question he finds himself unable to answer.\nHe brings his iPhone and a compatible projector and runs the film he made for Rachel on the front wall of her room, lying beside her as they did when they watched his other films. Rachel is moved to tears by the movie. However, while viewing the film, she falls into a coma, dying a few hours later.\nGreg admits to the viewer that he lied about Rachel not dying, as he \"didn't think she would.\"At her Shiva, Greg and Earl reconcile, and Greg sneaks up into Rachel's room, where he finds a card to him from her explaining that she wrote a letter to the college Greg applied to in order to let them know that he missed school for her sake. It also states her wish for Greg to take any of her possessions that he pleases. He finds several intricate carvings within her books depicting scenes of her with Greg and Earl. Greg leaves with one of the books containing a personal carving and his favorite of Rachel's pillows.Some time later, Greg writes his story of his time with Rachel and mails it to the college along with the film he made for her, with a warning that \"the last person who saw this immediately went into a coma and DIED.\"",
	"links": [
		"https://www.amazon.com/Earl-Dying-Girl-Thomas-Mann/dp/B013JD7NRM"
	]
}