{
	"title": "Birdman or (The Unexpected Virtue of Ignorance)",
	"release_year": "2014",
	"runtime": "119",
	"tags": [
		"Comedy",
		"Drama",
		"amazon"
	],
	"rating": 7.7,
	"actors": [
		"Michael Keaton",
		"Zach Galifianakis",
		"Edward Norton",
		"Andrea Riseborough",
		"Emma Stone",
		"Kenny Chin",
		"Jamahl Garrison-Lowe",
		"Naomi Watts",
		"Jeremy Shamos",
		"Katherine O'Sullivan"
	],
	"staff": [
		"Alejandro G. Iñárritu",
		"Alejandro G. Iñárritu",
		"Nicolás Giacobone",
		"Alexander Dinelaris",
		"Armando Bo",
		"Alejandro G. Iñárritu",
		"John Lesher",
		"Arnon Milchan",
		"James W. Skotchdopole",
		"Antonio Sanchez",
		"Emmanuel Lubezki",
		"Douglas Crise",
		"Stephen Mirrione",
		"Francine Maisler",
		"Kevin Thompson"
	],
	"votes": 672163,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzM3OGE5NDItNGM3ZS00ODZmLWI3NGQtOTIyZGVmYTE0MGE0XkEyXkFqcGc@._V1_QL75_UY281_CR4,0,190,281_.jpg",
	"description": "Riggan Thomson (Michael Keaton) is a faded actor famous for playing a superhero named Birdman in a film trilogy from 1989 to 1992.\nHe is tormented by the mocking and critical internal voice of his past self as Birdman and frequently visualizes himself performing feats of levitation and Telekinesis. It is implied that some part of him believes that he is Birdman.\nRiggan is trying to regain recognition by writing, directing, and starring in a Broadway adaptation of Raymond Carver's short story \"What We Talk About When We Talk About Love\".\nHowever, the Birdman voice wants Riggan to return to blockbuster cinema and insists that he is essential to Riggan's identity. The voice goads Riggan that Robert Downey Jr, doesn't have any talent compared to Riggan, and yet is raking it in with the Marvel franchise.\nThe press believes that Riggan is doing the play as he is a washed-up superstar, who refused Birdman 4, 20 years ago.Riggan's best friend and lawyer Jake (Zach Galifianakis) is producing the play, which co-stars Riggan's girlfriend Laura (Andrea Riseborough) and Broadway newcomer Lesley (Naomi Watts). Riggan's beautiful daughter Sam (Emma Stone), a recovering drug addict with whom he is trying to reconnect, works as his assistant.\nThe day before the first preview, a light fixture falls onto Riggan's hapless co-star Ralph (Jeremy Shamos). Riggan admits to Jake that he made the accident happen with his superpowers. Riggan wants to cancel the first preview, but Jake knows that this would mean a huge financial loss, not to mention that press would have a field day. They cannot afford to cancel the first preview.\nAt Lesley's suggestion, Riggan replaces Ralph with her boyfriend, the brilliant but volatile and self-absorbed method actor Mike Shiner (Edward Norton). Jake is ecstatic as Mike can sell tickets and the theatre critics love him.Mike makes the crew practice all night to be ready for the first preview show the next day. Since Lesley brought the script home, Mike already knew all the lines. Mike brings real passion and energy to the character. Larry (Michael Siberry) is the tailor and makes new costumes for Mike overnight.\nRiggan gets very excited by Mike and wants Jake to sign the contract, even though Mike is very expensive. Riggan promises to get the money. Riggan is having an affair with Laura.The first previews are disastrous: Mike breaks character over Riggan replacing his gin with water (The sets were supposed to have water for a drinking scene, but Mike placed a real gin bottle. When Riggan found out, he replaced the gin bottle with water. When Mike discovers this, he throws a tantrum on stage in the middle of the play), attempts to sexually assault Lesley during a sex scene, and complains that the prop gun does not look natural.\nRiggan wants Mike gone, but Jake says that the play cannot afford any more losses. Jake says that Riggan is the director and asks him to bring his actor under control.\nRiggan tells his ex-wife Sylvia that he will need to mortgage his house (or Sam's house), to finance the play.Riggan talks to Mike and says that people expect great things from him, since he is popular. Mike berates Riggan and says that people only like the Birdman character. Mike adds that if the play fails, Riggan will go back to Hollywood, but Mike will continue to put his heart and soul into every performance on Broadway even then. Riggan reveals that he is doing the Carver play as Carver was in the audience when Riggan performed Syracuse in High School. Carver sent a note to Riggan appreciating his performance, and that's when Riggan knew that he was going to be an actor someday.When Riggan berates Sam after finding her smoking marijuana, she insultingly rebukes and chastises him, telling him that he is irrelevant (he does not do any Vlogs, does not have a Facebook page or Twitter. It is Riggan who doesn't exist), and the play is for his own vanity.\nLesley tells Mike to move his stuff out of her apartment. She is livid that Mike would not have sex with her for 6 months, but now wants to assault her in front of a live audience of 800 people. When Laura tries to console Lesley, they end up sharing a kiss.Mike goes to the roof to light a smoke, where he finds Sam. Sam and Mike start talking and connect over their respective troubles in life, due to them being misunderstood. Mike admits that he finds Sam attractive.\nRiggan clashes continually with Mike, culminating in a brawl after Riggan reads a New York Times interview with Mike in which he steals Riggan's personal reason for doing a Raymond Carver play. Mike is stealing Riggan's show, his cover page story and thinks he is a joke.\nJake persuades Riggan to continue with the play.During the final preview, after seeing Mike and Sam kissing backstage, Riggan goes for a smoke and accidentally locks himself outside with his robe stuck in the fire escape door. He is forced to walk through Times Square in his briefs and enter through the audience to do the final scene. A concerned Sam is waiting in his dressing room after the show, and she thinks the performance was very unusual but interesting. She shows him that the Times Square footage is going viral and explains how this actually helps him.Riggan goes to a bar for a drink and approaches Tabitha Dickinson (Lindsay Duncan), a cynical and highly influential theater critic. She promises to \"kill\" his play with a deprecating review without seeing it. On the way back, Riggan buys a pint of whiskey, drinks it, and passes out on a stoop.\nThe next day, walking to the theater with a severe hangover, he visualizes Birdman trying to convince him to abandon the play and make a fourth Birdman film. Riggan then imagines himself flying through the streets of Manhattan before arriving at the theater.On opening night, the play goes very well. In his dressing room, a strangely calm Riggan confesses to his ex-wife, Sylvia (Amy Ryan), that several years ago, he attempted to drown himself in the ocean after she caught him having an affair. He also tells her about the Birdman voice, which she ignores.\nAfter Sylvia leaves, Riggan picks up a real gun for the final scene in which his character commits suicide. At the climax, Riggan shoots himself in the head on stage. The play receives a standing ovation.Riggan wakes up in a hospital-the suicide attempt merely blew off his nose, which has been surgically reconstructed. Tabitha has published a glowing review of the play, mistaking the suicide attempt for a new acting technique. Sam visits with flowers and takes a picture of him to share with the skyrocketing number of followers on the Twitter account she has created for him.While she steps outside to find a vase, Riggan goes into the bathroom, removes the bandages revealing his swollen new nose, and says goodbye to Birdman, seen seated on the toilet. Fascinated by the birds flying outside his room, he opens the window, peers up at them, and then climbs out onto the ledge. Sam returns to an empty room and frantically runs to the open window, scanning the ground before slowly looking up into the sky and smiling at what she sees.",
	"links": [
		"https://www.amazon.com/Birdman-Michael-Keaton/dp/B00PLG8LFY"
	]
}