{
	"title": "Alice Through the Looking Glass",
	"release_year": "2016",
	"runtime": "113",
	"tags": [
		"Adventure",
		"Family",
		"Fantasy",
		"amazon"
	],
	"rating": 6.2,
	"actors": [
		"Mia Wasikowska",
		"Johnny Depp",
		"Helena Bonham Carter",
		"Anne Hathaway",
		"Sacha Baron Cohen",
		"Rhys Ifans",
		"Matt Lucas",
		"Matt Lucas",
		"Lindsay Duncan",
		"Leo Bill",
		"Geraldine James"
	],
	"staff": [
		"James Bobin",
		"Linda Woolverton",
		"Lewis Carroll",
		"Tim Burton",
		"Joe Roth",
		"Jennifer Todd",
		"Suzanne Todd",
		"Danny Elfman",
		"Stuart Dryburgh",
		"Andrew Weisblum",
		"Lucy Bevan",
		"John Papsidera",
		"Dan Hennah"
	],
	"votes": 124530,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTc2NjExMTIyN15BMl5BanBnXkFtZTgwMjg0OTIwODE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Alice Kingsleigh (Mia Wasikowska) has spent the past three years following in her father's footsteps and sailing the high seas. Upon her return to London from China, she discovers that her ex-fiance, Hamish Ascot (Leo Bill), has taken over her father's company and plans to have Alice sell him her father's ship, \"the Wonder\", in exchange for her family home. Unable to make a choice, Alice runs away, and comes across her butterfly friend Absolem, who disappears through a mysterious mirror in one of the upstairs rooms, returning to Underland.There, Alice is greeted by Mirana of Marmoreal (Anne Hathaway), the White Queen, Nivens McTwisp, the White Rabbit, the Tweedles, Mallymkun, the Dormouse, Thackery Earwicket, the March Hare, Bayard, and the Cheshire Cat. They inform her that Tarrant Hightopp (Johnny Depp), the Mad Hatter is in poor health because his family is missing following the Attack of the Jabberwocky (And Tarrant believes that somehow his family has survived, even when everybody else believes they are all dead). The attack occurred shortly after his father, Zanik (Rhys Ifans), a hat retailer, seemed to reject Tarrant's gift of a hat creation.The White Queen persuades Alice to convince Time (Sacha Baron Cohen) himself to save the Mad Hatter's family in the past (by sending Alice into the past), believing her to be the only one who can save the Hatter. However, she cautions Alice about time, and that if her past self sees her future self, everything will be history. As Alice sets out, she ends up in a dreary castle, where Time himself, a demigod that is part-human, part-clock, resides. Time refuses to send Alice into the past saying that she cannot change it. As Alice tries to consult Time, she finds the Chronosphere, an object that powers all time in Underland and will allow her to travel to any time in the past.Alice ignores Time's warning that the past is unchangeable, and steals the Chronosphere, shortly after finding Iracebeth of Crims (Helena Bonham Carter), the exiled Red Queen (and the sister of the white queen), in the care of Time. Alice accidentally flies to the day of Iracebeth's coronation, where a younger Mad Hatter mocks the Red Queen when the royal crown doesn't fit on her abnormally large head. This causes Iracebeth to melt down and her father deems her emotionally unqualified to rule and passes the title of queen to her younger sister, the White Queen.Iracebeth swears revenge on Hatter and implores the White Queen to \"Tell everyone the truth\"..\nAlice learns of an event in Iracebeth's and Mirana's past that caused friction between the two and travels back in time again, hoping it will change Iracebeth's ways and stop the Jabberwocky from killing the Hatter's family. She learns that the hat that the Mad Hatter thought his father threw away was actually treasured by him. Meanwhile at the White Queen and the Red Queen's castle, at the time they are children, Mirana steals a tart from her mother and eats it. When confronted by their mother, Mirana lies about eating the tart, and Iracebeth is accused, causing her to run out of the castle. Alice sees that Iracebeth is about to run into a clock, thinking that's the event that deforms her head and personality. Alice prevents that collision but fails to change the past, as Iracebeth trips and slams her head into a stone wall instead.A weakened Time then confronts Alice after relentless searching and scolds her for putting all of time in danger. Out of panic, Alice runs into a nearby mirror back in the real world, where she wakes up in a mental hospital, diagnosed with female hysteria. As Dr. Addison Bennett (Andrew Scott), a psychiatric doctor, tries to inject her with a sedative, with her mother Helen's encouragement and help, she escapes and returns to Underland via the mirror, where she travels to Horovendush Day, when the Hightopp family was killed. Alice discovers that the Mad Hatter's family was captured by the Red Queen instead and never died. Returning to the present however, Alice discovers that the Mad Hatter is on the brink of death.Alice, close to tears, says that she believes him, and Tarrant transforms back to his normal self. The Underlandians go to the Red Queen's new organic plant castle, where the Mad Hatter finds his family shrunk and trapped in an ant farm. However, the Red Queen apprehends them and steals the Chronosphere from Alice. Ignoring Time's warning, she takes her sister back to the day she lied about the tart. By the time the Mad Hatter and Alice get there, the Red Queen and her younger self have seen each other. Time becomes irrelevant, and Underland begins to freeze in a rust. At a powerless Time's pleas, Alice and the Mad Hatter with the White Queen and now-frozen Red Queen use the Chronosphere to race back to the present as the rust proceeds to spread all over the ocean of Time and the castle, where Alice places the Chronosphere in its original place in time.With the Chronosphere stabilized, Underland, including those frozen, are reverted to normal. The Mad Hatter reunites with his family and the White Queen, and the Red Queen make amends, while Time forgives Alice for the trouble she caused, but forbids her to return. Alice bids farewell to her friends and returns to the real world through another mirror. She finds her mother is about to sign over the Wonder to Hamish (saying that it's only a ship). Helen decides to support her daughter instead. Hamish gets the Kingsleigh family home but not the ship. Alice and her mother set out to travel the world together with their own shipping company.",
	"links": [
		"https://www.amazon.com/Alice-Through-Looking-Glass-Theatrical/dp/B01G2LHWK6"
	]
}