{
	"title": "Arrival",
	"release_year": "2016",
	"runtime": "116",
	"tags": [
		"Drama",
		"Mystery",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.9,
	"actors": [
		"Amy Adams",
		"Jeremy Renner",
		"Forest Whitaker",
		"Michael Stuhlbarg",
		"Mark O'Brien",
		"Tzi Ma",
		"Abigail Pniowsky",
		"Julia Scarlett Dan",
		"Jadyn Malone",
		"Frank Schorpion"
	],
	"staff": [
		"Denis Villeneuve",
		"Eric Heisserer",
		"Ted Chiang",
		"Dan Levine",
		"Shawn Levy",
		"David Linde",
		"Aaron Ryder",
		"Jóhann Jóhannsson",
		"Bradford Young",
		"Joe Walker",
		"Francine Maisler",
		"Patrice Vermette"
	],
	"votes": 787100,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTExMzU0ODcxNDheQTJeQWpwZ15BbWU4MDE1OTI4MzAy._V1_QL75_UX190_CR0,8,190,281_.jpg",
	"description": "Linguist Louise Banks (Amy Adams) is caring for her adolescent daughter, who dies of cancer at the age of twelve. Louise laments that human beings are bound by time and its linear order, as she relives the memories of her daughter as she was born, grew up and eventually passed away.While she is lecturing at a university, twelve extraterrestrial spacecraft appear, each landing in a different country. In the ensuing widespread panic, affected nations send military and scientific experts to monitor and study them.\nLouise is puzzled about why the aliens sent 12 spacecraft if the objective was to make an initial contact. The craft in US has landed in Montana. The President declares a state of emergency, and all air traffic is grounded. Panic buying all utilities and groceries ensues.U.S. Army Colonel Weber (Forest Whitaker) asks Louise to join physicist Ian Donnelly (Jeremy Renner) (an experimental physicist from Los Alamos) to decipher their language and find out why they have come to Earth. 2 years ago, Louise did some Farsi interpretation for Army Intelligence and already has top secret clearance. Weber shares an audio file of an interaction with the aliens, but Louise says that to interpret their language, she needs to be there and interact directly.The team is brought to a U.S. military camp in Montana near one of the spacecrafts and makes contact with two seven-limb aliens on board. The spacecraft itself is oval in shape and stands on its vertical axis. There is an open door at the bottom of the ship, which is accessible via a tall crane. Once inside the door, the gravity changes from vertical to horizontal and Louise and team are able to walk normally on the \"vertical\" walls inside the chamber. At the end is a glass-like structure beyond which the aliens \"arrive\" to interact with the humans.Weber is nervous about Louise's approach and wants to know why the aliens came to Earth and what are their intentions. Louise says that when Cook reached Australia, he saw a strange animal and asked an Aboriginal native what the animal was called. The native said \"Kangaroo\" and the name stuck. Only Kangaroo means \"I don't Understand\". She says that it is important to take time and understand the language so that more complex communications are not misinterpreted, later on.Louise removes her protective gear in subsequent sessions and interacts more closely with the Heptapods.\nThey call the extraterrestrials \"Heptapods\", and Ian nicknames them Abbott and Costello. At first the team focuses on the audio cues from the Heptapods to try and figure out their language. Louise believes that the aliens might have a form of written language.\nLouise shows them a placard with the word \"Human\" written on it, and the aliens respond with a written phrase of their own. The writing happens with an ink secreted from their limbs.Banks and Donnelly research the complex written language of the Heptapods, consisting of\npalindromic phrases written with circular symbols, and share the results with other nations. As Banks studies the language, she starts to have flashback-like visions of her daughter.When Louise asks what the aliens want, they answer: \"offer weapon\". A similar translation \"use weapon\" is made by one of the other sites in China. Fear of a potential threat from the aliens leads other nations to close down communications on the project, and some prepare their military for attack. However, Louise thinks that the symbol interpreted as \"weapon\" might have an alternative translation, such as \"tool\" or \"technology\".\nChina's translation likely results from interacting with the Heptapods using Mahjong, a highly competitive game.Rogue U.S. soldiers plant explosives in the spacecraft. Unaware, Louise and Ian re-enter. The aliens give them a much larger and more complex message. Abbott ejects Ian and Louise from the craft as the explosion occurs, which leaves them unconscious. Louise and Ian come round in the camp as the military prepares to evacuate, and the spacecraft moves higher above the ground.General Shang issues an ultimatum to the alien craft in China, demanding that it leave within 24 hours. Russia, Pakistan, and Sudan follow suit; communications between the international research teams are terminated as worldwide panic sets in.Donnelly discovers that the symbol for time is present throughout the message and that the writing occupies exactly one-twelfth of the 3D space into which it is projected. Banks suggests that the full message is split between the twelve craft and that the Heptapods want all the nations to collaborate in order to decipher it.Meanwhile, China notifies the world that its military is planning to attack the spacecraft off its coast. Louise rushes back to the spacecraft, which sends down a shuttle to take her inside. She meets Costello, who communicates that Abbott is dying. Louise asks about her visions of a daughter (whom she doesn't recognize), and Costello explains that she is seeing the future, revealing that her \"visions\" were not flashbacks but flash-forwards.\nLearning the language alters humans' linear perception of time, allowing them to experience memories of future events. Banks's visions of her daughter are revealed to be premonitions; her daughter will not be born until sometime in the future.Costello also communicates that they have come to help humanity by sharing their language, which is the \"weapon\" or \"tool\" because it changes the mind's perception of time. The aliens know that 3000 years into the future they will need humanity's help in return. They ask her to use her \"weapon\"-her ability to see into the future.Banks returns to the camp as it is being evacuated and tells Donnelly that the aliens' language is the \"tool\" that was meant by the word \"weapon\".\nShe has a vision of herself at a future United Nations reception, being thanked by the Chinese General Shang (Tzi Ma) for convincing him to suspend the military attack. He explains that she had called his private mobile telephone. He shows her its number, which he says he knows he must do without understanding why.In the present, Louise steals a satellite phone and calls Shang but realizes she does not know what to say. Her vision continues with Shang explaining that she had convinced him by repeating his wife's last words in Mandarin, which he tells Louise. This convinces Shang in present time, and the Chinese attack is called off and the other nations resume contact with each other, as the spacecraft disappear from Earth.From what she has learned, Banks writes and publishes a book called The Universal Language, a guide to the Heptapod language, which will eventually teach humanity to perceive time the same way as the Heptapods.During the evacuation, Donnelly expresses his love for Banks. They talk about their life choices and whether he would change them if he could see his life from beginning to end. Banks knows that she will agree to have a child with him despite knowing their fate: that Hannah will die from an incurable disease and that Donnelly will leave them both as a result of her revealing that she knew this.",
	"links": [
		"https://www.amazon.com/Coloring-Book-Poster-Collection-Whitaker/dp/165248566X"
	]
}