{
	"title": "Whiplash",
	"release_year": "2014",
	"runtime": "106",
	"tags": [
		"Drama",
		"Music",
		"amazon",
		"netflix"
	],
	"rating": 8.5,
	"actors": [
		"Miles Teller",
		"J.K. Simmons",
		"Melissa Benoist",
		"Paul Reiser",
		"Austin Stowell",
		"Nate Lang",
		"Chris Mulkey",
		"Damon Gupton",
		"Suanne Spoke",
		"Max Kasch"
	],
	"staff": [
		"Damien Chazelle",
		"Damien Chazelle",
		"Jason Blum",
		"Helen Estabrook",
		"David Lancaster",
		"Michel Litvak",
		"Justin Hurwitz",
		"Sharone Meir",
		"Tom Cross",
		"Terri Taylor",
		"Melanie Jones"
	],
	"votes": 1015619,
	"cover": "https://m.media-amazon.com/images/M/MV5BNDE1ZDdiZTQtNzE0OC00N2IwLTlhOTItNzMyMDZhNzk0ZmQwXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Andrew Neiman (Miles Teller) is a first-year jazz student at the prestigious Shaffer Conservatory in New York. He has been playing drums from a young age and aspires to become one of the greats like Buddy Rich.\nConductor Terence Fletcher (J. K. Simmons) watches Andrew practice his drums and walks out without saying anything. Mr Kramer (Damon Gupton) is Andrew's first instructor at school, but it is clear that Fletcher is the one that everybody wants to join.\nAndrew has Father Jim (Paul Reiser), who is a writer turned high school teacher. Andrew meets Nicole, a movie theater employee and they begin dating. Frank (Chris Mulkey) is Andrew's uncle.The next day, Andrew enters one class aside from Fletcher and there, he meets the drummer named Ryan Connelly (Austin Stowell). Shortly, the professor arrives, and the class performs \"Billy's An\". Andrew sees Fletcher in silhouette looking at the door. After the class, Andrew peeks into one of the classrooms where the class is handled by Fletcher, and he is being looked at by Fletcher.Back at the Studio Band, Andrew is playing drums as core drummer. Suddenly, Fletcher breaks inside and Andrew becomes horrified of him. Fletcher conducts every saxophonist and bassist one by one and finally the drums. Fletcher eventually accepts Andrew into his studio band as the alternate for core drummer Carl Tanner (Nate Lang). After that, Fletcher tells Andrew to come, and he is told to come at his room tomorrow at 6 in the morning.Andrew invites Nicole to go out with him. The next day, Andrew realizes that he is late for class. Andrew struggles and rushes quickly to the school, only he goes inside the empty classroom. Andrew knows that the class actually starts at 9 AM. Andrew waits three hours before the class.Andrew discovers that Fletcher, although encouraging at first, is relentlessly strict and verbally and physically abusive towards his students, mocking and insulting them. Fletcher confronts then suddenly yells at a saxophonist named Metz (C.J. Vana) playing out-of-tune and angrily tells him to get out of the Studio Band.\nWhen the band rehearses the Hank Levy piece \"Whiplash\" and Andrew struggles to keep his tempo, Fletcher hurls a chair at him, slaps Andrew every four in 12 counts he makes, and he will not stop questioning until Andrew answers whether he is \"dragging\" or \"rushing\". Andrew answers \"rushing\" then Fletcher forces Andrew to tell the whole band that he is really upset, louder! Fletcher then mocks Andrew about his parents being separated. Thus, Andrew is being embarrassed and insulted.At a local jazz competition, Andrew misplaces Carl's sheet music; as Carl cannot play without it, Andrew steps in informing Fletcher that he can perform \"Whiplash\" from memory. Fletcher promotes him to core drummer.\nAt the Studio Band, the band is practicing the new song called \"Caravan\" which needs an extreme time stamp measure of 330 bpm. Fletcher dismisses the band except Andrew when Fletcher discusses him about that note. Shortly, Ryan Connelly, whom Andrew met from the other class, arrives. Andrew plays the drums to test the ability of the tempo, but his tempo fails while Ryan plays well. Therefore, Fletcher takes Ryan as the new core drummer, but Andrew does not agree to this. Jealous, Andrew will be the core drummer if he earns the part.Determined to impress Fletcher, Andrew practices until his hands bleed and breaks up with his girlfriend Nicole (Melissa Benoist), believing she will distract him.The next day, Fletcher tearfully reveals in class that a talented former student of his, Sean Casey, has died in a car accident. The band rehearses \"Caravan\", but Ryan struggles with the tempo. Fletcher auditions Andrew, Ryan and Carl for hours while the class waits outside. Fletcher then pushes the three drummers to play at a faster tempo on \"Caravan\", keeping them for a grueling five-hour practice. When it is Andrew's turn, Fletcher kicks the chair then throws the drum away in wrath and even tells Andrew to increase the tempo. In this process, Andrew's left hand is bleeding and the blood drips onto the drum set. After a one minute of playing, Fletcher finally tells Andrew that he earned the part.On the way to a jazz competition, Andrew's bus breaks down. Determined to make the performance, he rents a car but arrives late without his drumsticks. After an argument with Fletcher, Andrew drives back to the car rental office and retrieves the drumsticks. As he speeds back, his car is hit by a truck. He crawls from the wreckage and arrives on stage badly injured. When he struggles to play \"Caravan\" due to his injuries, Fletcher stops the band midway through the performance to tell Andrew that he is \"done\". Enraged, Andrew attacks Fletcher in front of the audience and is dragged away.Days later, Andrew is expelled from Shaffer and meets with a lawyer representing the parents of Sean Casey. The lawyer explains that Sean actually hanged himself, having suffered anxiety and depression after joining Fletcher's class. Sean's parents want to prevent Fletcher from teaching. Andrew agrees to testify, resulting in Fletcher being fired.Months later, Andrew sees Fletcher performing at a club. They drink together and Fletcher explains that he pushes his students beyond the expected so they might achieve greatness. Citing a story where Jo Jones allegedly threw a cymbal at Charlie Parker as an example, Fletcher says that the next jazz musician to live up to Parker's legacy would never let discouragement stop them. He invites Andrew to perform at a festival concert with his band. Andrew agrees and invites Nicole, but she is in a new relationship and declines.On stage at the jazz festival, Fletcher reveals to Andrew that he knows he testified against him. In revenge, Fletcher leads the band in a new piece for which Andrew was not given sheet music. Andrew leaves the stage humiliated, but returns and begins \"Caravan\", interrupting Fletcher as he addresses the audience. The rest of the band joins him, surprising Fletcher, who eventually follows suit. Andrew ends the performance with an extravagant drum solo, and Fletcher gives him a nod of approval.",
	"links": [
		"https://www.amazon.com/Whiplash-4K-UHD-Miles-Teller/dp/B08HNFQJB8",
		"https://www.netflix.com/title/70299275"
	]
}