{
	"title": "Night at the Museum: Secret of the Tomb",
	"release_year": "2014",
	"runtime": "98",
	"tags": [
		"Adventure",
		"Comedy",
		"Family",
		"amazon"
	],
	"rating": 6.2,
	"actors": [
		"Ben Stiller",
		"Ben Stiller",
		"Robin Williams",
		"Robin Williams",
		"Owen Wilson",
		"Dick Van Dyke",
		"Steve Coogan",
		"Ricky Gervais",
		"Dan Stevens",
		"Rebel Wilson",
		"Skyler Gisondo",
		"Rami Malek"
	],
	"staff": [
		"Shawn Levy",
		"David Guion",
		"Michael Handelman",
		"Mark Friedman",
		"Thomas Lennon",
		"Chris Columbus",
		"Shawn Levy",
		"Mark Radcliffe",
		"Alan Silvestri",
		"Guillermo Navarro",
		"Dean Zimmerman",
		"Heike Brandstatter",
		"Coreen Mayrs",
		"Martin Whist"
	],
	"votes": 138015,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjI1MzM2ODEyMV5BMl5BanBnXkFtZTgwNTIzODAwMzE@._V1_QL75_UY281_CR3,0,190,281_.jpg",
	"description": "In 1938, in Egypt a team of archaeologists are digging into a tomb to look for a valuable artifact. A young boy falls through a hole that leads his father and the others to what they came for - the tablet of Ahkmenrah. Several local men see the tablet and say that if the archaeologists remove it, then \"the end will come\".In the present day in New York City, Larry Daley (Ben Stiller) is overseeing a nighttime event at the Museum of Natural History with Dr. McPhee (Ricky Gervais) in attendance. Larry gathers the favorite exhibits, including Theodore Roosevelt (Robin Williams), Attila the Hun (Patrick Gallagher), Sacagawea (Mizuo Peck), Dexter the Capuchin Monkey, and Rexy the Tyrannosaurus skeleton. Elsewhere, Jedediah (Owen Wilson) and Octavius (Steve Coogan) are watching a cat video on YouTube.Larry meets a new wax figure Neanderthal named Laa who was modeled to look like Larry as a joke. Ahkmenrah had earlier alerted Larry to the fact that the tablet is starting to corrode, causing all the exhibits to act abnormally. The corrosion causes chaos during the event, with the attendees having to flee from dangers caused by the affected exhibits. When Larry returns home, he catches his son Nicky throwing a party for which he is serving as the DJ. Nicky tells Larry that he does not intend to apply to college, wanting to take time to pursue being a DJ and to figure out what he wants to do with his life.Larry researches the tablet and learns that Cecil Fredericks, the former museum security guard that tried to steal the tablet for himself, was the boy present at the discovery of the tablet. Larry finds Cecil in a retirement home along with his cohorts Gus and Reginald. Larry explains to Cecil what is happening, and he recalls \"the end will come\" prophecy, realizing it was not an \"end of the world\" prophecy but a reference to an end to the magic. He suggests that they consult Ahkmenrah's parents, who are in the British Museum. Larry later goes to Dr. McPhee, who is in the process of being fired, and convinces him to call the British Museum and allow Larry to travel there with Ahkmenrah and the tablet.Larry and Nicky travel to London to get to the British Museum. They meet the security guard of that museum, Tilly, who lets them through the gate. When Larry gets into the museum, he sees that Laa, Teddy, Sacagawea, Attila, Dexter, Jed, and Octavius have all stowed away to join on the adventure. The Tablet brings the British exhibits to life and the gang encounters a Triceratops skeleton which chases them. They are saved by Sir Lancelot (Dan Stevens). Lancelot loves Queen Guinevere but has been sent on a quest by King Arthur to find the Holy Grail & ordered not to return without it. Unfortunately, the gang has lost Jed and Octavius; they discover that they have fallen into the ventilation chambers. Larry sends Dexter into the ventilation with Nicky's cell phone attached to his waist to find Jed and Octavius. Jed and Octavius land on a Pompeii exhibit just before it erupts. The gang fights off a nine-headed Xiangliu statue, which Larry defeats using a defibrillator. Meanwhile, Dexter urinates on the lava to save Jed and Octavius.The gang finds the tombs of Ahkmenrah's parents, Merenkahre (Ben Kingsley) and Shepseheret. Merenkahre is at first hesitant to reveal the truth behind the Tablet, but he eventually admits that it was a gift made for his son when he was a baby to keep the family together always. Endowed with the power of Khonsu, the tablet needs moonlight to retain its magic.Lancelot steals the tablet, thinking it to be the Holy Grail and then leaves to find Guinevere. The tablet continues to corrode, causing Teddy's hands to return to wax and Ahkmenrah to age. The gang splits up to find Lancelot and regain the tablet, but Larry is caught by Tilly, who then locks Larry and Laa in the security room. There, Larry starts to think about his relationship with Nicky. Laa eventually smashes the glass of the door with his head to free Larry and himself. Larry and the gang continue to search for Lancelot again but are cornered by the Trafalgar Square lion statues. Larry distracts them with a flashlight like in the cat video Jed and Octavius had previously watched on YouTube.Lancelot has made his way to a local theater showing a Camelot production starring Hugh Jackman as King Arthur and Alice Eve as Guinevere. Sir Lancelot runs onstage with the tablet and tries to convince \"Guinevere\" to join him. The actors eventually convince Lancelot that they are actors, upsetting Lancelot and causing him to take a lighted torch from the stage and run to the roof. Larry and the gang chase Lancelot and attempt to get him to adjust the tablet appropriately in order for the moonlight to restore it. Larry convinces Lancelot to give him back the tablet to save his friends once the other exhibits all return to their lifeless state due to the corrosion of the tablet. Larry then adjusts the tablet, and it is restored by the moon, reanimating Teddy, Dexter, and the rest.Larry returns the tablet to Merenkahre after the New York exhibits explain that they believe the tablet and the pharaohs should stay together. On the way out, Larry catches Tilly and Laa in a romantic moment. As they leave, Larry tells Tilly that, starting the next day, she will have the greatest job in the world. Back in New York, the exhibits accept their fate and say goodbye to Larry.Three years later, a British Museum treasures exhibition event is happening at the American Museum of Natural History. Tilly shows up to McPhee's office with a box. McPhee explains that Larry left the museum and went on to become a teacher, after taking the blame for what happened when the exhibits went ballistic, granting McPhee his job back. Tilly opens the box and takes out the tablet. She brings Dr. McPhee to show him all the exhibits coming to life, including some new light displays. The exhibits then have a party.Outside, Larry pauses on the sidewalk to see the flashing lights from inside the museum; as he watches, he smiles.",
	"links": [
		"https://www.amazon.com/Night-at-Museum-Secret-Tomb/dp/B00R7FU2UE"
	]
}