{
	"title": "Fences",
	"release_year": "2016",
	"runtime": "139",
	"tags": [
		"Drama",
		"amazon"
	],
	"rating": 7.2,
	"actors": [
		"Denzel Washington",
		"Viola Davis",
		"Stephen McKinley Henderson",
		"Jovan Adepo",
		"Russell Hornsby",
		"Mykelti Williamson",
		"Saniyya Sidney",
		"Christopher Mele",
		"Lesley Boone",
		"Jason Silvis"
	],
	"staff": [
		"Denzel Washington",
		"August Wilson",
		"Todd Black",
		"Scott Rudin",
		"Denzel Washington",
		"Marcelo Zarvos",
		"Charlotte Bruus Christensen",
		"Hughes Winborne",
		"Victoria Thomas",
		"David Gropman"
	],
	"votes": 119450,
	"cover": "https://m.media-amazon.com/images/M/MV5BOTg0Nzc1NjA0MV5BMl5BanBnXkFtZTgwNTcyNDQ0MDI@._V1_QL75_UX190_CR0,8,190,281_.jpg",
	"description": "In 1950s Pittsburgh, Troy Maxson (Denzel Washington) lives with his wife Rose (Viola Davis) and their son Cory (Jovan Adepo) and works as a waste collector alongside his best friend, Jim Bono (Stephen Henderson). Troy's younger brother, Gabriel Maxson (Mykelti Williamson), sustained a head injury in World War II that left him mentally impaired, for which he received a $3,000 government payout that Troy used to purchase a home for his family. Gabriel has since moved out, but still lives in the neighborhood, often getting in trouble with the law for his eccentric behavior, which includes religious fixations.In his adolescence, Troy left home from his abusive father and became a robber to sustain himself. After killing a man during a robbery led him to prison, he met Bono and revealed himself to be a talented baseball player. He then played in the professional Negro Leagues; but he never made it to Major League Baseball, which had no black players in the years before 1947. When Bono says that Troy was born too soon, Troy rejects this choice of words and insists that he was passed over due to the color of his skin. Having survived a near-fatal bout of pneumonia in his youth, Troy claims to have done so by defeating the Grim Reaper in a fistfight, upon which the Reaper vowed to return for a rematch.Troy's estranged son from a previous relationship, Lyons Maxson (Russell Hornsby), visits him on each payday to borrow money, upsetting Troy, whose belief in responsibility rejects Lyons's pursuing his dream of becoming a musician instead of finding a real job - Troy refuses to even visit the club where his son's band is playing. Rose later tells Troy that Cory is being scouted by a college football team, but Troy is dismissive of Cory's chances of reaching the NFL. Not only is he stung by his own lack of success in baseball, but he believes that racial discrimination is still common in the major leagues. He tells Cory that he will not sign the permission documents. He does not want his son to fail as he did, but there is also some jealousy that Cory might achieve the success that had eluded his father.Rose asks Troy to build a fence around their house, and Troy demands that Cory help him as punishment for Cory not doing his chores due to football practice. Troy and Cory clash over Cory's ambitions to play college football. On learning that Cory is not working at his part-time job due to football practice, Troy demands that he returns to the job, despite Cory's attempts to convince him that the job is being held for him until football season is over.Troy achieves a promotion to driving the garbage truck, becoming the first African-American to do so in Pittsburgh, even though he can't read and doesn't have a driver's license. Bono finds out that Troy is cheating on Rose with Alberta, a woman he met at the local bar, and alerts him his actions will have repercussions. The two then become estranged when Troy is assigned to a different neighborhood. Troy later finds out that Cory did not return to his part-time job at the A&P, and forces Cory's coach to kick him off the team - Troy also refuses to meet with the college scout who plans to visit their home. Cory lashes out and throws his helmet at Troy, which Troy claims is the first of Cory's three permitted offenses. When called to bail Gabriel out of jail for disturbing the peace, Troy unknowingly signs papers rerouting half of Gabriel's pension to a psychiatric hospital, forcing Gabriel to be institutionalized.Troy is forced to reveal his affair to Rose when his mistress becomes pregnant, leading to an argument in which Troy aggressively grabs Rose, causing Cory to intervene and knock Troy into a fence, which Troy marks as Cory's second offense. In the following months, Troy and Rose become estranged, although they keep living in the same house, as Troy continues to visit his mistress, who ultimately dies in childbirth after going into early labor, leading an embittered Troy to angrily challenge the Reaper to another fight.Troy brings his baby daughter Raynell home, and Rose decides to raise her as her own, but refuses to accept Troy back into her life. Cory is considering enlisting in the United States Marine Corps after missing his opportunity to attend college. One day, when he returns home, an intoxicated Troy blocks his path and instigates a fight in which Cory swings at Troy with a baseball bat. Troy gains the upper hand, grabs the bat from Cory, and drives him out of the house. Both energized and disoriented by his victory, Troy once again challenges the Reaper to come for him.Six years later, Troy has died of a heart attack, and Cory, now a USMC corporal, returns home, but informs Rose he will not attend the funeral. Rose admits to loving Troy despite his many flaws and pleads that Troy is still a part of him, and Cory later reconsiders after interacting with an older Raynell (Saniyya Sidney). Lyons is serving three years for fraud and gets furlough to attend the funeral. Similarly, Gabriel is released from the hospital to attend and reunites with his family as they all bid farewell to Troy. Gabriel prays for St. Peter to open the gates of heaven for Troy, and a shimmering sunlight glistens over them, symbolizing inter-generational forgiveness and peace.",
	"links": [
		"https://www.amazon.com/Fences-Denzel-Washington/dp/B01N1P9MYW"
	]
}