{
	"title": "Star Trek Beyond",
	"release_year": "2016",
	"runtime": "122",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Chris Pine",
		"Zachary Quinto",
		"Karl Urban",
		"Zoe Saldana",
		"Simon Pegg",
		"John Cho",
		"Anton Yelchin",
		"Idris Elba",
		"Sofia Boutella",
		"Joe Taslim"
	],
	"staff": [
		"Justin Lin",
		"Simon Pegg",
		"Doug Jung",
		"Gene Roddenberry",
		"J.J. Abrams",
		"Justin Lin",
		"Roberto Orci",
		"Lindsey Weber",
		"Michael Giacchino",
		"Stephen F. Windon",
		"Greg D'Auria",
		"Dylan Highsmith",
		"Kelly Matsumoto",
		"Steven Sprung",
		"April Webster",
		"Alyssa Weisberg",
		"Andrew Murdock",
		"Thomas E. Sanders"
	],
	"votes": 260711,
	"cover": "https://m.media-amazon.com/images/M/MV5BN2FhNDI1YTYtNWI0OC00ZjYxLWJlYWEtN2ZiZjRmZDY1MWJjXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Captain James Tiberius Kirk (Chris Pine) acts as a diplomatic intermediary for the Fibonians in a mission to the Teenaxi. He offers the Teenaxi the Arbonath, part of a weapon as a gift and a proposal for truce. The Teenaxi attack Kirk when they do not trust the Fibonians (and believe the weapon to be stolen), but he beams off the planet.\nKirk stores the Arbonath in the ship's vault.Three years (966th Day) into its five-year mission, the USS Enterprise arrives at Star base Yorktown, a massive (newest and the most advanced) space station, for resupply and shore leave for her crew. Kirk is exhausted with the endless routine of space travel and can no longer distinguish when one day ends and the next one begins. They continue to search for new life forms in order to establish firm diplomatic ties. Prolonged cohabitation has complicated inter personnel dynamics.\nKirk knows that he joined Starfleet on a dare, unlike his own father, who believed in its mission and its principles.Struggling to find continued meaning in the endless nature of their mission of exploration (he believes that the Universe is truly endless and so exploration has no end), Captain James Kirk (Chris Pine) has applied for a promotion to Vice Admiral and commanding officer of Yorktown. He recommends Spock (Zachary Quinto) as the new captain of the Enterprise.\nMeanwhile, Hikaru Sulu (John Cho) reunites with his family, Montgomery Scott (Simon Pegg) works to keep the ship operational, and Spock and Nyota Uhura (Zoe Saldana) amicably end their relationship; Spock also receives word from New Vulcan that Ambassador Spock (Spock's future self from the original time-line) has died.The Enterprise is dispatched on a rescue mission after an escape pod drifts out of a nearby uncharted nebula. The survivor, Kalara (Lydia Wilson), claims her ship is stranded on Altamid, a planet within the nebula. She says that the ship was on a scientific mission inside the nebula when is malfunctioned and crash landed on the planet. Once inside the Nebula, Enterprise has no communication with Starfleet.The Enterprise reaches the Altamid, which shows massive underground activity, but no life forms on the surface.\nThe rescue turns into an ambush when the Enterprise is quickly torn apart by a massive swarm of small ships. The ships have a tough outer shell which penetrates the Enterprise's hull without any resistance. The Phasers are ineffective, and the torpedoes cannot track their movements. The ships attack and detach the warp nacelles.\nKrall (Idris Alba) (Captain Balthazar Edison, former commander of the USS Franklin who became a powerful mutated alien creature under the alias of Krall) and his crew board the ship.Krall takes control a relic called an Abronath that Kirk had obtained for the diplomatic mission to Teenaxi. Kirk manages to attack Krall and wrest back control of the Abronath, as Krall is weakened with prolonged exposure to Earth like atmosphere. Scotty manages to reroute the reserve power to the impulse engines to provide some control on the Enterprise. As Enterprise tries to escape into the Nebula, Krall orders an attack to cut the saucer section connection to the warp core and cut off its source of power.\nScott is launched into space in an escape pod, but Krall captures and removes many crew members from the ship (they capture the escape pods from the ship as well). Kirk then orders for the crew to abandon ship as the Enterprise's saucer section hurtles towards the planet. Kirk gives the Abronath to a crew member to hide. Uhura pushes Krall (who got the empty shell of Abronath and realize that Kirk hid the weapon) into an escape pod with herself and ejects before he can get to Kirk. As the ship is doomed, Kirk orders full evacuation. Kirk is the last one to leave just before the saucer crashes into the planet.\nDuring their escape, different crew members land on different parts of the planet.On the planet's surface, Sulu, Uhura, and other survivors are captured by Krall. Sulu and Uhura manage to escape from their prison and find that Krall possesses a lot of Federation technology. Sulu finds that Krall had hacked into the Yorktown database and had been tracking the Enterprise from the beginning. They manage to send a distress signal to the Yorktown but are then captured. Krall says that the distress signal had incorrect coordinates, which means the Yorktown fleet will be stranded in the nebula and the base will be defenseless. Krall says that his attack on the Federation will spread from the Yorktown.Kirk and navigator Pavel Chekov (Anton Yelchin), accompanied by Kalara, locate the wrecked saucer section. Kalara claims to be the captain of the ship that was attacked by Krall and claims that he is holding her crew hostage till she delivered the Enterprise to him.Kalara leads Kirk and Pavel back to the Enterprise. Kirk wanted to use the ship's scanners to search for the crew. Kalara is discovered to be Krall's ally when she tries to retrieve the Abronath as she did not know that Kirk had already hid it.\nTo escape Krall's soldiers, Kirk activates the still-functional Thrusters, causing the saucer to lurch forward, crushing Kalara. Kirk tracked the call Kalara made to Krall and found the location of his base.Meanwhile, a wounded Spock and Dr. Leonard McCoy (Karl Urban) search for other survivors. Spock confides to McCoy that he intends to leave Starfleet to continue the late Ambassador Spock's work on New Vulcan. This is also the reason he broke up with Uhura. Spock and McCoy find a cave which has carvings similar to the Abronath, indicating that it came from the planet.Meanwhile, Scott is attacked by hostiles on the planet, who also crash landed there just like the Enterprise. He is rescued by Jaylah (Sofia Boutela), a scavenger who previously escaped Krall's encampment. Jaylah says that Krall is searching for a death machine.\nShe takes Scott to her makeshift home, the grounded USS Franklin, an early Starfleet vessel reported missing over a century earlier. It was the first Federation vessel capable of Warp 4 and went missing in the Gagarin radiation belt in 2160s.Kirk and Pavel trigger one of Jaylah's traps and are reunited with Scott. Kirk and Pavel then use the Franklin and find a transmission from McCoy. Spock and McCoy are also found. They determine the crew's location using the unique Vokaya mineral on the necklace that Spock had gifted Uhura.\nUsing the ship as a base, they plot to raid Krall's camp and transport the crew to the Franklin, then escape the planet in the repaired ship.Meanwhile, Krall realizes that Kirk hid the Abronath with the crew. He threatens to execute them and forces Ensign Syl (Melissa Roxburgh) to hand over the Abronath that she had kept hidden for Kirk (she hid it in her brain as her exoskeleton opens up).\nThe Abronath is the missing half of an ancient bio weapon, created by the planet's original inhabitants which can disintegrate any humanoid. Krall demonstrates the Abronath to Uhura using Syl as a specimen.\nWith the device complete, Krall intends to attack Yorktown and kill its inhabitants, and, using the Yorktown's advanced technology, go on to attack the Federation.Kirk and the others free the crew as Krall launches into space with the bio-weapon, leading his drone fleet to Yorktown. Krall's officers try to stall Kirk and his crew as much as possible but are outnumbered. As everyone is transported out, Kirk stays back as Jaylah has been engaged by one of Krall's officers. Kirk rescues Jaylah and she understands the meaning of being part of a crew.The Starfleet crew pursues Krall in the Franklin (after Sulu drops the ship from a cliff, by using the impulse engines, in order to jump start the warp core engines).\nSpock determines that the swarm is coordinated and hence must rely on some frequency of communication. If the communication is disrupted, the swarm maybe defeated. Scott transports Spock and McCoy into one of Krall's drone ships. After dispatching the pilot, they learn that VHF transmissions can disrupt Krall's communications and destroy his fleet. Matching the drone fleets frequency (577 Mhz) and using the 'classical' song Sabotage by the Beastie Boys, they destroy almost the entire fleet.\nKrall and his three surviving ships crash in Yorktown. As Krall flees into the city, Uhura and Kirk discover from the Franklin's logs that 'Krall' is actually Balthazar Edison, the former captain of the Franklin. A Pre-Federation human soldier, Edison was bred on war. Edison became disillusioned with the newly founded Federation, rejecting its principles of unity and cooperation with former enemies.When he and his crew were stranded on Altamid by a rogue wormhole, he believed the Federation had deliberately abandoned them. The three survivors prolonged their lives with the technology of the planet's extinct natives (at the cost of their human physiology and their numerous victims' lives), and re-purposed that species' dormant drone workers into the swarm. Krall now plans to destroy the Federation to resume galactic conflict. Kirk pursues Krall into Yorktown's ventilation system, where Krall activates the bio-weapon. Before it can be unleashed, Kirk ejects the weapon and Krall into space. Spock and McCoy save Kirk moments before he is also blown into open space.Kirk opts to remain as captain, and Spock chooses to stay in Starfleet and resumes his relationship with Uhura. Jaylah is accepted into Starfleet Academy based on Kirk's recommendation.\nAs the crew celebrates Kirk's birthday, they view the construction of their new ship, USS Enterprise-A, and after its completion, they depart to resume their five-year mission.",
	"links": [
		"https://www.amazon.com/Star-Trek-Beyond-Chris-Pine/dp/B01IG0E1F0"
	]
}