{
	"title": "Anyone But You",
	"release_year": "2023",
	"runtime": "103",
	"tags": [
		"Comedy",
		"Romance",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Sydney Sweeney",
		"Glen Powell",
		"Alexandra Shipp",
		"Mia Artemis",
		"Nat Buchanan",
		"Josh Bonello",
		"Gata",
		"Hadley Robinson",
		"Dermot Mulroney",
		"Rachel Griffiths"
	],
	"staff": [
		"Will Gluck",
		"Ilana Wolpert",
		"Will Gluck",
		"Will Gluck",
		"Jeff Kirschenbaum",
		"Joe Roth",
		"Este Haim",
		"Christopher Stracey",
		"Danny Ruhlmann",
		"Kim Boritz-Brehm",
		"Tia Nolan",
		"Nikki Barrett",
		"Kathleen Chopin",
		"John Ort",
		"Steven Jones-Evans"
	],
	"votes": 119215,
	"cover": "https://m.media-amazon.com/images/M/MV5BMDYwY2EzMjQtNjJjMS00OThhLWE4MGEtNDI2YjAwMTE5MDI5XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "While trying to secure a restroom key at a coffee shop, Boston University law student Bea (Sydney Sweeney) meets Goldman Sachs employee Ben (Glen Powell). The shop wont give Bea the key without having purchased something and the purchasing line at the cashier was too long. Ben was at the head of the line, pretended to be her husband ad got her the key.\nThe two have an instant connection and spend the day together, ultimately falling asleep on Ben's couch.\nShe leaves without waking him in the morning, but reconsiders and returns to the apartment, only to overhear him insulting her while talking to his friend Pete (GaTa).\nShifting back to Ben, who was incredibly hurt by this decision of Bea leaving, he gets up and decides to look at the \"giant wrench\" that he decided to tell her about (Ben had said that his mom gifted him the wrench telling him that no matter how broken something is, it can be fixed). He does not tell anyone about his mom, although he did tell her because he knew she was special. Pete believes that Ben is already in love with Bea.\nBen claims to Pete that he could not get her out of the apartment fast enough. When Bea is about to go back inside to talk to him, like her sister, Halle (Hadley Robinson), advised her to, she is distraught by this dialogue. As Ben continues to degrade her to Pete, Bea turns around and leaves with her thoughts gathered about him. As she walks through Boston, she collects herself.Bea and Ben do not see each other again for six months, crossing paths when Bea's sister, Halle, begins dating Pete's sister, Claudia (Alexandra Shipp). The two are frosty toward each other, each blaming the other for their date ending poorly. Ben blames Bea for bailing on him, and Bea calls out Ben for labeling her a disaster.\nHalle and Claudia later become engaged and plan a wedding in Sydney.Bea, who has broken up with her fiance Jonathan (Darren Barnet) and secretly dropped out of law school, is dismayed to find that Ben is not only on the same flight to Australia as her, but that they will both be staying at Claudia and Pete's parents' house in the days leading up to the wedding.\nBea and Ben's disdain for each other begins to frustrate the other members of the wedding party, compounded by the appearances of both Bea's and Ben's exes, Jonathan and Margaret (Charlee Fraser), respectively.\nClaudia tells Ben that she loves Halle very much and wants a perfect wedding. Margaret is Claudia's cousin and is hence invited to the wedding. Margaret is now dating Beau (Joe Davidson).\nBea's parents (Leo (Dermot Mulroney) and mother Innie (Rachel Griffiths)) invited Jonathan as they didn't want Bea to be alone at the wedding.\nRoger (Bryan Brown) and Carol (Michelle Hurd) are Claudia and Pete's adoptive parents.Ben and Bea are at each other's throats and burn down a wedding decoration (and Halle's hair) at a dinner. Claudia is convinced that Ben and Bea will ruin their wedding and their memories.\nWhile Bea's parents attempt to push her to reconcile with Jonathan, the other attendees devise a plan to get Bea and Ben together to ensure the wedding goes off smoothly.\nBea quickly sees through the scheme and makes a deal with Ben to pretend that they are together in order to both make Margaret jealous and stop Bea's parents pushing her to make up with Jonathan.Ben apologizes to Bea for insulting her behind her back, when she came back after their first date. Jonathan tries to woo Bea, while Margaret tries to spend some time with Ben.\nEarly efforts to sell the relationship are unsuccessful (Their friends ignore their nuzzling, while Bea's parents can see right through her) until a party on a boat, where Bea and Ben dance together and reenact a scene from Titanic, which ends in Bea falling into Sydney Harbour. Ben jumps in after Bea, and they have a conversation while waiting for rescue on a buoy. She tells him that she has withdrawn from law school, and they make a date to sight-see at the Sydney Opera House. She says that she broke up with Jonathan because they never fought.\nBen says that he was hurt when Bea left and that is why he said those insulting things about Bea to Pete.\nThey return to the house and have sex, but Bea suggests offhandedly that her recent actions have all been mistakes, which disappoints Ben. He slips away in the early hours of the morning, disheartening Bea.The morning of the wedding, Margaret asks Bea for her blessing to rekindle things with Ben. Bea accepts, claiming that she was only Situationally involved with him. Through a conversation with Pete, Ben indirectly reveals to Bea's parents that she has secretly quit law school, leaving her feeling betrayed.After overhearing Halle and Claudia arguing (after the family dog destroyed their wedding cake just before the ceremony), Ben convinces Bea to pretend to reconcile for the sake of the wedding. The ceremony goes smoothly, but Bea sees Margaret kissing Ben during the reception and leaves in tears, heading to the Opera House.\nHowever, Ben rejects Margaret and says that he no longer has feelings for her as he was wrongfully stuck on a memory. The wedding guests convince him to chase after Bea, so he jumps off a nearby cliff and into the Pacific Ocean, then convinces the rescue helicopter that retrieves him to fly him to the Opera House.Ben apologizes to Bea, telling her that he left because he feared their relationship could become another regret. They reconcile and return to the reception as a couple, where Halle and Claudia reveal that their argument was yet another ruse to push Bea and Ben toward each other. Meanwhile, Jonathan and Margaret get together.",
	"links": [
		"https://www.amazon.com/Anyone-But-You-Sydney-Sweeney/dp/B0CN53WN67"
	]
}