{
	"title": "Bãhubali: The Beginning",
	"release_year": "2015",
	"runtime": "159",
	"tags": [
		"Action",
		"Drama"
	],
	"rating": 8.0,
	"actors": [
		"Prabhas",
		"Prabhas",
		"Rana Daggubati",
		"Anushka Shetty",
		"Tamannaah Bhatia",
		"Sathyaraj",
		"Ramya Krishnan",
		"Nassar",
		"Rohini",
		"Meka Rama Krishna",
		"Adivi Sesh"
	],
	"staff": [
		"S.S. Rajamouli",
		"Vijayendra Prasad",
		"S.S. Rajamouli",
		"C.H. Vijay Kumar",
		"Ajay Kumar",
		"Prasad Devineni",
		"Shobu Yarlagadda",
		"M.M. Keeravani",
		"KK Senthil Kumar",
		"Kotagiri Venkateshwara Rao",
		"Sabu Cyril"
	],
	"votes": 139860,
	"cover": "https://m.media-amazon.com/images/M/MV5BNmNlYWMyYWUtMmVlNy00MzFkLTgxYTQtYzQ5ZTU1ZGYyNjYyXkEyXkFqcGc@._V1_QL75_UY281_CR4,0,190,281_.jpg",
	"description": "In the ancient Kingdom of Mahishmati in India, Sivagami (Ramya Krishnan), carrying a baby in her arms, emerges from a cave directly next to a waterfall. She is being chased by soldiers. She kills the soldiers but falls into the river nearby. Knowing that she can't be saved, she makes the ultimate sacrifice, her own life, to save the baby. She holds her hand and the child above water, while she drowns herself. Local villagers spot the stranded child and save the infant while Sivagami dies with her finger pointing to the top of the waterfall. Sanga (Rohini) and her husband name the infant Shivudu and raise him as their own son. To prevent anyone from coming for the baby, they seal the cave with a large rock.Shivudu (Prabhas) grows up aspiring to climb the waterfall which irks his mother as she does not want to lose her son. He attempts again and again to climb the massive waterfall but fails. Seeing that his son isn't going to stop climbing she asks Swamiji (Tanikella Bharani) for a solution. He tells her that she has to pour water on Shivling 116 times and only then will Lord Shiva answer her prayers. When Shivudu finds out about it, he picks Shivling on his shoulders and puts it below the waterfall. From the top of the falls, a mask falls in to the lap of Shivudu. After pressing the mask into the dirt, he creates an imprint of the person whom the mask belongs to, a beautiful girl. He tries again to climb the waterfall and seeing visions of the girl whom the mask belongs to, succeeds.On top of the waterfall, Shivudu, now called Shiva, discovers that the mask belongs to Avanthika (Tamannaah), a rebellious warrior whose group has indulged in a guerrilla warfare against king Bhallala Deva / Palvaalthevan (Rana Daggubati) of Mahishmati Kingdom. The group intends to rescue former queen Devasena (Anushka Shetty) who is the real mother of Shiva and she has been imprisoned by the king for the past 25 years.While Avanthika initially doubts Shiva's intentions, later she falls in love with him after she finds out that he has climbed the waterfall for her. Shiva pledges to help her in her mission and sneaks into Mahishmati to rescue Devasena. Meanwhile, the king's Royal Guard Kattappa (Sathyaraj), known for his warrior abilities, is making arrangements to erect a large statue of the King. During the celebrations, Shiva infiltrates the boundaries of the Mahismati kingdom. During the erection of the statue, some workers slip & the statue is about to fall, when Shiva steps in and stops the statue from falling all by himself, before rallying the men & erecting the statue correctly. The villagers recognize Shiva as Bahubali & chant his name, which worries Bhallala as no-one has spoken the Bahubali name in his kingdom for 25 yrs.Impressed by Katappa's skills, a warrior (Sudeep) from a Kingdom in the Eastern region, offers his friendship to Kattappa (this scene takes place earlier). On the other hand, Kattappa and his group, attack Shiva upon the order of the King. After Shiva beheads Bhadra (Bhallala Deva's son), Kattappa drops his weapons on realizing that Shiva is Mahendra Baahubali, the son of late king Amarendra Baahubali. Shiva's adoptive family travel through the cave to join the others and witness his ascension.A flashback reveals the animosity between cousins Amarendra Baahubali and Bhallala Deva / Palvaalthevan, whose father is Bijjala Deva / Pingaladevan (Nassar). They are both trained in all areas including warfare but both of them have different approach towards kingship. Amarendra Baahubali is liberal to everyone and loves his public and so the public love him but Bhallala Deva has tendency to achieve his goals with any means possible. When a war is waged by another Kingdom, they both are guided by Shivagami that whoever brings the head of the enemy Ruler will be rewarded as the New King.Sivagami is Bijjala's wife & became the caretaker of the kingdom when Amarendra's father & Bijjala's younger brother died in a freak accident. Amarendra's mom died in childbirth. Bijjala saw this as an opportunity to wrest the kingdom for his son, but Sivagami decided to treat both sons equally & let fate decide the future king of Mahismati kingdom.While Amarendra Baahubali uses his skill, cunning and ability to crush the enemy by motivating his troops against the stronger Army, on the other side Bhallala Deva uses all the resources of the Army, killing innocent people as well as the enemy, to win the war. In the end, when Baahubali is on the verge of killing the Enemy Chief, Bhallala Deva kills the Enemy Chief with his ranged weapon, thus taking all the credit of winning the war.But Shivagami, who is wise, announces Amarendra Baahubali as the new king because of his nobility and leadership in the war. Kattappa and the others worship him as the king. After the flashback, when Shiva asks Kattappa who killed his father, Kattappa reveals himself as the killer.",
	"links": []
}