{
	"title": "Me Before You",
	"release_year": "2016",
	"runtime": "110",
	"tags": [
		"Drama",
		"Romance",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Emilia Clarke",
		"Sam Claflin",
		"Janet McTeer",
		"Charles Dance",
		"Vanessa Kirby",
		"Eileen Dunwoodie",
		"Pablo Raybould",
		"Gabrielle Downey",
		"Henri Charles",
		"Samantha Spiro"
	],
	"staff": [
		"Thea Sharrock",
		"Jojo Moyes",
		"Alison Owen",
		"Karen Rosenfelt",
		"Craig Armstrong",
		"Remi Adefarasin",
		"John Wilson",
		"Kate Dowd",
		"Andrew McAlpine"
	],
	"votes": 294975,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTQ2NjE4NDE2NV5BMl5BanBnXkFtZTgwOTcwNDE5NzE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Louisa \"Lou\" Clark (Emilia Clarke) must find a new job after being laid off from a cafe. Louisa had worked at the cafe for 6 years, but now it was closing down. Louisa lives with her father Bernard, mother Josie (Samantha Spiro), granddad (Alan Breck) and sister Katrina \"Treena\" Clark (Jenna Coleman). The family desperately needs the money, and the pressure is on Louisa to find a job. Louisa has an unthinking, marathon-running boyfriend named Patrick (Matthew Lewis), who is an entrepreneur.Out of options, Louisa visits the job center to figure out what is available. Louisa finds work as a caregiver for Will Traynor (Sam Claflin), a cynical former banker who was completely paralyzed by a motorcycle accident (he was crossing the street during a downpour and didn't see a motorcycle coming his way, which crashed into him) two years prior. The job offers 6 months, fix term contract with good money. Will has had 5 caretakers before and none persisted, so the family is also desperate to get somebody.Camilla Traynor (Janet McTeer) & Steven Traynor (Charles Dance) are Will's parents & try and organize the best facilities for him. Louisa has no experience with care-giving or Quadriplegia. During the interview with Camilla, Louisa makes jokes and is horrified when her skirt rips from being too tight. Despite the setbacks, Louisa claims that she is a fast learner, lives close to the castle, never gets ill and can make a mean cup of tea.\nWill is cold towards his parents. Will's mother hopes Lou's bubbly personality will lift Will's depressed and cynical spirits. Camilla says that it would be helpful if Will sees Louisa as a friend rather than a paid professional.Nathan is Will's nurse and brings her up to speed with his daily routine and his medicines. Nathan says that Lousia does not have to handle any of the physical stuff, but her main job is to cheer up Will.\nAt first, Will reacts coldly to her Spunkiness. Louisa tries very hard to connect with Will, but he is grumpy and just wants to be left alone. Louisa thinks about quitting the job, but her sister wants to go back to college, and begs Louisa to continue with the job, so she can continue to support their parents.Will's ex-girlfriend Alicia (Vanessa Kirby) visits and reveals that she is going to marry Will's former best friend Rupert (Ben Lloyd-Hughes). These bums Will out. Alicia tells Louisa that once can only help someone who wants to be helped.\nWill is sick of Lousia's gaudy costumes and tells her that he doesn't want to see her anymore. Louisa retorts that she is employed by his mother and is staying until she says otherwise. Louisa also refuses to indulge Will in his self-pity and treats him like a regular jerk who is being mean to others.\nLouisa confronts Will & tells him she can't quit her job as she really needs the money. Will finally starts to understand Louisa and starts to engage with her. He makes her watch a French film with him, even though she did not want to.\nLouisa is open and honest with Will and calls him a snob. Camilla notices that Will has started to have conversations with Louisa. Will tries to understand Louisa's life and routine and comments that her life is even duller than his own.Nathan (Steve Peacocke) tells Louisa that Will would never get any better & all the exercises and check-ups are only to keep his muscles from atrophying. Nathan says that Will is extremely susceptible to infections and his blood pressure is very erratic.\nWill gets sick and Louisa has to take care of him as Nathan is away. Louisa doesn't know what to do, and when Nathan arrives, he tells Louisa that Will doesn't sweat like the other humans and needs help to bring down his body temperature. Then Louisa notices Vut marks on Will's wrists and realizes that he has tried to take his own life before.Lousia continues to engage Will & shares with him that she had an offer from Manchester college to study fashion but didn't go because her family needed her. Louisa talks about her love for gaudy fashion and her love for life and she finds happiness in the smallest of things.\nWill and Louisa soon become friends and develop feelings for each other. Will encourages Louisa to widen her horizons and says that it is her duty to live her life as fully as possible.Overhearing an argument between Will's parents, Lou learns that Will has conceded six months to them before he will go to Dignitas in Switzerland for assisted suicide, as he is unable to accept a disabled life. Camilla is not willing to let go, but Stephen says that this is Will's choice and this is what he wants to do.\nLou takes it upon herself to change his mind by organizing trips and adventures to show him that life is still worth living.Together, they go for the horse races, the Mozart concert (Louisa wears a red dress), his ex-girlfriends wedding (where they decide to roam the world). Will exerts himself having fun with Louisa at the wedding & catches Pneumonia. Louisa ignores Patrick as she increasingly spends more and more time with Will. Finally, this leads to a breakup between Louisa and Patrick.Will even gives Lousia's dad Bernard (Brendan Coyle) a job, after he finds that his firm was the one responsible for him getting laid off, when the bank bought the firm, stripped it off and sold it for pieces.Will asks Lou to accompany him to Alicia's wedding. They start to fall in love.\nLouisa and Will, along with Nathan, start their world tour. Will & Louisa finally kiss. However, at their final trip to Mauritius with Will's nurse Nathan (Steve Peacocke), Will tells Lou he still intends to take assisted suicide, saying he wants her to live a full life instead of half a life with him. Heartbroken, Lou quits as Will's caregiver and refuses contact with him.She is heartbroken and does not speak to him the rest of the trip.Lou's father convinces her to visit Will, but she finds he has already left for Switzerland. She follows him there to be with him in his final moments.\nSome weeks after Will's death, sitting in his favorite cafe in Paris, Lou reads a letter he left for her. In it, he says he has left her enough money to follow her dreams and encourages her to live abundantly.",
	"links": [
		"https://www.amazon.com/Me-Before-You-Emilia-Clarke/dp/B01GIIVF6K"
	]
}