{
	"title": "Everest",
	"release_year": "2015",
	"runtime": "121",
	"tags": [
		"Action",
		"Adventure",
		"Biography",
		"max",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Jason Clarke",
		"Ang Phula Sherpa",
		"Thomas M. Wright",
		"Martin Henderson",
		"Tom Goodman-Hill",
		"Charlotte Bøving",
		"Pemba Sherpa",
		"Amy Shindler",
		"Simon Harrison",
		"Chris Reilly"
	],
	"staff": [
		"Baltasar Kormákur",
		"William Nicholson",
		"Simon Beaufoy",
		"Nicky Kentish Barnes",
		"Tim Bevan",
		"Eric Fellner",
		"Baltasar Kormákur",
		"Dario Marianelli",
		"Salvatore Totino",
		"Mick Audsley",
		"Fiona Weir",
		"Gary Freeman"
	],
	"links": [
		"https://www.max.com/movies/everest-one-up-won-finland/53dc4f6d-8db7-4b06-98ca-66f650fdd4e1",
		"https://www.amazon.com/Everest-Jason-Clarke/dp/B015IVFHWQ"
	],
	"votes": 235158,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjA0MjA2NDY5Nl5BMl5BanBnXkFtZTgwMjU1MjA5NTE@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "In March 1996, several commercial expeditions arrive at Mount Everest base camp to prepare for a climb to the summit. Rob Hall (Jason Clarke), who first popularized guided Everest climbs, is the leader of Adventure Consultants, whose clients include Beck Weathers (Josh Brolin), an experienced climber, Doug Hansen (John Hawkes), a former mailman pursuing his dream, and climbing veteran Yasuko Namba (Naoko Mori), who is hoping to complete her last of the Seven Summits. Scott Fischer (Jake Gyllenhaal) is the chief guide for competitor Mountain Madness. Helen Wilton (Emily Watson) is Rob's base camp manager.A month earlier in New Zealand, Rob says goodbye to his pregnant wife, Jan (Keira Knightley), and promises he will be home for the birth. At base camp, Rob receives a fax from her, informing him their baby will be a girl. He wants to name her Sarah, but Jan is against it.\nThe group lands in Kathmandu & takes a helicopter to the town of Lukla at 2800 meters. From there they trek to the Namache bazaar, 3750 meters, where climbing permits are checked. Tengboche monastery at 3867 meters. Thok La mountain pass at 4877 meters. at 5364 meters, its the Everest base camp.At base camp each team has to do 3 prep climbs, before the final ascent to Everest. The first climb takes one to Camp One at 5900 + meters. Camp two is at 6492 meters. Cara Lhoste is the last mountain pass (at 7132 meters) before the 3rd and final camp. Camp 3 is at 7345 meters and the final rest place before the summit climb.Worried about crowding on the mountain, Rob persuades Scott to cooperate to reduce delays on crucial passes such as the Hillary step. On the summit attempt, Rob's group departs Camp IV before dawn, planning to reach the top and turn around by 2 p.m., the latest safe time that will allow them to return to camp before nightfall. They are delayed over an hour after discovering guide ropes are not yet installed on upper reaches of the climb. Beck has eyesight problems and stops. Rob tells him not to continue if his condition does not improve in a half hour. Scott hurries back to camp to help another climber but is intent on re-ascending. Rob warns him about excessive exertion.Rob reaches the summit on time and is joined by other climbers including Yasuko, who jubilantly plants her flag of Japan in the snow. On the way down, Rob encounters Doug struggling just above the Hillary Step and orders him to turn back. Doug says he will not get the chance again and insists on continuing. Rob reluctantly agrees, and together they reach the summit after 4 p.m. Also at the top is Scott, exhausted and increasingly ill from high-altitude pulmonary edema.As Rob helps Doug descend, a blizzard strikes the mountain. Doug's oxygen bottle runs out, and he becomes semi-conscious. No full extra bottles are stored on the route where Rob had asked. Rob radios Helen to send someone up with oxygen. Doug, left alone briefly by Rob, Unclips himself from the guide rope in his Hypoxia daze and walks unsteadily along the extremely narrow path on the mountainside. A moment later he silently topples to his death.Scott's condition worsens, and he tells fellow climbers to continue descending without him. He lies down-soon to die. Returning climbers reach Beck, his vision still impaired. The group becomes lost when the blizzard obliterates the trail. Three climbers go for help, leaving Beck and Yasuko behind.Guide Andy Harris reaches Rob with the oxygen, which freezes shut. The two huddle together in the storm. While Rob sleeps, Andy hallucinates and falls to his death. In the morning, Rob radios Helen and tells her that Doug and Andy are gone and that his hands and feet are frozen. Helen calls Jan, hoping Rob will respond to her voice. Jan tells Rob that he must start moving. Rob tells her he is cold but comfortable and asks her to name their baby Sarah. He dies soon after.Returning climbers tell the camp that Beck and Yasuko are stranded. The weather is too dangerous for a rescue. Helen calls Beck's wife, Peach (Robin Wright), and informs her of the situation. In the morning, Beck miraculously regains consciousness, sees that Yasuko has died, and stumbles back to camp alone, to the astonishment of everyone. He is severely frostbitten and desperately needs medical help. Peach calls the American Embassy and organizes a helicopter rescue. The flight is dangerous because of the thin air, but the aircrew successfully makes the high-altitude medical evacuation. One of Scott's guides finds his body.Returning home, Helen has an emotional reunion with Jan, who later gives birth and names her daughter Sarah. Beck returns to his family, heavily bandaged. Closing titles inform the audience that he lost both hands and nose to severe frostbite and that Rob's body still remains on Everest."
}