{
	"title": "Annihilation",
	"release_year": "2018",
	"runtime": "115",
	"tags": [
		"Adventure",
		"Drama",
		"Horror",
		"amazon"
	],
	"rating": 6.8,
	"actors": [
		"Natalie Portman",
		"Jennifer Jason Leigh",
		"Tessa Thompson",
		"Benedict Wong",
		"Sonoya Mizuno",
		"David Gyasi",
		"Oscar Isaac",
		"John Schwab",
		"Gina Rodriguez",
		"Tuva Novotny"
	],
	"staff": [
		"Alex Garland",
		"Alex Garland",
		"Jeff VanderMeer",
		"Eli Bush",
		"Andrew Macdonald",
		"Allon Reich",
		"Scott Rudin",
		"Geoff Barrow",
		"Ben Salisbury",
		"Rob Hardy",
		"Barney Pilling",
		"Nina Gold",
		"Francine Maisler",
		"Mark Digby"
	],
	"votes": 368242,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTk2Mjc2NzYxNl5BMl5BanBnXkFtZTgwMTA2OTA1NDM@._V1_QL75_UX190_CR0,8,190,281_.jpg",
	"description": "At the U.S. government's Area X facility on a southern coast, cellular biology professor and former U.S. Army soldier Lena (Natalie Portman) undergoes a quarantined debriefing about an expedition into an anomaly called \"the Shimmer\", from which she and her husband are the only survivors. The Government interrogator says that Lena was in the Shimmer for 4 months, while the team had rations only for 2 weeks. Lena says that 2 members of her expedition are dead and doesn't know about the other 2.The Shimmer emerged three years prior from a meteor that landed in a lighthouse in the St. Mark's National Wildlife Refuge in Florida, and it is gradually expanding and increasing its boundaries. Many exploratory expeditions were organized.In a flashback, Lena's husband, an Army Special Forces soldier named Kane (Oscar Isaac), returns without warning to their home after having gone missing on a mission to the Shimmer nearly a year ago. Kane walked into his house as if nothing had happened. He was devoid of any emotion upon seeing Lena and Lena finds him to be distant.\nKane remembers nothing of that time in the Shimmer and suddenly becomes very ill. Lena teaches at University and Daniel (David Gyasi) is her colleague.\nLena remembers that when Kane was leaving for the mission, there was a greater than usual silence around it.A government security force intercepts Lena and Kane on the way to a hospital and brings them to Area X, near where a shimmering electromagnetic field began to spread three years earlier. For now, it has been kept a secret, but in a few months, it will expand to engulf cities and at that point, nothing will stop it.Psychologist Dr. Ventress (Jennifer Jason Leigh) recruits Lena into the project, explaining that military teams, including one with Kane, ventured into the Shimmer to reach a lighthouse, where the shimmer first appeared. No one except Kane, now in a coma (due to multiple organ failures), ever returned.\nThe lighthouse has been approached by land, sea and air, but neither man nor animal has ever returned. So far, the Shimmer has expanded into sparsely populated swampland, which was easy to evacuate under the pretext of a chemical spill.This time the government is sending a scientific team instead of a military one. The objective is to reach the lighthouse, acquire data and return.\nLena joins Ventress on a research expedition consisting of them, physicist Josie Radeck (Tessa Thompson), anthropologist Cass Sheppard (Tuva Novotny), and paramedic Anya Thorensen (Gina Rodriguez). Lena does not reveal to her teammates, other than Ventress, that Kane is her husband. Lena tells Ventress that she cannot help Kane from the outside and hence she has to go into the Shimmer to find out what happened to him.\nThere are 2 theories. Either something kills who goes in, or they all go crazy and kill each other.Guidance and communication technology fails, the team forgets extensive periods of time. The team has been inside for 3-4 days (from the rate of their food depletion) and yet have no memory of their time spent in the Shimmer.\nThe expedition encounters unusually mutated plants and animals and a mutated alligator attacks Josie. The team rescues her and learns that the alligator shows signs of being hybridized with a shark, with several concentric rows of teeth. The mutations were subtle at first but grew more and more extreme as they got closer to the lighthouse.At an abandoned military base, the team discovers evidence of Kane's expedition. Video on a memory card shows Kane cutting open a living expedition member to reveal that something inside him is moving. They later find soldiers from Kane's expedition dead as if they had exploded from the inside out. The corpse had turned into an overgrown colony of lichens.\nThat night, the base's perimeter fence is torn open as Ventress and Lena stand guard. A mutated, bear-like creature drags Cass away and kills her; the following morning, the team see Cass's boot. Lena investigates further alone, and she discovers the mutilated corpse of Cass. She returns to the team and tells them that Cass is dead.The group is freaked out and wants to return, which Ventress does not agree to. Ventress is determined to understand the source of the Shimmer. Lena argues that they are 6 days into the Shimmer and at this point, it would be faster to reach the coast and then follow it to the perimeter.\nAs the team continues toward the lighthouse at the center of the Shimmer, they find a settlement filled with human-shaped plants. Josie hypothesizes that the Shimmer functions as a prism, distorting and transforming everything that falls within its boundaries, like light waves, radio waves, plant DNA, human DNA and so on, including the expedition members' own DNA.\nThat night, Lena tests her own blood which confirms Josie's theory.That night, a paranoid Anya attacks and restrains Lena, Josie, and Ventress. She has discovered that Kane was Lena's husband and accuses the group of killing Cass. Anya hears what sounds like Cass screaming for help outside and investigates. The creature that killed Cass enters the house, and the screams are coming from the creature. It kills Anya and attacks Lena before Josie shoots and kills the creature.Ventress leaves the group and heads for the lighthouse, the center of the Shimmer. Josie believes Cassie's dying mind was \"refracted\" into the bear, and laments that the only piece left of Cassie was the pain and fear she experienced while being killed. She allows herself to succumb to the shimmer and \"refract\" into a humanoid plant, hoping to avoid a similar fate.\nLena follows Ventress to the lighthouse, where she discovers Kane's remains and a videotape. In the footage, Kane leaves an instruction to find Lena before killing himself with a phosphorus grenade. After the explosion, a doppelganger of Kane steps into frame.Lena descends into the hole and finds Ventress, who tells her the forces at work will spread to encompass everything. Ventress disintegrates into a glowing nebulous structure that absorbs a drop of blood from Lena's face and creates a humanoid entity that mimics Lena's every motion and eventually transforms into an identical copy of her. Lena exploits its mimicking behavior to set an active phosphorus grenade in its hands before fleeing. The creature is set ablaze by the grenade. Flames fully engulf the lighthouse, the various constructs in the area collapse, and the Shimmer fades away.Lena's debriefing concludes. She reunites with \"Kane\", who has recovered rapidly with the disappearance of the Shimmer. She asks him whether he is the real Kane, to which he replies, \"I don't think so.\" He asks her if she is Lena, to which she does not respond. The two embraces as their irises shimmer and shift in color.",
	"links": [
		"https://www.amazon.com/Annihilation-Natalie-Portman/dp/B079YYHM9Z"
	]
}