{
	"title": "Red Sparrow",
	"release_year": "2018",
	"runtime": "140",
	"tags": [
		"Action",
		"Drama",
		"Thriller",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Jennifer Lawrence",
		"Joel Edgerton",
		"Matthias Schoenaerts",
		"Charlotte Rampling",
		"Mary-Louise Parker",
		"Ciarán Hinds",
		"Joely Richardson",
		"Bill Camp",
		"Jeremy Irons",
		"Thekla Reuten"
	],
	"staff": [
		"Francis Lawrence",
		"Justin Haythe",
		"Jason Matthews",
		"Peter Chernin",
		"David Ready",
		"Jenno Topping",
		"Steven Zaillian",
		"James Newton Howard",
		"Jo Willems",
		"Alan Edward Bell",
		"Denise Chamian",
		"Zsolt Csutak",
		"Priscilla John",
		"Maria Djurkovic"
	],
	"votes": 203997,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTA3MDkxOTc4NDdeQTJeQWpwZ15BbWU4MDAxNzgyNTQz._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In modern-day Russia, Dominika Egorova (Jennifer Lawrence) is a famed Russian ballerina who supports her ill mother. Following a career-ending injury, Dominika is approached by her uncle, Ivan (Matthias Schoenaerts), who works in Russian intelligence. Ivan gives Dominika evidence that her injury was not an accident, it was a deliberate ploy by her dance partner to break her leg so that her spot would go to his girl friend. Dominika has her revenge by breaking his hip when he his having sex with his girlfriend.She is tasked with seducing Dimitry Ustinov (Kristof Konrad), a Russian politician, in exchange for her mother's continued medical care. As Ustinov sexually assaults her, he is killed by Simionov (Sergej Onopko), a Russian operative authorized by Ivan. Ivan offers Dominika a choice to begin working for Russian intelligence, or be executed so there are no witnesses.Nate Nash (Joel Edgerton) is a CIA operative working in Moscow. While meeting with an asset in Gorky Park, they are confronted by the police. Nash creates a diversion to ensure his asset, a mole in Russian ranks code-named Marble, escapes detection. Nash is reassigned back to the U.S. but Nash insists that he is the only individual whom Marble will work with, and is assigned to Budapest (as he cannot go back to Russia) to regain contact with Marble.Dominika is sent to train to become a Russian operative, known as a 'Sparrow', capable of seducing her targets. Dominika excels in her training, despite some friction with her trainers (she refuses to submit to any sort of sexual training or intimidation), and she is assigned to Budapest. Russian SVR has been tracking Nash, and hopes to find out the identity of Marble. Dominika's assignment is to gain the trust of Nash, and reveal his contact.Upon her arrival in Budapest, Dominika lives with Marta (Thekla Reuten), another Sparrow. Dominika quickly makes contact with Nash, who correctly determines that she is a Russian intelligence operative. Dominika reveals her true identity to him, as well as her motive to find out Marble's identity. While Marta is out, Dominika inspects her room, and realizes that she is working to gather information from Stephanie Boucher (Mary-Louise Parker), a chief of staff for a U.S. Senator. Dominika realizes she needs more time, and claims to Ivan that she is helping in Marta's effort to gather information from Boucher. Marta finds out that Dominika knows about Boucher. She confronts her and threatens to kill her, when she asks Marta for sympathy as Dominika is a witness to the Utsinov killing. Dominika claims that she needs protection and hence she used her knowledge of Marta's contact with Boucher to save her own ass as her contact with Nate is going nowhere.Upon returning home one day, Dominika finds Marta brutally tortured and murdered. Simionov reveals that he carried out the murder as a warning not to betray Russian secrets (Marta blabbed about the Utsinov episode to embassy chief in Budapest and Simionov comes to know of it).Dominika offers to work for Nash as a double agent. She carries out Marta's assignment to meet Boucher, and covertly exchanges the supplied information for CIA-supplied floppy disks. On leaving the meeting place, Boucher sees American agents and is spooked. She unintentionally steps into traffic and is killed. Russian agents observing Boucher realize that the mission had been compromised by Dominika. They require her to return to Moscow. She is tortured and interrogated for days. She convinces Ivan that she is now credible to the Americans, as she has been tortured by her own people and did not reveal information. Dominika returns to Budapest, and informs Nash that she wishes to defect with her mother to America.After spending the night with Nash, Dominika awakes to find him being tortured by Simionov, who is attempting to discover the identity of Marble. She initially helps Simionov torture Nash, but turns on him and kills him. She wakes in a hospital where General Vladimir Korchnoi (Jeremy Irons) reveals that he is Marble. He explains that he was initially patriotic, but grew to feel that Russia was corrupt. He fears he will be caught soon, and instead of dying in vain, instructs Dominika to reveal his identity to Ivan. She could then replace him as a mole and further their work by passing information to the CIA. But when Dominika contacts her superiors to reveal the identity of the mole, she frames her uncle Ivan rather than betray Korchnoi. Ivan is killed by the Russian side, and Dominika is congratulated for her work by her Russian superiors.Back home in Russia, Dominika lives with her mother, and receives a phone call from an unknown person who plays Grieg's piano concerto that she had listened to during her affair with Nash.",
	"links": [
		"https://www.amazon.com/Red-Sparrow-Jennifer-Lawrence/dp/B07B3HN24T"
	]
}