{
	"title": "Chef",
	"release_year": "2014",
	"runtime": "114",
	"tags": [
		"Adventure",
		"Comedy",
		"Drama",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"Jon Favreau",
		"Robert Downey Jr.",
		"Scarlett Johansson",
		"Dustin Hoffman",
		"John Leguizamo",
		"Bobby Cannavale",
		"Emjay Anthony",
		"Sofía Vergara",
		"Oliver Platt",
		"Amy Sedaris"
	],
	"staff": [
		"Jon Favreau",
		"Jon Favreau",
		"Sergei Bespalov",
		"Jon Favreau",
		"Kramer Morgenthau",
		"Robert Leighton",
		"Sarah Finn",
		"Denise Pizzini"
	],
	"links": [
		"https://www.amazon.com/Chef-Jon-Favreau/dp/B00MH78O0M"
	],
	"votes": 235629,
	"cover": "https://m.media-amazon.com/images/M/MV5BODkyNTI4YjUtNjEyNC00NWQ5LTk4M2YtM2Q3NjBiYmJmMGUyXkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Miami-born Carl Casper (Jon Favreau) is the head chef of Gauloise in Brentwood, Los Angeles. While popular with his kitchen staff and hostess Molly (Scarlett Johansson), Carl clashes with the restaurant's owner, Riva (Dustin Hoffman), who wants him to stick to \"classics\" rather than innovative dishes. Carl has a strained relationship with his tech-savvy preteen son, Percy (Emjay Anthony), and rich ex-wife, Inez (Sofía Vergara).When Carl has the chance to serve prestigious food critic and internet food blogger Ramsey Michel (Oliver Platt), Riva demands he prepare old favorites at the last minute (Riva asks Carl to stick to the tried and the tested, which he thinks is what people come to the restaurant for. Carl says the place has been in a creative rut for 5 years, but Riva would have none of it); Carl concedes, leading to a scathing review (2 stars and a personal insult insinuating that Carl gained weight because he ate all the food sent back to the kitchen).Carl works all night in his kitchen and cooks up a new menu, which his staff loves. They tell him not to worry about twitter. Carl is intrigued as he is not on twitter and his staff won't tell him what's going on. Percy signs Carl up on twitter. Percy shows Carl how Ramsey's review has gone viral and has been re-tweeted many times over.Carl insults Ramsey on Twitter (saying he wouldn't know a good meal if it sat on his face), not realizing that his reply is public (with Ramsey replying and re-tweeting to his 185K followers. He wrote he would rather have Carl sit on his face than go through the lava cake again :)) and gains a large online following. Carl invites Ramsey to a \"rematch\" but leaves after confronting Riva (who wants Carl to tweet and apology to Ramsey and serve the same menu), who wants the old menu again.\nAt home, Carl prepares the menu he wanted, while his sous-chef Tony (Bobby Cannavale) (who refuses to leave with Carl when he asked him to) serves Ramsey the same dishes from his prior visit. Ramsey tweets negatively about Carl calling him a no show, causing Carl to confront him at the restaurant and publicly berate him. Videos of Carl's meltdown go viral, leaving him humiliated and unemployable. Inez's PR rep Jen (Amy Sedaris) tells Carl that he might have a shot at Hell's kitchen after his \"stunt\". He has 20K followers on twitters now.\nMolly encourages Carl not to get a new job, working for someone else and wants him to do his own thing. She also proposes a trip so that Carl gets to spend time with his son Percy.Carl reluctantly accepts Inez's invitation to accompany her and Percy to Miami, where he rediscovers his love for Cuban cuisine. At Inez's encouragement, her ex-husband Marvin (Robert Downey Jr.) offers Carl a dilapidated food truck. Carl gets down to fixing it and its very hard work. Carl and Percy bond while restoring the truck and buying groceries, and Carl gives him a chef's knife. Martin (John Leguizamo), Carl's friend and former line cook, turns down his promotion at Gauloise to join Carl, who has reignited his passion as a chef. Martin gathers some Cubans from Marvin's work site (he owns an equipment rental company) who agree to work for Carl, cleaning the truck and loading all the new equipment if Carl cooks them a good meal. In no time, the truck is ready.\nCarl also teaches Percy to have pride in what he is doing and not take short cuts, when Percy tries to serve a burnt sandwich to the workers as it is free for them. Martin calls in a favor from his cousin to give the truck a fresh paint. He names the truck \"El Jeffe\".Carl, Martin, and Percy drive the truck across the country to Los Angeles, serving Cuban sandwiches and Yuca fries. Percy promotes them on social media (posting 6 second videos of their entire trip, taking 1 second daily snippets, as well as their live Geo-tagged location when they set up shop in a city) (Percy learns to use cornstarch on the balls to suck up extra moisture), and they find success in New Orleans and Austin, where their daily specials include Po' boys and barbecued brisket, made with local ingredients.Back in Los Angeles, having strengthened his relationship with Percy (Carl sits Percy down and says that eventually Percy will have to go back to school and things between them will go back to before, and not like what they were in the last 2 weeks), Carl accepts his son's offer to help with the food truck. Ramsey visits the truck to explain his bad review: though an early fan of Carl, he was disappointed by a meal he felt was beneath Carl's skills. Impressed with the chef's return to form, Ramsey offers to bankroll a new restaurant where Carl will have full creative control.\nSix months later, the successful new restaurant is closed for a private event: Carl and Inez's remarriage ceremony."
}