{
	"title": "Kingsman: The Secret Service",
	"release_year": "2014",
	"runtime": "129",
	"tags": [
		"Action",
		"Adventure",
		"Comedy",
		"amazon"
	],
	"rating": 7.7,
	"actors": [
		"Colin Firth",
		"Colin Firth",
		"Taron Egerton",
		"Samuel L. Jackson",
		"Michael Caine",
		"Adrian Quinton",
		"Mark Strong",
		"Jonno Davies",
		"Jack Davenport",
		"Alex Nikolov",
		"Samantha Womack"
	],
	"staff": [
		"Matthew Vaughn",
		"Jane Goldman",
		"Matthew Vaughn",
		"Mark Millar",
		"Dave Gibbons",
		"Adam Bohling",
		"David Reid",
		"Matthew Vaughn",
		"Henry Jackman",
		"Matthew Margeson",
		"George Richmond",
		"Eddie Hamilton",
		"Jon Harris",
		"Reg Poerscout-Edgerton",
		"Paul Kirby"
	],
	"votes": 729956,
	"cover": "https://m.media-amazon.com/images/M/MV5BODk1MTYwNTAtYmI5Zi00OWYyLWE0MzQtOWE4NDIxZmU2MjMwXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "During a raid in the Middle East, a probationary secret agent sacrifices himself to save his team. Feeling guilt over the loss of his colleague, Harry Hart (Colin Firth), code-named \"Galahad\", delivers a bravery medal to the agent's widow, Michelle Unwin, and her young son, Gary \"Eggsy\" (Taron Egerton), saying that if they ever need help, they should call the phone number on the back of the medal and deliver a coded message.Seventeen years later, Professor James Arnold is kidnapped by unknown assailants, led by Internet billionaire Richmond Valentine (Samuel L. Jackson). One of Hart's fellow agents, \"Lancelot\", attempts to stage a rescue, but is killed by Gazelle, Valentine's henchman. Valentine, known for his philanthropy, continues to meet with various heads of state and VIPs, some of whom go missing afterwards. He also announces a global giveaway of SIM Smart cards, granting free cellular and Internet access. The secret service organization somehow suspects Velentine to be connected to the development of biological weapons that are being used to turn insurgents & terrorists on one another & to kill each other.In London, Eggsy is now an unemployed young adult living with his mother, infant half-sister, and abusive stepfather Dean. Despite being intelligent and capable, he left training for the Royal Marines and lives an aimless life. After being arrested for stealing a car, Eggsy calls the number on the back of the medal. Hart arranges for his release and tells Eggsy about the existence of Kingsman, a secret intelligence agency for which both he and Eggsy's father worked. In the wake of Lancelot's death, the agency opens a vacancy for a new agent, and Eggsy agrees to apply as Hart's candidate. He joins a group of other candidates, including a woman named Roxy (Sophie Cookson). Training is overseen by \"Merlin\" (Mark Strong), a senior Kingsman who acts as teacher, quartermaster, pilot and Operations coordinator. The candidates are eliminated one by one until only Eggsy and Roxy remain. Eggsy fails his final test, and Roxy becomes the new Lancelot.During this time, Kingsman has been investigating Valentine in connection with VIP disappearances and notes that Arnold is no longer missing. Hart tracks down Arnold and confronts him about his abduction. A chip implanted in Arnold's head explodes, killing him; Hart is injured during his escape from unknown assailants. Undeterred, Hart poses as a billionaire and dines with Valentine to try to discern his plans. Valentine spikes Hart's drinks with Nanomites, which enables Valentine to track Hart's every move & thereby helping him learn about Hart's organization.Meanwhile, Roxy & Eggsy make it to the top 2 of the training & their final task is to shoot the dog that they were assigned to take care of all through their training. Eggsy fails to shoot, & is kicked out, Roxy shoots her dog & is appointed as Lancelot at Kingsman. Hart explains to Eggsy that the gun had only a blank & that Eggsy should not throw his life away over this failure.Hart tracks Valentine to an obscure hate group church in Kentucky, where Valentine and Gazelle are conducting a test. They broadcast a signal, which is picked up by cellphone SIM cards and causes everyone in the church, including Hart, to become uncontrollably violent. A mass brawl breaks out, with Hart the sole survivor, while Eggsy, Merlin and Arthur-the Kingsman's leader-watch via video link. Valentine approaches Hart and kills him after revealing his plan.Eggsy returns to the Kingsman headquarters, where he discovers that Arthur is one of Valentine's converts. Arthur explains Valentine's views: humanity is akin to a virus, and global warming is the Earth's equivalent of a fever. Valentine intends to kill the virus before it kills the host, broadcasting his signal worldwide to cause a massive culling of the human race. Only a select few that Valentine has deemed worthy of living-those who have sided with him and thus received the protective microchips in their heads, and the VIPs he kidnapped-will be spared.After avoiding Arthur's attempt to kill him-killing Arthur as he does so-Eggsy teams up with Roxy and Merlin. Roxy pilots a high-altitude balloon vehicle into the stratosphere to disrupt Valentine's satellite network with a missile, while Eggsy and Merlin directly assault Valentine's mountain bunker. Roxy knocks out the satellite, not realizing that Valentine has a substitute satellite. Valentine activates the signal, causing a global pandemonium.Eggsy and Merlin infiltrate the bunker. Merlin hacks the system, successfully disturbing the signal for a while, before Valentine activates the fingerprint scanner, thus counter-attacking the hack. Eggsy is later surrounded by the guards, but Merlin activates the chip implanted into everyone involved in Valentine's scheme, killing everyone except Valentine and Gazelle. Eggsy fights Gazelle and kills her with his booby-trapped shoe given to him earlier by Hart. Eggsy later manages to kill Valentine, ending the pandemonium.In a mid-credits scene, Eggsy, now Harry's replacement as Galahad, reaches out to his mother, offering her a nicer house and a chance to get away from Dean. In a call back to when Hart recruited Eggsy, Dean and his subordinates move to attack, and Eggsy quotes his old mentor by saying \"Manners Maketh Man\" before moving on to knocking them down.",
	"links": [
		"https://www.amazon.com/Kingsman-Secret-Service-Colin-Firth/dp/B00TJYY1HQ"
	]
}