{
	"title": "Lucy",
	"release_year": "2014",
	"runtime": "89",
	"tags": [
		"Action",
		"Sci-Fi",
		"Thriller",
		"amazon"
	],
	"rating": 6.4,
	"actors": [
		"Scarlett Johansson",
		"Morgan Freeman",
		"Choi Min-sik",
		"Amr Waked",
		"Julian Rhind-Tutt",
		"Pilou Asbæk",
		"Lio Tipton",
		"Nicolas Phongpheth",
		"Paul Lefevre",
		"Jan Oliver Schroeder"
	],
	"staff": [
		"Luc Besson",
		"Luc Besson",
		"Virginie Besson-Silla",
		"Éric Serra",
		"Thierry Arbogast",
		"Julien Rey",
		"Nathalie Cheron",
		"Hugues Tissandier"
	],
	"links": [
		"https://www.amazon.com/Lucy-Scarlett-Johansson/dp/B00QQW1VJA"
	],
	"votes": 542237,
	"cover": "https://m.media-amazon.com/images/M/MV5BODcxMzY3ODY1NF5BMl5BanBnXkFtZTgwNzg1NDY4MTE@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "Lucy (Scarlett Johansson) is a 25-year-old American woman living and studying in Taipei, Taiwan. She is tricked into working as a drug mule by her new boyfriend, whose employer, Mr. Jang, is a Korean mob boss and drug lord. Lucy delivers a briefcase to Mr. Jang (Choi Min-Sik) containing a highly valuable synthetic drug called CPH4. After seeing her boyfriend shot and killed, she is captured, and a bag of the drug is forcibly sewn into her abdomen and that of three other drug mules who will also transport the drug for sales in Europe. While Lucy is in captivity, one of her captors kicks her in the abdomen, breaking the bag, releasing a large quantity of the drug into her system. As a result, she begins acquiring increasingly enhanced physical and mental capabilities, such as telepathy, telekinesis, mental time travel, and can choose not to feel pain or other discomforts, in addition to other abilities. She kills off her captors and escapes. She is shot in the process but is able to ignore her pain & simply dig the bullet out of her body.Lucy travels to the nearby Tri-Service General Hospital to get the bag of drugs removed from her abdomen. By this time, she has the ability to hear nearby conversations & knows all languages. The bag is successfully removed, and Lucy is told by the operating doctor of the volatile nature of the drug, based on a substance given to fetuses during prenatal development, and its destructive side-effects. Sensing her growing physical and mental abilities, Lucy returns to Mr. Jang's hotel, kills his bodyguards, assaults Mr. Jang, and telepathically extracts the locations of all three drug mules from his brain.At her shared apartment, Lucy begins researching her condition and contacts a well-known scientist and doctor, Professor Samuel Norman (Morgan Freeman), whose research (On the effects of increasing use of brain capacity by animals. He also theorizes about the nature of life having 2 purposes: become immortal or reproduce. Norman hypothesizes that at 20% of brain capacity humans would have control over their own body & at 40% they would have control over other humans.) may be the key to saving her. After Lucy speaks with the professor and provides proof of her developed abilities, she flies to Paris and contacts a local police captain, Pierre Del Rio, to help her find the remaining three packets of the drug. The Taiwan police is looking for Lucy after her stunt at the hospital, so she disguises herself by changing her body shape and structure to avoid detection & by controlling other humans & animals (such as the police drug sniffers). Lucy has deduced that she needs the drug to survive & buy more time & without the drug she would probably die within 24 hrs.During the plane ride she starts to disintegrate as her cells destabilize from consuming a sip of champagne, which made her body inhospitable for cellular reproduction. Only by consuming more CPH4 is she able to prevent her total disintegration. Her powers continue to grow, leaving her able to telepathically incapacitate armed police and members from the Korean drug gang. With the help of Del Rio, Lucy recovers the drug and hurries to meet Professor Norman, with whom she agrees to share everything she now knows, after he points out that the main point of life is to pass on knowledge. Jang and the mob also want the drug and a gunfight ensues with the French police.In the professor's lab, Lucy discusses the nature of time and life and how people's humanity distorts their perceptions. At her urging, she is intravenously injected with the contents of all three remaining bags of CPH4. Her body begins to metamorphose into a black substance, spreading over computers and other objects in the lab, as she transforms these into an unconventionally shaped, next generation supercomputer that will contain all of her enhanced knowledge of the universe.She then begins a space-time journey into the past, eventually reaching the oldest discovered ancestor of mankind, implied to be Lucy, and touches fingertips with her. Meanwhile, back in the lab, after an M136 AT4 anti-tank weapon destroys the door, Mr. Jang enters and points a gun at Lucy's head from behind, intending to kill her. He shoots, but in an instant before the bullet strikes, Lucy reaches 100% of her cerebral capacity and disappears within the space-time continuum, where she explains that everything is connected, and existence is only proven through time. Only her clothes and the oddly shaped black supercomputer are left behind.Del Rio then enters and fatally shoots Mr. Jang. Professor Norman takes a black, monolithic flash drive offered by the advanced supercomputer created by Lucy's body before the machine disintegrates to dust. Del Rio asks Professor Norman where Lucy is, immediately after which, Del Rio's cell phone sounds and he sees a text message: \"I AM EVERYWHERE.\" With an overhead shot, Lucy's voice is heard stating, \"Life was given to us a billion years ago. Now you know what to do with it.\""
}