{
	"title": "Pitch Perfect 2",
	"release_year": "2015",
	"runtime": "115",
	"tags": [
		"Comedy",
		"Music",
		"max",
		"amazon"
	],
	"rating": 6.4,
	"actors": [
		"Anna Kendrick",
		"Rebel Wilson",
		"Hailee Steinfeld",
		"Brittany Snow",
		"Skylar Astin",
		"Adam Devine",
		"Katey Sagal",
		"Anna Camp",
		"Ben Platt",
		"Alexis Knapp"
	],
	"staff": [
		"Elizabeth Banks",
		"Kay Cannon",
		"Mickey Rapkin",
		"Elizabeth Banks",
		"Paul Brooks",
		"Max Handelman",
		"Mark Mothersbaugh",
		"Jim Denault",
		"Craig Alpert",
		"Kerry Barden",
		"Paul Schnee",
		"Toby Corbett"
	],
	"links": [
		"https://www.max.com/movies/pitch-perfect-2/2b81bc9f-4ecb-4177-8655-88bcb03f8ca7",
		"https://www.amazon.com/Pitch-Perfect-2-Anna-Kendrick/dp/B00XOX6HLQ"
	],
	"votes": 172106,
	"cover": "https://m.media-amazon.com/images/M/MV5BMzk4OTM2NzMzNl5BMl5BanBnXkFtZTgwNTAzNDE0NDE@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "Three years after the events of Pitch Perfect, the Barden Bellas are now led by Beca Mitchell (Anna Kendrick) and three-time super senior Chloe Beale (Brittany Snow). Over those three years, with their new modern sound, the Bellas have been ICCA champions for three years in a row. However, their performance at President Obama's birthday gala disastrously ends when Fat Amy's (Rebel Wilson) airlifting solo goes awry causes a nationwide scandal, being named Muffgate. Because of this, they are suspended from competing in the ICCAs and aren't allowed to hold auditions for new members. Beca makes a deal to allow the Bellas to be reinstated if they win the 2015 World Championship of ACapella in the spring of Copenhagen, in which Acapella announcers John Smith (John Michael Higgins) and Gail Abernathy (Elizabeth Banks) mockingly accept because the American team at the Worlds have never won one.Freshman Emily Junk (Hailee Steinfeld) begins her college career at Barden University, in hopes of joining the Bellas, just like her mom, Katherine (Katey Sagal). At orientation, Emily and other freshmen watch an a Capella performance by the Treblemakers, now led by Beca's boyfriend, Jesse Swanson (Skylar Astin). After orientation, Emily meets Jesse and his best friend, Benji Applebaum (Ben Platt), who awkwardly develops a crush on her. Meanwhile, while the other Bellas learn that the German champions have taken over the Bellas' victory tour, Beca has started a recording studio internship that only Jesse knows about.Emily stops by the Bellas' sorority house to audition for them. They are impressed when they learn that Emily is a Legacy Bella through her mother, Katherine, who sang with the Bellas in the 1980s. By singing her unfinished song \"Flashlight,\" Emily succeeds in joining the Bellas when the rules of suspension state that the Bellas can't hold any auditions, but Emily technically came to them, so therefore they are not breaking any rules. That night, the Bellas have a party with the Treblemakers and several other a Capella students, where Benji tries to ask Emily out but she kindly refuses, with the reason being that it's her first day of college. Bumper Allen (Adam Devine) returns from being backup to John Mayer as a security guard for Barden.The next day, the Bellas attend a car show where they were initially due to perform, to meet their German replacements, powerhouse \"Das Sound Machine\" (DSM) - led by intimidating duo Pieter Krämer (Flula Borg) and Kommissar (Birgitte Hjort Sørensen). In determination, the Bellas rehearse a performance that is similar to DSM as a warm-up for Worlds and is supposedly better. Meanwhile, Beca shows off her mashup skills to her boss (Keegan-Michael Key) on a Christmas album song for Snoop Dogg, in which he rewards her to listen to her demos for a chance to become a producer. Later at an exclusive riff off, the Bellas lose to DSM in the final round when Emily flubs attempt to sing \"Flashlight\" as she is nervous.The next day, Beca's boss informs her that he was looking forward to original songs on her demos but was disappointed at the fact that the demos all had mashups. He gives her one more chance as a producer to have an original voice and makes her question if being in the Bellas, an a Capella group, is really what defines her. As a result of this, added to the current events, Beca is becoming stressed out and Fat Amy reassures her confidence in everything, after she reveals that she knew about Beca's internship by her badge in her purse, searching for money. Also, Amy advises her to tell the other Bellas. Meanwhile, Bumper tries to get serious with Amy about if they would become a couple, but Amy declines as she likes to be carefree and \"not tied down\".The next day, the Bellas put on their performance, which makes John and Gail question the Bellas' true identity, but that ends in disaster when Cynthia-Rose (Ester Dean) has her hair set ablaze by pyrotechnics. In response, Chloe takes the Bellas to a retreat led by Aubrey Posen (Anna Camp) hoping to regain their lost harmony. Before this, Emily comes to Katherine for help because of the Bellas arguing with each other and the possibility that she won't solo at the ICCAs and be as great as the Bellas. Katherine reassures her that going to Worlds is bigger than the ICCAs and that the Bellas won't end now.With her stress having completely taken over, Beca's frustration over the camp activities sparks an argument between her and Chloe and reveals her internship and her frustration over her obsession with winning Worlds, before Beca gets trapped by a net. Lily (Hana Mae Lee) cuts the rope and manages to get her down. Beca reveals that her stress was caused by her independence in doing everything under extreme pressure and wishes that she wants to be as confident as Emily. Emily also reveals that she has felt the same way about her and wants to be a Bella, not a Legacy. Beca offers Emily to produce her song at the studio. Each Bella talks about their dreams and future as they won't be seeing each other after graduation. They regain their harmony by singing \"Cups.\" Then, Fat Amy realizes that she made a mistake not getting serious with Bumper and goes to get him back, getting trapped in a net after making her announcement. She rows across a lake to him, singing \"We Belong\" to him, with the Bellas and Treblemakers watching from their houses. During her soloing, he angrily wants her to turn back but gives in and starts singing with her. They then make out on the Treblemakers ' front lawn, with them watching and run away. Then, Beca and Emily show their song to Beca's boss, who sees potential in it and looks forward to working with them. Beca and Emily get excited, after he leaves.The senior Bellas graduate and all head off to Copenhagen for Worlds, with Jesse and Benji to cheer them on. Before the start of Worlds, Benji finds Emily to wish her luck and Emily kisses him and then a second time because the first time, he was trying to do one of his magic tricks. As DSM performs, the performance gives the Bellas a look of discouragement on their faces, with the crowd loving them. Before their performance, Fat Amy gives one of her pep talks and brings more spirit to the group. Their performance begins with a hand-clap introduction, and they rock the Worlds with their own modern sound. Then, the Bellas sing a harmonized version of \"Flashlight\" with Aubrey, Katherine, and past Bellas. The Bellas win the championship and have repaired a damaged legacy and name. Before the senior Bellas leave Barden, they give Emily a proper initiation, with Fat Amy showing her how to do the last tradition: christening the house by sliding down the stairs. After that, Emily gets ready for her turn and when she starts to slide, the credits roll.In a mid-credits scene, Bumper performs on The Voice."
}