{
	"title": "Ad Astra",
	"release_year": "2019",
	"runtime": "123",
	"tags": [
		"Adventure",
		"Drama",
		"Mystery",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Brad Pitt",
		"Tommy Lee Jones",
		"Ruth Negga",
		"Donald Sutherland",
		"Kimberly Elise",
		"Loren Dean",
		"Donnie Keshawarz",
		"Sean Blakemore",
		"Bobby Nish",
		"LisaGay Hamilton"
	],
	"staff": [
		"James Gray",
		"James Gray",
		"Ethan Gross",
		"Dede Gardner",
		"James Gray",
		"Anthony Katagas",
		"Jeremy Kleiner",
		"Max Richter",
		"Hoyte Van Hoytema",
		"John Axelrad",
		"Lee Haugen",
		"Douglas Aibel",
		"Kevin Thompson"
	],
	"votes": 263710,
	"cover": "https://m.media-amazon.com/images/M/MV5BN2RiYjE2ZjQtMmY1Yi00ZjI3LTg5MDctMzg5NTk2MjU0Mjk5XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Major Roy McBride (Brad Pitt) is an astronaut who works on the International Space Antenna, a large communication tower many miles high somewhere on the surface of Earth.About 100 years in the future, our Solar System is struck by mysterious power surges, threatening all human life. One of these surges strikes the Earth while Roy is working on the Tower. He is forced to jump from the highest section and freefalls for miles before he opens his parachute and lands safely on the ground. The source of the deadly surges is being investigated.Roy is the son of famed astronaut H. Clifford McBride (Tommy Lee Jones). In a top-secret briefing, he is informed by U.S. Space Command (SpaceCom) that the surges have been traced to the \"Lima Project\" (near Neptune), a deep space mission launched 26 years earlier to explore the limits of the Solar System for intelligent life where the Sun's magnetic field won't interfere with incoming signals from alien life. The mission was lead by Clifford and hasn't been heard from in 16 years after reaching Neptune. Roy is informed that the Lima project was powered by anti-matter and the surges have the characteristics of an uncontrolled chain reaction. If the reaction gets anymore out of hand, it will destroy the solar system. Roy's mission is to contact his father from Mars and try and ascertain the situation.Informed that Clifford may still be alive, Roy accepts a mission to travel to Mars to try to establish communication with him, joined by his father's old associate Colonel Pruitt (Donald Sutherland). Roy's mental and physical acuity is tested several time revealing that he is emotionally detached but also very calm in a crisis, his heart rate never rising above 80 beats a minute, even during the incident on the tower. He has no emotional reaction to his wife, Eve (Liv Tyler), leaving him, or to the news that his father may still be alive.After taking a commercial flight to the Moon, Roy and Pruitt are escorted by US military personnel to the SpaceCom base, located on the far side of the moon. Moon is borderless and has many disputed mining territories engaged in a state of war. En route in lunar rovers, they are ambushed by scavenging pirates who kill their entire escort. Upon arrival at the base, a dying Pruitt is placed into intensive care. Before he loses consciousness, Pruitt tells Roy that if Roy can't make contact with his dad, SpaceCom will take all measures to destroy Clifford's station and put an end to the surges.Roy transfers to the ship Cepheus, bound for Mars. The ship receives a distress signal from a Norwegian bio-medical research space station. The Cepheus stops to investigate despite Roy's protests, and Roy and the captain make their way to the station. It appears abandoned and the two split up, but Roy soon discovers an escaped baboon test subject feeding on the captain's corpse. It attacks him when it notices his presence, but he manages to kill it. Another baboon attempts to attack him, but he quickly subdues it and locks it in another module. He then kills it instantly as it attempts to open the door by depressurizing the chamber. Believing that he can save the captain, he tapes over the broken helmet visor of the captain's spacesuit and carries him back to the ship, where he is declared to be already dead. A brief service is held where the captain's body is ejected into space. Again, Roy appears to be very emotionless and calm after the violent encounter and death of the captain. He does admit that he experiences rage, and recalls his father expressing his rage.Another surge hits as the Cepheus lands on Mars, requiring manual piloting to complete the landing. The interim captain freezes in fear, while Roy remains very calm and takes command of the ship, landing it safely. Roy is led to the underground SpaceCom base where he meets facility director Helen Lantos (Ruth Negga) and is tasked with recording voice messages to send to the Lima Project in hopes that Clifford will respond. During one recording, Roy goes off-script with an emotional appeal to his father and is abruptly taken off the mission on the grounds of his personal connection posing a risk to himself and the mission's success. From the visible reaction of the recording observation team to his emotional recording, he assumes correctly that an immediate response from his father had been received and demands to hear it.Sequestered in a \"comfort room\", he is visited by Lantos, who reveals that she was born on Mars and was the daughter of Lima Project crew-members. She shows Roy classified footage revealing that Clifford's crew had mutinied and tried to return to Earth, causing him to turn off their life-support systems, her parents included. She tells Roy that the crew that brought him to Mars are leaving to destroy the Lima Project station with a nuclear payload. The two decide that Roy should confront Clifford himself, and Helen sneaks Roy to an underground lake beneath the rocket launch site.Roy clandestinely climbs aboard as the rocket takes off and is subsequently discovered by the crew, who are instructed to neutralize him. The entire crew is killed in the ensuing brutal fight. During the long journey to Neptune, a solitary Roy reflects on his relationships with his father and Eve. The isolation and stress of the mission take a mental toll, but after several weeks he arrives at the Lima Project. Roy finds the Lima Project craft to be degrading around Neptune's orbit. He leaves the Cepheus on auto pilot and takes a shuttle to maneuver around Neptune's rings.The shuttle is damaged in a collision with the fragments in Neptune's rings, preventing it from docking with the station. Roy enters the station via a space-walk while the shuttle drifts away. Finding the station abandoned and encountering the dead bodies of its crew, he plants the nuclear payload before encountering Clifford, the station's sole survivor, who confirms that the surges are coming from the ship's malfunctioning antimatter power source, which had been damaged in the mutiny. Clifford has continued to work on the project, refusing to lose faith in the possibility of non-human intelligent life. Clifford is reluctant to go back to Earth as there is nothing for him there. He admits that he doesn't love his own son or his wife.After Clifford agrees to accompany him back to Earth, Roy finishes arming the payload and they climb out on the station's surface in preparation for returning to the Cepheus. Clifford suddenly uses his spacesuit's thrusters to launch the two of them off into space. With Clifford pleading for Roy to untether them from each other, Roy reluctantly does so and manages to propel himself back to the Cepheus using his own spacesuit and with a piece of the station's hull as a shield against Neptune's ring debris. Without enough fuel to return to Earth, he relies on the shock wave from the nuclear explosion in the station to gain the required speed.\nThe data retrieved from the base suggests that humans are the only intelligent life in the universe, however, Clifford has collected a vast amount of information about other planets, more than humankind has ever known. Roy is inspired to reconnect with those closest to him, and he returns to Earth with a newfound optimism. After expressing his opinions in a psychological evaluation, he reconnects with Eve.",
	"links": [
		"https://www.amazon.com/Ad-Astra-Brad-Pitt/dp/B07XLJBLR6"
	]
}