{
	"title": "The Guest",
	"release_year": "2014",
	"runtime": "100",
	"tags": [
		"Action",
		"Mystery",
		"Thriller",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Dan Stevens",
		"Sheila Kelley",
		"Maika Monroe",
		"Joel David Moore",
		"Brendan Meyer",
		"Leland Orser",
		"Lance Reddick",
		"Tabatha Shaun",
		"Chase Williamson",
		"Steve Brown"
	],
	"staff": [
		"Adam Wingard",
		"Simon Barrett",
		"Jess Wu Calder",
		"Keith Calder",
		"Steve Moore",
		"Robby Baumgartner",
		"Adam Wingard",
		"Courtney Bright",
		"Nicole Daniels",
		"Arlie Day",
		"Tom Hammock"
	],
	"votes": 109097,
	"cover": "https://m.media-amazon.com/images/M/MV5BOTQyODc5MTAwM15BMl5BanBnXkFtZTgwNjMwMjA1MjE@._V1_QL75_UX190_CR0,8,190,281_.jpg",
	"description": "After the loss of their eldest son, Caleb, to the war in Afghanistan, the Peterson family (the husband Spencer Peterson (Leland Orser), wife and their children Luke (Brendan Meyer) and Anna (Maika Monroe)) are visited by David Collins (Dan Stevens), who claims to be a former soldier and Caleb's best friend, and he is there to help Caleb take care of the family. David claims that he and Caleb trained and fought together. He says that he was with Caleb when he died, and Caleb had asked him to check on his family. David even identifies himself in one of Caleb's Afghanistan pictures in the house.\nDavid says that he has recently been discharged from the military due to an injury, for which he spent several months in the hospital.\nDavid plans to stay at a motel nearby. David is polite, warm and friendly toward the family, and Mrs. Laura Peterson (Sheila Kelley) offers to let him stay in her house, as long as he needs to.Anna works at a late-night diner & has trouble with harassing customers. David hears of Mr. Peterson's troubles at work and sees Luke return home with a black eye, caused by a gang of jock bullies in school.\nSpencer is no happy that Laura allowed David to stay in their home as war veterans are often victims of PTSD and can show unpredictable behavior. David helps Luke with his mathematics homework.\nThe next day, with Luke's help, David follows the bullying jock gang that attacked Luke to a bar and humiliates them in a confrontation (The bullies were there with their girls. David sends the guys Cosmopolitans, and the girls a \"B**w Job shot\") which erupts into a fight that injures all the bullies. He then uses his knowledge of the law to convince the bartender not to tell anyone, as the bartender could lose his license for serving liquor to minors.David then goes to a party with a reluctant Anna (as Laura forced her to take David with her), at which he saves her friend Kristen (Tabatha Shaun) from her ex-boyfriend who was trying to force himself upon Kristen. Kristen ends up having sex with David. David also inquiries about where to buy guns from Anna's friend Craig (Joel David Moore).\nAnna says that her boyfriend Zeke doesn't even have a job, and no plans for the future, while she is saving money for college. David says that Anna is the kind of girl that soldiers go to war for. On their way home, Anna offers to make David a mix CD.David teaches Luke some self-defense moves and gives him his butterfly knife. He buys the guns from Craig and his friend, then kills them both and takes all the weapons, including two grenades.\nAnna sees David talking to somebody on Luke's phone in a really animated manner. An increasingly suspicious Anna calls the military base to ask about David. The call alerts a private corporation headed by Major Carver (Lance Reddick), who assembles a special forces team and heads to Anna's house.\nAnna is told that David died a week ago. Anna then learns that Craig was killed, and her boyfriend Zeke (Chase Williamson) has been blamed for it (it was David who killed Craig, when he shot Craig after taking the guns that Craig brought to sell to David). The gun that killed Craig was found in Zeke's room.\nIt is revealed that Mr. Peterson's boss Alan died in an accident (it looked like he and his girlfriend committed suicide), giving him the promotion he always wanted. Anna checks Luke's phone to research the numbers David has called on his phone.Anna shares her concerns with her parents, who refuse to believe her. Spencer anyways never liked Anna dating Zeke and says that Craig was perhaps dealing drugs anyways and so had this coming to him regardless. David says that he has no ID as he was in the special forces where he was given a whole new identity to work undercover.\nAnna tells Luke that David called a doctor from his phone. But the doctor had already lost his license 2 years ago. She wants Luke to find out anything he can about David.At school, one of the bullies' assaults Luke again, and he retaliates, injuring the bully. After they are both sent to the principal's office, David arrives and blackmails the principal to give Luke an after-school detention with threats of lawsuit if the principal expels him.Luke tells David of Anna's suspicions. Luke says that he knows David is not really David (as the real David Collins is indeed dead. The military hospital where David said he was discharged from, had a fire due to some oxygen tanks. The real David Collins (along with 20 other people) was supposed to have been killed in the fire).\nLuke says that he knows that David is also calling a plastic surgeon from Luke's phone who is perhaps helping this guy to change appearance & even fingerprints, but David convinces him to not investigate the matter any further.While David helps Mrs. Peterson with the laundry, Major Carver's team attack the house. David deftly kills all except Carver. Deciding his cover has been blown David kills Mrs. Peterson. While driving away, he sees Mr. Peterson and kills him as well. David is injured by Carver's bullets during the getaway.Carver picks up Anna from the diner and informs her of her parents' death. He reveals that David is a former test subject for a military health program. He was \"programmed\" to kill, but the experiment went wrong, and David started killing everyone who knew his identity.\nHe set fire to the test facility & left bodies behind with no identification to confuse the investigators into believing that he was dead.David kills Kristen destroys the restaurant she works at, then heads for the school to kill Luke. Carver and Anna head for the school, and enter a haunted house set up for the Halloween dance. David announces his presence by playing Anna's mix CD, then kills Luke's principal and Carver. Anna shoots David with Carver's gun, but David stabs her in the leg and attempts to choke her. Luke stabs David with his own butterfly knife. As he seemingly dies, David tells Luke that he's \"proud of him\".Sitting in an ambulance, Anna and Luke overhear the firefighters talking. They found two charred corpses with no teeth. Anna then sees David exiting the building, posing as a firefighter.",
	"links": [
		"https://www.amazon.com/Guest-Dan-Stevens/dp/B00R2KMGN0"
	]
}