{
	"title": "Dungeons & Dragons: Honor Among Thieves",
	"release_year": "2023",
	"runtime": "134",
	"tags": [
		"Action",
		"Adventure",
		"Comedy",
		"amazon"
	],
	"rating": 7.2,
	"actors": [
		"Chris Pine",
		"Michelle Rodriguez",
		"Regé-Jean Page",
		"Justice Smith",
		"Sophia Lillis",
		"Hugh Grant",
		"Chloe Coleman",
		"Daisy Head",
		"Kyle Hixon",
		"Spencer Wilding"
	],
	"staff": [
		"John Francis Daley",
		"Jonathan Goldstein",
		"Jonathan Goldstein",
		"John Francis Daley",
		"Michael Gilio",
		"Chris McKay",
		"Brian Goldner",
		"Jeremy Latcham",
		"Nick Meyer",
		"Lorne Balfe",
		"Barry Peterson",
		"Dan Lebental",
		"Victoria Thomas",
		"Ray Chan"
	],
	"votes": 235045,
	"cover": "https://m.media-amazon.com/images/M/MV5BOGRjMjQ0ZDAtODc0OS00MGY1LTkxMTMtODhhNjY5NTM4N2IwXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Before being imprisoned, bard Edgin Darvis was a member of the Harpers, a peacekeeping order, until his wife was murdered by followers of a Red Wizard he had detained.Alongside the barbarian Holga Kilgore, Edgin turned to theft in an effort to start over with his daughter Kira. He teamed up with rogue con artist Forge Fitzwilliam, amateur sorcerer Simon Aumar, and Forge's enigmatic friend Sofina. Edgin tries to steal a \"Tablet of Reawakening\" to bring his wife back to life while raiding a Harper stronghold, but he and Holga are apprehended while their accomplices manage to get away.Unaware that they have been released from their two-year incarceration in Arctic Revel's End, the two escape to Neverwinter and discover that Forge has been made Lord there following the mysterious encapsulation of its previous lord. He has been looking after Kira, telling her that Edgin was arrested because of his greed. It turns out that Sofina is a Red Wizard, and the two of them planned the capture of Edgin and Holga.During the impending High Sun Games, Sofina tries to put Edgin and Holga to death, but they manage to get away and decide to rob Forge's vault and bring Kira home. They need the tablet to prove their innocence to Kira and bring Edgin's wife back to life. Forge restored the gladiatorial games after they had been outlawed, claiming that they would attract tourists and revenue. Edgin and Holga find Simon to assist; he recommends enlisting Doric, a druid whose forest community is resisting Forge's ordered forced logging.Doric enters Forge's castle disguised as a fly and discovers that the vault has Mordenkainen's magical defenses, which Simon is unable to turn off. He thinks \"The Helm of Disjunction,\" a magic relic, might be effective.To find it, they go to a cemetery and ask Holga's ancestors. Using a talisman, Simon brings the dead back to life long enough for them to respond to three questions apiece. According to the corpses, they handed the Helm over to Xenk Yandar, a paladin who left his homeland of Thay after Szass Tam transformed the Thayans into an army of indeed.Xenk leads the group through the Underdark to recover the Helm after making Edgin swear to share any bounty he gains with the populace. They locate the relic with the aid of a teleportation staff that Holga's halving ex-husband gave them, but Sofina's Thayan assassins attack them. Before leaving, Xenk battles them off and aids the group in escaping from the fat red dragon Themberchaud.During the games, they choose to enter the vault using the staff because Simon finds it difficult to control the Helm's power. After breaking into the vault, Simon and Holga discover that the room is deserted save for a magical trap. Sofina subdues Edgin while posing as Kira. The group escapes the stadium after being apprehended and made to play in the games. Doric learns that Forge is getting ready to escape after loading the treasure onto a boat. After Kira is rescued from Forge, who had threatened to kill her, the group takes the boat for themselves.As they flee, the group discovers that Sofina planned the games to attract a large audience and use the curse that destroyed Thay to transform them into an indeed army. In order to get people out of the stadium before Sofina's spell takes effect, the group returns, carries Forge's stolen riches out of the boat with the teleportation staff, and disperses them throughout the city by hot-air balloon.After losing, Sofina becomes enraged and attacks the group. Kira uses an invisibility pendant that Edgin and Holga gave her as a child to put on an anti-magic bracelet after Simon breaks her time-stop spell. When Sofina is attacked by Doric in owl-bear form, she is killed by falling debris, and Holga is fatally wounded. Edgin uses the tablet to revive Holga after realizing that he only intended to bring her back for himself and that she had actually joined their family. Doric makes it clear that a romantic relationship with Simon is something he is open to.The old Lord of Neverwinter restores the team and declares them the heroes of the realm. Forge is sent to Revel's End by Xenk after his pardon is denied, where he is unable to escape like Edgin and Holga did.",
	"links": [
		"https://www.amazon.com/Dungeons-Dragons-Honor-Among-Thieves/dp/B0D68V8W8F"
	]
}