{
	"title": "Better Call Saul",
	"release_year": "2015",
	"runtime": "45",
	"tags": [
		"Crime",
		"Drama",
		"netflix"
	],
	"rating": 9.0,
	"votes": 674931,
	"actors": [
		"Bob Odenkirk",
		"Rhea Seehorn",
		"Jonathan Banks",
		"Patrick Fabian",
		"Michael Mando",
		"Giancarlo Esposito",
		"Michael McKean",
		"Tony Dalton",
		"Mark Margolis",
		"Kerry Condon"
	],
	"staff": [
		"Vince Gilligan",
		"Peter Gould"
	],
	"cover": "https://m.media-amazon.com/images/M/MV5BNDdjNTEzMjMtYjM3Mi00NzQ3LWFlNWMtZjdmYWU3ZDkzMjk1XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Season 1Following the events of Breaking Bad, Saul Goodman is living under the assumed name Gene in Omaha, Nebraska and managing a Cinnabon. That night he watches a tape of television ads made when he worked as an attorney. Back in 2002, James McGill (Saul's birth name) is a struggling public defender in Albuquerque, New Mexico. \"Jimmy\" lives and works out of a cramped storage room in the back of a Vietnamese nail salon while caring for his brother, Chuck. Chuck has become semi-reclusive and believes he suffers from electromagnetic hypersensitivity. On his brother's behalf, Jimmy passionately and theatrically confronts Chuck's law firm partner, Howard Hamlin, of Hamlin Hamlin & McGill (HHM), demanding HHM cash out his brother's US$17 million share in the firm. At Loyola's Diner, Jimmy exhorts Craig and Betsy Kettleman, the county treasurer accused of embezzling $1.6 million, to hire him; however, the Kettlemans decline and hire HHM instead. Frustrated, Jimmy sets up a skateboarding accident scam with con artist twins Lars and Cal to secure the Kettlemans as clients. The twins accidentally target the wrong car and Jimmy ends up a hostage at gunpoint by gangster Tuco Salamanca. Tuco drags Jimmy at gunpoint into the house where the skateboarding twins are being held. Jimmy explains that the twins were part of his scam operation, but they picked the wrong car. Tuco leads Jimmy to the garage, where the twins are tied up. After Jimmy frees them, Lars reveals that this was all Jimmy's idea, which infuriates Tuco. Later, Jimmy is tied up and on his knees in the desert. Tuco demands to know who Jimmy is and why he is coming after Tuco. Out of options, Jimmy lies about being an FBI agent. Nacho doesn't believe this and Jimmy confirms that he is actually a lawyer. Jimmy is released. He talks Tuco out of killing the twins, suggesting he break their legs instead. Jimmy drives the twins to an emergency room, with the twins calling him \"the worst lawyer in the world.\" At the nail salon in his office, Nacho visits Jimmy and reveals his scheme to steal the million dollars the Kettlemans embezzled and offers Jimmy a 10% finder's fee. Jimmy declines to participate, telling Nacho that he is a lawyer, not a criminal. Surprised, Nacho leaves his number with Jimmy, encouraging him to call when Jimmy decides he's \"in the game.\" During a flashback, Jimmy, who faces multiple charges and the prospect of being branded a sex offender, is visited by Chuck in jail. Chuck promises Jimmy that he would extend his legal help, in exchange for a solid promise to quit \"everything [Jimmy is] involved with\". In 2002, Jimmy is still working on the Kettleman case and warns them they are at risk of getting robbed. As Jimmy returns to the Kettleman house, he's informed they have been kidnapped. Nacho, whom a neighbor spotted casing the Kettleman house, is arrested; he accuses Jimmy of tipping off the Kettlemans, and threatens to kill Jimmy unless he proves Nacho's innocence. Jimmy comes up with a theory that the Kettlemans have kidnapped themselves and strives to prove it. The police do not believe Jimmy's theory, but Mike does. Later, following Mike's advice, Jimmy locates the Kettlemans in a tent near their home, along with the embezzled $1.6 million. In a flashback, Jimmy and his friend con a bar patron using a fake Rolex watch. In 2002, Jimmy offers his legal services to the Kettlemans; they reject his offer and counter with a $30,000 bribe. Jimmy successfully frees Nacho, but Nacho deduces that Jimmy warned the Kettlemans and warns him about \"consequences\". Jimmy uses the bribe money to purchase clothing and a billboard that exactly imitates Hamlin and HHM's logo. Hamlin obtains a cease and desist order and forces Jimmy to take the billboard down. Jimmy uses this as a way to try to make Hamlin look bad through college media, and in the meanwhile stages a rescue of a billboard worker who has fallen off. The next day, Jimmy's actions make it on the news, much to Hamlin's disgust. Jimmy then makes his daily drop off at Chuck's, but keeps the local paper out of his supplies. With great distress, Chuck runs outside to take the neighbor's newspaper and reads about Jimmy's act. After Chuck's neighbor reports him for stealing her newspaper, he is arrested and hospitalized. A doctor tries to have Jimmy commit Chuck into a mental institution, but Jimmy manages to convince her that he is fully capable of containing Chuck in his own home; however, the nurse proves to Jimmy that Chuck's \"disease\" is entirely psychosomatic. Jimmy's newfound fame seems to attract mostly weird clients, but he eventually comes across an elderly lady in need of a will, which prompts Kim to propose that Jimmy specialize in elder law. Jimmy takes her advice and begins promoting himself at a nursing home. Meanwhile, Mike is visited at home by several police officers from Philadelphia. In a flashback, Mike arrives to Albuquerque on a train and is met by his daughter-in-law, Stacey. Their conversation reveals that Mike's son, Matty, who was also a cop, was recently murdered. Mike finds a crooked veterinarian to treat his bullet wound; the veterinarian offers Mike assistance in finding a job, but Mike declines. In 2002, Mike is taken to the police station and demands Jimmy as his lawyer. He asks Jimmy to spill coffee on one of the detectives so that Mike can steal his notebook; Jimmy refuses at first, but ends up doing it. Reading through the notebook, Mike realizes that Stacey had called the detectives. He confronts her and reveals that Matty was the only \"clean\" cop in the precinct. In another flashback, Mike breaks into a police cruiser parked outside a bar before entering, then after drinking heavily, he tells two detectives, Hoffman and Fenski, he knows it was them. Stumbling, Mike announces his move to Albuquerque and leaves the bar. The two detectives pick him up in their cruiser, where Mike explains that they killed Matty because they were scared of what he might do. They plan to murder him in an empty parking lot using his own gun, but Mike, having feigned his drunken state and hidden a second gun in the back seat, kills them both. In 2002, Mike tearfully explains to Stacey that he was the one who \"broke\" Matty by convincing him to take the bribe, but his partners still saw the hesitation in his eyes and killed him anyway. Mike and Jimmy are called down to the station, and the younger detective accuses them of stealing his notebook. Jimmy returns the notebook and assures him they found it in the parking lot outside. Mike and Jimmy are then allowed to go and Mike tells Jimmy to go home. The next day, Jimmy takes Kim to his new office and offers Kim a partnership but she refuses. Back at HHM, Kim presents to the Kettlemans their best deal which would send Craig to jail for 16 months instead of 30 years. After hearing the deal, Betsy fires Kim and leaves HHM with Craig. Meanwhile Jimmy is hosting a bingo game with the elderly and is contacted by the Kettlemans. They all meet at Loyola's again, and the Kettlemans demand that he represent him and they want no jail time. Jimmy turns them down and strongly encourages them to go back to Kim. They inform him that in order for them to take the deal, they would need all the money, including the bribe Jimmy took. Later that night, Jimmy hires Mike to steal the Kettleman's million dollars from their home, and returns all the money that he took from the bribe. The next day, Jimmy visits the Kettlemans and tells them he took their money, and forces them to take Kim's deal. Jimmy returns the Kettlemans to HHM, and visits the office he had to give up in order for the deal to go through. Jimmy angrily kicks an office door shut and sobs on the floor, only to pull himself together to answer a phone call. In a flashback, Jimmy works in the mailroom at HHM. Jimmy asks Kim to open his bar exam results; he passes and she kisses him on the lips. Jimmy then shows Chuck his results and explains that he studied law via distance learning from the \"University of American Samoa\". Chuck seems to be happy for him. After, there is a small mailroom party to celebrate, but Howard tells Jimmy that HHM refuses to hire him as an attorney. In 2002, Hamlin holds a press conference to announce Craig Kettleman's plea deal, as Jimmy visits clients at a senior care home called Sandpiper Crossing. Jimmy visits a client, discovering that Sandpiper is overcharging her. Jimmy returns to Chuck's house, and points out fraud by Sandpiper Crossing. Chuck tells Jimmy he needs more information, Jimmy returns to Sandpiper, but is forcibly thrown out. Meanwhile, Mike receives a call from Stacey, asking him to babysit Kaylee. Later that night, Jimmy searches the Sandpiper's dumpster for shredded documents. He brings bags of the shredded documents to Chuck's house, but makes no progress and falls asleep. Chuck manages to put some of the documents together, which proves Sandpiper's guilt. Mike meanwhile spends the day with Kaylee, and is asked by Stacey what she should do with the money Matty accepted. Mike tells her to spend it and returns to the vet for a job. Jimmy meanwhile sets up a meeting with Sandpiper's lawyers at Chuck's house, and Chuck demands 20 million dollars from them. After, Chuck explains he sees a way to win which Jimmy is visibly ecstatic. The next day, Jimmy returns to Chuck's house with new client files and naps on his sofa. Chuck absentmindedly walks outside to Jimmy's car to grab some documents Jimmy forgot, and they stand outside in amazement. Chuck and Jimmy are enjoying time outside on a park bench. It seems Chuck is able to spend more time outside than he originally thought, but after a while insists they go inside. Meanwhile, Mike brings Stacey and Kaylee a dog (seen last episode), and receives a call about a job. Jimmy goes to court to argue against a restraining order from Sandpiper Crossing, and ultimately wins. Returning to Chuck's house, Jimmy finds boxes of paperwork and Chuck convinces Jimmy to bring the case to HHM. Later that night, Chuck sneaks outside to place a phone call. The next day, Mike, a loudmouth mercenary named Sobchak (Steven Ogg), and a very large man wait for the job. The client arrives and Mike manages to subdue Sobchak and scare off the other man, accepting the job on his own. Meanwhile, Chuck and Jimmy prepare to visit HHM, lining Chuck's space blanket in his suit. The McGill brothers present their case to Howard, but Howard informs Jimmy that he wants the case, not him. Frustrated, Jimmy refuses the consultation fee and tells Howard to go to hell. After, Kim confronts Howard on his decision, but not after Howard reveals something to her. At the job, Mike and his client wait for Nacho and a new gang of thugs to show up and buy the pills the client is selling. After the deal is concluded, Mike explains to the client, who insists he is not a \"bad man\", that he is now a criminal, and that morality doesn't enter into it. Back at the nail salon, Kim meets up with Jimmy and urges him to take the deal, causing Jimmy to get angry at her. Jimmy enters his office and has a realization when he charges his phone. The next day, Jimmy goes to Chuck's house and confronts him about the phone call he placed to Howard before their meeting. Jimmy has realized it was Chuck who told Howard not to hire him, and has been blocking him from being hired at HHM ever since his days in the mailroom, and demands to know why. Chuck reveals his opinion of Jimmy as not being worthy to be called a real lawyer and that he has not changed since his \"Slippin' Jimmy\" days. Jimmy tells Chuck he's on his own and angrily drives off, with Chuck calling out to him as he goes. In a flashback to Cicero, Illinois, Jimmy says goodbye to his friend and con artist partner Marco, telling him that he is moving to Albuquerque. In the present, Jimmy meets with Howard Hamlin to receive his $20,000 \"of counsel\" fee, and to discuss arrangements for delivering groceries and supplies to Chuck. After having a breakdown while calling Bingo at the retirement home, Jimmy then returns to Cicero where he catches up with Marco at their usual bar. They run a rare coin scam on an out-of-town businessman with a Kennedy half dollar. Over the next week, they run several successful scams. One morning, Jimmy explains to Marco that he is now an elder law attorney and must return to Albuquerque. Marco insists on one last fake Rolex scam for kicks but succumbs to a heart attack during the con. A grieving Jimmy, now wearing Marco's pinky ring, receives a phone call from Kim. A large Santa Fe firm, Davis & Mane, is assisting with the class action suit and considering Jimmy for partner. Jimmy returns to Albuquerque, but backs out of the Davis & Mane meeting. He asks Mike why they gave back the embezzled $1.6 million, then proclaims that whatever stopped him from taking it \"is never stopping [him] again.\" Jimmy drives away, smiling and humming \"Smoke on the Water\", the same song Marco hummed whenever they pulled off the Rolex scam.",
	"links": [
		"https://www.amazon.com/HWC-Trading-Odenkirk-Autograph-Memorabilia/dp/B088KJYRKK",
		"https://www.netflix.com/title/80021955"
	]
}