{
	"title": "Spy",
	"release_year": "2015",
	"runtime": "120",
	"tags": [
		"Action",
		"Comedy",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Melissa McCarthy",
		"Rose Byrne",
		"Jude Law",
		"Jason Statham",
		"Raad Rawi",
		"Jessica Chaffin",
		"Miranda Hart",
		"Sam Richardson",
		"Katie Dippold",
		"Jaime Pacheco"
	],
	"staff": [
		"Paul Feig",
		"Paul Feig",
		"Peter Chernin",
		"Paul Feig",
		"Jessie Henderson",
		"Jenno Topping",
		"Theodore Shapiro",
		"Robert D. Yeoman",
		"Melissa Bretherton",
		"Brent White",
		"Allison Jones",
		"Jefferson Sage"
	],
	"links": [
		"https://www.amazon.com/Spy-Melissa-McCarthy/dp/B013EZQV6E"
	],
	"votes": 261253,
	"cover": "https://m.media-amazon.com/images/M/MV5BNjI5OTQ0MDQxM15BMl5BanBnXkFtZTgwMzcwNjMyNTE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Susan Cooper (Melissa McCarthy) is a desk-bound CIA analyst guiding her partner Agent Bradley Fine (Jude Law) on a mission to Varna from a CIA office in the Washington, D.C. area. Fine kills Tihomir Boyanov after he sneezes without first finding a suitcase nuke whose location is known only to Boyanov. Meanwhile, the agency learns that Boyanov's daughter Rayna (Rose Byrne) might know the location of her father's device, so they send Fine to infiltrate her home. However, Rayna shoots Fine dead while Susan watches online. Rayna knows the identities of all the agency's top agents, including Fine and Rick Ford (Jason Statham). Susan, who is unknown to Rayna, volunteers to become a field agent, and her boss, Elaine Crocker (Allison Janney), agrees. Ford quits in disgust over Susan being chosen for the assignment.Susan is sent to Paris to spy on Sergio De Luca (Bobby Cannavale), Susan was the one who analyzed the footage of Fine's death & identified a piece of paper that had DE Luca's number on it. CIA believes Rayna is using De Luca to find a buyer for the tactical nuke. Later that night, Ford appears in the hotel Susan is staying at and insists that she will ruin the mission due to being an inexperienced field agent. The next morning, Susan recognizes an assassin working for De Luca, and one of his contacts, exchanging Ford's bag for one with a bomb inside it. Susan warns Ford, who throws the bag away (which explodes just seconds later), then catches up to the assassin, but he is killed when they fight. Susan recovers a camera from the assassin, which has a video of him with De Luca, outlining his plans to go to Rome to find a buyer for the nuke.Susan follows De Luca to Rome, where she meets her CIA contact Aldo (Peter Serafinowicz), a suave Italian informant (who is supposed to help Susan track De Luca) who makes inappropriate advances towards her. Susan follows De Luca into a casino where she meets Rayna in a casino, prevents Rayna's assassination, and becomes part of her inner circle. When they fly in her private plane to Budapest, the steward kills the bodyguard and pilots and tries to kill Rayna, but Susan subdues him and lands the plane in Budapest.Rayna believes Susan to be a CIA spy, but Susan convinces Rayna that her father hired her to be Rayna's bodyguard. In Budapest, the two encounter Susan's best friend Nancy B. Artingstall (Miranda Hart), who is sent by Crocker to provide back-up. After being shot at in the street, Susan orders Nancy to get Rayna to safety while she pursues the shooter's vehicle. The shooter turns out to be CIA double agent Karen Walker (Morena Baccarin), who sold Rayna the names of the agents. As she is about to shoot Susan, Walker is killed by an unknown sniper. As most of Rayna's security is dead, she orders Susan to get more guards, & she gets in Aldo.Later that night, Susan and Nancy accompany Rayna to a party. The contact is De Luca's associate, Lia (Nargis Fakhri). Nancy creates a diversion so Susan can fight Lia, who is a skilled assassin. Just as Susan is about to arrest Lia, she is fatally stabbed in the chest by an unknown assailant, who turns out to be Bradley Fine. Susan is captured and is told that Fine faked his death so he could become Rayna's lover.After Susan is imprisoned with Aldo in a bunker, Fine appears and reveals to Susan that the real reason he faked his death was to gain intelligence on the device's location, which could only happen if he gained Rayna's trust. Fine also reveals that he was the one who assassinated Karen. Susan and Aldo escape after subduing two bodyguards. Eventually, Susan accompanies Rayna and Fine at De Luca's mansion while posing as a double agent. Chechen terrorist Solsa Dudaev (Richard Brake) and his men arrive to purchase the device for a suitcase full of diamonds. Rayna then reveals the location of the device. However, De Luca, now in possession of the device and doubting that Dudaev can safely smuggle it into the United States, kills him and his men and keeps the diamonds. De Luca intends to sell the device to someone who can transport it to New York City within a week. As De Luca is about to kill Rayna, Ford appears and distracts him, allowing Susan to save Rayna's life again.De Luca escapes with the device and diamonds on his helicopter, with Susan and Ford clinging to the landing gear. Ford loses his grip and falls into the lake, leaving Susan to confront De Luca in the helicopter alone. After Nancy and Aldo arrive in a helicopter and help Susan kill De Luca, Crocker shows up to recover the device. Rayna is arrested, but it is implied that she has come to like Susan as a friend. After Aldo reveals to Susan that his real name is Albert and he is an MI6 agent, he invites her to dinner should they ever cross paths in London, which Susan accepts. Susan declines a similar offer from Fine and instead opts for a girls' night out with Nancy. The next morning, Susan is shown screaming after waking up in the middle of empty champagne bottles, realizing that she has slept with Ford."
}