{
	"title": "Creed",
	"release_year": "2015",
	"runtime": "133",
	"tags": [
		"Action",
		"Drama",
		"Sport",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Michael B. Jordan",
		"Sylvester Stallone",
		"Tessa Thompson",
		"Phylicia Rashad",
		"Andre Ward",
		"Tony Bellew",
		"Ritchie Coster",
		"Jacob 'Stitch' Duran",
		"Graham McTavish",
		"Malik Bazille"
	],
	"staff": [
		"Ryan Coogler",
		"Ryan Coogler",
		"Aaron Covington",
		"Sylvester Stallone",
		"Robert Chartoff",
		"William Chartoff",
		"Sylvester Stallone",
		"Kevin King Templeton",
		"Ludwig Göransson",
		"Maryse Alberti",
		"Claudia Castello",
		"Michael P. Shawver",
		"Kathy Driscoll",
		"Francine Maisler",
		"Hannah Beachler"
	],
	"votes": 314486,
	"cover": "https://m.media-amazon.com/images/M/MV5BNWM3NjY2ZDctMGZiYy00OGFlLThkMTktOTY2MDM2YjE2OTliXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1998, Adonis \"Donnie\" Johnson (Michael B. Jordan), the son of an extramarital lover of former heavyweight champion Apollo Creed (Carl Weathers), is serving time in a Los Angeles youth facility when Creed's widow, Mary Anne (Phylicia Rashad), pays him a visit and offers to take him in.Seventeen years later, Donnie walks away from his job at a securities firm to pursue his dream of becoming a professional boxer. Mary Anne vehemently opposes this, remembering how her husband was killed in the ring 30 years earlier against Ivan Drago. He tries to get a slot at Los Angeles' elite Delphi Boxing Academy, but is turned down after he is beaten by the gym's star boxer Danny \"Stuntman\" Wheeler (Andre Ward). Delphi trainer Tony \"Little Duke\" Evers (Wood Harris) is Tony Sr's son. Tony Sr was a father figure for Apollo and was Apollo's trainer/manager when Apollo became world heavyweight champion and then one of Rocky's trainers for his rematch against Clubber Lang (Rocky III).Undaunted, Donnie travels to Philadelphia in hopes of getting in touch with his father's old friend and rival, Rocky Balboa.\nDonnie tracks down Rocky (Sylvester Stallone) at Rocky's Italian restaurant, Adrian's, named in honor of his deceased wife, and asks Rocky to become his trainer. Rocky is reluctant to get back into boxing, having already made a one-off comeback at a very advanced age despite having suffered brain trauma during his career as a fighter. However, he eventually agrees. Donnie trains at the Front Street Gym, with several of Rocky's longtime friends as corner-men, and also finds a love interest in Bianca (Tessa Thompson), an up-and-coming singer and songwriter.Donnie, now known as \"Hollywood Donnie,\" defeats a local fighter Leo \"The Lion\" Sporino (Gabriel Rosado). Leo is the son of Pete Sporino (Ritchie Coster), the trainer of Mickey's gym (where Rocky used to train). Pete has been begging Rocky for years to train Leo, & is angry that Rocky is now training this nobody from LA.Word gets out that he is Creed's illegitimate son. Rocky gets a call from the handlers of world light heavyweight champion \"Pretty\" Ricky Conlan (Tony Bellew), who is due to be forced into retirement by an impending prison term. Conlan was supposed to fight Wheeler for his last fight, but he broke Wheeler's jaw during a Pre match-up & now needs a new opponent. He offers to make Donnie his final challenger-provided that he change his name to Adonis \"Hollywood Donnie\" Creed. Donnie balks at first, wanting to forge his own legacy. However, he eventually agrees.While helping Donnie train, Rocky learns he has non-Hodgkin's lymphoma. He is unwilling to undergo chemotherapy, remembering that it was not enough to save Adrian when she had ovarian cancer. His diagnosis and the fact that his best friend and brother-in-law Paulie Pennino-Adrian's brother-has now passed away in addition to Adrian, Apollo and his old trainer Mickey Goldmill further force him to confront his own mortality. Seeing Rocky shaken, Donnie urges him to seek treatment.Donnie fights Conlan in Conlan's hometown of Liverpool, and many parallels emerge between the bout that ensues and Apollo and Rocky's first fight 40 years earlier. First, before going into the ring, Donnie receives a present from Mary Anne - new American flag trunks similar to the ones Apollo and later Rocky wore. Additionally, to the surprise of nearly everyone, Donnie goes the distance after giving Conlan all he can handle. Conlan wins on a split decision (just as Apollo retained his title by split decision against Rocky), but Donnie has won the respect of Conlan and the crowd. As Jim Lampley puts it while calling the fight for HBO, \"Conlan won the fight, but Creed won the night.\" Conlan tells Donnie that he is the future of the light heavyweight division.The film ends with Donnie and a frail but improving Rocky climbing the \"Rocky Steps\" at the entrance of the Philadelphia Museum of Art.",
	"links": [
		"https://www.amazon.com/Creed-Michael-B-Jordan/dp/B017WRCU92"
	]
}