{
	"title": "Relatos salvajes",
	"release_year": "2014",
	"runtime": "122",
	"tags": [
		"Comedy",
		"Drama",
		"Thriller"
	],
	"rating": 8.1,
	"actors": [
		"Darío Grandinetti",
		"María Marull",
		"Mónica Villa",
		"Diego Starosta",
		"Marcelo Frasca",
		"Lucila Mangone",
		"María Laura Caccamo",
		"Carlos Alberto Vavassori",
		"Pablo Machado",
		"Horacio Vay"
	],
	"staff": [
		"Damián Szifron",
		"Julian Loyola",
		"Damián Szifron",
		"Germán Servidio",
		"Agustín Almodóvar",
		"Pedro Almodóvar",
		"Esther García",
		"Matías Mosteirín",
		"Gustavo Santaolalla",
		"Javier Julia",
		"Pablo Barbieri Carrera",
		"Damián Szifron",
		"Javier Braier",
		"Josè Massolo",
		"María Clara Notari"
	],
	"votes": 220149,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzAzMjA1ODAxOV5BMl5BanBnXkFtZTgwODg4NTQzNDE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The first story and prologue is \"Pasternak\": Two passengers on a plane discover that they know a man named Pasternak: the woman was his former girlfriend, and the man was a music critic who savagely reviewed his work. They find out that everybody else on the flight is also connected in some way to Pasternak. It turns out that the whole flight was a trap organized by Pasternak, who was the purser. Pasternak crashes the plane into his parents' house.\"Las Ratas\" (Spanish: The Rats) features a usurer who stops at a small restaurant by the highway. The waitress recognizes him as a man who had ruined her family. She refuses the cook's offer to mix rat poison in his food, but the cook adds the poison anyway. When his son joins him and eats the same food, the waitress tries to take the poisoned food away. The man begins to attack her when the cook appears and kills him with a butcher's knife. Soon after the cook is taken away by the police.\"El Mas Fuerte\" (Spanish: The strongest) features two men driving cars on a lone highway. Mario, whose car is old and damaged prevents Diego, whose car is fast and expensive, from passing him. But Diego finally gets around the slower car, insulting Mario as he passes. Further up the road, Diego gets a flat tire, so Mario catches up with him. Mario parks his car in front of Diego's and proceeds to smash his windshield and defecate and urinate on his roof. Diego then pushes Mario and his car into the river and drives off but has second thought and returns to run down Mario, losing control and going down into the river too. Mario enters Diego's car through the trunk and gets a lit rag into the gas tank, while the two fight inside the car. As the tow truck driver arrives on the scene, and sees nothing on the road or shoulder, the car blows up. When the police arrive, they see two charred bodies that appear to be holding each other and theorize that it might be a \"crime of passion\".\"Bombita\" (Spanish: Little bomb) features Simón Fischer, a demolitions expert whose car is towed away for parking while he's picking up the cake for his daughter's birthday. Fischer goes to the towed-car lot and argues but to no avail. He pays the fee but arrives home as his daughter's party is ending. When he goes to pay the parking ticket, he argues again, attacks the glass partition, and is hauled away by security as other people in line cheer him on. The story gets on the news and the company Fischer was working for fires him. Meanwhile, his wife seeks a divorce and full custody of their daughter. Fischer then goes to an office to apply for a new job and comes out to find that his car has been towed again. He then packs his trunk with explosives, watches as his car is towed again, and detonates the explosives while the car is parked in the towed-car lot. The explosion doesn't kill anyone, which was Fischer's plan, but he is arrested and placed in jail. During the trial the corruption of the towing company and the city are exposed, so the public and his fellow inmates laud him as an urban hero, calling him \"Dynamite\". At the end, his wife and daughter visit him with a birthday cake with a toy tow-truck on it.\"La Propuesta\" (Spanish: The proposal) features a kid from a rich family who hits a pregnant woman with his dad's car and drives away without helping her. The young man drives home and wakes his parents to tell them what happened. Mauricio Pereyra Hamilton, his father, calls his lawyer and they hatch a plan to have their groundskeeper, Jose, take the blame and go to jail for the crime, in return for payment. The accident is all the rage on the TV news, where it is reported that the woman and her unborn child have both died.\nThe police and local prosecutor arrive, and the prosecutor sees through the scheme because the mirrors were not adjusted for the caretaker in the car. But the lawyer negotiates to include the prosecutor in deal, for more money. The caretaker then also asks for an apartment along with his money, and the prosecutor asks for an additional payment to pay off cops, the police chief, and others as needed. The guilty son says he wants to confess to the gathered crowd and media, as it's the right thing to do. The men refuse, but the father gets fed up and walks away, calling the deal off, and yells to his son that he should confess and go to jail. The lawyer continues to talk with the father, and they eventually agree on a price. The caretaker walks out front to get into a police car and go to jail, when suddenly the husband of the dead woman attacks him with a hammer.The final story, \"Hasta Que La Muerte Nos Separe\" (Spanish: Until death do us part), takes place during a wedding party. The wife discovers that her new husband had been cheating on her with a girl who is at the wedding. She confronts him with this as they dance in front of everyone, and she eventually leaves the party and goes up on the roof of the building, where a kitchen worker comforts and advises her. When her husband reaches the roof, she's having sex with the hotel worker, and says that she'll sleep with every man who shows her any interest or kindness and take him for all he's worth if he tries to divorce her, or when he dies. They return to the party and continue with some of the dancing and festivities, but the bride pulls the woman her husband slept with out onto the dance floor, spins her round and round, and slams her into a mirror. She continues to behave erratically, eventually yelling at her husband and his mother, as he's crying, slouched on the floor. His mother attacks her and is pulled off by her husband and the bride's father. The groom picks up the knife for the wedding cake, but just cuts and eats a piece of cake. Finally, he approaches his new wife, they slowly begin to dance and kiss, and then begin having sex on the table alongside the wedding cake, as their guests file out of the room.",
	"links": []
}