{
	"title": "Fantastic Beasts and Where to Find Them",
	"release_year": "2016",
	"runtime": "132",
	"tags": [
		"Adventure",
		"Family",
		"Fantasy",
		"amazon"
	],
	"rating": 7.2,
	"actors": [
		"Eddie Redmayne",
		"Katherine Waterston",
		"Alison Sudol",
		"Dan Fogler",
		"Sam Redford",
		"Scott Goldman",
		"Tim Bentinck",
		"Tristan Tait",
		"Colin Farrell",
		"Tom Clarke Hill"
	],
	"staff": [
		"David Yates",
		"J.K. Rowling",
		"David Heyman",
		"Steve Kloves",
		"J.K. Rowling",
		"Lionel Wigram",
		"James Newton Howard",
		"Philippe Rousselot",
		"Mark Day",
		"Fiona Weir",
		"Stuart Craig",
		"James Hambidge"
	],
	"votes": 513289,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjMxOTM1OTI4MV5BMl5BanBnXkFtZTgwODE5OTYxMDI@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1926 the British wizard and \"Magizoologist\" Newt Scamander (Eddie Redmayne) (Scamander is the future author of the Hogwarts School of Witchcraft and Wizardry standard textbook Fantastic Beasts and Where to Find Them) arrives by ship to New York City on route to Arizona.\nThe world is in turmoil with the Wizard world finding itself at the brink of war with the Muggle world. Dark wizards are attacking the Muggles in Europe. The attacks are led by Dark Wizard Grindelwald and his whereabouts are not known. Beast ownership is banned in the US.Percival Graves, a high-ranking Auror (Auror is a wizard or witch that worked as a highly trained law enforcement official for a Wizarding governing body) and Director of Magical Security for MACUSA, responsible for the protection of wizards, is on the hunt for Grindelwald.\nGraves reports to MACUSA president Picquery, who is worried that a magical beast has just attacked New York. Picquery says that when No-Maj's are afraid, they attack. She believes that the beast is connected to Grindelwald.Newt encounters Mary Lou Barebone (Samantha Morton), a non-magical woman (\"No-Maj\" (in US) or \"Muggle\" (in Europe)) who heads the New Salem Philanthropic Society, which claims that witches and wizards are real and dangerous.As Newt listens to her speak, a Niffler (Nifflers were rodent-like creatures with a long snout similar to that of a platypus and a coat of black, fluffy fur) escapes from his magically expanded suitcase, which houses multiple magical creatures. As he attempts to capture it, he meets No-Maj cannery worker and aspiring baker Jacob Kowalski (Dan Fogler). Jacob had a briefcase very similar to that of Newt.\nJacob was going into a bank to secure a loan for his bakery idea, when the Niffler escaped. Newt chased the Niffler all over the bank, in an attempt to capture it. Newt even gets into the bank vault and is found by Bank manager Mr Bingley. Before security can arrive, Newt uses his magic wand to transport himself and Jacob out of the bank. All of this was witnessed by a woman who was following Newt.\nNewt tries to erase Jacob's memory for the last few minutes, but he escapes with one of the briefcases, the one which belonged to Newt.Demoted Auror (a hunter of dark wizards) Tina Goldstein (Katherine Waterston) arrests Newt for being an unregistered wizard (and for not wiping the No-Maj's memory) and takes him to the Magical Congress of the United States of America (MACUSA) headquarters, hoping to regain her former position. Newt claims that he is in the US to acquire an Appaloosa Puffskein and there is only one man in the world who breeds them, Tina says that breeding of magical creatures is banned in the US.\nHowever, as Jacob's suitcase contains only baked goods, Newt is released. At Jacob's tenement apartment, several creatures escape from Newt's suitcase.Meanwhile Mary meets newspaper owner Henry Shaw Sr (Jon Voight), introduced by his younger son Langdon (Ronan Raftery). Langdon believes in the presence of magic in NYC and wants Henry to publish a story based on Mary's collected evidence. But Henry insults Mary and her kids Credence, Chastity (Jenn Murray) and Modesty and calls them freaks.After Tina and Newt find Jacob and the suitcase, Tina takes them to her apartment and introduces them to Queenie (Alison Sudol), her Legilimens sister (she can read minds). Queenie and Jacob are mutually attracted, though American wizards are forbidden to marry or even socially interact with No-Majs. Newt takes Jacob inside his magically expanded suitcase, where Jacob encounters a contained Obscurus, a dark, destructive parasite that develops inside magically gifted children if they suppress their magical abilities.\nNewt tells Jacob that he came to the US to return a Thunderbird to its native ecosystem in Arizona. The Thunderbird was trafficked and found chained in Egypt. Newt says that he rescues endangered magical creatures and nurtures them back to health to released them back in nature where they belong.Newt extracted it from a young girl who has died, those afflicted rarely living past the age of ten. Newt persuades Jacob to help search for the missing creatures. After re-capturing two of the three escaped beasts, they re-enter the suitcase, which Tina takes to MACUSA. Officials arrest them, believing one of Newt's beasts is responsible for killing Senator Henry Shaw Jr (Josh Cowdery). They decide to destroy Newt's suitcase and erase Jacob's recent memories.Percival Graves (Colin Farrell) accuses Newt of conspiring with the infamous dark wizard Gellert Grindelwald (Johnny Depp). Newt and Tina are sentenced to immediate death, but Queenie and Jacob rescue them; thanks to the help of Goblin gangster Gnarlack (Ron Perlman), Tina's old informant, the foursome then find and re-capture the last of the creatures.Meanwhile, Percival Graves approaches Credence Barebone (Ezra Miller), Mary Lou's adopted son, and offers to free him from his abusive mother. In exchange, he wants Credence to find an Obscurus. Graves believes it has caused the mysterious destructive incidents around the city. Credence finds a wand under his adopted-sister, Modesty's (Faith Wood-Blagrove), bed.Mary Lou assumes it is Credence's wand, but Modesty claims it is hers. When she is about to be punished, the Obscurus is unleashed, killing everyone except Modesty and Credence. Graves arrives and dismisses Credence as being a Squib (a non-magical person of wizard ancestry) and refuses to teach him magic. Credence reveals he is the Obscurus' host, having lived longer than any other host due to the intensity of his magic. In a rage, he unleashes the Obscurus upon the city.Newt finds Credence hiding in a subway tunnel, but he is attacked by Graves. Tina, who knows Credence, arrives and attempts to calm him, while Graves tries to convince Credence to listen to him. As Credence begins to settle into human form, Picquery (Carmen Ejogo) (Seraphina Picquery, the President of MACUSA, the Magical Congress of the United States of America. As such, she is the American equivalent of a Minister for Magic in the United Kingdom) and Aurors arrive. Picquery decides Credence must be executed to protect their magical society. The Aurors apparently disintegrate him, but a tiny Obscurus fragment escape. Graves admits to unleashing the Obscurus to expose the magical community to the No-Majs, and angrily claims that MACUSA protects the No-Majs more than themselves. After being subdued by one of Newt's beasts, he is revealed as Grindelwald in disguise and taken into custody by MACUSA Aurors.MACUSA fears their secret world has been exposed, but Newt releases his Thunderbird to disperse a poultice as rainfall over the city that erases all New Yorkers' recent memories as MACUSA wizards repair the destruction. Queenie kisses Jacob goodbye as the rain erases his memories. Newt departs for Europe but promises to return and visit Tina when his book is finished; he also anonymously leaves Jacob a case of silver Occamy eggshells (which are made of silver) to fund his bakery. His breads and pastries are unknowingly inspired by Newt's creatures, and Queenie visits him in his shop.",
	"links": [
		"https://www.amazon.com/Fantastic-Beasts-Where-Find-Them/dp/B01MSIWWI2"
	]
}