{
	"title": "Trainwreck",
	"release_year": "2015",
	"runtime": "125",
	"tags": [
		"Comedy",
		"Drama",
		"Romance",
		"amazon"
	],
	"rating": 6.2,
	"actors": [
		"Amy Schumer",
		"Bill Hader",
		"Brie Larson",
		"Colin Quinn",
		"Devin Fabry",
		"Carla Oudin",
		"Josh Segarra",
		"Ryan Farrell",
		"Robert E. Torres",
		"Jim Florentine"
	],
	"staff": [
		"Judd Apatow",
		"Amy Schumer",
		"Judd Apatow",
		"Barry Mendel",
		"Jon Brion",
		"Jody Lee Lipes",
		"William Kerr",
		"Paul Zucker",
		"Kevin Thompson"
	],
	"links": [
		"https://www.amazon.com/Trainwreck-Amy-Schumer/dp/B011U0HGUU"
	],
	"votes": 143727,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTQ4MjgwNTMyOV5BMl5BanBnXkFtZTgwMTc1MjI0NDE@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "Gordon Townsend (Colin Quinn) is telling his two young daughters Amy (Devin Fabry) and Kim (Carla Oudin) that he and their mother are divorcing because monogamy is not realistic, repeating it like a mantra. Twenty-three years later, Amy (Amy Schumer) is a party girl who drinks too much, smokes weed and sleeps around while dating a gym-addict named Steven (John Cena).Amy writes for a men's magazine. Amy's boss, Dianna (Tilda Swinton), assigns her to write an article about a sports doctor named Aaron Conners (Bill Hader).\nGordon has multiple sclerosis and has moved into a fancy assisted living home. Amy helps Kim (Brie Larson) pack Gordon's things, who throws away a lot of his Mets memorabilia, which upsets him, when Amy later informs him of Kim's actions. Kim resents her dad because he was a drunk and cheated on their mom. Kim is married to Tom and has a stepson, Allister, who annoys Amy.\nAmy goes to meet Aaron to coordinate schedules for an interview. That night Amy goes to a movie with Steven, who is upset that she is drunk. Their loud conversation gets him into a fight with another moviegoer. Amy returns to the theater after going outside to smoke a joint, when Steven then asks her about all the guys on her phone, and Amy admits she sleeps with other guys. Steven is hurt, having thought they were exclusive. Being really stoned, Amy wants to end the conversation. Steven tells her she is not a nice person and leaves, crushed.At brunch with Kim, Amy realizes that her sister is pregnant. When they visit Gordon to tell him, he is thrilled to finally have a biological grandchild. This makes Kim angry, since she says Allister is his grandchild. Kim leaves, furious.\nWhile Amy interviews Aaron at the sports facility, she receives a text from Kim insisting they move Gordon to a cheaper facility. Amy starts to hyperventilate. Aaron calms her down, and suggests they get food. Over dinner, they begin to bond. He compliments her writing; she learns about his family. After some drinks, they go to his place and sleep together. Amy breaks her rule by staying the night.The next day, Amy tells her co-worker Nikki (Vanessa Bayer) what happened, and Aaron calls to ask if they can see each other again. Amy panics and tells him they will talk about it at the interview. She and Nikki decide she has to end it. Meanwhile, Aaron's friend, LeBron James, is excited for him; Aaron has not dated anyone in five years. Amy goes to watch Aaron perform surgery to \"Uptown Girl\", his favorite song. Afterwards, she tries to break things off. He insists they like each other and should date. Amy then gets a phone call that her dad had a fall. Aaron drives her to the home where he tends to her dad, who immediately takes a liking to Aaron.Aaron and Amy begin dating and fall for each other. Amy is worried she is going to mess up the relationship, but Kim tells her she is just finally doing what everyone else does. Amy goes with Aaron to a charity slam dunk contest hosted by LeBron. LeBron confronts Amy and asks her what her intentions are with Aaron. Confused, she assures him they are fine. Later, Amy goes to see Gordon, and he critiques her relationship with Aaron. He says he knows she is just like him; she cannot have a stable relationship. Amy leaves, angry.Aaron and Amy attend Kim's baby shower. Tom makes a joke to Aaron about Amy's history with men, which unnerves him. A couple of days later, Kim calls her; Gordon has died, as he was hoarding his pain medication at the nursing home. Amy gives a speech at the funeral, asking everyone to \"raise your hand if my dad ever offended you\" and then \"raise your hand if he was also one of your favorite people\". After the funeral, she and Kim get into a fight; Amy says Kim did not even like Gordon anyway. Aaron tells her he loves her for the first time, but Amy tells him he picked the worst time to say it (at her father's funeral). Meanwhile, at work, Dianna tells Amy they cut Aaron's story because it was boring.Aaron receives a prestigious award at a luncheon and brings Amy. While making his speech, Amy gets a call from her boss Dianna, who threatens to fire her if she does not answer. She chooses to take the call and leaves during his speech. Afterwards, Aaron is upset, and they start arguing. They return to her apartment, and Aaron thinks they should not go to bed angry, so Amy lets him have it. She rants all night, even though the next day is Aaron's big surgery on Amar'e Stoudemire. Aaron shows up very tense due to lack of sleep, and Amar'e reschedules the surgery. Aaron goes home and tells Amy that they need to take a break. Hurt, Amy reacts by telling him that it is fine if they break up because the article was canceled. Aaron leaves.Party-girl Amy returns and goes out drinking at a bar with her co-workers, including an intern. He invites her back to his place, and their bizarre sexual encounter is interrupted when his mom enters, revealing that he is only 16. The next day, Dianna fires Amy. Aaron has been moping in his apartment until LeBron calls, claiming he has been injured. Aaron rushes over to find an intervention for him consisting of LeBron, Matthew Broderick, Chris Evert, and Marv Albert. They tell him he has always been afraid of opening up and needs to make things right with Amy, but Aaron insists things with Amy are over.Amy goes to Kim's to apologize. After she tells Kim everything that has happened, Kim tells her maybe it is time to change. Amy clears out all the alcohol from her apartment. She takes her Aaron story to Vanity Fair, where it ends up getting published, and sends it to Aaron. He successfully performs the surgery on Amar'e and attends his first game post-op. After the game, Aaron is called to the court, where the Knicks City Dancers perform with Amy front and center. The slam dunk guys come back, and Amy races and jumps off the trampoline to make a dunk and immediately lands on her face. Aaron rushes over to see if she is okay. She tells him she wanted to show him that she can work hard, and she wants to make their relationship work. She tells him she loves him, and they kiss."
}