{
	"title": "Crazy Rich Asians",
	"release_year": "2018",
	"runtime": "120",
	"tags": [
		"Comedy",
		"Drama",
		"Romance"
	],
	"rating": 6.9,
	"actors": [
		"Constance Wu",
		"Henry Golding",
		"Michelle Yeoh",
		"Gemma Chan",
		"Lisa Lu",
		"Awkwafina",
		"Harry Shum Jr.",
		"Ken Jeong",
		"Sonoya Mizuno",
		"Chris Pang"
	],
	"staff": [
		"Jon M. Chu",
		"Peter Chiarelli",
		"Adele Lim",
		"Kevin Kwan",
		"Nina Jacobson",
		"John Penotti",
		"Brad Simpson",
		"Brian Tyler",
		"Vanja Cernjul",
		"Myron Kerstein",
		"Philothea Liau",
		"Terri Taylor",
		"Nelson Coates"
	],
	"votes": 194687,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTYxNDMyOTAxN15BMl5BanBnXkFtZTgwMDg1ODYzNTM@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1995, Eleanor Young (Michelle Yeoh), her son Nick (Henry Golding), sister-in-law, and niece arrive at a London hotel with a reservation, only to be told condescendingly by the receptionists that the room she booked is not available. Eleanor and family are turned away by the concierge of the hotel, and she is forced to call her husband using a public telephone. When she returns to the hotel, the owner warmly greets her at the lobby and introduces her to the staff as the new owner of the hotel.In the present, Rachel Chu (Constance Wu), an economics professor at New York University (NYU) in New York City, plays poker with a teaching assistant to demonstrate to her game theory class that, in games involving both psychology and choice, \"the key is playing to win, instead of trying not to lose.\"\nRachel accepts an invitation from her boyfriend Nick Young to accompany him to Singapore for his best friend Colin's (Chris Pang) wedding. Nick's mother Eleanor learns of the relationship from rapid online gossip. Rachel is shocked when Nick arranges a first-class suite for the flight; he claims that his family is \"comfortable.\"\nIn Singapore, Rachel and Nick join Colin and his fiance Araminta (Sonoya Mizuno) for dinner in a hawker center. The next day, Rachel visits her old college friend Peik Lin (Awkwafina), who accompanies her to a party thrown by Nick's family. Rachel makes several faux pas and quickly realizes that Nick's mother, Eleanor, dislikes her, but seems to make a good impression on Nick's grandmother, Su Yi (Lisa Lu).Rachel attends Araminta's hens party at a resort owned by her family, while Nick attends Colin's bachelor party aboard a container ship arranged by their boorish schoolmate Bernard (Jimmy O. Yang). A woman named Amanda (Jing Lusi) seemingly befriends Rachel, but deliberately undermines her confidence before revealing that she had previously dated Nick. Amanda sends out a text signaling some of the women who vandalize Rachel's bed with a dead fish and graffiti calling Rachel a \"gold digging b***h\". Nick's cousin Astrid (Gemma Chan) comforts Rachel, admitting that her life is not perfect either, as her husband Michael (Pierre Png) is having an affair. When Nick and Colin flee the ship to relax, Nick tells Colin he plans to propose to Rachel. Colin is concerned that Nick's family's disapproval and the couple's cultural differences will be insurmountable.After Rachel vents to Nick about her unpleasant experience at the hens party, he apologizes to her for concealing his wealth and takes her to make dumplings by hand with his family. Rachel admires Eleanor's distinctive engagement ring; Eleanor tells her how she met her husband and the sacrifices she made to be a part of the family. While looking for the bathroom Rachel spots Eleanor, who tells her that Nick's grandmother disapproved of Eleanor and denied Nick's father the family ring and tells Rachel she will never be good enough for Nick. Rachel considers leaving Singapore, but Peik Lin convinces her to stand up to Eleanor, giving Rachel a glamorous makeover before the wedding with help from Nick's cousin Oliver. Meanwhile, Astrid tells Michael she knows he is cheating on her, and they break up.At the wedding, Rachel displays a remarkable degree of social grace which earns her the admiration of many people, and she even manages to befriend Princess Intan (Kris Aquino) who is normally cold and reserved. However, at the reception, Eleanor and Su Yi pull Rachel aside, and reveal that they hired an investigator to research Rachel's background, discovering that Rachel was conceived through an adulterous affair, after which Rachel's mother, Kerry (Tan Kheng Hua), abandoned her husband and fled to America. Rachel is stunned, as her mother had lied to her saying that her father was dead. Eleanor and Su Yi demand that Nick stop seeing Rachel for fear of scandal. Rachel runs away in tears, and Nick chases after her, even though his grandmother threatens to disown him. Rachel becomes depressed and stays for several days at the house of Peik Lin. She is surprised to discover that Kerry has arrived in Singapore to visit her.Kerry explains that her husband was abusive and that she became pregnant from an old classmate who was trying to comfort her, later fleeing for fear of her husband's reprisals. Kerry reveals that Nick arranged her visit and urges Rachel to reconcile with him. When they meet up, Nick proposes to her.Rachel meets Eleanor at a Mahjong parlor and explains that she declined Nick's proposal in order to prevent the ruin of Nick's relationship with his family. She tells Eleanor that one day, down the road, Eleanor will look back and realize that she is in Rachel's debt. Rachel intentionally loses the Mahjong game to Eleanor, symbolizing her sacrifice, and then walks away with Kerry. Shortly afterward, Astrid and her son move out of Michael's apartment. Rachel and Kerry board an economy-class flight back to the United States. However, Nick arrives and proposes again, this time with Eleanor's ring. Rachel accepts and they stay in Singapore an extra day for an engagement party, during which Eleanor tacitly reveals her grudging respect for Rachel. In the mid-credit scene, Astrid exchanges glances with her ex-fiance, Charlie Wu.",
	"links": []
}