{
	"title": "Little Women",
	"release_year": "2019",
	"runtime": "135",
	"tags": [
		"Drama",
		"Romance",
		"amazon"
	],
	"rating": 7.8,
	"actors": [
		"Saoirse Ronan",
		"Emma Watson",
		"Florence Pugh",
		"Eliza Scanlen",
		"Laura Dern",
		"Timothée Chalamet",
		"Tracy Letts",
		"Bob Odenkirk",
		"James Norton",
		"Louis Garrel"
	],
	"staff": [
		"Greta Gerwig",
		"Greta Gerwig",
		"Louisa May Alcott",
		"Denise Di Novi",
		"Amy Pascal",
		"Robin Swicord",
		"Alexandre Desplat",
		"Yorick Le Saux",
		"Nick Houy",
		"Kathy Driscoll",
		"Francine Maisler",
		"Jess Gonchor"
	],
	"votes": 252931,
	"cover": "https://m.media-amazon.com/images/M/MV5BMWMzYjNiZWMtMDg4NS00MDgyLTk5MWItOTFmNjg4NzRhZmExXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1868, Jo March (Saoirse Ronan) is a teacher in New York City. She goes to an editor, Mr. Dashwood (Tracy Letts), and gets a story published subject to considerable editing and gets paid 20$ for her efforts. She lives in a boarding house called \"Little Women\". It's up to Jo keep the family going till her sister Amy in Paris marries a suitably wealthy man who can provide for everyone. Her sister Amy (Florence Pugh), in Paris with their Aunt March (Meryl Streep), sees childhood friend Laurie (Timothée Chalamet) and invites him to a party. Laurie was turned down by Jo earlier when he proposed to her in NYC. At the party she is angry at his drunken behavior. It is clear that Laurie is no longer infatuated with Jo, who is back in NYC.\nIn New York, Jo meets with Friedrich Bhaer (Louis Garrel), a professor infatuated with her, and he criticizes her work. Afterward, Jo gets a letter saying that her younger sister Beth (Eliza Scanlen) has gotten sicker, so she returns home.In 1861 in Concord, Massachusetts, Jo and her older sister Meg (Emma Watson) go to a party where Jo meets Laurie, the grandson of their neighbor Mr. Laurence (Chris Cooper). On Christmas morning, their mother Marmee (Laura Dern) persuades the girls to give their breakfast to their poor neighbor, Mrs. Hummel. Upon returning home, the girls see their table full of food, provided by Mr. Laurence, and a letter from their father fighting in the Civil War.Jo visits their Aunt March, who invites Jo to Europe with her. During his Latin lesson, Laurie notices Amy standing outside, having been hit by her teacher for misbehaving in class, and invites her in before her family comes to take her home. Amy is trying to distract Laurie's attention from Jo and onto herself.It is clear to Amy that Jo and Laurie are smitten with each other when Jo invites Laurie to act in plays written by her. When Meg, Jo, Laurie and John (James Norton), Laurie's tutor, go out one night, an angry and jealous Amy burns Jo's writings, upsetting Jo. Amy attempts to apologize but to no avail. The next morning Amy, wanting to make up with Jo, chases her onto a lake where Jo and Laurie are skating. The two skate over to save Amy when the ice breaks underneath her. That night, Jo expresses guilt over what happened to Amy. Mr. Laurence invites Beth to play the piano in his house, as she reminds him of his dead daughter.Also, Meg starts going out with John. She is teased by the other girls for not having proper clothes for a party. She buys a $50 dress which she asks John to pay for. John is angry at such mindless expenses. Eventually Meg sells the dress to one of the other girls and decides to marry John.\nIn the present, Laurie visits Amy to apologize for his behavior at the party. Later, he urges Amy not to marry Fred Vaughn (Dash Barber), but to marry him instead. Amy is upset at being second for everything to Jo, including Laurie. Amy later turns down Fred's proposal only to learn that Laurie left for London. Beth's condition later worsens, and she soon dies.In the past, Marmee, the mother of the girls, is informed that their father is ill from the war. While Marmee is visiting their father, Beth is given the piano from Mr. Laurence, but contracts scarlet fever. Amy, who has not had the disease before, is sent to Aunt March. Marmee comes home early when Beth gets worse, but she recovers in time for Christmas, with their father returning home.\nOn Meg's wedding day Jo tries to convince her to run away, but Meg tells her she is happy getting married. Aunt March announces her trip to Europe but decides to take Amy instead of Jo. After the wedding, Laurie admits his feelings for Jo, but she insists she does not feel the same way.In the present Marmee reveals a devastated Amy was returning home with a sick Aunt March. Jo wonders whether she was too quick in turning Laurie down and writes him a letter. On their way back, Amy tells Laurie she turned down Fred's proposal. The two kiss and later marry on the journey home. Returning home, Laurie catches up with Jo and they agree to just be friends. Outside, Jo throws away the letter she wrote for Laurie.The next day, Jo begins writing a novel based on the lives of her and her sisters. She sends the first chapters to Mr. Dashwood, who is unimpressed by them. Bhaer turns up at the March house on his way to California to teach. Her whole family feels that Jo is in love with Bhaer and implores her not to let him get away.In New York, Mr. Dashwood's daughters find the chapters of Jo's book and ask how it ends. He agrees to publish the book but finds it unacceptable that the main character was unmarried. Jo amends her ending so that the main character, herself, chases after Bhaer and stops him from going to California. She negotiates copyright and royalties with Mr. Dashwood.\nLater, Jo has opened a school in Aunt March's house, who gave it to her after she died. Her book has been printed, titled Little Women.",
	"links": [
		"https://www.amazon.com/Greta-Work-Life-Style-Gerwig/dp/0760395659"
	]
}