{
	"title": "X-Men: Apocalypse",
	"release_year": "2016",
	"runtime": "144",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"max",
		"amazon"
	],
	"rating": 6.8,
	"actors": [
		"James McAvoy",
		"Michael Fassbender",
		"Michael Fassbender",
		"Jennifer Lawrence",
		"Jennifer Lawrence",
		"Nicholas Hoult",
		"Nicholas Hoult",
		"Oscar Isaac",
		"Oscar Isaac",
		"Rose Byrne",
		"Evan Peters",
		"Evan Peters",
		"Josh Helman",
		"Sophie Turner",
		"Tye Sheridan",
		"Tye Sheridan"
	],
	"staff": [
		"Bryan Singer",
		"Simon Kinberg",
		"Bryan Singer",
		"Michael Dougherty",
		"Dan Harris",
		"Simon Kinberg",
		"Hutch Parker",
		"Lauren Shuler Donner",
		"Bryan Singer",
		"John Ottman",
		"Newton Thomas Sigel",
		"Michael Louis Hill",
		"John Ottman",
		"Roger Mussenden",
		"Grant Major"
	],
	"links": [
		"https://www.max.com/movies/x-men-apocalypse/ff650eed-5382-4477-8dd4-ea16de4dd4e8",
		"https://www.amazon.com/X-Men-Apocalypse-James-McAvoy/dp/B01FV2BH62"
	],
	"votes": 469552,
	"cover": "https://m.media-amazon.com/images/M/MV5BNjVhNWY3NjItNmZjOS00NTU3LWFiZTctNzdjNGM5Y2Y0MDUwXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 3600 BC, En Sabah Nur (Oscar Isaac), a powerful mutant believed to be the first of his kind, rules ancient Egypt. Due to his aging health, Nur is facing death. He has a variety of destructive superhuman abilities, including Telekinesis, Cyberpathy, teleportation, and the ability to augment other mutants' abilities.\nFollowing a ceremony in which his consciousness is transferred into another man's body in order to gain his healing factor (the young man was a mutant and his powers would grant Nut immortality), he and his four followers, the Horsemen of Apocalypse are betrayed by conspirators.\nThe conspirators cut access to sunlight, which stops the transfer process midway. In the process, his followers are killed, and he is entombed alive as the entire pyramid collapses in on itself when the pillar holding it up are destroyed by the conspirators. Before dying, one of the followers puts Nur's new body into a protective casket and puts a shield around it to save it from the falling debris.A cult of Nur survives & succeeds in finding the location of his tomb & manages his Awakening in 1983 (when they accidentally shine sunlight over the collapsed tomb, thereby completing the transfer of the consciousness into the new body), he believes humanity has lost its way without his presence. Nur's emergence causes a tremor that is felt worldwide.\nAiming to destroy the world and remake it, he recruits Cairo pickpocket Ororo Munroe/Storm (Alexandra Shipp), who can control weather, and upgrades her power.In East Berlin, shape-shifting mutant Raven/Mystique (Jennifer Lawrence) (A mutant with shape-shifting abilities) investigates an underground fight club and discovers mutant champion Angel (Ben Hardy), who possesses a pair of large, feathered wings on his back, and Kurt Wagner/Nightcrawler (Kodi Smit-McPhee), who can Teleport.\nRaven rescues Kurt and employs the services of black marketeer Caliban (Tomas Lemarquis) to transport him to America.\nEn Sabah Nur recruits Caliban's enforcer, Psylocke (Olivia Munn) (Her abilities include projecting purple psychic energy, usually into the form of an energy blade), who leads him to Angel. En Sabah Nur enhances both their powers, transforming Angel's wings into metal wings.Alex Summers/Havok (Lucas Till) (A mutant who has the ability to absorb energy and release it with destructive force from his body) discovers that his younger brother, Scott/Cyclops (Tye Sheridan) (A mutant who fires destructive optic beams and wears a ruby visor or sunglasses to stabilize and contain them), is manifesting his mutation for shooting optic beams. Alex takes Scott to Professor Charles Xavier's/Professor X (James McAvoy) (A pacifist mutant and the world's most powerful Telepath) educational institute in Westchester County, New York in hopes that Xavier and Hank McCoy/Beast (Nicholas Hoult) (mutant with Leonine attributes, Prehensile feet and superhuman physical abilities) will teach him how to control his abilities.Scott meets the Telepathic and Telekinetic Jean Grey (Sophie Turner), and the two develop an attraction. Raven brings Kurt to the institute.\nApocalypse's powers cause disturbances around the world, leading Xavier and Alex to consult with CIA agent Moira MacTaggert (Rose Byrne), who has been researching the legend of Nur in Egypt. Moira has no memory of Xavier as he had purged her memory after their last meeting (X-Men Days of Future Past). Xavier tells Moira that he has level 5 security clearance, and she shares all her intel with him. Nur always had 4 protectors with him, which he called as the Horsemen of Apocalypse.\nJean is having nightmares of an oncoming worldwide destruction led by a Dark Power, which she warns Xavier about. Jean is still learning to control her powers and Xavier encourages her.In Poland, the metal-controlling mutant Erik Lehnsherr/Magento (Michael Fassbender) lives with his wife Magda (Carolina Bartczak) and their young daughter, Nina. He uses his powers to save a coworker, prompting militia to come capture him. When they accidentally kill Erik's family, he retaliates by murdering them.\nNur hacks into the internet and learns all about Earth's history since he has been gone. He learns Erik was the first mutant to announce himself publicly in 1962.\nEn Sabah Nur later approaches the disheartened Erik and takes him to Auschwitz, where Erik's power first manifested. Erik destroys the camp, and the entire town and joins Nur.Raven tells Xavier that Erik has resurfaced and that he might be in trouble, prompting Xavier to enter Cerebro to try and locate Raven.\nEn Sabah Nur enters Xavier's mind while Xavier is using the mutant-locating computer Cerebro to locate Erik and, co-opting Xavier's powers, forces all global superpowers to launch Earth's entire nuclear arsenal into space to prevent interference. All offensive capabilities like submarines, planes and ground forces are forced to self-destruct.\nNur and his new lieutenants arrive at the mansion and kidnap Xavier. Attempting to stop them, Alex accidentally causes an explosion that destroys the mansion.Peter Maximoff/Quicksilver (Evan Peters), having learned that he is Erik's son and hoping that Xavier can help to find him, arrives just in time to use his super speed to evacuate the students just before the explosion destroys the building, but Alex is presumed dead.Colonel William Stryker's (Josh Helman) forces subsequently capture Hank, Raven, Peter, and Moira, and take them to a military facility for interrogation. Scott, Jean and Kurt covertly follow and liberate their comrades using Stryker's mind-controlled and brainwashed experiment, Weapon X (Wolverine/Logan) (Hugh Jackman), whose memories Jean partially restores.Xavier manages to send a hidden mind message to Jean and reveals his position to her. At En Sabah Nur's behest, Erik uses his powers to control Earth's magnetic poles, causing widespread destruction across the planet and mass casualties.\nEn Sabah Nur plans to transfer his consciousness into Xavier's body and use Xavier's power to enslave the minds of every person on earth. Xavier secretly sends a telepathic distress call to Jean, and the others travel to Cairo to battle Apocalypse and his horsemen. They rescue Xavier, but he loses his hair as the process nears completion.\nAngel is defeated and incapacitated in the battle. Erik and Ororo are convinced to turn on En Sabah Nur and, with Scott's help, they keep him occupied physically while Xavier fights him Telepathically in the astral plane. Finally, Xavier encourages Jean to unleash the full extent of her powers, incinerating En Sabah Nur. In the ensuing chaos, Psylocke flees.Xavier restores Moira's memories, and the two rekindle their relationship. Erik and Jean help reconstruct the school, but Erik refuses Xavier's offer to stay and help teach. Peter decides not to tell Erik that he is Erik's son yet. As the new X-Men, Hank and Raven train new recruits Scott, Jean, Ororo, Kurt and Peter.In a post-credits scene, men in suits visit the Weapon X facility to retrieve data on Stryker's mutant research, including an X-ray and a blood sample marked \"Weapon X\", on behalf of the Essex Corporation.",
	"netflix": []
}