{
	"title": "Jack Reacher: Never Go Back",
	"release_year": "2016",
	"runtime": "118",
	"tags": [
		"Action",
		"Crime",
		"Drama",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Tom Cruise",
		"Cobie Smulders",
		"Aldis Hodge",
		"Robert Knepper",
		"Danika Yarosh",
		"Patrick Heusinger",
		"Holt McCallany",
		"Judd Lormand",
		"Christopher Berry",
		"Hunter Burke"
	],
	"staff": [
		"Edward Zwick",
		"Richard Wenk",
		"Edward Zwick",
		"Marshall Herskovitz",
		"Lee Child",
		"Tom Cruise",
		"Don Granger",
		"Christopher McQuarrie",
		"Henry Jackman",
		"Oliver Wood",
		"Billy Weber",
		"Victoria Thomas",
		"Clay A. Griffith"
	],
	"votes": 179797,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTA2MDIwNzAyNzReQTJeQWpwZ15BbWU4MDAxNjI5Njkx._V1_QL75_UX190_CR0,8,190,281_.jpg",
	"description": "After helping the 110th US Army CID Military Police (MP) arrest corrupt Oklahoma Sheriff Raymond Wood (Jason Douglas) and his local deputy (Judd Lormand), and bust a human trafficking ring, former military investigator turned vigilante drifter Jack Reacher (Tom Cruise) returns to his old military headquarters to meet Major Susan Turner (Cobie Smulders), whom he has been working with during his travels.\nReacher learns from Colonel Sam Morgan (Holt McCallany) that Turner has been accused of espionage and detained. Sergeant Leach had been patching Reacher's calls into the CID HQ and she tells Reacher that Turner was an outstanding officerTurner's attorney, Colonel Bob Moorcroft (Robert Catrini), reveals that there is evidence that Turner is involved in the murders of two soldiers in Afghanistan, but Reacher believes she is being framed. Moorcroft says that a hard drive with classified information was found in Turner's home. Morgan sees Reacher meeting Moorcroft.Moorcroft also reveals an old acquaintance of Reacher, Candice Dayton, has filed a paternity suit against him, claiming he is the biological father of her 15-year-old daughter, Samantha Dayton. Reacher tried to reach out to Samantha (Danika Yarosh), but she rebuffs him, believing he is after her biological mother due to her past as a prostitute. Samantha refuses to divulge any information about Candice.\nMeanwhile, Reacher confronts 2 men following him and finds that they work for ParaSource Inc. The men had earlier photographed Reacher meeting Samantha.Moorcroft meets Reacher and says that 2 soldiers found dead in Afghanistan were sent by Turner on an investigation and they filed daily reports. They were both shot at close range and Turner was imprisoned the same day. Reacher finds that Parasource is a big military contractor. Reacher feels that Turner is being isolated and asks Moorcroft to work on getting her bailed out.Moorcroft is beaten to death by The Hunter, an ex-SOCOM operator-turned mercenary who frames Reacher for the murder. Morgan confronts Reacher, who argues that since Moorcroft was killed off-base and Reacher is a civilian, this is a civilian matter. But Morgan uses emergency powers to reinstate Reacher to the Army and arrests him under military jurisdiction.Reacher is arrested and transported to the prison where Turner is being detained. Assassins arrive to kill her, but Reacher neutralizes them, rescues her and they escape to Morgan's house, having deduced he is involved in the conspiracy, to extract information.\nAfter they leave, the assassin, revealed to be working with Morgan, kills Morgan and frames Reacher. Reacher learns about this from a friend, Sergeant Leach (Madalyn Horcher) when he asks her to investigate the military contractor Parasource.Reacher and Turner uncover surveillance pictures of Samantha and surmise she is in danger, arriving at her home to find her foster parents dead and Samantha hiding in the kitchen. Reacher and Turner decide to escort Samantha to Turner's old private school for protection but discover that she has her mobile phone with her, and that the enemy probably knows exactly where they are. They discard the phone and make a quick exit, during which Samantha steals a backpack from one of the students to use the credit cards.Reacher, Turner and Samantha travel to New Orleans in search of Daniel Prudhomme (Austin Hebert), the only eyewitness to the murders for which Turner has been framed. They find him in a derelict warehouse filled with drug addicts and learn that Prudhomme is connected to Parasource, a private military organization that is trying to cover up the murders.\nOn the way, Sam reveals that it was she who filed the paternity suit, to gain financial support from Reacher for her mother.Reacher contacts Turner's friend, Captain Anthony Espin (Aldis Hodge), to move Prudhomme into custody, but they are ambushed by assassins and Prudhomme is killed, while Reacher rescues Espin and finds out that the assassins are Parasource contractors. Parasource's CEO, General James Harkness (Robert Knepper), then sends his enforcer The Hunter (Patrick Heusinger) to capture Samantha after she uses a credit card to order room service.Reacher and Turner, along with Espin, acting on information provided by Prudhomme, intercept a flight of weapons due to enter the country, where they confront Harkness and his men and accuse them of corruption. Upon opening the crates, however, Espin finds weapons as declared in the flight manifest. Before Turner can be re-arrested, Reacher opens up one of weapons and discovers that they are filled with opium. They learn that Harkness framed Turner, who had been investigating his activities, for the murders of two soldiers who discovered that Harkness was selling weapons to insurgents and smuggling drugs into the United States. Espin and his men then arrest Harkness, clearing Reacher's and Turner's names.The enforcer and his men locate and chase Samantha through the streets to lure Reacher into a confrontation. Turner kills one of the assassins, whilst Reacher takes out another one on the rooftop. The enforcer captures Samantha and threatens to kill her, but she manages to escape and steal his gun. Reacher then tackles the enforcer onto another rooftop, briefly incapacitating both of them, and they have a vicious fight that culminates with Reacher breaking the enforcer's arm, leg and neck, before dropping him off the rooftop. Reacher then admits to Samantha he might be her father.Following Harkness' arrest, Turner is reinstated in her old position and goes back to her office, where her colleagues and Captain Espin, all welcome her back. Reacher promises to keep in touch before meeting Samantha at a diner to meet Candice, Samatha's mother, whom Reacher surmises he will recognize as he remembers everyone he has slept with. Samantha reveals that the waitress that had been serving him is in fact Candice and that Reacher cannot be her father as they did not recognize each other. Reacher and Samantha then reluctantly part.\nWhile preparing to leave, a phone rings in Reacher's pocket and finds Samantha's phone, which she had slipped into his pocket, with a final goodbye. Reacher smiles as he hitches a ride to the nearest town.",
	"links": [
		"https://www.amazon.com/Jack-Reacher-Never-Go-Back/dp/B0B5MXYSLM"
	]
}