{
	"title": "The Hateful Eight",
	"release_year": "2015",
	"runtime": "168",
	"tags": [
		"Crime",
		"Drama",
		"Mystery",
		"amazon",
		"netflix"
	],
	"rating": 7.8,
	"actors": [
		"Samuel L. Jackson",
		"Kurt Russell",
		"Jennifer Jason Leigh",
		"Walton Goggins",
		"Demián Bichir",
		"Tim Roth",
		"Michael Madsen",
		"Bruce Dern",
		"James Parks",
		"Dana Gourrier"
	],
	"staff": [
		"Quentin Tarantino",
		"Quentin Tarantino",
		"Richard N. Gladstein",
		"Shannon McIntosh",
		"Stacey Sher",
		"Ennio Morricone",
		"Robert Richardson",
		"Fred Raskin",
		"Victoria Thomas",
		"Yôhei Taneda"
	],
	"votes": 669972,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjA1MTc1NTg5NV5BMl5BanBnXkFtZTgwOTM2MDEzNzE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Years after the Civil War, bounty hunter Major Marquis Warren (Samuel L. Jackson) is trying to transport three dead bounties to the town of Red Rock, Wyoming. Trying to stay ahead of a blizzard, he waits for a stagecoach, when he comes across one driven by a man named O.B, Jackson (James Parks).\nThe stagecoach is passing through a desolate landscape, with snow covering the ground from end to end. This the last stagecoach passing through the area for a long time, due to the blizzard. Warren knows that the blizzard will catch up with them before Red Rock, and so the plan is to get halfway to Minnie's Haberdashery and take shelter there to ride out the storm.\nOB says that another passenger named Ruth has paid him for a private coach, and hence Warren will have to convince him to get on the coach.Another bounty hunter is on the coach: John Ruth (Kurt Russell), aka 'The Hangman', known for bringing in outlaws alive, to see them hang.\nRuth is handcuffed to fugitive Daisy Domergue (Jennifer Jason Leigh), whom he is escorting to Red Rock, Wyoming. He is suspicious of anyone who might steal her to claim the substantial bounty of $10,000. Warren says that he never brings in his own bounties alive, as he believes that it gives enough incentives to the bounties to kill him and escape.\nRuth recognizes Warren as a fellow bounty hunter. Warren swears that he has never heard of Daisy and that his own 3 bounties are worth $8000. Daisy is extremely insulting towards Warren as he is an African American.\nThe two bounty hunters' bond over Warren's personal letter from Abraham Lincoln. Daisy spits on Warren's letter, prompting Warren to smack her in the face real hard.Former Lost-Causer militiaman Chris Mannix (Walton Goggins), who claims he is travelling to Red Rock to be the town's new sheriff, persuades Ruth and Warren to let him on the stagecoach. Mannix argues that both the bounty hunters will be paid only after he is sworn in as the new sheriff of the town.\nWarren and Ruth form an alliance to protect each other's bounties. But due to the mistrust, Ruth asks Warren & Mannix to wear handcuffs. Mannix refuses to ride into Red Rock with handcuffs and so Ruth has to free Warren as well.\nMannix and Warren almost come to blows over their controversial war records. Mannix was part of the Confederate army, which Ruth says was joined by all sorts of thieves and criminals who used the flag as a cover to loot and murder people.\nMannix accuses Warren of being an African American hungry to kill white confederates. He even tells a story when Warren set fire to a confederate prison camp, to kill whites (47 white soldiers died), but ended up killing almost 10 African American prisoners. For this reason, he was booted out of the union army. He wasn't hanged as his war record was stellar. The Confederates have a $30,000 reward on Warren's head.The group is forced to seek refuge from a powerful blizzard at Minnie's (Dana Gourrier) Haberdashery, a stagecoach lodge. They are greeted by Bob (Demián Bichir), a Mexican who says owner Minnie & her husband Dave is visiting her mother and left him in charge.\nOB, Mannix and Warren help Bob to take the horses to the stable and mark lines in the snow from the Haberdashery to the stables and the stables to the outhouse, as the blizzard will drop the visibility down to zero.\nWarren says that it is very unlike Dave to take a trip North in such cold, and very unlike Minnie to care about her customers enough to keep the Haberdashery open in her absence. Minnie had a strict no hats in the Haberdashery rule, but Bob has no such hang ups and doesn't care.The other lodgers are Oswaldo Mobray (Tim Roth), a hangman; Joe Gage (Michael Madsen), a quiet cowboy travelling to visit his mother; and Sanford Smithers (Bruce Dern), a former Confederate general. Suspicious, Ruth disarms all but Warren. OB is sent out in the blizzard to put the guns next to the outhouse.As the group eats, Mannix surmises that Warren's Lincoln letter is a forgery. Warren admits this, saying the letter buys him leeway with whites (and helps Warren survive), outraging Ruth. Warren leaves a gun next to Smithers and provokes him into reaching for it by telling Smithers he tortured (Warren claims that he made the boy walk for miles, completely naked, in bitter mountain cold), sexually humiliated (made him give Warren a blow job just for a blanket), and killed Smithers' son Chester. Mannix is against Warren and continues to counsel Smithers not to listen to Warren as he has been caught lying already.\nWarren shoots Smithers in \"self-defense\", in revenge for Smithers execution of African American soldiers at the Battle of Baton Rouge.While everyone is distracted by the confrontation, someone seen only by Daisy poisons the brewing coffee. Ruth and O.B. drink it, vomit blood, and collapse. The dying Ruth attacks Daisy, but she kills him with his own gun. Warren disarms Daisy, holds the men at gunpoint and leaves her cuffed to Ruth's corpse. Warren is joined by Mannix, whom Warren trusts because he nearly drank the poisoned coffee and stopped when he saw Ruth vomiting.Warren executes Bob, deducing that he is an impostor who killed the lodge owners. When Warren threatens to execute Daisy, Gage admits he is the poisoner. A man hiding in the cellar shoots Warren in the groin. Mobray draws a concealed gun and shoots Mannix, who returns fire, wounding Mobray and forcing Gage against the wall.Earlier that day, Bob, Mobray, Gage, and a fourth man, Jody Domergue (Channing Tatum), Daisy's brother, arrive at Minnie's Haberdashery and kill everyone but General Smithers. Jody tells Smithers they plan to ambush Ruth to rescue Daisy, and that his gang will spare Smithers if Smithers keeps quiet, as an extra lodger will make the setup more believable. The bandits dispose of the bodies, hide the evidence, and conceal guns around the lodge. As Ruth's stagecoach arrives, Jody hides in the cellar.In the present, Mannix and Warren, both seriously wounded, hold Daisy, Gage, and the dying Mobray at gunpoint. They force Jody out of the cellar by threatening to kill Daisy, and when he surrenders, Warren executes him. Daisy claims fifteen of her brother's men are waiting in Red Rock to kill Mannix and ransack the town; if Mannix kills Warren and allows her to escape, the gang will spare him and let him claim the bounties of the deceased.As Daisy and Mobray taunt Warren, Warren shoots Daisy in the foot, then Mobray in the leg, who eventually dies from his wounds. Gage draws a hidden revolver but is shot dead by Mannix and Warren. Warren tries to shoot Daisy but is out of bullets.\nMannix calls Daisy's bluff and rejects her offer, but faints from blood loss. Daisy hacks off Ruth's handcuffed arm and frees herself. As she reaches for a gun, Mannix regains consciousness, shoots, and wounds her. Warren persuades Mannix to hang her from the rafters in honor of Ruth. Afterward, as the two lie dying, Mannix reads aloud Warren's Lincoln letter.",
	"links": [
		"https://www.amazon.com/Hateful-Eight-Samuel-L-Jackson/dp/B01A1FDRP8",
		"https://www.netflix.com/title/80064515"
	]
}