{
	"title": "Sing",
	"release_year": "2016",
	"runtime": "108",
	"tags": [
		"Animation",
		"Comedy",
		"Family",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Matthew McConaughey",
		"Reese Witherspoon",
		"Seth MacFarlane",
		"Scarlett Johansson",
		"John C. Reilly",
		"Taron Egerton",
		"Tori Kelly",
		"Jennifer Saunders",
		"Jennifer Hudson",
		"Garth Jennings",
		"Garth Jennings"
	],
	"staff": [
		"Garth Jennings",
		"Garth Jennings",
		"Janet Healy",
		"Christopher Meledandri",
		"Joby Talbot",
		"Gregory Perler",
		"Allison Jones",
		"Eric Guillon"
	],
	"links": [
		"https://www.amazon.com/Sing-2-Matthew-McConaughey/dp/B09PMFJQFP"
	],
	"votes": 194840,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTYzODYzODU2Ml5BMl5BanBnXkFtZTgwNTc1MTA2NzE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In a world of anthropomorphic animals, koala Buster Moon (Matthew McConaughey) owns a theater, having been interested in show business since his father took him to his first music show as a child. Following financial problems brought up by the bank representative Judith (Rhea Perlman), he tells his wealthy friend Eddie (John C. Reilly) that he will host a singing competition with a prize of $1,000. But Buster's assistant, Miss Crawly (Garth Jennings), accidentally appends two extra zeroes, and the promotional fliers showing $100,000 are blown out of Buster's office into the city streets.Animals from all around the city gather for auditions. Those selected include: housewife and mother of 25 piglets Rosita (Reese Witherspoon); street musician mouse Mike (Seth MacFarlane); mobster's son gorilla Johnny (Taron Egerton); and punk-rock porcupine Ash (Scarlett Johansson). Shy teenage elephant Meena (Tori Kelly) fails her audition out of stage fright, while Ash's boyfriend Lance (Beck Bennett) is dismissed from the contest. Rosita is paired with another contestant, an exuberant pig named Gunter (Nick Kroll), for a dancing routine. Although Buster discovers the fliers show a prize of $100,000, money he does not have, he remains optimistic.Buster convinces Eddie to arrange a visit with Eddie's grandmother, former opera singer and theater actress Nana Noodleman (Jennifer Saunders), to persuade her to sponsor the prize money. She is hesitant to contribute but agrees to see a private screening of the show.Encouraged by her grandfather, Meena tries to ask Buster for another chance, but becomes his stagehand instead. When one of the acts quits, and another is injured, Meena is added as an act. The performers' individual problems begin to hinder rehearsals: Rosita flounders in her dance routine with Gunter, after having been distracted by her parenting duties that have fallen into disarray. After discovering Lance with a new girlfriend and evicting them from her apartment, Ash is heartbroken and in no state to sing her assigned song, Carly Rae Jepsen's \"Call Me Maybe.\"Johnny is torn between having to help his father as the driver of a getaway car in a heist and making the practices. When he tries to do both, he does not show up for the planned pickup in time, and his father and his gang are arrested. Meena does not get any help in overcoming her stage fright, and Mike, certain that the prize money is as good as his, buys a fancy car to impress a female mouse, and then swindles a group of bears in a card game in a nightclub.The day of the screening, the bears interrupt the show, demanding the money from Mike, who in turn, points to Buster. The bears open the chest containing the prize money, but it is nowhere near $100,000. The glass tank full of luminescent squids that Buster got to light up the theater breaks under all their weight, and floods the theater, which then comes crashing down. With the lot repossessed by Judith, Buster, who had been living in his theater's office desk, takes up residence at Eddie's place (his parents' pool house).Although the contestants (besides Mike, who saw Buster as a fraud) visit him and try to cheer him up, Buster is too despondent to listen to them. He tries to start over by opening a car wash, using the same bucket that his father had used to earn money for Buster's theater.When Meena goes to the theater's rubble lot and sings Leonard Cohen's \"Hallelujah,\" Buster hears her and is inspired to reinstate the show without the prize money. They perform in front of Rosita and Meena's family members. As Rosita and Gunter perform Taylor Swift's \"Shake It Off,\" more animals are attracted to the scene as the show is broadcast on the news. Johnny's rendition of Elton John's \"I'm Still Standing\" impresses his father, who then escapes from prison to reconcile with him. Despite interruption by Judith, Ash sings her original rock song \"Set It All Free.\" Mike returns to the show and sings Frank Sinatra's \"My Way.\" Meena finally overcomes her fears and sings Stevie Wonder's \"Don't You Worry 'bout a Thing,\" which literally brings down the house.The show becomes a success and impresses Nana, who was in the audience. Nana buys the lot and the theater is rebuilt and reopened."
}