{
	"title": "Captain America: Civil War",
	"release_year": "2016",
	"runtime": "147",
	"tags": [
		"Action",
		"Sci-Fi",
		"amazon"
	],
	"rating": 7.8,
	"actors": [
		"Chris Evans",
		"Chris Evans",
		"Robert Downey Jr.",
		"Robert Downey Jr.",
		"Scarlett Johansson",
		"Scarlett Johansson",
		"Sebastian Stan",
		"Sebastian Stan",
		"Anthony Mackie",
		"Anthony Mackie",
		"Don Cheadle",
		"Don Cheadle",
		"Jeremy Renner",
		"Jeremy Renner",
		"Chadwick Boseman",
		"Chadwick Boseman",
		"Paul Bettany",
		"Elizabeth Olsen",
		"Elizabeth Olsen"
	],
	"staff": [
		"Anthony Russo",
		"Joe Russo",
		"Christopher Markus",
		"Stephen McFeely",
		"Joe Simon",
		"Jack Kirby",
		"Kevin Feige",
		"Henry Jackman",
		"Trent Opaloch",
		"Jeffrey Ford",
		"Matthew Schmidt",
		"Sarah Finn",
		"Owen Paterson"
	],
	"votes": 864170,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjQ0MTgyNjAxMV5BMl5BanBnXkFtZTgwNjUzMDkyODE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1991, the brainwashed super-soldier James \"Bucky\" Barnes (Sebastian Stan) is dispatched from a Hydra base in Siberia to intercept an automobile carrying a case of super-soldier serum. Barnes is activated using a series of code words written into a Red book. Once activated, Barnes is a compliant soldier. Barnes attacks a Cadillac on an isolated road, which crashes and kills the occupants. Barnes steals the serum from the boot of the car.In the present day, approximately one year after Ultron's defeat in the nation of Sokovia at the hands of the Avengers, Steve Rogers (Chris Evans), Natasha Romanoff (Scarlett Johansson), Sam Wilson (Anthony Mackie), and Wanda Maximoff (Elizabeth Olsen) stop Brock Rumlow (Frank Grillo) from stealing a biological weapon from a lab in Lagos. Rumlow steals the weapon and escapes in an armored vehicle despite the best efforts of the Avengers. Rumlow knows that he cannot outrun the Avengers and gives the weapon to his associates for extraction. He stays behind to stop the Avengers. Rumlow blows himself up, hoping to kill Rogers. Before dying Rumlow reveals that Barnes is the buyer and that he remembers Rogers.\nRomanoff kills the associates to retrieve the biological weapon. When Maximoff tries to displace the blast into the sky with Telekinesis, it destroys a nearby building, killing several Wakandan humanitarian workers.U.S. Secretary of State Thaddeus Ross (William Hurt) informs the Avengers that the United Nations (UN) is preparing to pass the Sokovia Accords, which will establish a UN panel to oversee and control the team. If the Avengers reject the oversight, then they will have to retire.\nThe team is divided: Tony Stark (Robert Downey) supports oversight because of his role in Ultron's creation and Sokovia's destruction, while Rogers has more faith in his own judgment than that of the government.\nVision argues that it has been 8 years since Stark announced himself as Iron Man, since then the number of enhanced people and the number of world ending events have both risen exponentially. Vision argues that their strength invites challenge and conflict.\nTony, Rhodes, Vision sign the document. Clint retires and Wanda is TBD.At a conference in Vienna where the accords are to be ratified, a bomb kills King T'Chaka (John Kani) of Wakanda. Security footage indicates the bomber is Barnes, whom T'Chaka's son, T'Challa (Chadwick Boseman), vows to kill.Informed by Sharon Carter (The acting head of SHEILD) (Emily VanCamp), Peggy Carter's grand niece (Peggy Carter was Roger's first true love in the 1940's) of Barnes' whereabouts and the government's intentions to kill him, Rogers intends to bring in Barnes, his childhood friend and war comrade, himself.\nRogers and Wilson track Barnes to Bucharest. Barnes insists that he had nothing to do with the bombing in Vienne. Rogers and Wilson attempt to protect him from T'Challa (who appears as the Black Panther and prevents Barnes from escaping) and the authorities, but all four including T'Challa are arrested.Vision stops Wanda from leaving on Stark's orders, moving Wanda from a TBD to firmly anti-oversight.\nStark speaks to Rogers and almost convinces him to sign the accords. But Rogers refuses when he finds that Stark has kept Wanda under his custody under the guise of her safety.Helmut Zemo (Daniel Brühl) tracks down and kills Barnes' old Hydra handler, stealing a book containing the trigger words that activate Barnes' brainwashing. Zemo questions the handler about the mission report for the 1991 mission carried out by Barnes, before killing him.\nInfiltrating the Berlin facility where Barnes is held, Zemo recites the words to make Barnes obey him.Zemo questions Barnes about his mission report from 1991, then sends him on a rampage to cover his own escape. Rogers stops Barnes and sneaks him away to a safe-house. When Barnes regains his senses, he explains that Zemo is the real Vienna bomber and wanted the location of the Siberian Hydra base, where other brainwashed \"Winter Soldiers\" are kept in cryogenic stasis. Barnes reveals that after injecting the serum, the super soldiers were trained, but they were barely controllable and had to be put in Statis. Zemo wants control of these soldiers to mount an attack against the Avengers.Unwilling to wait for authorization to apprehend Zemo, Rogers and Wilson go rogue, and recruit Maximoff, Clint Barton (Jeremy Renner), and Scott Lang (Paul Rudd) to their cause.With Ross's permission, Stark assembles a team composed of Romanoff, T'Challa, James Rhodes (Don Cheadle), Vision (Paul Bettany), and Peter Parker (Tom Holland) (Stark offers Peter a serious technology upgrade to bring him to his side) to capture the renegades. Stark's team intercepts Rogers' team at Leipzig/Halle Airport, where they fight until Romanoff allows Rogers and Barnes to escape. The rest of Rogers' team is captured and detained at the Raft prison, while Rhodes is partially paralyzed from the neck down after being inadvertently shot down by Vision, and Romanoff exiles herself.Stark discovers evidence that Barnes was framed by Zemo. He finds that Zemo is a member of the Sokovian intelligence & was directly orchestrating the framing of Barnes. Then Stark visits Wilson, Wanda and Barton, who have been imprisoned by Ross. Stark convinces Wilson to give him Rogers' destination, the Siberian location where Barnes was created by Hydra.Without informing Ross, Stark goes to the Siberian Hydra facility and strikes a truce with Rogers and Barnes, unaware they were secretly followed by T'Challa. They discover that the other super-soldiers have been killed by Zemo, who shows them footage from Hydra's archives. Zemo reveals that he lost his entire family in Sokovia and hence wanted to end the Avengers. The footage reveals that Barnes killed Stark's parents during his mission in 1991.Enraged that Rogers kept this from him, Stark turns on them both, dismembering Barnes' robotic arm. Rogers disables Stark's armor and departs with Barnes, leaving his shield behind, when Stark reminds him that the shield was made by Stark's father & that Rogers doesn't deserve it. Satisfied that he has avenged his family's death in Sokovia by irreparably fracturing the Avengers, Zemo attempts suicide, but T'Challa stops him, and he is taken to the authorities.In the aftermath, Stark provides Rhodes with exoskeleton leg braces that allow him to walk again, while Rogers breaks his allies out of the prison.\nIn a mid-credits scene, Barnes, granted asylum in Wakanda by T'Chanka, chooses to return to cryogenic sleep until a cure for his brainwashing is found.\nIn a post-credits scene, Parker tests a new gadget.",
	"links": [
		"https://www.amazon.com/Captain-America-Civil-War-Theatrical/dp/B01EXR226A"
	]
}