{
	"title": "War for the Planet of the Apes",
	"release_year": "2017",
	"runtime": "140",
	"tags": [
		"Action",
		"Adventure",
		"Drama",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Andy Serkis",
		"Woody Harrelson",
		"Steve Zahn",
		"Karin Konoval",
		"Amiah Miller",
		"Terry Notary",
		"Ty Olsson",
		"Michael Adamthwaite",
		"Toby Kebbell",
		"Gabriel Chavarria"
	],
	"staff": [
		"Matt Reeves",
		"Mark Bomback",
		"Matt Reeves",
		"Rick Jaffa",
		"Amanda Silver",
		"Peter Chernin",
		"Dylan Clark",
		"Rick Jaffa",
		"Amanda Silver",
		"Michael Giacchino",
		"Michael Seresin",
		"William Hoy",
		"Stan Salfas",
		"Debra Zane",
		"James Chinlund"
	],
	"links": [
		"https://www.amazon.com/Dawn-Planet-Apes-4K-UHD/dp/B08GSMLNL1"
	],
	"votes": 306183,
	"cover": "https://m.media-amazon.com/images/M/MV5BMzNhMzNiZDYtMzYxYy00YTYwLTkxNmYtNTJhOGU1Yjg5ODI5XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Two years after the U.S. military was called to fight off an increasingly intelligent and dangerous tribe of apes, starting a devastating war between them and the humans, the apes' clan, led by the chimpanzee Caesar (Andy Serkis), are attacked in the woods by a rogue paramilitary faction known as Alpha-Omega, led by a ruthless Colonel (Woody Harrelson).Alpha-Omega also has in its service apes they call \"donkeys\" that had previously followed Koba (Toby Kebbell), a maniacal, human hating bonobo who led a failed coup against Caesar and started the war after attempting to wipe out humanity. During the attack, the Alpha-Omega militants are met by heavy ape resistance, and several soldiers, including a \"donkey\" gorilla named Red (Ty Olsson), are captured by the apes. Caesar arrives and orders the four human soldiers to be released, with a message to the Colonel that he did not start the war, and that he desires peace between the humans and apes. Caesar orders that Red is to be imprisoned for his crimes, but before he can be imprisoned, Red escapes, injuring an albino gorilla named Winter (Aleks Paunovic). Soon after, Caesar's son Blue Eyes (Max Lloyd-Jones) and his lieutenant Rocket (Terry Notary) return from a journey to find a safe haven for the apes. They report that they have found a place across the desert that is perfect for the clan. Winter, still frightened from the soldiers' attack, wants to leave immediately, but Caesar does not think they are prepared to leave so soon.That night, a group of Alpha-Omega soldiers, led by the Colonel, infiltrates the apes' home behind a waterfall. The apes discover their presence and kill them all except the Colonel, whom Caeser encounters preparing to escape. Discovering that the Colonel has killed his wife Cornelia (Judy Greer) along with Blue Eyes, an enraged Caesar lunges at the Colonel but fails to prevent him from escaping out of the waterfall. Winter cannot be found, and Luca (Michael Adamthwaite), a gorilla, believes that Winter has betrayed them out of cowardice.Leaving his younger son, Cornelius (Devyn Dalton), in the care of Blue Eyes' mate, Lake (Sara Canning), Caesar departs to exact revenge on the Colonel for the death of his family. He is accompanied by Maurice (Karin Konoval), an orangutan and Caesar's adviser, Luca, and Rocket, while the other apes head for the desert. During their journey, the apes enter an abandoned village, encounter a soldier, and kill him when he reaches for his rifle. Caesar, Maurice, Luca, and Rocket search the dead soldier's home. Maurice discovers the soldier's daughter Nova (Amiah Miller) who is apparently unable to speak. Maurice befriends and adopts the girl, giving her a small rag doll.Along the way Caesar's party encounters Winter in an Alpha-Omega camp on the beach where he has volunteered to become a \"donkey\" for the soldiers in return for sparing his life. He tells Caesar's group that the Colonel has departed for a location referred to as the \"border.\" Winter tries to call out to the Alpha-Omega soldiers to save him, but Caesar and the others struggle to keep him quiet. While restraining the traitorous gorilla, Caesar unintentionally smothers him, killing Winter. Caesar begins to worry that he is becoming like Koba by killing his fellow apes and seeking revenge. While following the soldiers to the border, they discover some soldiers who have been shot and left for dead. Their examination of a soldier who survived reveals that he, like the girl, cannot speak. At the soldier's urging, Caesar mercy kills him. Later the group encounters Bad Ape (Steve Zahn), an intelligent chimpanzee hermit who lived in the Sierra Zoo before the Simian Flu pandemic. Bad Ape reveals that the human soldiers are encamped at the border and hesitantly agrees to lead them there.When the group arrives at the border, they see hundreds of apes held captive inside a former quarantine facility. While getting a closer look, Luca is killed protecting Caesar from an Alpha-Omega patrol, angering Caesar and causing him to proceed alone. Caesar discovers the rest of his ape clan has been captured, and are being forced to build a wall with no food or water; he is captured by Red.The Colonel reveals to Caesar that the Simian Flu virus has mutated and now causes humans who survived the original strain to devolve, becoming mute and regressing back to a primitive state. Caesar deduces that the Colonel is barricading himself in the facility to fend off remnants of the U.S. Army from the north who are coming to execute him because he favors massacring any infected humans, including his own son, to stop the spread of the virus. Caesar is commended by the Colonel for his intelligence, and the Colonel explains that he is fighting a \"holy war\" for the survival of mankind.While Caesar is tortured with starvation, the mute girl, whom Maurice names Nova, sneaks into the facility to give Caesar food, water, and her rag doll (originally given to her by Maurice). To prevent Nova from being discovered, Rocket allows himself to be captured as a diversion. The next day, the Colonel comes to see if Caesar is still alive and confiscates Nova's doll upon discovering it. Together Caesar and Rocket are able to work out a means of escape via an underground tunnel that leads out of the facility. Maurice and Bad Ape use the tunnel to rescue the apes, and Caesar orders the others to escape while he goes to confront the Colonel as the facility comes under attack by the northern army. Caesar reaches the Colonel and prepares to kill him but discovers that Nova's doll has infected the Colonel with the mutated virus, rendering him unable to speak. Caesar spares the Colonel and watches as he uses his pistol to commit suicide, rather than reverting back to a primitive state.During the battle between Alpha-Omega and the northern army, the escaping apes come under fire from Alpha-Omega. Caesar attempts to attack Alpha-Omega forces from behind but is shot with a crossbow by Preacher (Gabriel Chavarria), one of the Alpha-Omega militants he had previously set free. Red saves Caesar's life by killing Preacher with a grenade launcher and is executed by an Alpha-Omega superior as a result. Caesar blows up a large fuel tank, causing a cascade of explosions which destroys the Alpha-Omega facility, allowing the northern army to win the battle. However, the army is subsequently devastated by an avalanche, which Caesar and the other apes, carrying Nova, survive by climbing nearby trees.The remaining apes depart the facility and cross the desert to find an oasis. While the other apes joyously celebrate their new home, Maurice discovers Caesar's wound. Maurice then speaks, telling the dying Caesar that Cornelius will know what his father believed in and did to protect the apes. Caesar slowly succumbs to his wound and dies peacefully while Maurice mourns his passing as the other apes look on."
}