{
	"title": "Murder on the Orient Express",
	"release_year": "2017",
	"runtime": "114",
	"tags": [
		"Crime",
		"Drama",
		"Mystery",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Kenneth Branagh",
		"Penélope Cruz",
		"Willem Dafoe",
		"Judi Dench",
		"Paapa Essiedu",
		"Yassine Zeroual",
		"Asan N'Jie",
		"Michael Rouse",
		"Elliot Levey",
		"David Annen"
	],
	"staff": [
		"Kenneth Branagh",
		"Michael Green",
		"Agatha Christie",
		"Kenneth Branagh",
		"Mark Gordon",
		"Judy Hofflund",
		"Simon Kinberg",
		"Patrick Doyle",
		"Haris Zambarloukos",
		"Mick Audsley",
		"Lucy Bevan",
		"Jim Clay"
	],
	"votes": 301996,
	"cover": "https://m.media-amazon.com/images/M/MV5BNTlkYjBlZTctZjg2YS00NDMzLTlkMTMtNWExMGYyOTliMmEzXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1934, famous detective Hercule Poirot (Kenneth Branagh) solves a theft at the Church of the Holy Sepulchre in Jerusalem. The obsessive compulsive Belgian-who seeks balance in life, and considers his case-solving ability to see a lie amid truth a curse-wants to rest in Istanbul but must return to London for another case. His friend Bouc (Tom Bateman), director of the Orient Express, offers him a room on the train.Poirot refuses businessman Samuel Ratchett's (Johnny Depp) offer to hire him as his bodyguard during the three-day journey, as Ratchett has received threatening letters from an unknown party. That night Poirot hears strange noises coming from Ratchett's compartment, and sees someone in a red kimono running down the hallway. An avalanche derails the train and strands the passengers.\nThe next morning Poirot learns Ratchett was murdered during the night after being stabbed a dozen times. Poirot and Bouc investigate passengers as repairs begin. Evidence indicates that Ratchett was murdered by one person, with Caroline Hubbard (Michelle Pfeiffer) claiming that a man was in her compartment during the night and that since her cabin was next to Ratchett, the murderer would have entered Ratchett's cabin through hers.\nPoirot discovers a partially destroyed note connecting Ratchett to the kidnapping of Daisy Armstrong, a child who was abducted from her bedroom and held for ransom. After the ransom was paid, Daisy was found murdered. Ratchett is identified as John Cassetti, Daisy's kidnapper and murderer. Her death caused her mother Sonia (Miranda Raison) to die after giving premature birth to a stillborn baby; her father, Colonel Armstrong, then committed suicide. The family's nursemaid Susanne was arrested and hanged herself while in police custody, but exonerated after her death.\nThe train compartments were locked at night, so the only suspects were the people in that particular compartment. Also that compartment had a guard who said he saw nobody enter Ratchett's cabin during the time of his death. Ratchett's coffee is found to be drugged, but his Valet Henry does not know how the coffee was drugged before or after he delivered it to Ratchett.\nThen Poirot finds Hector trying to burn the ledgers of Ratchett's accounts. Poirot stops him and accuses him of stealing from Ratchett and hence killing him for the fear of being found out. But Dr Artbutnot confirms that Hector was drinking with him all night.More evidence is found, including a bloodstained handkerchief and the button of a conductor's uniform found in Hubbard's compartment. The uniform is later found, as is the kimono, discovered in Poirot's own suitcase. Hubbard is stabbed in the back; she survives but cannot identify the culprit. Poirot discovers several of the passengers have direct connections to the Armstrong family. While interviewing governess Mary Debenham (Daisy Ridley), John Arbuthnot (Leslie Odom Jr.) shoots Poirot in the shoulder claiming that he is the murderer, but is stopped by Bouc. Poirot realizes that Arbuthnot-a medical doctor and former army sniper-never meant to kill him.\nPoirot then interview count and Countess Andrenyi. He finds that countess's passport has been tampered and deduces that her first name is not Elena, but Helena. He then deduces that Helena is in fact the sister of Sonia Armstrong, who is living in permanent fear from the events of the past.Poirot meets the suspects outside the train, offering two theories of how Ratchett died. The first is simple: A murderer disguised as a conductor boarded the train, murdered Ratchett, and fled. The second is more complex: Every suspect is connected to the Armstrongs, Susanne, or her trial in some way-including those who had pretended otherwise-and had motive to kill Ratchett/Cassetti. Hubbard is revealed to be Linda Arden, former stage actress and Sonia Armstrong's mother.\nPoirot reveals that the 13 other passengers on the train, and the train conductor, were all connected to the Armstrong family in some way:\nHector Willard MacQueen (Josh Gad), Ratchett/Cassetti's secretary was devoted to Sonia Armstrong. MacQueen's father was the district attorney for the kidnapping case. He knew from his father the details of Cassetti's escape from justice and intended to kill Ratchett. Hector's father was pressured to go after the maid on flimsy evidence. The maid later killed herself and then the evidence turned towards Casetti. Hector's father was pilloried for this.\nEdward Henry Masterman (Derek Jacobi), Ratchett/Cassetti's valet, was Colonel Armstrong's batman during the war, and later his valet, who also acted as butler to the Armstrong household.\nColonel Arbuthnot was Colonel Armstrong's comrade and best friend.\nMrs. Hubbard is, in actuality, Linda Arden (maiden name Goldenberg), the most famous tragic actress of the New York stage, and was Sonia Armstrong's mother and Daisy's grandmother.\nCountess Andrenyi (née Helena Goldenberg) (Lucy Boynton) was Sonia Armstrong's sister.\nCount Andryeni (Sergei Polunin) was the husband of Helena Andrenyi.\nPrincess Natalia Dragomiroff (Judi Dench) was Sonia Armstrong's godmother, and a friend of her mother.\nMiss Mary Debenham was Sonia Armstrong's secretary and Daisy Armstrong's governess.\nFräulein Hildegarde Schmidt (Olivia Colman), Princess Dragomiroff's maid, was the Armstrong family's cook.\nAntonio Foscarelli, a car salesman based in Chicago, was the Armstrong family's chauffeur.\nMiss Greta Ohlsson, a Swedish missionary, was Daisy Armstrong's nurse.\nPierre Michel (Marwan Kenzari), the train conductor, was the father of Susanne, the Armstrong's nursemaid who committed suicide.\nCyrus Hardman (Willem Dafoe), a private detective ostensibly retained as a bodyguard by Ratchett/Cassetti, was a policeman in love with Susanne.\nPilar Estravados (Penélope Cruz) was Daisy's nurse and has now turned to religion and service of God.\nManuel Garcia-Rulfo as Biniamino MarquezHubbard admits that she gathered everyone and planned the murder. All of the suspects took turns stabbing Ratchett. Arbuthnot stabbed Hubbard without endangering her life to convince Poirot of a lone killer. Poirot challenges the passengers to shoot him with his gun since he is the only one who can expose their plot; Bouc can lie but Poirot-obsessed with truth and balance-cannot. Hubbard grabs the gun and tries to kill herself. The gun is unloaded; Poirot wanted to see how the suspects would react.\nAs the train is put back on track Poirot concludes that justice is impossible in the case, as Ratchett deserved death; for the first time he will have to live with a lie and imbalance. Poirot presents the lone killer theory to the Yugoslavian police, allowing the suspects to leave. As he disembarks the train a messenger asks him to investigate a death on the Nile. Poirot takes the case.",
	"links": [
		"https://www.amazon.com/Murder-Orient-Express-Michael-Rouse/dp/B0B8JSQSHG"
	]
}