{
	"title": "Despicable Me 3",
	"release_year": "2017",
	"runtime": "89",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"amazon"
	],
	"rating": 6.2,
	"actors": [
		"Steve Carell",
		"Steve Carell",
		"Kristen Wiig",
		"Trey Parker",
		"Miranda Cosgrove",
		"Dana Gaier",
		"Nev Scharrel",
		"Pierre Coffin",
		"Pierre Coffin",
		"Pierre Coffin",
		"Steve Coogan",
		"Steve Coogan",
		"Julie Andrews",
		"Jenny Slate"
	],
	"staff": [
		"Kyle Balda",
		"Pierre Coffin",
		"Cinco Paul",
		"Ken Daurio",
		"Janet Healy",
		"Christopher Meledandri",
		"Heitor Pereira",
		"Pharrell Williams",
		"Claire Dodgson"
	],
	"votes": 160970,
	"cover": "https://m.media-amazon.com/images/M/MV5BNjUyNzQ2MTg3Ml5BMl5BanBnXkFtZTgwNzE4NDM3MTI@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "Following the previous film, Gru (Steve Carell) is now an agent for the Anti-Villain League (AVL) and he and his wife Lucy (Kristen Wiig) are sent to foil the plans of Balthazar Bratt (Trey Parker), a former child actor who portrayed a young super-villain in a popular television series \"Evil Bratt\" before it was canceled as a result of his puberty, and his waning popularity led to him adopting his former persona to become an actual super-villain. Gru manages to stop Bratt from stealing a very expensive diamond but is unable to capture him. As a result of constantly failing to capture Bratt, Gru and Lucy are fired from the AVL by its mean new director Valerie Da Vinci (Jenny Slate), following the retirement of Silas Ramsbottom (Steve Coogan).Gru and Lucy reluctantly tell their children, Margo (Miranda Cosgrove), Edith (Dana Gaier), and Agnes (Nev Scharrel), of their termination, but assure them they will find new jobs someday. Already upset Dr. Nefario has frozen himself in Carbonite, most of Gru's Minions leave Gru when he refuses to return to villainy despite losing his job. Meanwhile, Lucy struggles to adapt in her new role as the children's new mom.The next morning, the family is approached by Fritz (Coogan), the butler of Gru's long-lost twin brother Dru, who lives in a distant country named Freedonia and longs to meet him. Stunned at this revelation, Gru confronts his mother (Julie Andrews) who reveals after divorcing Gru's father, they agreed to keep one child each. The family decides to meet Dru and they are surprised at his immense wealth which Fritz attributes to their pig farm business. Meanwhile, the Minions are arrested after trespassing at a talent show set, while Bratt manages to steal the diamond once again, intending to use it to power a giant robot he constructed so he can destroy Hollywood as revenge for the cancellation of his show.While Lucy takes the children around Freedonia, Dru reveals to Gru that their father was a legendary super-villain. As Dru was constantly dismissed by their father as a disgrace, he turned to his brother to teach him how to be a villain. When Gru refuses to revert back to his old ways, Dru brings him on a joyride around Freedonia in their father's highly technological car where the siblings bond. Meanwhile, Lucy tries to balance her tasks as a mom which she exhibits after turning away a young boy named Nico who had fallen for Margo in the midst of a traditional cheese festival, all while Edith and Agnes stumble into a local tavern and learn from the bartender that a mythical unicorn lurks in the nearby forest.Gru, fatherly attempts to convince Agnes that unicorns are imaginary, but decides not to on account of her anticipation. The next day, Agnes and Edith set out into the woods to track the mythical horse, only to find, unexpectedly, a one-horned goat whom Agnes dubs \"Lucky\" and takes to her heart. Meanwhile back in Los Angeles, the Minions are hungry and follow a pizza delivery boy into a studio & are arrested. They are jailed and Minions exert control among the prisoners at their jail, but their longing for Gru motivates them to escape the prison.Having discovered Bratt has stolen the diamond, Dru convinces Gru to steal the diamond for one last heist to infiltrate Bratt's lair with Gru secretly intending to bring it to the AVL in order for Da Vinci to reinstate his work. Despite several setbacks, they manage to retrieve the diamond back, and are rescued by Lucy who had followed them earlier after a narrow escape. After finding out Gru's true motives, Dru confronts his brother on why he lied to him, and the latter insults him and decides to leave Dru's mansion. Bratt infiltrates Dru's mansion by disguising as Lucy, kidnaps the children, and once again acquires the diamond which leads the three to resolve their differences and pursue him.With his robot powered, Bratt terrorizes Hollywood just as planned. Lucy saves the children while Gru and Dru weaken Bratt's robot with the weapons of their father's car. Gru is knocked unconscious when the car is destroyed and Dru, having seemingly gained his inner villain, destroys the robot's core from the inside when Bratt threatens to kill Gru. When Gru recovers, he battles Bratt in a dance fight and uses it as a distraction to grab his key-tar, which ends in Gru trapping Bratt in his own gum and blasting him away. Having rendezvoused with Gru, the Minions manage to destroy the gum already covering the city, and Gru and Dru reunite.Soon afterward, Gru and Lucy are reinstated in the AVL and the newly united family celebrate in Gru's home. Lucy is acknowledged by the children as their mother; Dru, who still yearns to be a villain, steals Gru's ship, accompanied by the Minions. Gru and Lucy decide to give them a five-minute head-start before engaging pursuit.",
	"links": [
		"https://www.amazon.com/Despicable-Me-3-Steve-Carell/dp/B071K96CS6"
	]
}