{
	"title": "Black Widow",
	"release_year": "2021",
	"runtime": "134",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Scarlett Johansson",
		"Scarlett Johansson",
		"Florence Pugh",
		"David Harbour",
		"Rachel Weisz",
		"Ray Winstone",
		"Ever Anderson",
		"Violet McGraw",
		"O-T Fagbenle",
		"William Hurt",
		"Olga Kurylenko",
		"Olga Kurylenko"
	],
	"staff": [
		"Cate Shortland",
		"Eric Pearson",
		"Jac Schaeffer",
		"Ned Benson",
		"Kevin Feige",
		"Lorne Balfe",
		"Gabriel Beristain",
		"Leigh Folsom Boyd",
		"Matthew Schmidt",
		"Badr Balafrej",
		"Victoria Beattie",
		"Fouad Chaairi",
		"Leo Davis",
		"Charles Wood"
	],
	"votes": 435204,
	"cover": "https://m.media-amazon.com/images/M/MV5BZTMyZTA0ZTItYjY3Yi00ODNjLWExYTgtYzgxZTk0NTg0Y2FlXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1995, super soldier Alexei Shostakov (David Harbour) (The Russian super-soldier counterpart to Captain America and a father-figure to Romanoff and Belova) and Black Widow Melina Vostokoff (Rachel Weisz) (A seasoned spy trained in the Red Room as a Black Widow and a mother-figure to Romanoff and Belova who is now one of the Red Room's lead scientists) work as Russian undercover agents, posing as a family in Ohio with Natasha Romanoff (Scarlett Johansson) and Yelena Belova (Florence Pugh) as their daughters.They steal S.H.I.E.L.D. intel and escape to Cuba where their boss, General Dreykov (Ray Winstone) (Russian General and head of the Red Room Program), has Romanoff and Belova taken to the Red Room for training. Yelena is happy to be back, but Natasha is distraught at leaving Ohio and doesn't want to go back into the Red Room program.\nYears pass, during which Shostakov is imprisoned in Russia while Romanoff defects to S.H.I.E.L.D. after bombing Dreykov's Budapest office and apparently killing him and his young daughter Antonia (Olga Kurylenko).In 2016, Romanoff is a fugitive for violating the Sokovia Accords (The Sokovia Accords are a set of legal documents designed to regulate the activities of enhanced individuals, specifically for those who work for either government agencies such as S.H.I.E.L.D. or for private organizations such as the Avengers. Established by the United Nations and ratified by 117 nations, the accords serve as a \"middle point\" between the Avengers' desire to secure world peace and the international community's concern over the repercussions of the Avengers' actions).The Sokovia Accords caused a schism in the Avengers. While Tony Stark supported the Accords due to his role in the Ultron Offensive, Steve Rogers recognized that the government having power over potential missions may be a terrible idea in an emergency and disliked the authoritarian nature of its stipulations, noting that signing the Accords would be \"surrendering the right to choose\". The schism came to a head when Helmut Zemo framed Bucky Barnes for a terrorist attack that occurred during the signing of the Accords.Combined with Zemo's exploitation of the schism, the Accords tore the Avengers apart, causing Stark's pro-Accords faction and Rogers' anti-Accords faction to destroy an airport as the former attempted to arrest the latter. The Accords caused the anti-Accords faction and Natasha Romanoff, who had been pro-Accords but betrayed Stark's faction knowing that Rogers would never stand down, to either become fugitives or be placed under house arrest, ruining any chance of coordinated defense.She escapes from U.S. Secretary of State Thaddeus Ross (William Hurt) and flees to a safe-house in Norway supplied by Rick Mason (O-T Fagbenle) (An ally from Romanoff's S.H.I.E.L.D. past who is romantically interested in her).\nMeanwhile, Belova kills a rogue former Black Widow but comes in contact with a synthetic gas that neutralizes the Red Room's chemical mind-control agent. Belova removes her own tracker, sends antidote vials to Romanoff, hoping she and the Avengers can free the other Widows, and goes into hiding.When Romanoff is unknowingly driving with the vials in her car, Red Room agent Taskmaster attacks her. Romanoff realizes that the Taskmaster is interested in a case, and escapes from Taskmaster and finds that the vials came from Belova (it was collected by Mason from Natasha's hideout in Budapest). There she finds Belova who reveals that Dreykov is alive, and the Red Room is still active. Black Widows and Taskmaster attack them, but Romanoff and Belova evade them and meet with Mason, who supplies them with a helicopter.\nBelova says that the antidote was created by a Black Widow from Melina's generation. Belova says Dreykov has killed many little girls (only 1 in 20 survives the training, the rest he kills), and the black widow program needs to stop.Romanoff and Belova break Shostakov out of prison (he was imprisoned by Dreykov, but he doesn't know why) to learn Dreykov's location, and he directs them to Vostokoff who lives on a farm outside Saint Petersburg. There she is refining the chemical mind control process used on the Widows (This is what Shostakov and Melina has stolen from SHEILD in the first place, all those yrs ago). Belova tells Melina that her mind control chemicals were used on her, and she only managed to get out because of the antidote, while Natasha abandoned her. Melina also tells Natasha that she was not abandoned by her parents, she was selected by a program that assessed genetic potential in infants, and her parents were paid off. But her mom kept looking for her, threatening the exposure of the Red room, so Dreykov had her killedVostokoff alerts Dreykov and his agents arrive to take them, but Romanoff convinces Vostokoff to help them (by informing her how her mind control research has been used to kill and maim Soviet girls all over the world) and the pair use face mask technology to switch places. The Taskmaster arrives, everyone is sedated and taken to the Red room, which is a floating city in the sky.At the Red Room, Vostokoff frees Shostakov and Belova from their restraints. Dreykov sees through Romanoff's disguise and reveals that Taskmaster is Antonia, who suffered damage severe enough that Dreykov had to put technology in her head to save her, in turn creating the perfect soldier, capable of mimicking the actions & fighting styles of anyone she sees. Romanoff is unable to attack Dreykov due to a pheromone lock installed in every Widow but negates that by breaking her own nose and severing a nerve in her nasal passage. Shostakov battles Taskmaster while Vostokoff takes out one of the facility's engines. They then lock Taskmaster in a cell.Dreykov escapes as other Black Widows attack Romanoff, but Belova exposes them to the antidote. Romanoff copies the locations of other Widows worldwide from Dreykov's computer as the facility begins to explode and fall. She retrieves two surviving antidote vials and frees Taskmaster from the locked cell.Vostokoff and Shostakov escape via a plane (which loses control after they lose their vertical stabilizer and hence, they can't get back to the red room to rescue the girls) while Belova takes out Dreykov's aircraft (by destroying its engine with a pole, by the explosion throws her off the exploding deck of the Red room), killing him. Romanoff, who was watching this, jumps after her.\nIn free-fall, Romanoff gives Belova a parachute before battling Taskmaster. After landing, Romanoff uses one antidote vial on Taskmaster and gives the other to Belova along with the locations of the other mind-controlled Widows so she can find and free them. Belova, Vostokoff, and Shostakov say goodbye to Romanoff and leave with Antonia and the freed Widows. Two weeks later, Mason supplies Romanoff with a Quinjet to use in freeing the imprisoned Avengers.In a post-credits scene set after Romanoff's death, Valentina Allegra De Fontaine (Julia Louis-Dreyfus) blames her death on Clint Barton and assigns him as Belova's next target.",
	"links": [
		"https://www.amazon.com/Black-Widow-UHD-Scarlett-Johansson/dp/B09BRGWNM2"
	]
}