{
	"title": "American Made",
	"release_year": "2017",
	"runtime": "115",
	"tags": [
		"Action",
		"Comedy",
		"Crime",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Tom Cruise",
		"Domhnall Gleeson",
		"Sarah Wright",
		"Jesse Plemons",
		"Caleb Landry Jones",
		"Lola Kirke",
		"Jayma Mays",
		"Alejandro Edda",
		"Benito Martinez",
		"E. Roger Mitchell"
	],
	"staff": [
		"Doug Liman",
		"Gary Spinelli",
		"Ray Angelic",
		"Doug Davison",
		"Brian Grazer",
		"Brian Oliver",
		"Christophe Beck",
		"César Charlone",
		"Andrew Mondshein",
		"Mindy Marin",
		"Dan Weil"
	],
	"votes": 212872,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTUxNzUwMjk1Nl5BMl5BanBnXkFtZTgwNDkwODI1MjI@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In the late 1970s, Barry Seal (Tom Cruise), a pilot for commercial airline TWA, is contacted by CIA case officer Monty Schafer (Domhnall Gleeson). He asks Seal, who has been smuggling Cuban cigars into the country via Canada, to fly clandestine reconnaissance missions for the CIA over Central America using a small, fast, twin-engine Piper Smith Aerostar 600 (the fastest twin-engine plane on the planet at the time), outfitted with sophisticated aerial surveillance cameras. The plane is registered to Independent Aviation Consultants (IAC).\nSeal tells his wife, Lucy (Sarah Wright), he's still with TWA. Seal has 2 kids with a third on the way. They live in Baton Rouge.Schafer says that Seal would be in charge of IAC and would run missions for the CIA after hours. But his wife Lucy cannot know about the work. Seal tells Lucy that he is opening his own company for logistical support of airports. Seal quits his job at the TWA.\nBack in 1978, the Cold War was in full swing, and the Soviets were backing Communist Insurgents in Central America in countries like Guatemala, Honduras, and El Salvador. Seal's job is to get pictures of the insurgents, their bases and activities. The plane is shot at multiple times (on one instance, he lost an engine to gun fire), but the photos that Seal gets are fantastic. Schafer gets all the credit for the photos at the CIA.Later in the 1970s, Schafer asks Seal to start acting as a courier between the CIA and General Noriega (Alberto Ospino) in Panama. Noriega was selling intel to the CIA on all the Communist activity in Panama. Seal would deliver him the money and take the files given by Noriega back to the CIA.\nDuring a mission in Columbia in 1980, the Medellin Cartel (Jorge Ochoa, Carlos Lehder (Fredy Yate) and Pablo Escobar) picks Seal up and asks him to fly cocaine on his return flights to the United States. Medellin knows that Seal comes to Central American every week and his flights are sanctioned by the CIA. Medellin's usual routes through the ocean are heavily patrolled by the DEA and their boats are routinely caught. Their couriers on commercial flights are now caught by drug sniffing dogs. Medellin offer him $2000 per kilo.\nThe runway of the Medellin was short, and a few pilots had killed themselves trying to take off.Seal accepts (because the CIA is not paying him enough for his services) and starts flying the cartel's cocaine to Louisiana, delivering the drugs via airdrop in the countryside instead of landing at an airport in Miami. Seal carries 300 kilos in each trip.\nThe CIA turns a blind eye to the drug smuggling, but the DEA tracks Seal down. During one trip, the Medellin HQ are raided by the Columbian Armed Forces and Seal is locked up as a CIA operative. Schafer comes to meet Seal in prison and only offers to get him released for his greater involvement in CIA missions.To avoid the DEA authorities, Schafer moves Seal and his family to a remote town in Arkansas called Mena and his wife comes to accept the wealth generated by his new life. The small town gradually becomes wealthy as the hub of U.S. cocaine trafficking.Later, Schafer asks Seal to run guns to the Nicaraguan Contras (after the communist backed Sandinistas took power in Nicaragua, in a bid to unseat them from power) based in Honduras, Central America. This mission was sanctioned by Ronald Reagan in the White House.\nSeal soon realizes that the Contras are not serious about the war and just want to get rich.Pablo Escobar (Mauricio Mejia) of the Medellin cartel meets Barry in Nicaragua and tells him that the Contra are not interested in war. He makes a new deal with Barry. Barry delivers CIA's guns to Pablo in Columbia, Pablo loads Barry's plane with Cocaine, which he delivers to Contras in Nicaragua. The Contras take the cocaine to Miami via the boats. General Noriega provides the extra fuel for these trips in Panama. Eventually the operations get so big that Barry hires 4 more pilots with planes to join him.\nThe CIA set up a Contra training base in Mena and Seal flies the Contras in, but many of them escape as soon as they arrive. By 1982, Barry was swimming in money. Seal makes so much money he buries it in suitcases in the backyard.Seal's freeloading brother-in-law JB (Caleb Landry Jones) moves in, needing a job. Meanwhile the DEA starts intercepting Barry's flights more regularly and even forces him to crash his plane in 1 instance. In Columbia, Pablo goes to war against his government with the arms supplied by Barry.Eventually, JB starts stealing money from the Seals and is caught by Sheriff Downing (Jesse Plemons) with a briefcase full of laundered cash and is arrested. Seal gives him money and a plane ticket to Bora Bora so he can leave. JB demands weekly cash and insults his sister Lucy Seal (Sarah Wright). Barry tries to chase him, but JB's car explodes; it is implied Jorge Ochoa (Alejandro Edda), Pablo's partner, had JB's car rigged with explosives, killing him so that he would not snitch.The FBI soon catches wind of the sudden exuberance on the streets of Mena, not helped by JB's reckless spending.\nEventually, the CIA shuts the program down and abandons Seal (They figured out that Seal was selling the guns to the Columbians), who is arrested by the FBI, DEA and other law enforcement agencies.\nSeal escapes prosecution by making a deal with the White House, which wants evidence the Nicaraguan Sandinistas are drug traffickers. They ask Seal to get photos that tie the Medellín Cartel to the Nicaraguan Sandinistas. Seal manages to get the pictures, but the White House releases them as propaganda against the Sandinistas. Seal is prominently shown in the pictures, which leads to his arrest, and to the cartel plotting revenge.Seal is convicted but sentenced to only 1,000 hours of community service. Moving from motel to motel making video recordings of his experiences, Seal fears an explosion anytime he starts his car. As his community service is performed at the same Salvation Army building every night, Seal cannot hide from the cartel and is shot dead by assassins. The CIA destroys all evidence connecting them to Seal and continues smuggling, instead using Iran to get guns to the Contras, as proposed by Schafer.Schafer gets promoted for his idea, though it is soon discovered by the public with reporters asking President Reagan and Vice President Bush about the scandal. Lucy and her kids move back to Baton Rouge, where she is seen contentedly working in fast food. One of her expensive pieces of jewelry is seen on her wrist.",
	"links": [
		"https://www.amazon.com/American-Made-Tom-Cruise/dp/B075XBSX1V"
	]
}