{
	"title": "Thor: Ragnarok",
	"release_year": "2017",
	"runtime": "130",
	"tags": [
		"Action",
		"Adventure",
		"Comedy",
		"amazon"
	],
	"rating": 7.9,
	"actors": [
		"Chris Hemsworth",
		"Tom Hiddleston",
		"Cate Blanchett",
		"Mark Ruffalo",
		"Mark Ruffalo",
		"Idris Elba",
		"Jeff Goldblum",
		"Tessa Thompson",
		"Karl Urban",
		"Anthony Hopkins",
		"Benedict Cumberbatch"
	],
	"staff": [
		"Taika Waititi",
		"Eric Pearson",
		"Craig Kyle",
		"Christopher L. Yost",
		"Stan Lee",
		"Kevin Feige",
		"Mark Mothersbaugh",
		"Javier Aguirresarobe",
		"Zene Baker",
		"Joel Negron",
		"Sarah Finn",
		"Dan Hennah",
		"Ra Vincent"
	],
	"votes": 829854,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjMyNDkzMzI1OF5BMl5BanBnXkFtZTgwODcxODg5MjI@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Two years after the battle at Sokovia, Thor (Chris Hemsworth) has been unsuccessfully searching for the Infinity Stones and is now imprisoned by the fire demon Surtur (Clancy Brown) in Muspelheim. Surtur reveals that Thor's father Odin (Anthony Hopkins) is no longer on Asgard (exiled on Earth), and that the realm will soon be destroyed in the prophesied Ragnarok, once Surtur unites his crown with the Eternal Flame that burns in Odin's vault.\nSurtur says that he cannot die till his destiny is fulfilled, and he destroys Asgard. Thor defeats Surtur and claims his crown, believing he has prevented Ragnarok. Thor needs Heimdall to provide him a fast exit using the Bifrost, but Heimdall cannot be summoned.\nAn Asgard warrior named Skurge is protecting the Bifrost while Heimdall is away, who eventually hears Thor and retrieves him through the Bifrost.Thor returns to Asgard to find his brother Loki (Tom Hiddleston) posing as Odin and Heimdall missing. Thor forces Loki to help him find their father whom Loki left at an old age care home in New York. The old age home is now demolished, and Odin is nowhere to be found. With directions from Stephen Strange (Benedict Cumberbatch) on Earth (Strange explains that he tracks all arrivals on Earth and considers Loki as a threat to the planet. He is happy to know that Thor intends to return to Asgard with Loki and Odin as soon as he is found), they locate Odin in Norway.\nOdin explains that he is dying, and that his passing will allow his firstborn child (Cate Blanchett) (Goddess of death), Hela, to escape from a prison she was sealed in long ago. Hela had been the leader of Asgard's armies, and had conquered the Nine Realms with Odin, but had been imprisoned and written out of history after Odin feared that she had become too ambitious.Odin subsequently dies, and Hela, released from her imprisonment, appears. She destroys Thor's hammer Mjolnir, and when Thor and Loki attempt to flee through the Bifrost Bridge, she pursues them and forces them out into space to die.Hela arrives in Asgard, destroying its army and killing the Warriors Three; resurrects the ancient dead who once fought with her, including her giant wolf Fenris; and appoints the Asgardian Skurge (Karl Urban) as her executioner. She plans to use the Bifrost to expand Asgard's empire, but Heimdall (Idris Elba) covertly steals the sword that controls the Bridge and hides away with the rest of Asgard's citizens, who are hidden inside a cave in the countryside.Thor crash-lands on Sakaar, a garbage planet surrounded by wormholes. He is captured by a bounty hunter named Scrapper 142 (Tessa Thompson) and taken to serve as a gladiator for the planet's ruler, the Grandmaster (Jeff Goldblum) (One of the Elders of the Universe, who rules the planet Sakaar, and enjoys manipulating lesser life-forms.), with whom Loki has already become ingratiated. With his hammer, Thor is powerless.\nLoki refuses to help free Thor. Grandmaster says that he can grant freedom to Thor if he defeats the Sakaar Champion in a gladiator combat. Thor is put into a holding area for the contestants, where he meets Korg and Mike.\nKorg tells Thor that 142 is an Asgardian.Thor recognizes 142 as one of the Valkyrior (A tough, hard-drinking Asgardian bounty hunter, based on the mythological being Brynhildr, who was once a legendary warrior of the Valkyrior) a legendary force of female warriors who were killed defending Asgard from Hela long ago.\nThor taunts 142 that all Valkyrior are sworn to protect the throne of Asgard.Thor is forced to compete in the Grandmaster's Contest of Champions, facing his old friend Hulk (Mark Ruffalo). At first, Thor is elated that he is facing the Hulk, but the Hulk himself has no recollection of Thor and attacks him relentlessly.\nSummoning lightning (which Thor realizes that he can do without the Hammer), Thor almost defeats Hulk but the Grandmaster sabotages the fight (he activates a neck brace on Thor which renders him unconscious) to ensure Hulk's victory.Still enslaved, Thor attempts to convince Hulk and 142 to help him save Asgard, but neither is willing. Thor learns from Hulk that he arrived on Sakaar on a Quinjet. Thor again summons Heimdall and manages to connect with him. Heimdall helps Thor to see how Hela has completely captured Asgard. If Hela manages to leave Asgard, she will destroy the nine realms and consume the entire Cosmos.\nHeimdall tells Thor that he is on a planet surrounded by cosmic pathways, and advises him to use the biggest one to return to Asgard.\nThor soon manages to escape the palace and finds the Quinjet that brought Hulk to Sakaar. Hulk follows Thor to the Quinjet, where a recording of Natasha Romanoff ( Scarlett Johansson) makes him transform back into Bruce Banner for the first time since Sokovia.The Grandmaster orders 142 and Loki to find Thor and Hulk, but the pair come to blows and Loki forces her to relive the deaths of her fellow Valkyrie at the hands of Hela. Deciding to help Thor, she takes Loki captive to prove her goodwill. Unwilling to be left behind, Loki provides the group with the means to steal one of the Grandmaster's ships. They then liberate the other gladiators who, led by Korg (Taika Waititi) and Miek, stage a revolution.Loki attempts to betray his brother to gain a reward from the Grandmaster, but Thor anticipates this and leaves him behind, where Korg and the gladiators soon find him. Thor, Banner, and 142 escape through a wormhole to Asgard, where Hela's forces are attacking Heimdall and Asgard's citizens. Banner becomes Hulk again, fighting Fenris, while Thor and 142 battle Skurge and the resurrected warriors. Loki and the gladiators arrive to help, and the citizens board their large ship; a repentant Skurge sacrifices himself to allow their escape.Thor, facing Hela, loses an eye and then has a vision of Odin that helps him realize only Ragnarok can stop Hela. Odin also tells Thor that he is the God of Thunder and that his powers are not reliant on the Hammer.\nWhile Hela is distracted, Loki locates Surtur's crown and places it in the Eternal Flame. Surtur is reborn and destroys Asgard, seemingly killing Hela.\nThor and the others escape with Asgard's remaining citizens aboard the Grandmaster's vessel. Thor, now king, decides to take his people to Earth.In a mid-credits scene, they are intercepted by a large spacecraft.\nIn a post-credits scene, the Grandmaster encounters a group of his former subjects, who are still rebelling.",
	"links": [
		"https://www.amazon.com/Thor-Ragnarok-Theatrical-Chris-Hemsworth/dp/B076XR2JF6"
	]
}