{
	"title": "The Martian",
	"release_year": "2015",
	"runtime": "144",
	"tags": [
		"Adventure",
		"Drama",
		"Sci-Fi",
		"max",
		"amazon"
	],
	"rating": 8.0,
	"actors": [
		"Matt Damon",
		"Jessica Chastain",
		"Kristen Wiig",
		"Kate Mara",
		"Jeff Daniels",
		"Michael Peña",
		"Sean Bean",
		"Sebastian Stan",
		"Aksel Hennie",
		"Chiwetel Ejiofor"
	],
	"staff": [
		"Ridley Scott",
		"Drew Goddard",
		"Andy Weir",
		"Mark Huffam",
		"Simon Kinberg",
		"Michael Schaefer",
		"Ridley Scott",
		"Harry Gregson-Williams",
		"Dariusz Wolski",
		"Pietro Scalia",
		"Carmen Cuba",
		"Nina Gold",
		"Arthur Max"
	],
	"links": [
		"https://www.max.com/movies/martian/31cb4b84-951a-4daf-8925-746fcdcddcb8",
		"https://www.amazon.com/Martian-Michael-Pe%C3%B1a/dp/B018HIZ65U"
	],
	"votes": 940954,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTc2MTQ3MDA1Nl5BMl5BanBnXkFtZTgwODA3OTI4NjE@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "In the year 2035, the crew of the Ares III manned mission to Mars is on Sol 18 of their 31-Sol expedition on the surface, when a severe dust storm forces them to abort the mission and return to their orbiting vessel Hermes. During the evacuation, astronaut Mark Watney (Matt Damon) is struck off by flying debris and is lost in the storm; the last telemetry from his suit indicates that it has lost pressure, with no life signs. With their launch vehicle on the verge of tipping over in the wind, and the remaining crew's lives in peril, mission commander Melissa Lewis (Jessica Chastain) gives the order to launch without retrieving him; they subsequently leave Mars aboard the Hermes. The crew then leaves the Mars orbit and heads back to Earth.As the storm dissipates, Watney later awakes to the sound of a low-oxygen warning. He is injured but makes his way to the \"Hab\" which serves as the crew's living quarters and base of operations on Mars. He removes a piece of antenna which had impaled him in the belly, damaging his bio monitor. The antenna and his coagulated blood provided a temporary seal, saving his life. He quickly concludes that his only chance of rescue will be the arrival of the Ares IV crew in four years.Calculating that he has enough food to last only 300 Sols (Martian solar days), he improvises a farm in the Hab using whole potatoes sent along for a Thanksgiving meal, Martian soil fertilized with bacteria from his and his crew-mates' waste, and water produced by extracting hydrogen from leftover rocket fuel then oxidized by burning. He keeps a series of video logs to maintain morale and begins to modify the one functional rover to make it capable of long journeys across Mars's vast terrains. As the next Mars mission is scheduled to land in 4 yrs time in the Schiaparelli crater which is 3200 Kms from Mark's current location. Mark starts to experiment with various configurations of the existing rover that is designed to travel 35 Kms, before it requires charging, to extend its battery life and range.While reviewing satellite photos of Mars, Mars mission director Vincent Kapoor (Chiwetel Ejiofor) and satellite planner Mindy Park (Mackenzie Davis) realize that Watney has survived, and immediately start planning to establish contact. Over the objections of Hermes flight director Mitch Henderson (Sean Bean), NASA director Teddy Sanders (Jeff Daniels) decides not to inform the remaining crew of Ares III of Watney's survival, believing it would distract them from their remaining mission and endanger them. To restore communication with Earth, Watney takes the rover on a medium-range mission to retrieve the Pathfinder probe, which went silent in 1997. Using the lander's rotating still camera, Watney and the JPL team establish rudimentary communication, which they use to help them upgrade to typed text messaging.As Watney continues to grow his crop, Henderson and JPL director Bruce Ng (Benedict Wong) formulate a plan to send a space probe to Mars and resupply Watney with enough food to allow him to survive until Ares IV's scheduled arrival. As the probe's launch date approaches, an increasingly optimistic Sanders authorizes them to tell the crew of Watney's status, and they are informed in a video message from Henderson. With no other way to launch the supply probe on time, Sanders decides to skip safety inspections, which backfires when the probe explodes shortly after liftoff. Watney suffers his own disaster when the airlock on the habitat explosively decompresses, killing his potatoes and reducing his projected supply of food.The China National Space Administration (CNSA) offers NASA a lifeline: a classified booster that can carry a payload to Mars; NASA begins preparing an even more hasty supply mission using it. Meanwhile, JPL Astro Dynamicist Rich Purnell (Donald Glover) figures out a trajectory which could send Hermes back to Mars much more quickly, using the Chinese booster to instead resupply it for the necessary additional year and a half in space. Because both plans require the same booster, only one can be used; Sanders chooses the first plan, refusing to risk the lives of the Hermes crew. Henderson objects, and surreptitiously sends the details of Purnell's plan to Hermes. Lewis and her crew vote unanimously to execute the plan, and NASA - powerless to stop them - proceeds with the resupply as Hermes flies by Earth, using its gravity to slingshot them back to Mars.After 459 Sols, Watney leaves the Hab, beginning a 3200km, 90-sol journey to Schiaparelli Crater using solar panels from his hub powering his rover, where the Mars Ascent Vehicle (MAV) for the Ares IV mission was previously landed. In order to rendezvous with Hermes' fly-by, Watney must make drastic modifications to reduce its mass, removing non-essential equipment and even the vessel's windows and exterior panels. With Watney on board the gutted MAV, the Hermes crew launches it remotely; it escapes Mars successfully, but not at the planned speed and distance.To intercept, Hermes must use its maneuvering Thrusters to change course, and explosive decompression of its own internal atmosphere to adjust its speed. Lewis uses a MMU to approach Watney's vessel as close as her tether will allow but is unable to reach him. Watney pierces the glove of his pressure suit and leaves the capsule, using the escaping air as a miniature Thruster to reach Lewis. The crew is emotionally re-united, as crowds around the world cheer the news.After returning to Earth, Watney begins \"day 1\" of his new life, serving as a survival instructor for new candidates in the astronaut training program, emphasizing his own experiences in problem-solving and creative engineering. Years later on the occasion of the Ares V mission launch, those involved in Watney's rescue have returned to their lives or begun new lives."
}