{
	"title": "Cars 3",
	"release_year": "2017",
	"runtime": "102",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Owen Wilson",
		"Cristela Alonzo",
		"Chris Cooper",
		"Nathan Fillion",
		"Larry the Cable Guy",
		"Armie Hammer",
		"Ray Magliozzi",
		"Tony Shalhoub",
		"Bonnie Hunt",
		"Lea DeLaria"
	],
	"staff": [
		"Brian Fee",
		"Brian Fee",
		"Ben Queen",
		"Eyal Podell",
		"Jonathon E. Stewart",
		"Kevin Reher",
		"Randy Newman",
		"Jason Hudak",
		"Natalie Lyon",
		"Kevin Reher",
		"William Cone",
		"Jay Shuster"
	],
	"votes": 127151,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjE4MDU2MTEzMl5BMl5BanBnXkFtZTgwNTg1NTcyMjI@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Lightning McQueen, now a seven-time Piston Cup champion, is overshadowed five years after he competed in the World Grand Prix by rookie Jackson Storm, the first of a new generation of race cars with cutting-edge technology to boost speed and performance. The majority of racing veterans either retire or are fired by their sponsors in favor of younger, next-generation racers as Storm rides a winning streak throughout the season. After being passed by Storm and the other next-generation racers in the season's last race in Los Angeles, Lightning briefly takes the lead but soon finds themselves trailing. Despite his best efforts to stay ahead, he loses control and crashes into the outside wall, causing serious injuries and rendering him unable to continue racing.After four months, Lightning, who is now fully recovered from his accident, calls his sponsors, Dusty and Rusty, to inform them that they have sold Rust-Eve to a wealthy business car called Sterling. Lightning then decides to continue racing. Lightning is given the task of training at the Rust-Eve Racing Center by Sterling, where he finds it difficult to adjust to the contemporary training techniques. When Lightning inadvertently destroys a simulator, Sterling attempts to make him retire. Relentlessly asserting that he is still capable of racing, Lightning says that he will retire right away if he does not win the next Florida 500. The deal is reluctantly accepted by Sterling, but only if Cruz agrees to accompany him.Lightning is frustrated by Cruz's unusual training techniques and lack of practical racing experience as they try to set a record for his top speed at Fireball Beach. They discover that the Thunder Hollow Speedway is being used for a figure-8 demolition derby known as the \"Crazy Eights\" when Lightning chooses to train there. They are compelled to compete, and Cruz wins, unintentionally exposing him to the public. After the demolition derby, Lightning yells at Cruz in a furious manner and unintentionally breaks her trophy. Cruz leaves her position as Lightning's trainer and returns to the racing facility after disclosing that she had always aspired to be a racer but had never had the courage to compete. With no other choice and feeling ashamed, Lightning turns to his friend Mater for guidance. Mater advises Lightning to locate Smokey, the crew chief and mentor of Doc Hudson, in his hometown of Thomasville, Georgia. As a result, Lightning captures Cruz and persuades her to come back to him. They run into Smokey in Thomasville, who tells them that although Doc never raced again, he discovered new joy in training Lightning. Using Cruz as his sparring partner, Smokey and Doc's old friends Louise \"Barnstormer\" Nash, River Scott, and Junior \"Midnight\" Moon teach Lightning new skills to overcome his speed disadvantage after he acknowledges that he is an older car and will never be as fast as Storm. Lightning eventually passes Cruz in the last practice race at Thomasville Speedway after numerous tries. Cruz, however, unexpectedly passes Lightning, which makes him recall being passed by Storm prior to his accident, which undermines his self-confidence.At the Florida 500, Lightning starts at the back but gradually moves up the field with Smokey's help in the pits. Cruz wants to stay at the training center, but Sterling, who still thinks Lightning can not win, sends her back there to get a rookie ready for the next race. After listening to the conversation on his radio and recalling Cruz's desire to race, Lightning averts a huge car crash and has his crew prepare Cruz to compete in the race, giving her another opportunity to become a race car. Cruz, who is initially unsteady, begins passing cars one by one with Lightning's help from the pits. After a while, she finds herself directly behind Storm. Cruz is intimidated by Storm, who even pushes her against the wall during the last lap. Cruz wins the race by flipping Storm over and passing him with one of Doc Hudson's old tricks.Sterling offers Cruz a position on his team as she celebrates her win, but she declines and accepts a counteroffer from Tex Dinoco, the owner of Dinoco. Lightning effectively passes his contract with Sterling and becomes the race's joint winner because he and Cruz both wore #95. Lightning returns to Radiator Springs and announces that Tex has purchased Rust-Eve from Sterling. Dressed in Doc's vintage racing colors, Lightning makes the decision to keep racing but spends the remainder of the season training Cruz.",
	"links": [
		"https://www.amazon.com/Bonus-Content-Wilson-Lightning-McQueen/dp/B0BX9RXQZ5"
	]
}