{
	"title": "Allied",
	"release_year": "2016",
	"runtime": "124",
	"tags": [
		"Action",
		"Drama",
		"Romance",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Brad Pitt",
		"Marion Cotillard",
		"Jared Harris",
		"Vincent Ebrahim",
		"Xavier de Guillebon",
		"Camille Cottin",
		"Michael McKell",
		"Vincent Latorre",
		"Fleur Poad",
		"August Diehl"
	],
	"staff": [
		"Robert Zemeckis",
		"Steven Knight",
		"Graham King",
		"Steve Starkey",
		"Robert Zemeckis",
		"Alan Silvestri",
		"Don Burgess",
		"Mick Audsley",
		"Jeremiah O'Driscoll",
		"Nina Gold",
		"Robert Sterne",
		"Gary Freeman"
	],
	"votes": 172302,
	"cover": "https://m.media-amazon.com/images/M/MV5BNWJiOTUzODItNTYzYS00NGY0LWIzZmEtZDA4MGI5ZWMxMjM2XkEyXkFqcGc@._V1_QL75_UX190_CR0,7,190,281_.jpg",
	"description": "In 1942 during World War II, Royal Canadian Air Force intelligence officer Max Vatan (Brad Pitt) travels to Casablanca in French Morocco to assassinate the German ambassador. He is partnered with a French Resistance fighter named Marianne Beausejour (Marion Cotillard), who had escaped from France after her resistance group was compromised and killed. Marianne has been in Morocco for 2 years and has cultivated a strong network among the German military officials and the local French elite.\nMarianne's role is to get Max into a party in 10 days' time that the German Ambassador is attending.The two poses as a married couple and grow close, despite agreeing that in their line of work feelings can get people killed. Marianne teaches Max the local customs such as husbands sleeping on the roof after they have made love to their wives. Marianne is very thorough about the details and says that this is her key to survival. She knows that even her neighbors are watching them and are spies for the Germans. Marianne also teaches proper French pronunciation to Max as Max is supposed to be from France.As Max and Marianne keep up social appearances, Max is made by a German officer. Max follows him and kills him before Max's identity is reported.\nMax loves Marriane's zest for life, which is very different to his own subdued personality. Max falls in love with Marianne.\nMarianne, who is trusted by the Germans, secures Max an invitation to the party (vis Hobar (August Diehl) who is a liaison to the ambassador) where they plan to conduct the assassination. The ambassador will arrive at 8 30 PM. The guns will be hidden under the champagne table and a diversionary attack will take place at 8 35 PM to allow Max and Marriane to escape.On the day itself, they make love inside a car in the middle of a desert sandstorm, knowing that they might not survive.\nHowever, the mission goes well and they both escape. Max saves Marianne when Hobar tries to shoot her down.\nMax asks Marianne to come with him to London and be his wife. Marianne is vetted by the Special Operations Executive (SOE) and approved by Max's boss Frank. Frank warns Max that marriages made in the field never work. Max has a sister named Bridget (Lizzy Caplan).\nThe two get married, settle down in Hampstead, and have a baby girl named Anna, born during a German air raid while Marianne was in labor.A year later in 1994, Max is living a peaceful life with his wife and daughter. Max and Marianne are deeply in love and Max cannot believe his luck.\nMax learns from the SOE that Marianne is suspected of being a German spy, having adopted her identity after the real Marianne was killed in France. And the German ambassador that Marianne helped Max kill, was in fact a dissenter, who Hitler wanted dead. Max is told that several wireless transmissions to Germany have been intercepted regarding SOE activities in France. The transmissions are originating from the area that Max lives in, and the transmissions seem to have been made by a woman.\nIn order to test their suspicions, SOE run a 'blue dye' operation: Max is ordered to write down a piece of false intelligence at home, where Marianne can find it. If the information is picked up from intercepted German transmissions, Max must personally execute her, and if he is found to be an accomplice he will be hanged for high treason. Max is told otherwise to act normally.Defying orders, Max visits a former colleague named Guy Sangster (Matthew Goode) who knew Marianne but, blind from a wartime injury, cannot confirm her identity. He reveals that the resistance fighter Paul Delamare (Thierry Frémont) worked with Marianne in France and would be able to identify her. Max seeks out a young pilot named Adam Hunter (who is flying to France on a mission), gives him a picture of his wife, and instructs him to ask Delamare whether she really is Marianne. However, the following night, Max's commanding officer Frank Heslop (Jared Harris) informs him that Hunter was killed while waiting on the ground for the answer. He also hears that the whole operation might be a test, before he is given a big job in the run up to D-Day.The following night Max takes the place of a Lysander pilot and flies to France to meet with Delamare, who, it transpires, is being held at the local police station. Max and the resistance break into the jail to confront Delamare. Delamare unconvincingly verifies the picture. The delay gives the French police officer room to alert the Germans, whom Max and the resistance manage to defeat. Prior to leaving, Delamare tells Max that Marianne was a talented pianist who had once played La Marseillaise in a cafe in defiance of the occupying Germans in the early stages of the war.Back in England, Max takes Marianne to a local pub and demands she play the piano. Marianne cannot play, and admits she is a spy. She claims her feelings for Max are genuine and that she and her child were being threatened by German spies in London, including the woman who lives around the corner and often looks after Anna.Max, unwilling to kill his wife, tells her they need to leave before the SOE catches them. He kills Marianne's handlers and tries to flee the country via airplane, but Heslop intercepts them before they can escape. Marianne tells Max that she loves him, asks him to take care of Anna, then shoots herself. Heslop orders the soldiers present to report that Max executed Marianne as per his orders, so that Max himself will not be punished.After the war, Max moves to the ranch in Medicine Hat, Alberta, Canada, that was always his ambition, and raises Anna. The film ends with Marianne reading the letter that she had earlier written to her daughter, anticipating that one day her real identity would be uncovered.",
	"links": [
		"https://www.amazon.com/Allied-UHD-Digital-Combo-Blu-ray/dp/B01LTHZ5JI"
	]
}