{
	"title": "Incredibles 2",
	"release_year": "2018",
	"runtime": "118",
	"tags": [
		"Action",
		"Adventure",
		"Animation",
		"amazon"
	],
	"rating": 7.5,
	"actors": [
		"Craig T. Nelson",
		"Craig T. Nelson",
		"Holly Hunter",
		"Holly Hunter",
		"Sarah Vowell",
		"Huck Milner",
		"Catherine Keener",
		"Eli Fucile",
		"Bob Odenkirk",
		"Samuel L. Jackson",
		"Samuel L. Jackson",
		"Michael Bird",
		"Sophia Bush"
	],
	"staff": [
		"Brad Bird",
		"Brad Bird",
		"Nicole Paradis Grindle",
		"John Walker",
		"Michael Giacchino",
		"Stephen Schaffer",
		"Natalie Lyon",
		"Kevin Reher",
		"Ralph Eggleston"
	],
	"votes": 338721,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTEzNzY0OTg0NTdeQTJeQWpwZ15BbWU4MDU3OTg3MjUz._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Three months after defeating Syndrome, the Parr family ( better known as the \"Incredibles\") - Robert \"Bob\" Parr (Mr. Incredible), Helena Truax-Parr (Elastagirl/Mrs. Incredible), Violet Parr (Violet Incredible), Dashiell Robert \"Dash\" Parr (The Dash) and Jacob \"Jack-Jack\" Parr (Jack-Jack Incredible) - have moved to a motel in a different part of Metroville after Violet saved them from their previous house's destruction. After they attend their elementary school's athletics carnival, they pursue the Underminer (John Ratzenberger) (a mole-like super-villain who seeks to bring war and destruction to the world), though they unsuccessfully stop him from robbing the Metroville Bank and escaping. The Incredibles barely stop the Underminer's out of control drill with help from Frozone (Samuel L. Jackson), but due to the collateral damage caused by the incident, Agent Richard \"Rick\" Dicker (Jonathan Banks) (a government agent responsible for helping the Parrs stay undercover and unremarkable) informs the Parrs that his department's \"Super Relocation\" program is being shut down, forcing Supers across the world to permanently adhere to their secret identities. Soon thereafter, Mr. Incredible (Craig T. Nelson) and Elastigirl (Holly Hunter), along with Lucius Best (Frozone), are contacted by Winston Deavor (Bob Odenkirk) (a superhero fan who leads a telecommunications company with his sister Evelyn and wants to bring back the \"supers\" by revamping the public's perception of them), a superhero fan and the owner of DEVTECH, a telecommunications corporation. Winston and his sister Evelyn Deavor (Catherine Keener) (the mastermind behind Screenslaver, and a technological genius who has never encountered a problem she could not solve), the genius inventor behind DEVTECH technology, propose a publicity stunt to regain the public's support and trust in Supers.Helen is chosen to spearhead the stunt under her superhero identity. Winston provides the Incredibles with a new home and Bob offers to look after the kids while Helen is away on her mission. Bob struggles at first but gradually settles into the role of a stay-at-home parent. He also discovers that Jack-Jack (Eli Fucile) has various superpowers but has a hard time managing the baby's abilities. Meanwhile, on her mission, Helen confronts the Screenslaver, a mysterious super-villain who hijacks screens in order to project hypnotic images that can temporarily brainwash people.After foiling attacks by the Screenslaver on a high-speed train and an ambassador, Elastigirl tracks down and captures the villain, who turns out to be a pizza delivery man (Bill Wise) who has no recollection of what he did. At a DEVTECH party celebrating the Screenslaver's defeat, Winston announces an at-sea summit with leaders of various countries to legalise Supers, but feeling that something is wrong, Elastigirl investigates further and realises that the pizza delivery man was actually being controlled by Hypno-screens within his goggles. Before Elastigirl can alert anyone, Evelyn forces the goggles onto her, revealing herself as the mastermind behind the Screenslaver. Her hatred for Supers stems from her parents' murder several years ago, where instead of hiding from intruders and calling the police, her father attempted to call the Supers, but was unable to reach them and was subsequently discovered and fatally shot by the intruders. Evelyn plans to use the Supers to sabotage her brother's summit and cause a catastrophe that will tarnish their reputation forever. She uses Elastigirl to lure Mr. Incredible into a trap and force a pair of goggles on him, then sends other mind-controlled Supers to subdue the Parr children (Violet Parr (Sarah Vowell) & Dashiell \"Dash\" Parr (Huck Milner)) in their home. Frozone arrives and tries to protect the children but is eventually placed under Evelyn's hypnotizing goggles as well.Violet, Dash, and Jack-Jack escape with the help of the Incredibile, a high-tech car once owned by Bob during his time as Mr. Incredible and set for the Deavors' ship. On board, the mind-controlled Mr. Incredible, Elastigirl, and Frozone recite a vindictive manifesto on air to paint themselves-and Supers in general-as a public threat. They subdue the ship's crew members and turn the high-speed ship to aim at Municiberg, then crush the controls. When the Parr children find them, Jack-Jack inadvertently frees Elastigirl, who helps to free Mr. Incredible and Frozone. After Evelyn tries to leave with Winston and he discovers her plan, Winston frees the other guests on the ship from Evelyn's hypnosis. The Incredibles and Frozone release all the other mind-controlled Supers by destroying their goggles. Mr. Incredible swims underwater to turn the rudder while Frozone sends out layers of ice, and they manage to slow the ship down before it can crash into the city. Evelyn tries to escape in a getaway jet but is captured by Elastigirl. Following the incident, Evelyn is arrested, and Supers around the world regain full legal status.Sometime later, Anthony \"Tony\" Rydinger (Michael Bird), who had his memory erased by Dicker after encountering Violet in her super suit during the Underminer's attack, accompanies her and her family to see a movie at the cinemas for a date. Outside the theatre, the Parrs spot a deadly high-speed pursuit between police and bank robbers and don their masks, ready to give chase. Violet leaves Tony at the theater but promises to be back in time for the movie.",
	"links": [
		"https://www.amazon.com/Incredibles-2-Craig-T-Nelson/dp/B07DPFG888"
	]
}