{
	"title": "La La Land",
	"release_year": "2016",
	"runtime": "128",
	"tags": [
		"Comedy",
		"Drama",
		"Music",
		"amazon"
	],
	"rating": 8.0,
	"actors": [
		"Ryan Gosling",
		"Emma Stone",
		"Rosemarie DeWitt",
		"J.K. Simmons",
		"Amiee Conn",
		"Terry Walters",
		"Thom Shelton",
		"Cinda Adams",
		"Callie Hernandez",
		"Jessica Rothe"
	],
	"staff": [
		"Damien Chazelle",
		"Damien Chazelle",
		"Fred Berger",
		"Gary Gilbert",
		"Jordan Horowitz",
		"Marc Platt",
		"Justin Hurwitz",
		"Linus Sandgren",
		"Tom Cross",
		"Deborah Aquila",
		"Tricia Wood",
		"David Wasco"
	],
	"votes": 688628,
	"cover": "https://m.media-amazon.com/images/M/MV5BMzUzNDM2NzM2MV5BMl5BanBnXkFtZTgwNTM3NTg4OTE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "On a crowded Los Angeles highway (\"Another Day of Sun\"), Mia (Emma Stone), an on-studio barista and aspiring actress, has a moment of road rage with Sebastian (Ryan Gosling), a struggling jazz pianist. Her subsequent audition goes poorly despite her efforts. That night, Mia's roommates take her to a lavish party in the Hollywood Hills to cheer her up (\"Someone in the Crowd\"). She has to take a long walk back after finding that her car has been towed.During a gig at a restaurant, Sebastian slips into a passionate jazz improvisation despite warnings from the owner (J. K. Simmons) to only play songs on the set-list. Mia overhears the music as she passes by (\"Mia and Sebastian's Theme\"). Moved, she enters, but Sebastian is promptly fired for his disobedience. As he storms out, Mia attempts to compliment him, but he coldly brushes her off.Months later, Mia runs into Sebastian at a party where he plays in a 1980s pop cover band; she teases him. After the gig, the two walk together to find their cars, lamenting being in each other's company despite the chemistry between them (\"A Lovely Night\").Mia takes Sebastian on a walk around the movie lot, explaining her passion for acting; Sebastian takes Mia to a jazz club, describing his passion for jazz and desire to open his own club. They warm to each other (\"City of Stars\"). Sebastian invites Mia to a screening of Rebel Without a Cause, which Mia accepts, forgetting an earlier commitment with her current boyfriend. Discontented with that date, she leaves and rushes to the theater, finding Sebastian as the film begins. The two conclude their evening with a romantic dance at the Griffith Observatory (\"Planetarium\").After more failed auditions, Mia decides, at Sebastian's suggestion, to write a personal single-actress play. Sebastian begins to perform regularly at the jazz club (\"Summer Montage\") and the two move in together. A high school classmate, Keith (John Legend), invites Sebastian to be the keyboardist in his jazz band, which offers a steady source of income. Sebastian is dismayed over the band's pop-oriented style but decides to sign with them after overhearing Mia trying to convince her mother that Sebastian is working on his career. Mia attends one of their concerts (\"Start a Fire\") but is disturbed, knowing Sebastian could not possibly enjoy his band's music.During the band's first tour, Mia confronts Sebastian over his future and goals. Sebastian responds by claiming a steady career is what she wanted for him before accusing her of liking him more when he was unsuccessful. Insulted, Mia leaves. On the night of Mia's play, Sebastian fails to show up due to a photo shoot he had forgotten about. Only a few people attend, and Mia overhears dismissive comments. Despondent, she decides to move back home to Boulder City, Nevada.One day, Sebastian receives a call from a casting director who had attended Mia's play, inviting Mia to a film audition the following evening. Sebastian drives to Boulder City and persuades Mia to attend. For the audition Mia is simply asked to tell a story; she begins to sing about her aunt who inspired her to pursue acting (\"Audition/The Fools Who Dream\"). Sebastian, confident that the audition was a success, asserts that Mia must devote herself wholeheartedly to the opportunity. They profess they will always love each other but are uncertain of their future.Five years later, Mia is a famous actress and happily married to another man (Tom Everett Scott), with whom she has a daughter. One night, the couple stumble upon a jazz bar. Noticing the Seb's logo, she had once designed, Mia realizes Sebastian has finally opened his club. Sebastian spots Mia in the crowd. He begins to play their love theme (\"Epilogue\"), prompting an extended dream sequence in which the two imagine what might have been had their relationship worked perfectly. The song ends and Mia leaves with her husband. Before exiting, she shares one last look with Sebastian and smiles.",
	"links": [
		"https://www.amazon.com/Land-Ryan-Gosling/dp/B01MRR7AUU"
	]
}