{
	"title": "The Nice Guys",
	"release_year": "2016",
	"runtime": "116",
	"tags": [
		"Action",
		"Comedy",
		"Crime",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Russell Crowe",
		"Ryan Gosling",
		"Angourie Rice",
		"Matt Bomer",
		"Margaret Qualley",
		"Yaya DaCosta",
		"Keith David",
		"Beau Knapp",
		"Lois Smith",
		"Murielle Telio"
	],
	"staff": [
		"Shane Black",
		"Shane Black",
		"Anthony Bagarozzi",
		"Joel Silver",
		"David Buckley",
		"John Ottman",
		"Philippe Rousselot",
		"Joel Negron",
		"Sarah Finn",
		"Richard Bridgland"
	],
	"votes": 381025,
	"cover": "https://m.media-amazon.com/images/M/MV5BM2YwNWZlZGEtYTEyZi00NjdjLWEwM2ItM2Q2MDMwZjkzMjk0XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1977 Los Angeles, a boy named Bobby witnesses fading porn star Misty Mountains (Murielle Telio) die in a car crash. Later that week, down-on-his-luck private eye Holland March (Ryan Gosling) is approached by Mrs. Glenn (Lois Smith), the aunt of Misty Mountains who is obsessively claiming to have seen her niece alive. March is skeptical of her claim but realizes that a missing girl named Amelia Kutner (Margaret Qualley) is somehow involved and accepts the job. However, Amelia does not wish to be found and hires enforcer Jackson Healy (Russell Crowe) to intimidate March into staying away from her.Later that night, Healy is attacked at his home by two unnamed thugs credited as Blue Face (Beau Knapp) and Older Guy (Keith David), who attempt to interrogate him about Amelia's whereabouts. After stunning the duo, Healy manages to ward them off with a hidden shotgun. He then teams up with a reluctant March to find Amelia before the thugs do. The two are assisted by Holly (Angourie Rice), March's young daughter, who does not see eye to eye in regard to March's method of investigating and is disapproving of her father's method of swindling extra payments out of his clients and feigning good results to cover his failures.The two then find out that Amelia was working with Misty Mountains and an amateur filmmaker named Dean on an \"experimental film\"-equal parts pornography and investigative journalism-called How Do You Like My Car, Big Boy? about the smog in Los Angeles, as they were both protesters against the growing air pollution. Dean, however, mysteriously died in a fire that burned the film. The two end up at a party to search for the film's financier, Sid Shattack, a notorious pornography producer. After fumbling through the party, a drunken March ends up finding Shattack dead, while unknowingly coming across Amelia.Holly, after attempting to investigate on her own, is tricked into a car by Blue Face and Older Guy. Healy fights with Older Guy, while Blue Face tries to kill Amelia from inside his car, only to be stopped by Holly, who warns Amelia and then escapes with her. While chasing them down, Blue Face is seriously injured in a hit-and-run. As he lies half-dead in the middle of the road, he reveals to Healy that their boss has dispatched a hit man named John Boy to kill Amelia, March and his family to prevent further witnesses. Healy discreetly strangles Blue Face to death in order to protect March and Holly, later claiming to Holly that he died of his injuries.After a brief investigation, the two are greeted by Amelia's mother, Judith Kutner (Kim Basinger), a high-ranking official in the United States Department of Justice, who claims her daughter is delusional and paranoid and points them towards the Las Vegas mob trying to expand into the Los Angeles pornography scene.Healy reveals the note paper with March's address given to him by Amelia is identical to a paper he found at the party, which gives leads to an airport hotel where Amelia was going to distribute the film. However, they witness the men there being slaughtered by John Boy (Matt Bomer) and hastily retreat, only to have Amelia land on their car from the building where she is accidentally knocked out. They take her back to March's house, where she reveals that the people after her are working for a cabal of Detroit automakers.After uncovering evidence that they colluded to suppress the catalytic converter (which regulates exhaust emissions), Amelia created How Do You Like My Car, Big Boy? to expose their collusion rather than going to the media as she believed that they and the government were a part of the conspiracy. Judith has her assistant, Tally, arrange for March and Healy to deliver a case that supposedly contains one hundred thousand dollars.However, a half-asleep March accidentally crashes their car and the case is opened to reveal shredded magazines, causing them to realize that they have been double-crossed. At home, Holly is confronted and attacked by John Boy, who had been sent by Tally under the guise of being a family doctor. March and Healy arrive back at the house and engage in a shootout with John Boy. John Boy escapes, while an impatient Amelia leaves, only to run into and be killed by John Boy.March and Healy try to bring the matter to court, but are rejected, as they have no evidence, leading them again to search for the film. The two have Mrs. Glenn show them where she saw Misty Mountains alive. Inside they find a hidden projector-the poorly-sighted Mrs. Glenn having mistaken footage of Misty for her niece-and deduce that there was a reprint of the film. They realize that the projectionist, Chet (Jack Kilmer), another protester they had questioned about Dean, is the projectionist for the film and had worked with Amelia to make How Do You Like My Car, Big Boy? public by splicing it into the presentation film for the Los Angeles Auto Show, which is being held at a hotel.At the auto show, the two find that John Boy and Older Guy, along with a few other thugs are already there and have interrogated a drunken Chet, learning that the film will be projected automatically from a window of the building. Healy and March attempt to reach it first, only to be intercepted at gunpoint by Tally (Yaya DaCosta).Before she can kill them, Holly arrives while pretending to be room service and throws coffee at Tally. Holly's plan is initially unsuccessful as the coffee is cold, but Tally soon slips on the spill and knocks herself unconscious. In the subsequent fight, Older Guy falls to his death, while Healy subdues John Boy by knocking him out cold. He spares his life for Holly's sake.The detectives take How Do You Like My Car, Big Boy? to the police and though Judith is arrested, the Detroit car companies are immune to any charges, due to insufficient evidence. When she talks with March and Healy before her trial, Judith claims she did not want her daughter killed and justifies her involvement by insisting that \"what is good for Detroit is good for America.\" Afterward Healy and March decide to continue working together as private eyes, naming their agency \"The Nice Guys\".",
	"netflix": [
		"germany",
		"hong-kong",
		"japan",
		"malaysia",
		"saudi-arabia",
		"turkey",
		"uae"
	],
	"links": [
		"https://www.amazon.com/Nice-Guys-Russell-Crowe/dp/B01FV2BBF4"
	]
}