{
	"title": "Snowden",
	"release_year": "2016",
	"runtime": "134",
	"tags": [
		"Biography",
		"Crime",
		"Drama",
		"max",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"Joseph Gordon-Levitt",
		"Shailene Woodley",
		"Melissa Leo",
		"Zachary Quinto",
		"Jaymes Butler",
		"Robert Firth",
		"Rachel Handshaw",
		"Christian Contreras",
		"Parker Sawyers",
		"Rhys Ifans"
	],
	"staff": [
		"Oliver Stone",
		"Kieran Fitzgerald",
		"Oliver Stone",
		"Luke Harding",
		"Anatoly Kucherena",
		"Moritz Borman",
		"Eric Kopeloff",
		"Philip Schulz-Deyle",
		"Fernando Sulichin",
		"Craig Armstrong",
		"Anthony Dod Mantle",
		"Alex Márquez",
		"Lee Percy",
		"Lucy Bevan",
		"Mary Vernieu",
		"Mark Tildesley"
	],
	"links": [
		"https://www.max.com/movies/snowden/eaf88a81-92af-4a9c-a822-87c9a5c27b28",
		"https://www.amazon.com/Snowden-Joseph-Gordon-Levitt/dp/B01LWYVHKV"
	],
	"votes": 164876,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTg2MzYzNzgzOF5BMl5BanBnXkFtZTgwOTg4NzQ4OTE@._V1_QL75_UX190_CR0,7,190,281_.jpg",
	"description": "In 2013, Edward Snowden (Joseph Gordon-Levitt) arranges a clandestine meet in Hong Kong with Documentarian Laura Poitras (Melissa Leo) and journalist Glenn Greenwald (Zachary Quinto). They discuss releasing the classified information in the former's possession regarding illegal mass spying conducted by the National Security Agency (NSA).In 2004, Snowden is undergoing basic training, having enlisted in the U.S. Army with intentions of matriculating to the Special Forces. He eventually fractures his tibia and is informed that he will be receiving an administrative discharge and that he may serve his country in other ways.Snowden applies for a position at the Central Intelligence Agency (CIA) and subsequently undergoes the screening process. Initially his answers to the screening questions are insufficient, but Deputy Director Corbin O'Brian (Rhys Ifans) decides to take a chance on him, given the demands of such extraordinary times. Snowden is then brought to \"The Hill\" where he is educated and tested on Cyber-warfare. He learns about the Foreign Intelligence Surveillance Act, which circumvents the Fourth Amendment rights of U.S. citizens by allowing warrant requests to be approved by a panel of judges that were appointed by the chief justice. Snowden and his peers are each tasked with building a covert communications network in their hometown, deleting it, and then rebuilding it in eight hours or less, with five being the average time taken. Snowden impresses O'Brian when he completes the exercise in 38 minutes.Hank Forrester (Nicolas Cage) is the cryptography teacher at the CIA and someone that Snowden looks up to as an idol. Hank educates Snowden on how the military industrial complex drives US policy decision making.Meanwhile, Snowden meets Lindsay Mills (Shailene Woodley) via a dating website. The two bonds, despite sharply contrasting political ideologies. Snowden acquires his first post abroad working with diplomatic cover in Geneva in 2007, taking Mills with him. He meets Gabriel Sol (Ben Schnetzer), who has ample experience in electronic spying. Snowden begins questioning the ethical implications of their assignment (Gabriel has told and showed Snowden that the US govt can access not just public information on the internet but can access any private information and can activate any private device to collect live information). After his superior decides to set up their target on a DUI charge in order to leverage information from him, Snowden resigns from the CIA. Snowden sees this as a blatant misuse of Govt power to coerce information from innocent individuals by prying into their private lives.Snowden later takes a position with the NSA in Japan, initially under the pretense of building a program that would allow the government to back up all critical data from the Middle East in an emergency, a program which he names \"Epic Shelter\". Snowden learns of the practices the NSA and other U.S. Government agencies are using not just in Japan, but in most countries the U.S. is currently allied with, which include planting malware in different computers that manage government, infrastructure and financial sectors so that, in the event that any allies turn against the US, that country can effectively be shut down in retaliation. The stress associated with the job results in the end of his relationship with Mills, who moves back with her family in Maryland.Snowden learns that even the NSA has the ability to track the digital footprint of every individual on the planet. When a spying was ordered, the NSA would track not just the individual, but all their contacts up to the third level. For a person with 40 contacts each, that grows to 2.8 MM private individuals being tracked under 1 investigation. And these are not terrorists. Its everyone.Three months later, Snowden has left his post with the NSA and returned to Maryland where he and Mills resume their relationship, and he takes a position consulting for the CIA. During a hunting trip, O'Brian reveals an operation in Oahu that revolves around counterattacking Chinese hackers. After Snowden is diagnosed with epilepsy, Mills agrees that he should join the operation for she believes the environment in Hawaii may be beneficial for him. Upon beginning his new job in \"The Tunnel\", an underground World War II bunker that has been re-purposed for massive electronic spying and SIGINT operations, Snowden learns that Epic Shelter is actually providing real-time data that assists U.S. drone pilots in launching lethal strikes against terror suspects in Afghanistan. The pressure of the job of stopping Chinese hackers makes Snowden stop taking his epilepsy medication (which makes him groggy). This angers Mills.Snowden ultimately becomes disillusioned with what he is a part of. It culminates in Snowden smuggling a micro-SD card into his office by way of a Rubik's Cube and loading all relevant data. He then tells his colleagues he is feeling ill and departs. He advises Mills to fly home to Maryland, after which he contacts Poitras and Greenwald to schedule the meeting.With the help of journalist Ewen MacAskill (Tom Wilkinson), the information is disseminated to the press on June 5, 2013, with additional leaks published in the following days. In the aftermath, with the help of MacAskill, Greenwald and Poitras, Snowden is smuggled out of Hong Kong on a flight bound for Latin America by way of Russia. However, the U.S. Government revokes his passport, forcing him to remain in Moscow indefinitely. He is eventually granted asylum for three years, with Mills joining him at a later date. Snowden continues his activism."
}