{
	"title": "Elvis",
	"release_year": "2022",
	"runtime": "159",
	"tags": [
		"Biography",
		"Drama",
		"Music",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"Tom Hanks",
		"Austin Butler",
		"Olivia DeJonge",
		"Helen Thomson",
		"Richard Roxburgh",
		"Kelvin Harrison Jr.",
		"David Wenham",
		"Kodi Smit-McPhee",
		"Luke Bracey",
		"Dacre Montgomery"
	],
	"staff": [
		"Baz Luhrmann",
		"Baz Luhrmann",
		"Sam Bromell",
		"Craig Pearce",
		"Jeremy Doner",
		"Gail Berman",
		"Baz Luhrmann",
		"Catherine Martin",
		"Patrick McCormick",
		"Elliott Wheeler",
		"Mandy Walker",
		"Jonathan Redmond",
		"Matt Villa",
		"Nikki Barrett",
		"Denise Chamian",
		"Catherine Martin",
		"Karen Murphy"
	],
	"links": [
		"https://www.amazon.com/Elvis-Austin-Butler/dp/B0B12HXM8W"
	],
	"votes": 241481,
	"cover": "https://m.media-amazon.com/images/M/MV5BNTVhZmUyMDQtY2I5Ny00OWNiLTgzNjUtMTg4YTQwMTc0OTQxXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "On January 20, 1997, Elvis Presley's (Austin Butler) former manager, Colonel Tom Parker (Tom Hanks), is on his deathbed, having suffered a stroke. Nursing a gambling addiction that has left him destitute, he recounts how he first met the future King of Rock and Roll.\nIn 1973 Parker was exposed as a fraud, who took 50% of Elvis's income, worked him like a mule to support his own gambling addiction. He was thought to be responsible for Elvis's death.Raised mostly by his doting mother Gladys (Helen Thomson), Presley spends his childhood in the poorest parts of Mississippi (after his father was jailed for check fraud, he and his mother had to take up accommodation in the black part of town), finding an escape in the comic book adventures of Captain Marvel Jr. and especially in song. However, upon moving with his parents to Memphis, he is ridiculed by his peers due to his fascination with the African American music of Memphis's Beale Street. At this time, Parker is a carnival \"huckster\" who fancies himself a modern-day P. T. Barnum. Although partnered with country singer Hank Snow (David Wenham), Parker immediately realizes Presley's crossover potential when he hears the white artist \"sounding black\" on the groundbreaking single, \"That's All Right.\" Presley uses African American rhythms in his songs. That night, he sees Presley at a \"Louisiana Hayride\" performance, discovering a talented musician with strong sex appeal among the females (with the way he moves & shakes his legs). Even now Presley hung around the African American parts of town and adapted their clothing and music styles in his performances.\nPresley was contracted with Sam Phillips of Sun Records, who wanted to record black music, only it wasn't selling like it should. Parker takes Presley on tour with Hank Snow and soon Presley is the major attraction. Women start throwing themselves at Presley and he starts having sex with them at his hotel room. He starts doing drugs as well to keep up with the schedule.At a Ferris Wheel, Parker meets with Presley and persuades him to let him take exclusive control of his career. He says that Parker would have to give up Hank and represent Presley exclusively and thus argues for a higher share of earnings. he says they need a record company of national distribution and tells Presley to convince Sun Records to sell their contract to RCA. Rock stars need to have an \"available\" status and hence Presley has to give up his girlfriend. Presley is made into a family business, with dad Vernon (Richard Roxburgh) as its business manager. The entire family enters into a legally binding contract with Parker.This is the beginning a meteoric ascent that sees the Presley family lifted out of poverty. Parker lands him a 7-movie deal and merchandise deals. The regional public is divided in their view of the singer. Feeling that Presley's music will corrupt white children of and stoke racial hostility, segregationist Southern Democrat Mississippi Senator James Eastland (Nicholas Bell) calls Parker to an informal hearing, during which he questions Parker about his mysterious past.\nPresley agrees to do one family show without his trademark moves, but it is a disaster. Presley gets a lot of flak for it and is furious at Parker for making him change. Gladys blames Parker for their woes. B.B. King (Kelvin Harrison Jr.) is Presley's mentor and runs a African American club downtown. He advises Presley to start his own label. He also says that there is no way Presley, a famous white boy, will ever go to jail for dancing like an African American. He says there must be another reason why Parker guided him the way he did.After Presley's charged dance moves at a concert, the singer faces potential legal trouble. Parker persuades the government to draft Presley into the US Army instead to avoid legal entanglements. During his military service in West Germany (In 1958 for 2 years), Presley is devastated by his mother's alcoholism-induced death. Parker replaces Gladys and handholds Presley out of depression.\nPresley finds some solace when he meets Priscilla Beaulieu (Olivia DeJonge), the adopted teenage daughter of an United States Air Force pilot. After his discharge, he resumes his movie career, and years later, he marries Priscilla in 1966 (honeymoon on Frank Sinatra's jet). Presley gets movie work for Priscilla and his entire Memphis mafia. Lisa Marie was born shortly thereafter.As the popular culture of the 1960s passes Presley by (The Beatles were on the ascendancy), the assassinations of Martin Luther King Jr. and Robert F. Kennedy devastate him. Although he wants to become more politically outspoken in his music, Parker only allows him to release frivolous feel-good songs for a Christmas special television. However, this does not dissuade him. He meets Steve Binder (Dacre Montgomery), who put Steve and the Rolling Stones together. Presley's performance choices in the special, including the closing number, \"If I Can Dream\", are presented and perceived as acts of not only his past songs, but also political commentary. Infuriated corporate sponsors threaten litigation, while a disgusted Parker believes Presley has been \"brainwashed by hippies.\" Nevertheless, the show is massively successful.Parker is infuriated that Binder is guiding Presley that he no longer needs Parker. Binder gets more involved with Presley and books him on overseas tours paying $ 1 MM per night. He says that Parker refused 2 such offers in the previous year, although he can't figure out why.\nIt is revealed that Parker is under gambling debts. Plus, there was no colonel Parker to begin with and Parker is actually Andreas Van Kuijk, an illegal immigrant from Netherlands.After the special, Presley headlines at the largest showroom in Las Vegas, the International Hotel, and then resumes concert tours. Parker's control of Presley's life tightens further as he refuses Presley's request for a world tour despite initially promising him and manipulates him (by making it look like there are death threats against Presley and by staging attacks on stage on him at the International Hotel, to make the threats looks real and credible) into signing a contract for a lengthy Las Vegas casino residency at the International Hotel ($1 MM per year for 5 years in exchange for Parker's debt being canceled).Parker goads Presley into doing US tours instead. 15 cities in 15 days, which they do in 1969, 70, 71 and 72. Presley's behavioral issues and prescription drug addiction overtake him, and a despondent Priscilla divorces him on January 8, 1973, taking their daughter Lisa Marie with her. Presley discovers that Parker cannot leave the country, because he is a stateless illegal immigrant named Andreas (Dries) van Kuijk and fires him on September 3, 1973.Parker and Presley argue over Presley's $8 million debt to Parker and the record label for his numerous lavish expenses, straining Presley's relationship with his father. Parker is able to convince Presley of their symbiotic relationship and, while they rarely see each other afterward, Parker continues as his manager.Presley continues a rigorous schedule of shows that leaves him increasingly exhausted. In 1974, before his death on August 16, 1977, Presley expresses his greatest fear to Priscilla of being forgotten after he dies. At one of his final shows on June 21, 1977, in Rapid City, South Dakota, Presley, now bloated and pale, sings \"Unchained Melody\" and ends the performance to thunderous applause. As he finishes his recollection, Parker dies on January 21, 1997, impoverished and alone, while Presley is beloved worldwide and is the best-selling solo artist in history, with his influence and legacy on music continuing to this day.\nParker's financial abuse of Elvis was exposed after Elvis's death in a series of lawsuits. He settled out of court."
}