{
	"title": "Kong: Skull Island",
	"release_year": "2017",
	"runtime": "118",
	"tags": [
		"Action",
		"Adventure",
		"Fantasy",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Tom Hiddleston",
		"Samuel L. Jackson",
		"Brie Larson",
		"John C. Reilly",
		"John Goodman",
		"Corey Hawkins",
		"John Ortiz",
		"Tian Jing",
		"Toby Kebbell",
		"Toby Kebbell",
		"Jason Mitchell"
	],
	"staff": [
		"Jordan Vogt-Roberts",
		"Dan Gilroy",
		"Max Borenstein",
		"Derek Connolly",
		"John Gatins",
		"Alex Garcia",
		"Jon Jashni",
		"Mary Parent",
		"Thomas Tull",
		"Henry Jackman",
		"Larry Fong",
		"Richard Pearson",
		"Sarah Finn",
		"Stefan Dechant"
	],
	"votes": 355096,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTcwMjcxYTQtYjJlOS00YTE1LWIyZGYtOGRlOTBlMWZmYTliXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1944, in the midst of World War II, two fighter pilots - an American soldier named Hank Marlow (John C. Reilly) and a Japanese soldier named Gunpei Ikari (Miyavi) - parachute onto an island in the South Pacific after a dogfight. They both engage in close combat, with Ikari gaining the upper hand, but the fight is interrupted by a behemoth ape known as Kong.In 1973, U.S. government agent Bill Randa (John Goodman) hires former British Special Air Service Captain James Conrad (Tom Hiddleston), a skilled tracker (a broken but noble former British Special Air Service Captain who served in the Vietnam War with the Australian Special Air Service Regiment), to guide an expedition to map out an island known as \"Skull Island\". Their military escort is the Sky Devils, a Vietnam War helicopter squadron led by Lieutenant Colonel Preston Packard (Samuel L. Jackson) and his subordinates, Major Jack Chapman (Toby Kebbell) and Captain Earl Cole (Shea Whigham).The group is joined by pacifist and photojournalist Mason Weaver (Brie Larson), who believes the expedition is a secret military operation. Upon arrival at Skull Island, Packard's men begin dropping explosives developed by seismologist Houston Brooks (Corey Hawkins) to map out the island. However, the air unit is attacked by Kong, who kills a number of military personnel and scatters the others across the island.Packard regroups with some of the scattered survivors, including his door gunner Reles, pilot Glenn Mills (Jason Mitchell), Cole, Landsat employee Steve Woodward, and Randa. After being confronted by Packard, Randa reveals his affiliation to the secret government organization Monarch, which was trying to prove the existence of monsters and determine their threat to humanity.The other survivors (Conrad, Weaver, Brooks, biologist San Lin (Jing Tian), soldier Reg Slivko (Thomas Mann), and Landsat employee Victor Nieves (John Ortiz)) try to get to a rendezvous point to meet a resupply team arriving in three days' time. They encounter the local Iwi natives and an older Marlow. He reveals that Kong is the island's guardian, worshiped as a god by the natives for protecting the island's inhabitants from many predators, including reptilian underground monsters dubbed \"Skullcrawlers\". They have killed Kong's ancestors, leaving him as the last of his kind, and one killed Ikari.Packard's group begins making their way to Chapman, whose helicopter crash-landed elsewhere. Meanwhile, Chapman is ambushed and eaten by a Skullcrawler. Conrad's group helps Marlow complete a boat built from parts scavenged from Marlow and Ikari's downed planes. They ride the boat down the river, and manage to secure communication with Packard's group, but the boat is attacked by Pterosaur-like creatures which kill Nieves. They regroup with Packard, who insists on searching for Chapman, though his true objective is to find and kill Kong.Marlow leads the two groups to a mass grave littered with the bones of Kong's kind. There, the same Skullcrawler that devoured Chapman attacks the group, killing Randa and many soldiers before dying in a flammable gas explosion triggered by Weaver. Learning about Chapman's death, a vengeful Packard blames Kong for the deaths of his men and becomes determined to kill Kong. The two groups part ways, with Packard's group laying a trap for Kong, while the non-military personnel head back to the boat. While scouting the path ahead, Conrad and Weaver encounter Kong up-close and resolve to save him. They believe that Kong is God on the island and is protecting the world from skull crawlers breaking free and moving into the real world. They believe Kong is the only one keeping the skull crawlers in the ground.As Conrad and Weaver encounter Kong, Packard's group triggers napalm explosions to lure him in. Kong charges to the lake, where they manage to incapacitate him with ignited gasoline, though Woodward is killed. Conrad's group arrives and persuades the other soldiers to spare Kong, but Packard refuses to stand down. Then, a massive Skullcrawler emerges from the lake. Packard is crushed to death by a recovering Kong. The Skullcrawler overpowers Kong and chases the survivors. Cole is killed in a failed suicide bomb attempt to kill it. Kong returns to rescue the others and kills the beast by ripping out its innards. He saves Weaver from drowning, as she had been knocked into the water during the fight and allows the surviving humans to leave the island.During the credits, Marlow returns home, reuniting with his wife, meeting his son for the first time, and watching a Chicago Cubs game on television. In the post-credits scene, Conrad and Weaver are detained by Monarch and informed by Brooks and Lin that Kong is not the only monster to roam the world. As proof, they are shown archive footage of cave paintings depicting Godzilla, Rodan, Mothra, and King Ghidorah.",
	"links": [
		"https://www.amazon.com/Kong-Skull-Island-Tom-Hiddleston/dp/B06XFVDZVY"
	]
}