{
	"title": "Baby Driver",
	"release_year": "2017",
	"runtime": "113",
	"tags": [
		"Action",
		"Crime",
		"Drama",
		"amazon",
		"netflix"
	],
	"rating": 7.5,
	"actors": [
		"Ansel Elgort",
		"Jon Bernthal",
		"Jon Hamm",
		"Eiza González",
		"Micah Howard",
		"Lily James",
		"Morgan Brown",
		"Kevin Spacey",
		"Morse Diggs",
		"CJ Jones"
	],
	"staff": [
		"Edgar Wright",
		"Edgar Wright",
		"Tim Bevan",
		"Eric Fellner",
		"Nira Park",
		"Steven Price",
		"Bill Pope",
		"Jonathan Amos",
		"Paul Machliss",
		"Francine Maisler",
		"Marcus Rowland"
	],
	"votes": 625657,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjM3MjQ1MzkxNl5BMl5BanBnXkFtZTgwODk1ODgyMjI@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "When Baby (Ansel Elgort) was a child, a car accident killed his parents and left him with tinnitus (continuous humming sounds in the ears), which he blocks out by listening to music on iPod. As a teen, Baby lived a troubled life and it is revealed that he once tried to steal a car which was, unknown to him, owned by criminal mastermind \"Doc\" (Kevin Spacey). Doc had a lot of merchandise inside the car, which Baby dumped.\nBaby was caught by Doc himself but instead being turned in, he was coerced to work for Doc to pay off the debt for the lost merchandise.As a result, he became a getaway driver, and ferried crews of robbers assembled by Doc. The crews would hit various targets like a bank and Doc had a rule never to work with the same crew twice. Baby is an expert driver and is able to use his skill to extract the crews without ever being caught by the police. Baby gets a full cut from each job, same as everyone else. He is called Baby as people are still waiting on his first words. After the loot is distributed, Doc takes most of Baby's cut as payment towards the first stolen car.Between jobs, he creates remixes from snippets of conversations he records, and cares for his deaf foster father Joseph (CJ Jones). Baby has hidden away the money he earned from Doc inside the wooden floor of his apartment.\nAt a diner, he meets a waitress, Debora (Lily James), and they start dating. Debora likes music and loves driving into the sunset, not knowing where she is going. She is sweet looking and has a great outlook for life.Baby's supposedly final job for Doc goes awry after the trigger-happy Bats (Jamie Foxx), who developed an immediate dislike to Baby, shoots a security guard. Bats believes that the getaway driver needs both their eyes and ears on the job and with Baby listening to music all the time, Bats believes that he is only half there.\nIt becomes worse when an armed bystander chases them down, but Baby evades him and the police. Bats wanted to shoot down the bystander, but Baby prevents that with his skillful driving. Bats knows that Baby deliberately made him miss that shot and tells him later that once you develop feelings in this business, you most likely end up dead.Having paid his debt, Baby quits his life of crime. Joseph persuades him to start fresh and become a pizza delivery driver while Baby continues to date Deborah. However, while Baby is on a fancy dinner date with Debora, Doc appears and insists that he join another heist's crew, threatening to hurt Debora if he refuses. Baby reluctantly agrees. Doc says that Baby has paid off his debt and now it is time for him to profit. Doc says that he has done every job with Baby, ever since they met and now, he believes that Baby is his lucky charm.Baby tell Deborah that he is being forced to drive again and asks her if she would like to leave everything behind with him. Deborah agrees.The next heist targets money orders from a post office. When Baby arrives at their hideout, he is surprised that this job's crew consists of the easy-going Buddy (Jon Hamm), his sharpshooter wife Darling (Eiza González), and Bats; all repeat members, which is highly irregular, because Doc refuses to work with the same team more than once. While the crew attempts to purchase illegal arms for the job (Doc wanted hardware that could not be traced back to the crew or to any of their previous jobs), Bats realizes the dealers are police and opens fire, presumably killing them all. Afterwards, Bats forces Baby to stop at Debora's diner, unaware of Baby and Debora's romance, and nearly kills her in a hold-up.Doc is furious, revealing that the dealers were dirty cops on his payroll. He decides to cancel the heist, but Bats, Buddy and Darling disagree. Doc lets Baby decide; he chooses to go through with it. He attempts to flee later that night, hoping to take Debora and leave Atlanta. He is stopped by Buddy and Bats, who have discovered his recordings and suspect that Baby is an informant. However, Baby is able to prove his innocence when Doc and the rest of the crew play mix-tapes he has created.During the heist, Bats kills a security guard. Disgusted, Baby refuses to drive the crew, causing Bats to hit him. Baby rams the car into re-bar, impaling and killing Bats. The three surviving crew members flee on foot while the police chase them. After an ensuing firefight, Darling is shot and killed. Buddy blames Baby for her death, and vows to kill him. Baby steals another car and flees to his apartment to evacuate Joseph. Baby leaves Joseph, and his earnings from all his heists, on the porch of a senior care home along with a recording asking the staff to care for Joseph. Baby drives to Debora's diner to pick her up, where he discovers Buddy waiting. Baby shoots Buddy and flees with Debora as the police close in.Baby seeks help from Doc, who initially refuses, blaming Baby for ruining the heist. After seeing he truly loves Debora, Doc supplies them with cash and directions to get out of the country, stating that he was also in love once. Buddy ambushes them in the parking garage and rams Doc with a stolen police car, killing him. A cat-and-mouse game ensues, leading them in a multi-story parking garage. Buddy corners Baby, and fires his gun next to both of Baby's ears, temporarily deafening him. Debora disarms Buddy with a crowbar and Baby shoots him, causing him to fall to his death.Fleeing Atlanta, Baby and Debora run into a police roadblock. Debora prepares to ram it, but Baby stops her and surrenders, telling her she does not belong in the world of crime. At Baby's trial, Joseph, Debora, and several people Baby saved during the robberies testify in his defense. Baby is sentenced to 25 years in prison, with a parole hearing after 5 years served. He receives postcards from Debora, who promises to wait for him. Baby is released afterwards and finds Debora waiting in the same fashion he had previously dreamed of, and they kiss. They reunite with a new car and drive off into the sunset.",
	"links": [
		"https://www.amazon.com/Baby-Driver-Jamie-Foxx/dp/B072X499QT",
		"https://www.netflix.com/title/80142090"
	]
}