{
	"title": "Guardians of the Galaxy Vol. 2",
	"release_year": "2017",
	"runtime": "136",
	"tags": [
		"Action",
		"Adventure",
		"Comedy",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Chris Pratt",
		"Chris Pratt",
		"Zoe Saldana",
		"Dave Bautista",
		"Vin Diesel",
		"Bradley Cooper",
		"Michael Rooker",
		"Karen Gillan",
		"Pom Klementieff",
		"Sylvester Stallone",
		"Kurt Russell"
	],
	"staff": [
		"James Gunn",
		"James Gunn",
		"Dan Abnett",
		"Andy Lanning",
		"Steve Englehart",
		"Kevin Feige",
		"Tyler Bates",
		"Henry Braham",
		"Fred Raskin",
		"Craig Wood",
		"Sarah Finn",
		"Scott Chambliss"
	],
	"votes": 771847,
	"cover": "https://m.media-amazon.com/images/M/MV5BNWE5MGI3MDctMmU5Ni00YzI2LWEzMTQtZGIyZDA5MzQzNDBhXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1980, Peter's father Ego visited Earth and fell in love with Peter's mother (Laura Haddock).In 2014, Peter Quill (Chris Pratt) (The half-human, half-Celestial leader of the Guardians of the Galaxy who was abducted from Earth as a child and raised by a group of alien thieves and smugglers called the Ravagers), Gamora (Zoe Saldana) (A member of the Guardians and an orphan from an alien world who seeks redemption for her past crimes. She was trained by Thanos to be his personal assassin), Drax (Dave Bautista) (A member of the Guardians and highly skilled warrior in search for vengeance against Thanos for his family's slaughter), Rocket (Bradley Cooper) (A member of the Guardians who is a genetically modified raccoon bounty hunter and mercenary, who is also a master of weapons and military tactics), and Baby Groot (Vin Diesel) (A member of the Guardians who is a tree-like humanoid and the accomplice of Rocket) are renowned as the Guardians of the Galaxy.Ayesha (Elizabeth Debicki) (The golden High Priestess and the leader of the Sovereign people, a genetically engineered race who are \"gold and perfect and wanting to be physically and mentally impeccable), leader of the Sovereign race, has the Guardians protect valuable batteries from an inter-dimensional monster in exchange for Gamora's estranged sister Nebula (Karen Gillan) (An adopted daughter of Thanos who was raised with Gamora as siblings, and a reluctant member of the Guardians), who was caught attempting to steal the batteries.\nThe Guardians stop the attack and kill the beast when Drax realizes that the hide of the beast is too thick to cut from the outside. He allows himself to be swallowed, so he can cut the beast from the inside. That does not work, and Gamora finds a weak spot on the skin and runs the sword from there to the entire length of its body, killing the beast and freeing Drax. The Guardians leave with Nebula.After the Sovereign find that Rocket stole some batteries for himself, the Sovereign attacks the Guardians ship with a fleet of drones. The drones are destroyed by a mysterious figure, but the Guardians crash-land on a nearby planet named Berhert. The figure reveals himself as Quill's father, Ego (Kurt Russell). He invites Quill, Gamora, and Drax to his home planet, while Rocket and Groot remain behind to repair the ship and guard Nebula.Ayesha hires Yondu Udonta (Michael Rooker) (A blue-skinned buccaneer who is the leader of the Ravagers, a fatherly figure to Quill, and member of the Guardians) and his crew, who have been exiled from the greater Ravager community for child trafficking, to recapture the Guardians.\nThe Ravager community is led by Stakar, who had banished Yondu. Yondu claims that he didn't know that he was being used for trafficking kids.The Ravagers led by Yondu capture Rocket, but when Yondu hesitates to turn over Quill (by refusing to reveal Quill's location to the Sovereign and instead taking Rocket's offer of taking the batteries and selling them on the open market), whom he raised, his lieutenant Taserface (Chris Sullivan) leads a mutiny with help from Nebula. Taserface imprisons Rocket and Yondu aboard Yondu's ship and executes his loyalists.\nNebula tricks Groot into freeing her, so she can help Rocket, but Nebula leaves to track down and kill Gamora, whom she blames for all the torture inflicted on her by their father, Thanos. Thanos would make Gamora and Nebula battle each other. And every time Nebula lost, he would replace one part of her with a robotic aperture, slowly and painfully turning her into a half machine. Hence, Nebula wants to kill Gamora and Thanos.\nWhile imprisoned, Rocket and Yondu bond. Rocket is curious as to why Yondu did not deliver Quill to Ego, but Yondu evades the question. Groot and Yondu's loyalist Kraglin (Sean Gunn) free Rocket and Yondu, and they destroy the ship and its crew as they escape, though not before Taserface warns the Sovereign.Ego, a god-like Celestial that manipulated the matter around its consciousness to form his \"home\" planet, explains that he projected a humanoid guise to travel the universe and discover a purpose, eventually falling in love with Quill's mother Meredith. Ego hired Yondu to collect the young Quill after Meredith's death, but the boy was never delivered, and Ego has been searching for his son ever since. He teaches Quill to manipulate their Celestial power. Nebula arrives at Ego's planet and tries to kill Gamora, but the pair reach an uneasy alliance when they discover caverns filled with skeletal remains.Ego reveals to Quill that in his travels he planted seedlings on thousands of worlds which can Terraform them into new extensions of himself, but they can only be activated by the combined power of two Celestials. To that end, he impregnated countless women and hired Yondu to collect the children but killed them all when they failed to access the Celestial power. Under the influence of Ego's power, Quill helps him activate the seedlings, which begin to consume every world. However, Quill fights back when Ego reveals that he caused Meredith's death due to the distraction she posed.Mantis (Pom Klementieff), Ego's naive Empath servant, grows close to Drax and warns him of Ego's plan. Gamora and Nebula also learn of the plan just as Rocket, Yondu, Groot and Kraglin arrive. The reunited Guardians reach Ego's brain at the planet's core and fight the Sovereign's arriving drones. Rocket makes a bomb using the stolen batteries, which Groot plants on Ego's brain. Quill battles Ego with his newfound Celestial powers in order to distract him enough to allow the other Guardians and Mantis to escape.The bomb explodes, killing Ego and disintegrating the planet. Yondu sacrifices himself to save Quill, who realizes that the reason Yondu kept him was to spare him from the fate of Ego's other progeny, and that Yondu was Quill's true \"daddy\". Having reconciled with Gamora, Nebula still chooses to leave and attempt to kill Thanos. The Guardians hold a funeral for Yondu, which is attended by dozens of Ravager ships, acknowledging Yondu's sacrifice and accepting him again as a Ravager.In a series of mid- and post-credit scenes:\nKraglin takes up Yondu's Telekinetic arrow and control-fin;\nRavager leader Stakar Ogord (Sylvester Stallone) reunites with his ex-teammates;\nAyesha creates a new artificial being with whom she plans to destroy the Guardians, naming him Adam.\nGroot starts growing back to normal size, exhibiting typical teenage behaviour in the process.\nWhile a group of uninterested Watchers listen to their informant discussing several experiences on Earth.",
	"links": [
		"https://www.amazon.com/Guardians-Galaxy-Vol-2-Theatrical/dp/B0716DT6G3"
	]
}