{
	"title": "Okja",
	"release_year": "2017",
	"runtime": "120",
	"tags": [
		"Action",
		"Adventure",
		"Drama",
		"amazon",
		"netflix"
	],
	"rating": 7.3,
	"actors": [
		"Tilda Swinton",
		"Tilda Swinton",
		"Paul Dano",
		"Ahn Seo-hyun",
		"Jake Gyllenhaal",
		"Byun Hee-Bong",
		"Steven Yeun",
		"Lily Collins",
		"Yun Je-mun",
		"Shirley Henderson",
		"Daniel Henshall"
	],
	"staff": [
		"Bong Joon Ho",
		"Bong Joon Ho",
		"Jon Ronson",
		"Dooho Choi",
		"Dede Gardner",
		"Bong Joon Ho",
		"Lewis Taewan Kim",
		"Jung Jae-il",
		"Darius Khondji",
		"Jinmo Yang",
		"Jenny Jue",
		"Lee Ha-jun",
		"Kevin Thompson"
	],
	"votes": 133684,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjQxMTcxNDgxN15BMl5BanBnXkFtZTgwOTczNTIzMjI@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 2007, Lucy Mirando (Tilda Swinton) becomes CEO of the Mirando Corporation, succeeding her controversial grandfather, her father and her cruel twin sister Nancy. She announces that they have been breeding a special kind of super pig. Twenty-six of the best pigs will be sent to locations around the world, and ten years later, one will be crowned the winner.In 2017, a young girl named Mija (Ahn Seo-Hyun) lives happily in the countryside of South Korea with her grandfather (Byun Hee-Bong) and her super pig, Okja. They are visited by Mirando spokesperson and zoologist Dr. Johnny Wilcox (Jake Gyllenhaal), who declares Okja the best super pig and announces they will take her to New York City. Mija's grandfather takes her to visit the graves of her parents where he presents her with a gold pig and explains to her that rather than buy Okja, which was not allowed, he saved up the money for Okja and bought the solid gold item. Devastated, Mija runs away to Seoul to find Okja, where she sees her as she is being loaded onto a truck. Mija manages to chase down the truck, which is eventually intercepted by another truck, run by the Animal Liberation Front (ALF). In the resulting chaos Mija and Okja run away causing havoc though they are eventually saved by the ALF.Jay, leader of ALF tells Mija that Okja is a genetically mutated animal created by Mirando corporation in a lab. Mirando is hiding the fact that Okja & other super pigs are part of an illegal genetic experiment with live animals, which they now plan to introduce back into the food chain. Recognizing that Mija is Okja's owner, they tell her that their plan is to put a video recording device in Okja's ear and let her be re-captured by the Mirando corporation to show how brutally they treat their animals. They need the live video from inside Mirando's labs to prove their case to the world.Mija tells them to return her to the mountains but their translator, K (Steven Yeun), deliberately lies, causing the group to believe Mija went along with their plan. They abandon her, and Okja is recaptured.Meanwhile, footage of Okja and Mija running through the streets of Seoul has gone viral. In order to do damage control, Lucy pays for Mija to come to New York to be reunited onstage with her pig. Okja is taken to the laboratory where she is forcibly bred with another super pig and bits of meat are extracted from her flesh for a taste test by a drunk Wilcox. Members of the ALF overhear the recording through the device they placed in Okja's ear. Jay (Paul Dano) vows to help Okja and Mija and use the recording to expose the Mirando corporation's animal abuse.In New York City, Mija spends her time learning bits of English and being forced to agree to the wishes of the Mirando corporation. Jay, the leader of ALF, slips into her room and tells her that they still plan to rescue Okja while on stage. A huge parade is put on by the Mirando Corporation who give out free meat in the street. Mija is reunited with Okja who, blinded and battered does not recognize her and attacks her. In the resulting chaos, Jay tries to hurt Okja, but Mija prevents him from doing so, calming Okja down so that she recognizes Mija. A video of Wilcox's treatment of Okja is screened by the ALF to the public, who quickly turn on him and Lucy. Mija and the ALF attempt to escape with Okja, but Nancy arrives back and quickly takes over the Mirando Corporation, recapturing Okja and having the ALF members beaten and arrested.Escaping, Jay and K take Mija to find Okja in a mass killing plant. The group search for Okja but are unable to find her until Mija sees her going up the ramp to the slaughterhouse. In order to save Okja she runs through the killing plant and sees many dead super pigs. Mija sees Okja as she is about to be slaughtered and shows the Mirando employee a photograph of herself with a baby Okja. The man seems moved, but Nancy arrives and tells Mija and the man that Okja must be slaughtered. Mija offers the golden pig to Nancy in exchange for Okja's life. Nancy agrees to the deal whilst subsequently arresting Jay and K. As Mija and Okja are leaving, they see many more pigs being led to slaughter. A pair of super pigs manages to push their newborn through the fence, and Okja hides it within her mouth to take it away.Back in the countryside, Mija resumes her life with her grandfather, Okja, and the new piglet. In a post-credits scene, Jay is released from prison and gets on board a bus with K and the other members of the organization, who reveals that ALF will be attending a major meeting involving all of the Mirando shareholders.",
	"links": [
		"https://www.amazon.com/Bong-Joon-Contemporary-Film-Directors/dp/0252088573",
		"https://www.netflix.com/title/80091936"
	]
}