{
	"title": "Maze Runner: The Scorch Trials",
	"release_year": "2015",
	"runtime": "131",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Dylan O'Brien",
		"Kaya Scodelario",
		"Thomas Brodie-Sangster",
		"Giancarlo Esposito",
		"Ki Hong Lee",
		"Dexter Darden",
		"Alexander Flores",
		"Jacob Lofland",
		"Rosa Salazar",
		"Patricia Clarkson"
	],
	"staff": [
		"Wes Ball",
		"T.S. Nowlin",
		"James Dashner",
		"Marty Bowen",
		"Wyck Godfrey",
		"Ellen Goldsmith-Vein",
		"Joe Hartwick Jr.",
		"John Paesano",
		"Gyula Pados",
		"Dan Zimmerman",
		"Denise Chamian",
		"Daniel T. Dorrance"
	],
	"links": [
		"https://www.amazon.com/Maze-Runner-Scorch-Dylan-OBrien/dp/B015IVGKG8"
	],
	"votes": 282872,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjE3MDU2NzQyMl5BMl5BanBnXkFtZTgwMzQxMDQ3NTE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "A young boy, Thomas, is taken in by Ava Paige (Patricia Clarkson) and troops from the organization WCKD, alongside other children, after being dropped off by his mother for his own safety. Thomas and other children are placed in a moving maze in a place known as the Glade as part of the scientific testing.Years later, shortly after the remaining Gladers who escaped The Maze are taken to a facility run by Mr. Janson (Aidan Gillen).\nThe Gladers include the now teenage Thomas (Dylan O'Brien) and Teresa Agnes (Kaya Scodelario), former workers of WCKD and creators of the Maze, Newt (Thomas Brodie-Sangster), Minho (Ki Hong Lee), Frypan (Dexter Darden) and Winston (Alexander Flores).Janson explains that the facility is a safe haven for Immunes of the Flare virus, protecting them from WCKD and the Cranks, and providing them clothes, food, and sanitation. Jason says that the kids who are immune to the virus are humanity's best hope for survival, but this also makes them a target for the WCKD. Under Janson's care, they discover that they were not the only people in the experiment and that many more Mazes were constructed aside from their own.Thomas admits to Janson that he remembers that he used to work for WCKD and that they sent him into the Maze. Janson explains that the facility is a temporary way-station for survivors on their way to a safe farm, where they get to live their lives in peace. But only a few survivors are chosen each day to be transported to the \"farm\".Thomas gets worried when he is separated from Teresa, and she is taken for additional tests.\nThomas becomes curious about their activities and with help from Aris Jones (Jacob Lofland), the first maze survivor to end up in the facility, he explores the facility by getting into the air vents. He manages to find out what is really happening behind the closed doors. Thomas and Aris find that no survivors ever leave the place and that the survivors are instead taken to a section of the facility, where they are hooked to machines and their immunity serum is extracted out of them.\nIt is revealed that WCKD's leader, Ava, is still alive and that Mr. Janson is working for them.Janson and Ava two discuss the lethal experiments being conducted on the Immunes and that Janson has yet to find The Right Arm, a resistance group located in the mountains, who are after the same kids. Ava orders Janson to start harvesting all the remaining Immunes, & Janson suggests that they get started with the latest batch of arrivals (Thomas's group). Ava says that she is close to a cure for the Flare Virus.The group, including Aris (Jacob Lofland), escapes the facility as Janson orders his WCKD troops to track them down and they find themselves in the deserted outside world - the Scorch.\nThe group arrive at an abandoned marketplace, where they first encounter the Cranks, humans Zombified by the Flare virus. In the process, Winston gets infected by one of them. When morning comes, they find the city has turned into ruins and that WCKD is still searching for them. Winston's infection gets worse, forcing the rest of the group to leave him alone to die by shooting himself, preventing his transformation.The group continues to venture the desert until one night; while sleeping in the middle of the desert, Thomas wakes to discover civilization on the distant horizon. As a thunderstorm emerges, they run to an abandoned facility for shelter. To the group's relief, Minho survives being struck by a bolt of lightning. They manage to enter the facility, only to find that it is filled with chained Cranks.The group meets Brenda (Rosa Salazar) and Jorge (Giancarlo Esposito), who lead a dangerous band of survivors and have used the Cranks as their own guard dogs. When the two find that the group had come from WCKD and is looking for the Right Arm, the two agree to take them to the Right Arm, abandoning their group of survivors.\nMoments later, WCKD, led by Janson, storms the place, only for the facility to be destroyed by Jorge's explosives, however, Thomas and Brenda are left behind as the rest have escaped with Jorge. Thomas and Brenda manage to escape the Cranks, only for Brenda to get infected by a Crank in the process.Thomas experiences a flashback of when he and Teresa were working for WCKD, in which Thomas tries to warn Teresa of WCKD's plans, only for the two to be separated by WCKD's troops. As Thomas and Brenda reunite with the rest of the group, Jorge interrogates Marcus (Alan Tudyk), a survivor who secretly works for WCKD, into revealing the whereabouts of The Right Arm.The group eventually arrives at a roadblock, where several people ambush them. However, two young women, Harriet (Nathalie Emmanuel) and Sonya (Katherine McNamara), recognize Aris and stands down. They take the Gladers, Brenda, Jorge, and Aris to the Right Arm's outpost camp, where other immune survivors are present.The group eventually arrive at The Right Arm's relief camps, where other innocent survivors are present, and are greeted by Vince (Barry Pepper) who leads the Right Arm and is in charge of deciding whether they can stay or not. As Brenda's infection gets worse, Vince threatens to shoot her, only to be stopped by Mary Cooper (Lili Taylor), a former WCKD scientist who reveals that Thomas was their informant, as he'd become disillusioned with WCKD, so has helped the Right Arm take down WCKD's major operations ever since.As Mary halts Brenda's infection using an enzyme cure, Mary explains that the enzyme can only be harvested from an Immune's body, not manufactured, and that arguments over the methods of manufacturing the cure with Ava led to Mary's departure from WCKD.That evening, Teresa informs WCKD of her location, believing their motivations are good, leading to an ambush by the organization. Ava and Janson arrive in a Berg (a very large WCKD aerial transportation vehicle). Teresa explains to Thomas that she got her memories back from WCKD while she was with JansonThey confront the Right Arm before WCKD troops capture survivors for experimentation, including Minho, while Janson shoots Mary dead. After Thomas and the Right Arm fend the WCKD troops off, Ava, Janson, and Teresa retreat with their captured survivors.With only a fraction of survivors left at the site, Thomas plans an infiltration into WCKD and is determined to take them down to save his friends and civilization, with Vince and the Right Arm agreeing to help and prepare to fight back."
}