{
	"title": "Manchester by the Sea",
	"release_year": "2016",
	"runtime": "137",
	"tags": [
		"Drama",
		"amazon"
	],
	"rating": 7.8,
	"actors": [
		"Casey Affleck",
		"Michelle Williams",
		"Kyle Chandler",
		"Lucas Hedges",
		"Ivy O'Brien",
		"Richard Donelly",
		"Virginia Loring Cooke",
		"Quincy Tyler Bernstine",
		"Missy Yager",
		"Stephen McKinley Henderson"
	],
	"staff": [
		"Kenneth Lonergan",
		"Kenneth Lonergan",
		"Lauren Beck",
		"Matt Damon",
		"Chris Moore",
		"Kimberly Steward",
		"Lesley Barber",
		"Jody Lee Lipes",
		"Jennifer Lame",
		"Douglas Aibel",
		"Ruth De Jong"
	],
	"votes": 319958,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTYxMjk0NDg4Ml5BMl5BanBnXkFtZTgwODcyNjA5OTE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Lee Chandler (Casey Affleck), a sullen and quiet handyman for a society of apartments for the elderly in Quincy, Massachusetts. Mr Emery (Stephen Henderson) is Lee's boss. When the tenants of the apartments mistreat Lee, he is rude and unfriendly towards them. This leads the tenants to complain against him. Lee says that he works 4 buildings, does all the work and even does electrical fixes which are against the law.\nLee won't pick up women at the bar, even if they are hitting on him. He shuts down all conversation and likes to be left alone. He picks up fights with random strangers for looking in his direction.Lee receives word from George (C.J. Wilson), a family friend, that his brother Joe (Kyle Chandler) has suffered a heart attack. Joe dies before Lee can get to the hospital. Lee calls Mr Emery and makes arrangements for another handyman to cover his shifts while he is gone.\nLee knew that Joe had been diagnosed with weak heart muscles and his life expectancy was already reduced to 5-10 years tops. Dr. Bethany (Rubio Qian) had warned that Joe would be subject periodic episodes of heart failure, but in between he would be able to live a normal life. Joe already had a difficult relationship with his wife Elise back then. Elise is shown to be an alcoholic and an irresponsible mother.Lee goes back to his hometown of Manchester-by-the-Sea to break the news to Joe's teenage son, Patrick (Lucas Hedges). Patrick is friends with Joel (Oscar Wahlberg), CJ (Christian Mallen) and Silvie (Kara Hayward). Patrick is having sex with Silvie in his room, after taking permission from Lee.\nStaying in Joe's home while arranging Joe's funeral, Lee is shocked to learn that Joe named him as Patrick's guardian. The lawyer explains that Joe left money for Lee to relocate back to town, $5000 as living expenses and a small amount of other miscellaneous things, hoping that Lee would move back. Lee assumed that custody of Patrick would go his uncle Donny who now lives in Minnesota, but the lawyer says that this was not Joe's intention.\nReluctant to commit to the guardianship and unwilling to move back to Manchester but opposed to returning Patrick to his estranged alcoholic mother, Lee makes plans for Patrick to move back to Boston with him. Patrick, deeply rooted in the Manchester community, objects to the idea. Lee commits to staying until the end of the school year.It is shown through flashbacks that Lee once lived happily in Manchester with his wife Randi (Michelle Williams) and their three young children (Suzy (Chloe Dixon), Karen (Ellie Teeves) and infant Stanny). Lee used to spend a lot of time with Patrick when he was kid, fishing together on Joe's boat, called the \"Claudia Marie\". Lee had a happy life and he enjoyed Joe's company.One night after hosting a raucous party, an intoxicated Lee forgot to put the screen in front of the fireplace (it was freezing in the kid's bedroom and Lee put a few extra logs in the fire to heat up the house, while he went to get more beer), leading to a house fire that killed his children.\nNo criminal charges were filed against him, but Randi blamed him for the fire. Lee attempted suicide by pulling a gun from a police officer's holster after being interviewed. The attempt failed. Lee and Randi subsequently divorced, and he subsequently moved to Boston, becoming bitter and isolated.Joe's body needs to be kept in storage until spring when the ground thaws and he can be buried. Lee remains in Manchester until the delayed funeral. Over time, Patrick and Lee reestablish their bonds. Lee comes through when Patrick has a panic attack while rifling through the freezer, as he has been constantly bothered by the thought of his father on ice for several months.Conflict continues to arise when Lee refuses to make small talk with the mother Jill (Heather Burns) of Patrick's girlfriend, Sandy (Anna Baryshnikov), so that Patrick and Sandy can have sex. Patrick thinks Lee is trying to distance himself from him, especially because Lee is doing all he can to wrap things up and leave Manchester.Patrick's mother Elise (Gretchen Mol) learns of the situation and offers to allow Patrick to move in with her, having found religion and sobriety with her new Christian fiance, Jeffrey (Matthew Broderick). During an awkward meal with them, Patrick finds himself unable to connect with Elise. Elise's hurried departure from the room is followed by the sound of bottles and glass, to Jeffrey's concern. Patrick is later unsettled when his mother's controlling fiance emails him insisting on being an intermediary in the future, saying that it is best for her.Meanwhile, Lee runs into a remarried Randi and her newborn baby. She expresses great remorse for her treatment of him during the divorce and asks to reconnect. He deflects her apology, feeling that he does not deserve it. When she insists that they reconnect and pleads with him not to \"just die\".\nA distraught Lee cannot find the words to respond and leaves before he becomes emotional, parting with the phrase: \"There's nothing there.\" She sobs as he walks away.Distraught, Lee gets drunk at a bar, picks a fight with strangers, and is knocked out. He wakes up in the living room of Joe's friend George and breaks down in tears.\nAt home, Patrick shows his uncle deference after seeing his battered state and pictures of his deceased children. Lee arranges for George and his wife to adopt Patrick so that he can remain in Manchester while Lee takes a job in Boston. When Patrick asks Lee why he cannot remain in Manchester, Lee says that he \"can't beat it\".During a walk after Joe's burial service, Lee tells Patrick he is searching for a residence in Boston with an extra room so Patrick can visit whenever he wants. In the final scene, Lee and Patrick go fishing on Joe's refurbished boat, which Patrick has inherited.",
	"links": [
		"https://www.amazon.com/Manchester-Sea-Casey-Affleck/dp/B089XWWM3V"
	]
}