{
	"title": "Jason Bourne",
	"release_year": "2016",
	"runtime": "123",
	"tags": [
		"Action",
		"Thriller",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Matt Damon",
		"Tommy Lee Jones",
		"Alicia Vikander",
		"Vincent Cassel",
		"Julia Stiles",
		"Riz Ahmed",
		"Ato Essandoh",
		"Scott Shepherd",
		"Bill Camp",
		"Vinzenz Kiefer"
	],
	"staff": [
		"Paul Greengrass",
		"Paul Greengrass",
		"Christopher Rouse",
		"Robert Ludlum",
		"Matt Damon",
		"Gregory Goodman",
		"Paul Greengrass",
		"Frank Marshall",
		"David Buckley",
		"John Powell",
		"Barry Ackroyd",
		"Christopher Rouse",
		"Daniel Hubbard",
		"Francine Maisler",
		"Paul Kirby"
	],
	"votes": 245180,
	"cover": "https://m.media-amazon.com/images/M/MV5BMzY3Y2Q3MmUtZmU3MC00OWMxLWIwNDMtNDA4MmViMTUxYjYxXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "A decade after he exposed Operation Blackbriar and disappeared, Jason Bourne (Matt Damon)(born David Webb, a former CIA assassin who disappeared after publicizing details of the CIA's targeted assassination programs) has finally recovered from his amnesia, isolating himself from the world and making a living by taking part in illegal fighting rings. In Reykjavík, Nicky Parsons (Julia Stiles)(Bourne's former Treadstone contact in Paris whom he sent into hiding in The Bourne Ultimatum), who has been collaborating with a hacktivist group led by Christian Dassault (Vinzenz Kiefer), hacks into the CIA's mainframe server in order to expose the CIA's black ops programs. In the process, Parsons finds documents that concern Bourne's recruitment into the Treadstone program and his father's role in the program, and she decides to travel to Athens to find and inform him. Parsons' system intrusion alerts Heather Lee (Alicia Vikander), the head of the CIA's cyber ops division, and CIA Director Robert Dewey (Tommy Lee Jones)(leader of the Iron Hand program who holds an intention to take down Bourne after the exposure of Blackbriar).Before Parsons can disconnect from the CIA mainframe, Lee uses the connection to insert malware into the files, which would alert Lee any time and every time they are opened. Dewey activates the Asset. He also agrees to make Lee the point on the mission to bring in Parsons & Bourne.In Greece, Parsons and Bourne meet at Syntagma Square in the midst of a violent anti-government protest. They evade the CIA teams sent to locate them. Parsons tells Bourne that she hacked the CIA for Dassault, who intends to post all files on CIA black ops online. There is a new program called Iron Hand, which is worse than Treadstone. Parsons also tells Jason that the files she copied had info on his past, prior to him joining Treadstone. Parsons is killed by the Asset (Vincent Cassel), an ex-Blackbriar program assassin who also holds a personal grudge against Bourne, having been captured and tortured following Bourne's actions that exposed Blackbriar.Before she dies, Parsons is able to pass the key to a luggage locker that holds the CIA files on to Bourne. Intending to find the answers about his past and family, Bourne locates Dassault in Berlin. Decrypting Parsons's files, Bourne discovers that his father, Richard Webb (Gregg Henry), was an analyst for the CIA and was involved with the creation of the original Treadstone program. However, malware planted in the files alerts the CIA to Bourne's location, and Dewey sends a team to capture him while Lee remotely erases the files to prevent another leak.Dassault attacks Bourne when he realizes that the files are being deleted (he thinks Jason is deleting them), but is killed in the fight. Lee takes the opportunity to alert Bourne to the team's presence as she believes that he can be persuaded to return to the agency. Using the documents Jason read in Dassault's apartment, Bourne tracks Malcolm Smith (Bill Camp), a former Treadstone surveillance operative (who was in charge of maintaining surveillance of Jason before he was recruited into Treadstone), in London and arranges to meet him in Paddington Plaza.Lee persuades Dewey to allow her to contact Bourne in person to attempt to bring him back in. Dewey agrees, but secretly authorizes the Asset to eliminate Lee's team and kill Bourne, who he believes cannot be reasoned with. Knowing that the CIA is watching him, Bourne evades Lee and the Asset long enough to confront Smith. Smith admits that Richard Webb created Treadstone, but tried to prevent them from recruiting Bourne. Under Dewey's orders, the Asset killed Richard Webb and staged his death as a terrorist attack to persuade Bourne to join Treadstone. Smith is killed by the Asset while Bourne escapes and finds Lee, who admits that she is not comfortable with Dewey's methods and directs him to a technology convention in Las Vegas.Dewey is scheduled to attend the convention for a public debate on privacy rights with Aaron Kalloor (Riz Ahmed), the CEO of the social media enterprise Deep Dream. Kalloor is the public face of corporate social responsibility in the Internet age, but he has secretly been funded by Dewey, who intends to use Deep Dream for real-time mass surveillance alongside the reborn of targeted assassination programs Treadstone, Blackbriar, Outcome and LARX, now collectively known as \"Iron Hand\".Lee knows that Dewey is having issues with Aaron & suspects that Dewey will try to take out Aaron, to take control of his firm (which Dewey needs to take Iron Hand online).Suspecting that Kalloor will refuse to allow the CIA access to Deep Dream, Dewey authorizes the Asset to assassinate Kalloor and Lee, whom he no longer trusts (Dewey finds that Jason has been identified entering the USA, and believes that Lee issued him an agency clearance on his passport to help him through immigration).Bourne arrives at the convention in time to thwart the assassination and confronts Dewey in his suite. Dewey appeals to Bourne's sense of patriotism as he stalls for time, knowing that agents are closing in. Bourne kills Jeffers (Ato Essandoh), Dewey's right-hand man, while Lee kills Dewey before he can shoot Bourne. Bourne covers up Lee's involvement before giving chase to the Asset and finally kills him by breaking his neck after a long fight in a sewer.In the aftermath, Lee convinces Edwin Russell (Scott Shepherd), the Director of National Intelligence, that Dewey's methods were outdated and offers herself as a candidate to become Dewey's replacement as CIA Director, to act as Russell's eyes and ears within the CIA. She outlines her plan to use Bourne's trust to bring him back to the agency but recognizes the need to kill him if he refuses. Lee approaches Bourne, promising him that the CIA will become the organization he thought it was when he joined. Bourne asks for time to consider her offer, but leaves a recording of her conversation with Russell in her car, making it clear that he does not trust her before he disappears again.",
	"links": [
		"https://www.amazon.com/Jason-Bourne-Matt-Damon/dp/B01J2KID48"
	]
}