{
	"title": "Fantastic Beasts: The Crimes of Grindelwald",
	"release_year": "2018",
	"runtime": "134",
	"tags": [
		"Adventure",
		"Family",
		"Fantasy",
		"max",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Eddie Redmayne",
		"Katherine Waterston",
		"Dan Fogler",
		"Johnny Depp",
		"Kevin Guthrie",
		"Carmen Ejogo",
		"Wolf Roth",
		"Zoë Kravitz",
		"Callum Turner",
		"Derek Riddell"
	],
	"staff": [
		"David Yates",
		"J.K. Rowling",
		"David Heyman",
		"Steve Kloves",
		"J.K. Rowling",
		"Lionel Wigram",
		"James Newton Howard",
		"Philippe Rousselot",
		"Mark Day",
		"Fiona Weir",
		"Stuart Craig"
	],
	"links": [
		"https://www.max.com/movies/fantastic-beasts-the-crimes-of-grindelwald/8c884d7f-cf56-469d-ab2f-38129155757f",
		"https://www.amazon.com/Fantastic-Beasts-Grindelwald-Eddie-Redmayne/dp/B07PMNSRJS"
	],
	"votes": 312917,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTcxNzU5MzkwN15BMl5BanBnXkFtZTgwMzQxNjA1NjM@._V1_QL75_UY281_CR18,0,190,281_.jpg",
	"description": "In 1927, the Magical Congress of the United States of America (MACUSA) is transferring the powerful dark wizard Gellert Grindelwald (Johnny Depp) (An infamous powerful dark wizard who caused mass violence, terror and chaos around the globe, seeking to lead a new Wizarding World Order based on his strong belief in Wizarding superiority) from their maximum-security prison to London to be tried for his crimes in Europe. Grindelwald escapes during the transfer, aided by his follower and MACUSA employee, Abernathy (Kevin Guthrie) (Tina and Queenie's previous MACUSA supervisor who is revealed to have become a follower of Grindelwald).Three months later in London, Newt Scamander (Eddie Redmayne) (A British Ministry of Magic employee in the Beasts Division of the Department for the Regulation and Control of Magical Creatures, as well as a self-proclaimed Magizoologist. He played a part in remedying the events of a violent attack on the City of New York in December 1926 involving dark wizard Gellert Grindelwald) appeals to the Ministry of Magic to restore his revoked international travel rights following his misadventure in New York City. While at the Ministry, Newt runs into Leta Lestrange (Zoë Kravitz) (An emotionally damaged and confused young woman who still exerts some control over Newt, who was once in love with her, and possibly still is. After she once risked the life of a fellow Hogwarts student, Newt took the blame for the misdemeanor, protecting her but resulting in him being ostracized from some British Wizarding society. She is descended from a historically wealthy, pure-blood family infamous for embracing the Dark Arts. She is currently engaged to Theseus Scamander, Newt's brother, and is now working at the British Ministry of Magic as the assistant to Torquil Travers, the Head of Magical Law Enforcement), an old Hogwarts classmate who is engaged to his brother, Theseus (Callum Turner) (Newt Scamander's older brother who works in the Auror Office of the Department of Magical Law Enforcement, fought in World War I, and is described as a \"war hero\". The two brothers share a tentatively warm relationship, slightly marred by their disparate personalities and beliefs. He spent the previous year hunting Grindelwald with a team of British Aurors.), an Auror in the Department of Magical Law Enforcement.The Ministry offers to restore Newt's travel rights if he assists Theseus in locating the Obscurial Credence Barebone (Ezra Miller) (The disturbed adopted child of Mary-Lou Barebone, severely abused and downtrodden. Enraged by people's treatment of him and Grindelwald's betrayal, he set his Obscurus parasite loose on the City of New York, causing widespread death and destruction. He was eventually \"destroyed\" by MACUSA officials, although a tiny Obscurus fragment escaped. Credence now has complete control over his Obscurus), who has resurfaced in Paris. Credence may be Leta's long-lost brother, Corvus Lestrange, the last of a long line of pure-blood wizards. Grindelwald believes only Credence can kill his equal, Hogwarts Professor Albus Dumbledore (Jude Law) (An extremely influential and powerful wizard in the British Wizarding Community, known in the British Ministry of Magic and throughout the wider Wizarding world for his academic brilliance, currently a professor of Defense Against the Dark Arts at Hogwarts School of Witchcraft and Wizardry. As a teenager, he had a mysterious, summer-long relationship with Grindelwald, which ended on a tragic note. A strong ally of Newt Scamander's, he is called to resist Grindelwald's reign of terror). Newt, however, declines, refusing to choose sides, and the Auror Grimmson is dispatched instead.After leaving the Ministry, Newt is secretly summoned by Dumbledore, who is under constant Ministry surveillance for refusing to confront Grindelwald. As youths, they shared a close personal relationship. Dumbledore persuades Newt to locate Credence.\nNewt's American friends, Queenie Goldstein (Alison Sudol) (The pretty and vivacious younger sister of Tina, who worked alongside her in the Federal Wand Permit Bureau after Tina was once demoted. She is a powerful natural Legilimens, and has fallen in love with Jacob Kowalski, despite Wizarding laws forbidding relationships with No-Majs) and Jacob Kowalski (Dan Fogler) (A No-Maj veteran of World War I and current business owner of a bakery, a friend of Newt's, and the primary love interest to Queenie before having his memory Obliviated following Grindelwald's attack on New York), unexpectedly arrive at his house. Jacob's recollections from the New York City incident are mostly intact, as the MACUSA's citywide Obliviation order only erased Muggles' bad memories and his were mostly good. Queenie and Jacob have followed her sister, Tina (Katherine Waterston) (A promoted MACUSA (Magical Congress of the United States of America) Auror. She played a role in thwarting Gellert Grindelwald during the Obscurus incident of 1926, for which she and Newt were initially blamed), to Europe where she is searching for Credence. Newt learns that Tina mistakenly believes he and Leta Lestrange are betrothed. Newt suspects that Queenie has enchanted Jacob into eloping to Europe with her to circumvent MACUSA's marriage ban between wizards and muggles. After Newt lifts the charm, Jacob and Queenie quarrel about marrying, and an upset Queenie leaves to find Tina. Newt determines Tina is in Paris, and, ignoring the travel ban, he and Jacob follow the sisters.\nWhile in Paris, Queenie cannot locate Tina, and is lost and confused, and at that moment she is discovered by one of Grindelwald's minions.In Paris, Tina searches for Credence at a Wizarding freak show at the Circus Arcanus. Credence and Nagini (Claudia Kim) (The main attraction of a Wizarding circus and freak show called Circus Arcanus and a Maledictus, who carries a blood curse that will eventually transform her into a snake permanently. For as long as she can remember, Skender has exploited her Transformative powers. Nagini befriends Credence Barebone, who works as a menial worker at the circus. Nagini will eventually become the infamous companion of Lord Voldemort, as well as his final Horcrux that is destroyed by Neville Longbottom), a young female circus attraction who transforms into a snake, escape after causing a distraction. While searching for Credence's birth mother, Credence and Nagini locate the servant who put Credence up for adoption. However, Grimmson, who is secretly working for Grindelwald, arrives and kills her.Meanwhile, Tina meets Yusuf Kama (William Nadylam) (A French-Senegalese wizard who has spent many years obsessively searching for Credence and has finally tracked him down in Paris at Circus Arcanus) who is also hunting Credence. Newt and Jacob encounter Yusuf and follow him to Tina. Yusuf, Leta's maternal half-brother, says he made an Unbreakable Vow to kill Credence, whom he believes is his step-brother and the last of the Lestrange family.Newt and Tina infiltrate the French Ministry of Magic to retrieve documents confirming Credence's identity. While there, Newt and Tina reconcile after she learns he was never engaged to Leta. Theseus and Leta discover them and join the search, which leads to the Lestrange family tomb in the Père Lachaise cemetery. In the cemetery Yusuf reveals that Leta's father ensnared his mother away from her family, due to his desire for her. She died, giving birth to Leta. Then Leta's father remarried and that led to the birth of her brother Corvus, which Yusuf thinks is Credence. Yusuf had sworn to kill Corvus.Leta reveals that Credence cannot be her brother: as a child, she inadvertently caused her infant brother Corvus' death by switching him with baby Credence while on a doomed New York-bound passenger ship, thereby sparing Credence. Meanwhile, a fabricated trail has lured Credence to the Lestrange tomb where Grindelwald is holding a rally for his followers. Jacob finds Queenie, now seemingly aligned with Grindelwald, in the audience there.Grindelwald preaches abolishing laws concealing wizards from muggles and utilizes future World War II images to justify worldwide wizard supremacy and domination. Led by Theseus, Aurors surround the rally, but Grindelwald fends them off while sending his emissaries across Europe to spread his message. Grindelwald casts a circle of blue flame to divide followers from enemies. Credence and Queenie cross over to join him, while Leta sacrifices herself to save Newt, Tina, Jacob, Yusuf, Nagini, and Theseus. As Grindelwald escapes, the remaining heroes unite alongside the immortal alchemist Nicolas Flamel to defeat Grindelwald. Newt realizes he must join the fight.At Hogwarts, Newt gives Dumbledore a vial taken from Grindelwald that contains the blood pact the teen-aged Grindelwald and Dumbledore made together. Newt correctly surmises that the pact magically prevents Dumbledore and Grindelwald from combating each other; Dumbledore believes it may be possible to destroy the pact.Hidden in Austria at his Nurmengard base, Grindelwald reveals Credence's true identity as Aurelius Dumbledore, Albus' long-lost brother and the only person powerful enough to defeat him. Queenie uses her mind-reading ability to advise Grindelwald on controlling Credence. A baby bird that Credence had been caring for is revealed to be a phoenix, a bird associated with the Dumbledore family. Grindelwald provides Credence with his first magic wand."
}