{
	"title": "Captain Marvel",
	"release_year": "2019",
	"runtime": "123",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.8,
	"actors": [
		"Brie Larson",
		"Brie Larson",
		"Brie Larson",
		"Samuel L. Jackson",
		"Ben Mendelsohn",
		"Ben Mendelsohn",
		"Jude Law",
		"Annette Bening",
		"Annette Bening",
		"Djimon Hounsou",
		"Lee Pace",
		"Lashana Lynch",
		"Gemma Chan",
		"Clark Gregg"
	],
	"staff": [
		"Anna Boden",
		"Ryan Fleck",
		"Anna Boden",
		"Ryan Fleck",
		"Geneva Robertson-Dworet",
		"Nicole Perlman",
		"Kevin Feige",
		"Pinar Toprak",
		"Ben Davis",
		"Debbie Berman",
		"Elliot Graham",
		"Sarah Finn",
		"Andy Nicholson"
	],
	"votes": 620042,
	"cover": "https://m.media-amazon.com/images/M/MV5BZDI1NGU2ODAtNzBiNy00MWY5LWIyMGEtZjUxZjUwZmZiNjBlXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1995, on the Kree Empire's capital planet of Hala, Starforce member Vers (Brie Larson) (An ex-U.S. Air Force fighter pilot and member of an elite Kree military unit called Starforce, whose DNA was altered during an accident, imbuing her with superhuman strength, energy projection, and flight) suffers from amnesia and recurring nightmares involving an older woman.Yon-Rogg (Jude Law) (The commander of Starforce and Danvers's mentor, who trains Vers to use her new powers), her mentor and commander, trains her to control her abilities, which Yon-Rogg says have been given to her by the Kree.\nWhile the Supreme Intelligence (Annette Bening), the artificial intelligence that rules the Kree, urges her to keep her emotions in check. The Supreme Intelligence says that Vers is a victim of the Skrull expansion, and her home world was also attacked by them. This resulted in the attack that fuels Vers's nightmares. The Supreme Intelligence convinces Vers that she has been given a gift by Kree and that it is her duty to serve the Kree people.\nUnknown to Vers, she has been implanted with a device on her neck, that suppresses her powers and allows the Kree to control her.Vers is assigned to a mission to rescue an undercover operative infiltrating a group of Skrulls, alien shape-Shifters with whom the Kree are at war. The mission is on a Kree border planet called Torfa and the operative has been undercover with Skrull for 3 years now. But the mission was an ambush planned by the Skrulls.\nVers is captured by Skrull commander Talos (Ben Mendelsohn) (The shape-shifting leader of the Skrull invasion of Earth).\nA probe of Vers' memories leads them to Earth. Talos sees in Vers memories that she was an Air Force pilot on Earth and worked with Dr Wendy Lawson who designed a revolutionary light-speed engine, that can help Skrulls win the war against Krees.Vers regains consciousness and confronts Talos. Talos says that these are her memories and the Kree suppressed them. Talos says that Skrull are looking for Dr Lawson and her light speed engine and were headed to Earth based on coordinates retrieved from Vers's memories.\nVers escapes in a Skrull escape pod and crash-lands in Los Angeles. Talos and the Skrull start tracking Vers on Earth. Vers contacts Yon-Rogg and reveals her location.\nHer presence attracts S.H.I.E.L.D. agents Nick Fury (Samuel L. Jackson) (The future director of S.H.I.E.L.D., who at this time is a low-level bureaucrat) and Phil Coulson (Clark Gregg) (A rookie agent of S.H.I.E.L.D. who works closely with Fury), whose investigation is interrupted by a Skrull attack.\nIn the ensuing chase, Vers recovers a Skrull crystal containing her extracted memories while Fury kills a Skrull impersonating Coulson. Talos, disguised as Fury's S.H.I.E.L.D. boss Keller, orders Fury to work with Vers under the guise of hunting the Skrulls.Using her extracted memories, Vers and Fury go to the Project Pegasus installation at a U.S. Air Force base. They discover Vers was a pilot presumed to have died in 1989 while testing an experimental jet engine designed by Dr. Wendy Lawson (Annette Bening) (Wendy appears to Vers also as an artificial intelligence that is the collective embodiment of the greatest minds of the Kree people, and the ruler of the Kree Empire), whom Vers recognizes as the woman from her nightmares.\nFury also picks up a cat named Goose at the Pegasus installation.The records in the facility indicate that Wendy died in the crash of the experimental engine along with a pilot and the facility has been trying to cover up this billion-dollar failure ever since. Only Vers knows that the pilot was herself. She also figures from Lawson's handwriting that Lawson was a Kree (wrote in the Kree language). Concerned by the cover-up of these events Fury contacts S.H.I.E.L.D. for back-up & Keller arrives with force.But quickly Fury realizes that Keller is a Skrull (when Keller calls Fury by the name Nicholas, when everyone calls him only Fury) and helps Vers fight past his fellow S.H.I.E.L.D. agents to escape in a jet with Lawson's stowaway cat Goose. They fly to Louisiana to meet former pilot Maria Rambeau (Lashana Lynch) (One of Danvers's oldest friends and a fellow Air Force pilot who goes by the call sign \"Photon\"), the last person to see Vers and Lawson alive.\nVers again calls Yon-Rogg who tells Vers that Lawson was working on technology that could help them win the war against Skrull. He dismisses suggestions that Vers was ever on Earth and says that the evidence she found was only Skrull simulations and mind-games.Rambeau and her daughter Monica tell Vers that her real name is Carol Danvers, as she was like family to them before they believed her to have died. Talos arrives at Rambeau home and states that the Skrulls are refugees searching for a new home and Lawson was Mar-Vell, a renegade Kree scientist helping them.\nTalos plays a recovered recording from Lawson's jet that prompts Danvers to remember the crash: Lawson attempted to destroy the engine to keep its power-core from the Kree but was killed by Yon-Rogg before she could.\nDestroying the engine herself, Danvers absorbed the energy from the ensuing explosion, giving her the energy-core's powers but allowing her to be taken by Yon-Rogg, who went on to erase these memories.Danvers, Talos, Fury, and Rambeau locate Lawson's hidden laboratory orbiting Earth. It is sheltering a group of Skrulls, including Talos's family, along with the Tesseract, the energy source that had powered Mar-Vell's engine.\nStarforce arrive and connect Danvers to the Supreme Intelligence. During their conversation, Danvers rejects the Supreme Intelligence and is able to destroy a Kree implant that was suppressing her powers, allowing her to reach her full potential.\nIn the subsequent battle, Danvers defeats Starforce while the others help the Skrulls escape. Goose is revealed to be a Kree alien Flerken and swallows the Tesseract. Kree forces led by Ronan the Accuser (Lee Pace) arrive to help defeat the Skrulls but retreat when Danvers destroys an entire star-cruiser. Danvers overpowers Yon-Rogg on Earth and sends him back to Hala with a warning to the Supreme Intelligence.Danvers departs to help the Skrulls find a new home world, leaving Fury a modified pager to contact her in an emergency. Meanwhile, Fury loses his left eye after it is scratched by Goose. While recovering, he drafts an initiative to locate heroes like Danvers and names it after her Air Force call sign \"Avenger\".\nIn a present-day mid-credits scene, Fury has activated the pager, and it is being monitored by the Avengers when Danvers arrives.\nA post-credits scene shows Goose throwing-up the Tesseract on Fury's desk.",
	"links": [
		"https://www.amazon.com/CAPTAIN-MARVEL-Blu-ray-Brie-Larson/dp/B07QLB785M"
	]
}