{
	"title": "Molly's Game",
	"release_year": "2017",
	"runtime": "140",
	"tags": [
		"Biography",
		"Crime",
		"Drama",
		"amazon",
		"netflix"
	],
	"rating": 7.4,
	"actors": [
		"Jessica Chastain",
		"Idris Elba",
		"Kevin Costner",
		"Michael Cera",
		"Jeremy Strong",
		"Chris O'Dowd",
		"J.C. MacKenzie",
		"Brian d'Arcy James",
		"Bill Camp",
		"Graham Greene"
	],
	"staff": [
		"Aaron Sorkin",
		"Aaron Sorkin",
		"Molly Bloom",
		"Mark Gordon",
		"Matt Jackson",
		"Amy Pascal",
		"Daniel Pemberton",
		"Charlotte Bruus Christensen",
		"Alan Baumgarten",
		"Elliot Graham",
		"Josh Schaeffer",
		"Francine Maisler",
		"David Wasco"
	],
	"votes": 191144,
	"cover": "https://m.media-amazon.com/images/M/MV5BNmYxYTg1ZDktNjc1Yy00MjVlLTk2Y2MtNmMzZTBkZDNjZjdlXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Molly Bloom (Jessica Chastain) is world-class moguls skier with Olympic aspirations, the result of years of enforced training from her overbearing father Larry (Kevin Costner). In a qualifying event for the 2002 Winter Olympics, Molly is severely injured; ending her career.\nInstead of her original plan of attending law school, Molly decides to take a year off and move to Los Angeles. Once she arrives, she becomes a bottle-service waitress at a club, where she meets Dean (Jeremy Strong), an ostentatious but unsuccessful real estate developer. She becomes his office manager, and he soon involves her in running his underground poker games. Many famous and wealthy individuals, such as movie stars, investment bankers, and sports players are involved in Dean's game; she earns large sums of money on tips alone.Molly is initially uninformed on poker topics, but quickly learns how to appeal to the players to gain tips. In particular, she hopes to please the most successful player, Player X (Michael Cera) (a composite character of Leonardo DiCaprio, Tobey Maguire, Ben Affleck, and other real-life celebrity poker players), by attracting new players to the game. Dean, upon seeing that Molly is becoming increasingly independent in running the games, attempts to control her, and then fires her. Molly, having gained the contacts through 8 years of running the game in LA, decides to create her own poker games. She rents a penthouse at a hotel, and hires a staff to help her run games. Additionally, she contacts employees at clubs and casinos to try and spread word about her poker games. Player X, along with many other players, decide to leave Dean's games to play for Molly. Molly becomes increasingly successful, gaining more money while being pressured to raise the stakes for her games. Harlan Eustice (Bill Camp), a conservative gambler who becomes increasingly compulsive, joins her game. Despite heavy losses (Harlan continues to make bigger and bigger bets for 48 hrs straight until he is down 1.2 MM USD. Harlan had a reputation for winning, so when the word spread that Harlan is on the tilt, they came from all over LA to beat Harlan and recoup some of their money), Eustice continues to play; Molly finds out that Player X has been funding his losses to keep him in the game. After Molly berates him for his unethical actions, Player X decides to change to Dean's game, where the other players join him; Molly is left without any players for her poker games.Molly moves to New York, with the hope of beginning a new underground poker game. After reaching out to many wealthy New Yorkers, Molly finds enough players for several weekly games. Despite continuous success, she is unable to cover her losses when players cannot pay. Her dealer convinces her to begin taking a percentage of large pots, allowing her to recuperate her potential losses (but which also means that she is in violation of the law by running an illegal casino). One of her Los Angeles players is indicted for running a Ponzi scheme; Molly is investigated and questioned as to who attended her games. At this time, Molly becomes increasingly addicted to drugs as the games have increasingly taken their toll. Her players also begin to include wealthy individuals from the Russian mafia, among others. She is approached by several Italian mafia members, who offer their services to extort money from non-paying players. After she declines, she is attacked in her home, where she is held at gunpoint and her mother's life is threatened. As she is about to return to her poker games, the FBI conducts a raid, a result of Douglas Downey (Chris O'Dowd), one of her players (The one who introduced Molly to the Russian mafia in the first place), acting as an informant. Molly's assets are seized, and she returns home to live with her mother.Two years later, Molly has published a book where she names few individuals that played in her games, and has recently moved out. She is arrested by the FBI, and indicted for involvement in illegal gambling with the mafia. She enlists the help of Charlie Jaffey (Idris Elba), a high-profile and expensive lawyer in New York, who agrees to help after Molly claims she has over $2 million in unclaimed gambling debts. After listening to Molly's full story he is convinced that she had nothing to do with the Russian or Italian mafia and her only crime was to run an illegal gambling joint for 7 months, which she stopped 2 yrs ago. Every penny that she had earned was legit (Even the 4 MM USD that the DoJ confiscated while arresting her). After she gave up gambling, she wrote a book and had a golden shot to earn millions by naming everyone that she was ever associated with, but refused to do so and accepted a meager dollars 35000 as a deposit on her book, in which she names only those 4 individuals that were named in the Harlan investigation by him.While in New York awaiting trial, Molly's father, Larry, seeks her out, and attempts to reconcile with her. He admits that he was overbearing, and that he treated Molly differently than her brothers because she had known about his affairs. Charlie reads Molly's book, and becomes interested in helping her case, as he feels she has not committed serious enough wrongdoing to merit a prison term. Charlie negotiates a deal for Molly to receive no sentence and her money returned in exchange for her hard drives and digital records from gambling. Molly declines this deal, fearing for the information about her players that would be released, and pleads guilty. The judge, arguing that she had committed no serious crimes, sentences her to community service, probation, and a $200,000 fine.",
	"links": [
		"https://www.amazon.com/Mollys-Game-Aaron-Sorkin/dp/B0CZK35QLB",
		"https://www.netflix.com/title/80199959"
	]
}