{
	"title": "Gran Turismo",
	"release_year": "2023",
	"runtime": "134",
	"tags": [
		"Action",
		"Adventure",
		"Drama",
		"amazon",
		"netflix"
	],
	"rating": 7.1,
	"actors": [
		"David Harbour",
		"Orlando Bloom",
		"Archie Madekwe",
		"Takehiro Hira",
		"Darren Barnet",
		"Geri Horner",
		"Djimon Hounsou",
		"Josha Stradowski",
		"Daniel Puig",
		"Maeve Courtier-Lilley"
	],
	"staff": [
		"Neill Blomkamp",
		"Jason Hall",
		"Zach Baylin",
		"Alex Tse",
		"Doug Belgrad",
		"Dana Brunetti",
		"Asad Qizilbash",
		"Carter Swan",
		"Lorne Balfe",
		"Andrew Kawczynski",
		"Jacques Jouffret",
		"Austyn Daines",
		"Colby Parker Jr.",
		"Raylin Sabo",
		"Mary Vernieu",
		"Martin Whist"
	],
	"votes": 109375,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjA0N2YyNmYtZDk4Ny00ODE2LThmZWQtNGJiMDk0YzhiNzE5XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Kazunori Yamauchi (Takehiro Hira), is the creator of Gran Turismo, the most accurate racing simulator of all time. Kanzunori wanted to make racing accessible to all.Following a pitch by marketing executive Danny Moore (Orlando Bloom), Nismo, the motor-sport division of Nissan establishes the GT Academy to recruit skilled players of the racing simulator Gran Turismo and turn them into real racing drivers. Danny believes that 80 million youth play the Gran Tourismo. If he can convert one of them into a racing champion, that would open up a whole new category for their physical cars.Danny recruits former driver-turned-mechanic Jack Salter (David Harbour) to train the players. Jack is initially hesitant but accepts after tiring of the arrogance of his team's driver, Nicholas Capa (Josha Stradowski). Jack believes that putting a kid from behind his console into a 200 mile an hour rocket is dangerous, but Danny is convinced that the kids have more track time than any of the professional racers.\nMeanwhile, Jann Mardenborough (Archie Madekwe), a teenage clothing store employee and gamer from Cardiff, Wales, is an avid player of the simulator and wants to become a racing driver, despite the disapproval of his former footballer father Steve Mardenborough (Djimon Hounsou). Jann argues that racing cars is what he is good at, it's what he loves.One day, Jann learns he is eligible for a qualification race to join the GT Academy after setting a time record for a particular track. The night before his race, Jann is invited by his brother Coby to a party, and the brothers take their father's car. Jann flirts with a young woman named Audrey (Maeve Courtier-Lilley) whom he develops a crush on.\nThe gathering is disbanded after police arrive, and Jann initiates a pursuit after driving away when their friends are pulled over. The brothers escape but are caught returning by their father. Coby (Daniel Puig) starts to worry, but Jann offers to take the blame for him if he admits that he is the better driver. Jann is taken to his father's place of employment the next morning in an attempt to be taught a life lesson (Steve says that either Jann gets an education, or he joins Steve at the rail-yard since he has no other plans. Steve says that there is no future in racing), but leaves early to partake in the qualifying race, which he wins, earning a place in GT Academy.At the academy camp in Silverstone UK, Jack puts the competitors (Including Jann, Matty, Antonio, Frederick, Leah Vega (Emelia Hartford), Joo-Hwan Lee (Sang Heon Lee), Klaus Hoffman (Max Mundt), Henry Evas (Mariano González), Avi Bhatt (Harki Bhambra), Chloe McCormick (Lindsay Pattison), Marcel Durand (Théo Christine))through their paces in various tests, through which ten competitors are narrowed down to five.\nDuring one of which, Jann crashes with Jack in the car and claims the brakes were glazed, later proven correct by analysts, to Jack's surprise. The remaining five compete in a final race to determine who will represent Nissan. Jann narrowly wins the race against American competitor Matty Davis (Darren Barnet), but Danny insists Matty should be chosen as the representative due to his better commercial viability and due to Jann not being press ready and awkward in front of the camera. However, Jann is chosen at Jack's insistence.Jann is told that if he finishes at least fourth in any one of a series of qualifying races, he will earn a professional license and contract with Nissan. He finishes last in his first professional race in Austria after Nicholas taps him into a spin, and despite gradually improving over the next few races, he does not finish the penultimate race in Spain. He travels to Dubai for his last qualifying race, during which Nicholas takes a corner too fast and crashes. Despite the debris from this crash cracking his windshield, Jann achieves a fourth-place finish and earns his license. He then travels to Tokyo with Danny and Jack to sign his contract and uses his signing bonus to fly Audrey to Tokyo. During this time, they initiate a relationship.Jann's first race after signing is at the Nürburgring Nordschleife. He starts the race well and maintains a high position until the front of his car lifts into the air at the Flugplatz corner, hitting a barrier and launching into a crowded spectator area. Jann is airlifted to the Nürburgring Medical Center and is informed while in hospital that a spectator was killed in the crash, much to his horror. Reluctant to return to racing and blaming himself for the spectator's death, Jack takes him back to the Nürburgring, during which he reveals he was involved in a fatal accident at the 24 Hours of Le Mans, which led to a fellow driver dying and his retirement from driving.\nAn inquiry clears Jann of any wrongdoing, but professional sentiment begins to turn against sim drivers. In response, Danny decides a sim driver team should compete at Le Mans and finish on the podium to prove their viability.Danny enlists Matty and fellow GT Academy participant Antonio Cruz (Pepe Barroso) to make up the three-driver team alongside Jann. On race day, Jann's father apologizes for not initially being supportive of his passions. Early in the race, Jann is left shaken after Frederik Schulin's (Niall McShea) car crashes and catches fire, but is encouraged through his first shift by Jack playing \"Songbird\" and \"Orinoco Flow\" through the car's communication system, which Jann had previously used as motivational music during training.\nMatty and Antonio complete their first shifts without issue, but the latter is brought in from his last session early due to experiencing cramps. A wheel nut is dropped by mechanic Felix (Richard Cambridge) during the pit stop, causing Jann to lose several positions. He deviates from advised racing lines he learned from playing Gran Turismo to regain his positions, breaking the competition lap record in the process. The final lap sees Jann pitted against Nicholas, with Jann once again narrowly in front on the final straight to earn third place and a podium finish for Nissan.In the epilogue, the real Jann Mardenborough is shown having competed in over 200 races and served as his own stunt double in the film.",
	"links": [
		"https://www.amazon.com/Gran-Turismo-Based-Story-Bonus/dp/B0CC5JKYDB",
		"https://www.netflix.com/title/81672085"
	]
}