{
	"title": "Gifted",
	"release_year": "2017",
	"runtime": "101",
	"tags": [
		"Drama",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Chris Evans",
		"Mckenna Grace",
		"Lindsay Duncan",
		"Octavia Spencer",
		"Jenny Slate",
		"Michael Kendall Kaplan",
		"John M. Jackson",
		"Glenn Plummer",
		"John Finn",
		"Elizabeth Marvel"
	],
	"staff": [
		"Marc Webb",
		"Tom Flynn",
		"Andy Cohen",
		"Karen Lunder",
		"Rob Simonsen",
		"Stuart Dryburgh",
		"Bill Pankow",
		"David Rubin",
		"Laura Fox"
	],
	"votes": 133232,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjQ2NDU3NDE0M15BMl5BanBnXkFtZTgwMjA3OTg0MDI@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In St. Petersburg, Florida, seven-year-old Mary Adler (Mckenna Grace), a mathematical genius, lives with her uncle and De Facto guardian, Frank (Chris Evans). Her best friend is her 43-year-old neighbor, Roberta Taylor (Octavia Spencer). Frank, a former philosophy professor now boat mechanic, feels strongly that Mary should attend a normal elementary school so she can have a normal childhood.\nFrank tells Roberta that Mary needs to have a social life as she has almost no friends her own age.On her first day of first grade, she shows remarkable mathematical talent, which impresses her teacher, Bonnie Stevenson (Jenny Slate). Bonnie tries to ask Frank about it, but he tries to pass it off as the Trachtenberg system until Bonnie tricks Mary into completing a college math test and confronts Frank again. It emerges that Mary's mother, Diane, had been a promising mathematician, dedicated to the Navier-Stokes problem (one of the 7 unsolved Millennium Prize Problems) before committing suicide when Mary was six months old. Mary has lived with Frank ever since.\nFrank admits the truth to Bonnie. He says Diane was so socially awkward that she did not know how to differentiate good guys from the bad, and she had sex with Mary's biological father Bradley Pollard (Keir O'Donnell), who left her after a month. Frank says that their dad died when he was 8, and their mother turned her back on Diane when she was pregnant.Despite Mary's initial disdain for average children her own age and her boredom with their classwork, she begins to bond with them when she brings her one-eyed cat, Fred, for show-and-tell. Later, she defends a classmate Justin (Michael Kendall Kaplan) from a bully on the school bus, something that Frank is not concerned about. After the incident, the principal Mrs. Davis (Elizabeth Marvel), having discovered Mary's math talent, encourages Frank to send Mary to a private school for gifted children, offering the opportunity of a scholarship. However, Frank turns it down, based on his family's experiences with similar schools.\nFrank argues that Mary needs to live a normal life to become a decent human being and separating her from society is only going to aggravate her loneliness.The principal contacts Frank's estranged mother and Mary's maternal grandmother, Evelyn (Lindsay Duncan). Evelyn, a former mathematician herself, is of the opinion that people with capabilities such as Mary's have an obligation to use their talents to further help society and therefore feels that Mary should be specially tutored in preparation for a life devoted to mathematics, much as Diane was. But Frank is adamant that his sister would want Mary to be in a normal school and have the childhood she did not have. Evelyn later sues him for full custody.\nEvelyn says that Frank does not understand the price that one needs to pay for greatness. Frank blames Evelyn for Diane's suicide, but Evelyn retorts that Diane died as she could not solve the Navier-Stokes problem and she was mentally weak. Evelyn threatens to take Frank to court.The case goes to court. Bonnie reaches out to Frank and says that this is all on Mrs. Davis. They end up having sex. Evelyn gets visitation rights while the court decides the case, and she takes Mary to Boston for 2 days with her. Evelyn takes Mary to meet Seymour Shankland (Jon Sklaroff), the head of MIT's math department.\nShankland gives Mary a difficult problem to solve, which she cannot. This annoys Evelyn, but later Mary says that the problem was unsolvable as it was written wrong. Mary returns to Shankland's class and solves the problem by first correcting it.\nMary returns to Frank and says that she does not want to live with Evelyn as she is very bossy.Bradley appoints Evelyn as the legal guardian of Mary.\nWhile Evelyn is on the stand in court, it is revealed that not only did Evelyn home-school Diane, she kept her socially isolated, so that she could be completely focused on mathematics. When Diane and her teenage boyfriend ran away to a ski resort, Evelyn filed a lawsuit and threatened to charge him with kidnapping, forcing him to cut ties with Diane. She attempted suicide for the first time shortly after, something Evelyn argues was an isolated incident.\nEvelyn loses her temper on stand and says that Diane was a gifted person, and every gifted person has a duty to serve humanity and make the world a better place.When Frank takes the stand, he admits working at a low-paying job without health insurance. Evelyn's lawyer insinuates that Frank gave up his job as professor at Boston University and came to the little town, to work as a freelance boat mechanic, as she wanted to take revenge on Diane. Diane was gifted and he was not, so she got all the attention and Mary was his way of getting revenge. This is why Frank also refused the scholarship offered to Mary by her school.\nFrank says that Diane wanted Mary to have a normal childhood.\nHis lawyer, worried that the judge will side with Evelyn due to her having a better income, health plan and home, encourages Frank to consider taking a deal orchestrated by Evelyn's lawyer. Mary would be placed in foster care and attend the private school Evelyn wants to have her enrolled in. The foster parents live 25 minutes from Frank's home, he will be entitled to scheduled visits, and Mary will be able to decide where she wants to live after her 12th birthday.Mary is devastated at being placed in foster care and refuses to see Frank when he tries to visit. When Bonnie sees a picture of Fred up for adoption, she alerts Frank. He retrieves the cat from the pound moments before he is about to be put down and learns that Fred was brought in due to allergy issues in the home he was in. Frank realizes that Evelyn, who is allergic to cats, is overseeing Mary's education in the guest house of Mary's foster home.Frank goes to the foster home and, after reconciling with Mary, reveals to Evelyn that Diane had indeed completed the Navier-Stokes Problem, but left instructions for Frank not to publish the equation until after Evelyn's death, revealing Diane's deep resentment towards her mother.\nKnowing that it meant everything for her to see Diane solve the problem, Frank offers Evelyn the opportunity to publish Diane's work if she drops her custody case, to which she agrees. Mary is placed back in the custody of Frank, returning to public school and socializing with children her age while taking college-level courses.",
	"links": [
		"https://www.amazon.com/Gifted-Marc-Webb/dp/B071G9H7XT"
	]
}