{
	"title": "Patriots Day",
	"release_year": "2016",
	"runtime": "133",
	"tags": [
		"Action",
		"Crime",
		"Drama",
		"amazon",
		"netflix"
	],
	"rating": 7.3,
	"actors": [
		"Mark Wahlberg",
		"Michelle Monaghan",
		"J.K. Simmons",
		"John Goodman",
		"Dicky Eklund Jr.",
		"Michael Marchand",
		"Rhet Kidd",
		"Frank Czarnowski",
		"Chris O'Shea",
		"Rachel Brosnahan"
	],
	"staff": [
		"Peter Berg",
		"Peter Berg",
		"Matt Cook",
		"Joshua Zetumer",
		"Paul Tamasy",
		"Dorothy Aufiero",
		"Dylan Clark",
		"Stephen Levinson",
		"Hutch Parker",
		"Trent Reznor",
		"Atticus Ross",
		"Tobias A. Schliessler",
		"Gabriel Fleming",
		"Colby Parker Jr.",
		"Sheila Jaffe",
		"Angela Peri",
		"Tom Duffield"
	],
	"links": [
		"https://www.amazon.com/Patriots-Day-Mark-Wahlberg/dp/B01N0SONDM",
		"https://www.netflix.com/title/80117619"
	],
	"votes": 114591,
	"cover": "https://m.media-amazon.com/images/M/MV5BODYxMDc0NTg2Nl5BMl5BanBnXkFtZTgwNjY0NDYzOTE@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "On April 14, 2013, Boston Police Department Sergeant Tommy Saunders (Mark Wahlberg) captures a suspect and fails to convince Commissioner Davis to let him off from a punishment duty the next day, working in the Boston Marathon. The Marathon is being held on Patriot's Day.\nTommy was suspended from duty for a while, and he is working his way back into the department. Doing his beat duty is part of the rehabilitation process.The night before the marathon, people go about their daily lives. Police officer Sean Collier is dating Li (Lana Condor), a student at MIT. Li is working on creating autonomous robots.\nTommy's wife Carol (Michelle Monaghan) is a nurse.\nDun Meng is a Chinese start-up owner, who has just bought a new car to impress the girls. He is working on developing a custom food delivery application.On April 15, 2013, the marathon starts at 10 am from Hopkinton. Tommy is stationed at the finish line near the VIP section. Tommy wears a knee brace. Boston Police Superintendent William Evans (James Colby) is in attendance along with many other VIPs. This is the oldest running marathon in the United States.\nBrothers Dzhokhar (Alex Wolff) and Tamerlan Tsarnaev (Themo Melikidze) detonate two bombs during the Boston Marathon, causing widespread panic. The bomb were placed near the finish line in backpacks, and were detonated while the runners were already coming through to the finish line.\nA young couple, Patrick Downes (Christopher O'Shea) and Jessica Kensky (Rachel Brosnahan), are injured and taken to separate hospitals, where they are both required to have their legs amputated; the family man Steve Woolfenden (Dustin Tucker) is also injured and separated from his young son, Leo (Lucas Thor Kelley), who is rescued by the police and taken to a safe location.FBI agent Richard DesLauriers (Kevin Bacon) is assigned to investigate the bombings in collaboration with Boston police commissioner Ed Davis (John Goodman) and Watertown police sergeant Jeffrey Pugliese (J. K. Simmons), while Police Sergeant Tommy Saunders (Mark Wahlberg) searches for evidence and helps people that have been injured or separated from their loved ones in the chaos, including Patrick and Jessica as well as Steven and Leo.\nTommy gets the roads cleared and starts pushing in ambulances so that the injured can be evacuated and taken to the hospital. He shuts the race down, so that no more runners are reaching the finish line and interfering with the rescue efforts.DesLauriers is reluctant to label it a terrorist attack just yet, as that label has nationwide ramifications, including on the stock market. DesLauriers finds evidence of metal shards and nails at the blast site, indicating that it is a home-made bomb, and concludes that it is a terrorist attack.\nA command center is set up at the Black Falcon terminal.Tommy heads over to the hospital to interview the victims to try and find the identity of the bombers.\nFBI analysts review footage of the bombing and notice and notice that one person looks away from the blast just at the moment of the explosion. The footage is grainy, so with the help of Tommy, FBI traces the steps of the suspect and get them on different security cameras with a better angle and a better resolution.\nThe FBI identify Dzhokhar and Tamerlan as suspects, but DesLauriers is reluctant to release their pictures to the public without further evidence. Tommy argues that the city of Boston wants to help when it comes to terrorism. He advocates the release of the photos.\nDesLauriers hand is forced when the pictures are leaked to the press, while Pugliese's men begin conducting door-to-door searches for the pair.\nDzhokhar's university friends Aza (Jin Yang Brancalhao) & Dias (Elijah Guo) identify him from the pictures, but do not report anything to the police. Instead, they head over to Dzhokhar's room to pack up his personal belongings. They find bomb making materials in his closet. It has been 78 hours since the blast.Attempting to lie low, Dzhokhar and Tamerlan kill Massachusetts Institute of Technology Police Department officer Sean Collier (Jake Picking) in a failed attempt to steal his sidearm and then carjack student Dun Meng (Jimmy O. Yang), telling him of their plans to conduct another bombing in New York City.\nWhile Dzhokhar visits a gas station convenience store, Meng quickly escapes the car and run to another gas station so that he can call the police; the brothers flee in the stolen car.Saunders arrives at the scene, learns of the brothers' plan from Meng and is given the stolen car's GPS tracker code, leading police to the pair, which leads to an epic shootout.\nThe ensuing shootout sees several officers injured, while Tamerlan is shot by Pugliese and run over by Dzhokhar (when he tries to escape), killing him. Dzhokhar escapes in the chaos.Meanwhile, Tamerlan's wife Katherine Russell (Melissa Benoist) and Dzhokhar's college friends are later detained by the FBI Hostage Rescue Team and questioned by the High-Value Interrogation Group. Katherine refuses to disclose any knowledge of her husband's illegal activities, while Dzhokhar's friends appear oblivious to his plans, despite having earlier found bomb components in his possessions & his room.A local man named David Henneberry later finds Dzhokhar hiding under the sheets of his boat and calls the police. Dzhokhar is quickly surrounded and arrested after a brief standoff, as Saunders and his colleagues celebrate. The Boston police are invited to attend a Boston Red Sox game, where David Ortiz thanks them for their heroism and telling them to \"stay strong\".Dzhokhar was convicted on thirty counts and sentenced to death by lethal injection and is currently waiting for his appeal in federal prison; his college friends were arrested for obstructing the investigation and Russell is still under investigation for her possible involvement. The authorities responsible for the investigation and the survivors of the bombing then give statements celebrating Boston's newfound sense of unity."
}