{
	"title": "Maze Runner: The Death Cure",
	"release_year": "2018",
	"runtime": "143",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Dylan O'Brien",
		"Ki Hong Lee",
		"Kaya Scodelario",
		"Thomas Brodie-Sangster",
		"Dexter Darden",
		"Will Poulter",
		"Jacob Lofland",
		"Rosa Salazar",
		"Giancarlo Esposito",
		"Patricia Clarkson"
	],
	"staff": [
		"Wes Ball",
		"T.S. Nowlin",
		"James Dashner",
		"Wes Ball",
		"Marty Bowen",
		"Wyck Godfrey",
		"Ellen Goldsmith-Vein",
		"John Paesano",
		"Gyula Pados",
		"Paul Harb",
		"Dan Zimmerman",
		"Denise Chamian",
		"Daniel T. Dorrance"
	],
	"votes": 169279,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTYyNzk3MDc2NF5BMl5BanBnXkFtZTgwMDk3OTM1NDM@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Thomas (Dylan O'Brien), Newt (Thomas Brodie-Sangster), and Frypan (Dexter Darden) are the last of the free \"Gladers\" immune to the Flare virus that has ravaged the world's population. They and The Right Arm resistance conduct a rescue operation where they retrieve other Immunes from a train, which is owned by WCKD, an organization responsible for capturing and experimenting on immune children. They discover that Minho (Ki Hong Lee), their remaining Glader friend whom WCKD had captured, was not on that train, which is headed to \"The Last City\", WCKD's base of operations. Against the orders of Vince (Barry Pepper), leader of The Right Arm, the three leave their camp to rescue Minho, who is being tortured by WCKD in hopes of developing a cure for the virus. Heading for the Last City, the group is attacked by Cranks, humans infected with the Flare. However, they are saved by Jorge (Giancarlo Esposito) and Brenda (Rosa Salazar), who join them.The group makes it to the wall of the Last City, which protects the city from Cranks. Outside the wall, people are rallying in protest to be let into the city. When WCKD opens fire at the protesters, the group is captured by a contingent of masked men and are taken to a hideout. One of the masked men is revealed to be Gally (Will Poulter), who has survived Minho's attack at the end of The Maze Runner (The first movie). Gally takes them to see Lawrence (Walton Goggins), a rebellion leader (who is infected with the virus but has a personal stash of the antidote (old version) which is barely keeping him alive) for those outside the walls, who helps them enter the Last City through a secret entrance. Gally leads Thomas and Newt through to the city and, spotting Teresa (Kaya Scodelario), Gally tells Thomas that she can get them into WCKD headquarters. Newt then confides to Thomas that he is infected. Promising to cure him, the three capture Teresa.Inside the WCKD HQ, Teresa uses Minho blood to cure a Flare, but fails. Ava confides in Janson that the virus is now airborne and inside the city walls. The serum was their last hope and now its gone. There are 28 Immunes in their captivity, including MInho.Thomas, Newt, and Gally escort Teresa inside WCKD headquarters and toward the location of the Immunes. Gally looks after the Immune children and stays to find a serum that slows the Flare, while Thomas, Newt, and Teresa go to find Minho. They are discovered and chased by Janson (Aidan Gillen). Teresa lets them escape to find Minho before rushing to do a blood test on Thomas' blood, which she obtained when removing trackers from the Gladers.Having delivered the Immune children and the serum to Brenda, Gally returns to WCKD headquarters to find Thomas. Brenda is forced to flee with the Immune children to avoid capture. Thomas and Newt reunite with Minho in the medical wing. Teresa discovers that Thomas' blood can cure the Flare. She shares her discovery with WCKD's leader, Ava Paige (Patricia Clarkson), both agreeing that they must find Thomas. Brenda and the Immune children escape WCKD with Frypan's help. Meanwhile, Lawrence rallies his rebels outside the city before blowing a hole in the city wall, sacrificing himself to allow his allies and the infected people to storm the city. Gally finds Thomas, Minho, and Newt. Newt, sending Minho and Gally ahead to get the serum from Brenda, gives Thomas a pendant before passing out. Teresa transmits her voice throughout the city, telling Thomas that his blood can save Newt if he will only return to WCKD. Newt, nearly consumed by the Flare, regains consciousness and attacks Thomas, while begging Thomas to kill him. When Thomas will not, Newt-left with no other option-stabs himself.Thomas makes his way back to WCKD and confronts Ava. However, she is killed by Janson, who is infected by the Flare. Janson knocks Thomas out and drags him to a lab where Teresa is ready to extract his blood. However, he reveals that he is only truly interested in curing himself, which results in Teresa turning on him. After a fight, Janson is killed, allowing Thomas and Teresa to escape to the rooftop, where Teresa gives Thomas a vial with the cure. Their allies suddenly appear in an aircraft: Thomas makes it aboard, but Teresa dies when the headquarters collapses in on itself.\nThe group reunites with the rest of the Immunes and The Right Arm, escaping to a safe haven, where the remaining population can live in safety. There, Thomas discovers that the pendant Newt gave him had a note in it. Still traumatized by his friends' deaths, he reads the note, in which Newt tells him to look after everyone.",
	"links": [
		"https://www.amazon.com/Maze-Runner-Death-Dylan-OBrien/dp/B07981P2YW"
	]
}