{
	"title": "Darkest Hour",
	"release_year": "2017",
	"runtime": "125",
	"tags": [
		"Drama",
		"War",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Gary Oldman",
		"Lily James",
		"Kristin Scott Thomas",
		"Ben Mendelsohn",
		"Ronald Pickup",
		"Stephen Dillane",
		"Nicholas Jones",
		"Samuel West",
		"David Schofield",
		"Richard Lumsden"
	],
	"staff": [
		"Joe Wright",
		"Anthony McCarten",
		"Tim Bevan",
		"Lisa Bruce",
		"Eric Fellner",
		"Anthony McCarten",
		"Dario Marianelli",
		"Bruno Delbonnel",
		"Valerio Bonelli",
		"Jina Jay",
		"Sarah Greenwood"
	],
	"votes": 223847,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjIyNDkyMTgzMV5BMl5BanBnXkFtZTgwNTQwNjg2MzI@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In May 1940 Britain and France are Allies in World War II against Nazi Germany. Hitler has already invaded Czechoslovakia, Poland, Denmark and Norway. 3 million German troops are poised on the Belgian border. Hitler wants to conquer the rest of Europe.Before the German invasions of Belgium and the Netherlands, the Opposition Labor Party in Parliament demands the resignation of British Prime Minister Neville Chamberlain (Ronald Pickup) for being too weak to protect national security. The Parliament holds Chamberlain and his years of inaction to be responsible for Britain's unpreparedness to face Nazi Germany. Chamberlain is considered to be a fit leader for wartime Britain.Chamberlain tells Conservative Party advisers that he wants Lord Halifax (Stephen Dillane) as his successor, but Halifax does not want to become Prime Minister because he is a member of the House of Lords. Chamberlain must choose the only other man whom other parties will support: Winston Churchill (Gary Oldman), the First Lord of the Admiralty.On her first day at work Churchill's new secretary Elizabeth Layton (Lily James) quickly upsets him by failing to follow his instructions. After Churchill causes Layton to cry and almost quit, his wife Clementine (Kristin Scott Thomas) rebukes him, reminding him that as Prime Minister he will have to be nicer to others. On 10th May, King George VI (Ben Mendelsohn) reluctantly invites Churchill to form a government including Chamberlain and Halifax but secretly wants his friend Halifax as Prime Minister. Churchill's history is littered with catastrophes.Although he was right about the danger from Adolf Hitler, Churchill has a poor reputation from the Gallipoli Campaign (25,000 troops dead), his opposition to Indian self-government and his support for Edward VIII during the Abdication Crisis, Russian Civil War, the Gold Standard. He lost 1800 troops, 1 aircraft carrier. 2 cruisers, 7 destroyers and a submarine in the recent defense of Norway.\nAnthony Eden (Samuel West) is among his few political friends; other Conservatives remember Churchill twice crossing the floor.\nChurchill forms his war cabinet, including Churchill himself, Chamberlain, Viscount Halifax, Clement Attlee (David Schofield).\nBy 13th May, Germany had invaded France and crossed the river Meuse in 24 hours.Parliament dislikes the new Prime Minister's first speech promising \"Blood, toil, tears and sweat\" and Churchill refuses to negotiate for peace.\nHalifax and Chamberlain agree, keen to use Italian Ambassador Giuseppe Bastianini as intermediary to negotiate with Germany. During the May 1940 War Cabinet crisis, they plan to resign from the government if Churchill refuses, causing a vote of no confidence that will allow Halifax to become Prime Minister.The British Expeditionary Force is trapped at Dunkirk and Calais. There is no air cover for the troops as Britain wants to save its remaining fighter planes for its own defense. The navy sits idle as it is neutralized against enemy air strikes. The French army has capitulated. Churchill travels to France to motivate the French to fight.\nChurchill believes that the Germans are untrustworthy, but the French Prime Minister thinks him delusional for not admitting that the Allies are losing the Battle of France. Churchill believes that as long as the Panzer tanks are not supported by ground troops, they can be defeated.On 19th May, Churchill address the nation and says that the British and French armies are winning against Germany, when they are in full retreat. Clementine says that people need hope, and there will be enough time for truth. But the King calls Churchill and asks him not to mislead the nation.On 25th May, against the advice of the War Cabinet, Churchill orders Brigadier Claude Nicholson (Richard Glove) in Calais to lead the 30th Infantry Brigade (of 4000 men) in a suicide attack to distract the enemy while the soldiers at Dunkirk are evacuated in Operation Dynamo.\nChurchill sends a telegram to Nicholson stating that the forces at Calais will not be rescued, and that every hour his troops fight on, gives Britain an extra hour to rescue their men at Dunkirk.Halifax wants Churchill to commit on paper that he will not consider a peace proposal with Germany before sacrificing the lives of 4000 young British men. Churchill speaks to Halifax and Chamberlain alone and contests that Germany would have to invade Britain to annex it and they need an army. He says that Hitler will never accept a peace proposal if Britain has no means to defend itself.The Little Ships of Britain under the command of Admiral Ramsey (David Bamber) are ordered to rescue 300,000 British soldiers, but Belgium surrenders, France will soon surrender, a German invasion of Britain seems inevitable, and U.S. President Franklin D. Roosevelt (Samuel West) cannot help because of the Neutrality Acts of 1930s. Churchill spoke to Roosevelt over the hot line and had asked for 50 older US destroyers, which Roosevelt refuses. Roosevelt also refuses to hand over the P-40 planes that Britain paid for. The best Roosevelt offers is to take the planes to the Canadian border, but the British would have to somehow push them over the border without using any motorized vehicle.On 26th May, the defeat in France causes the War Cabinet to support negotiating with Germany; even Eden declines to speak up in Churchill's favor. Halifax argues that Churchill has a romantic fantasy of \"Fighting till the end\", which will only lead to destruction of everything. He says that peace talks should start before the forces are wiped out completely.\nChurchill wants to hold out till Germany has made an unsuccessful attempt to invade Britain. He wants to negotiate from a position of strength. Chamberlain argues that the army is about to be wiped out, and hence terms should be struck immediately.\nChurchill reluctantly allows Halifax to speak to Bastianini and authorizes a draft peace document.On 27th May, George VI unexpectedly visits Churchill. Churchill says that there is no support in the war cabinet for a campaign of resistance. He is preparing to address the Parliament accordingly. The King, not wanting to flee to Canada and rule in exile should Britain be invaded, encourages the Prime Minister to continue the war. Churchill knows that he has no support in his own party for war, and hence is forced to sue for peace. George asks Churchill to go to the people and seek their view.On 28th May, Admiral Ramsey launches the sea rescue of the soldiers at Dunkirk and is successful beyond the most enthusiastic odds.\nStill uncertain of what to do, Churchill suddenly decides to ask London Underground passengers about the war; the civilians reject negotiations and want to continue to fight the Germans.\nChurchill misses the war cabinet meeting where the peace document created by Halifax is discussed.\nChurchill meets with the Outer Cabinet and other members of Parliament, who also support him.Churchill now goes to the war cabinet puts a stop to all plans of a negotiated peace.\nWith Layton's help, Churchill prepares to address Parliament, while Halifax demands that an increasingly reluctant Chamberlain continue their plan to depose him. Towards the end of his speech, Churchill proclaims that \"We shall fight on the beaches\" should the Germans invade. Chamberlain decides to forgo the plan and the room, including Eden and other Conservatives, applauds the Prime Minister's defiance. Satisfied, Churchill departs.The film's end-credits begin with a worded summary that Chamberlain dies six months later from cancer and Halifax is sent away to become the Ambassador to the United States, and that Churchill is Prime Minister in May 1945 when the Allies achieve victory over Germany but loses the General Election in July.",
	"links": [
		"https://www.amazon.com/Darkest-Hour-Gary-Oldman/dp/B078R5T25R"
	]
}