{
	"title": "Kingsman: The Golden Circle",
	"release_year": "2017",
	"runtime": "141",
	"tags": [
		"Action",
		"Adventure",
		"Comedy",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Taron Egerton",
		"Colin Firth",
		"Mark Strong",
		"Channing Tatum",
		"Edward Holcroft",
		"Gordon Alexander",
		"Hanna Alström",
		"Calvin Demba",
		"Thomas Turgoose",
		"Tobi Bakare"
	],
	"staff": [
		"Matthew Vaughn",
		"Jane Goldman",
		"Matthew Vaughn",
		"Mark Millar",
		"Dave Gibbons",
		"Adam Bohling",
		"David Reid",
		"Matthew Vaughn",
		"Henry Jackman",
		"Matthew Margeson",
		"George Richmond",
		"Eddie Hamilton",
		"Reg Poerscout-Edgerton",
		"Darren Gilford"
	],
	"votes": 371669,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjQ3OTgzMzY4NF5BMl5BanBnXkFtZTgwOTc4OTQyMzI@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "A year has passed since Eggsy Unwin (Taron Egerton) and the secret organization Kingsman saved the world from Richmond Valentine's neurological wave broadcast. He has since taken his late mentor Harry Hart's (Colin Firth) title of Galahad and lives with Crown Princess Tilde of Sweden (Hanna Alstrom). On his way home he is ambushed by Charlie Hesketh (Edward Holcroft), a former Kingsman trainee who lost his arm and vocal cords during the Valentine incident. Eggsy evades Charlie and his henchmen in a car chase across London, but Charlie's severed cybernetic arm hacks into the Kingsman servers through the car's computer system.Lancelot (Sophie Cookson) reveals that Charlie's associates during the chase (whom Eggsy killed), all had their teeth filed, fingerprints removed and had a golden circle tattooed on this chest. Her speculation is that they are dealing with a mafia org.\nWhile Eggsy is away in Sweden, a volley of missiles destroys the Kingsman headquarters and wipe out all of the agents in Britain.Being the only surviving agents, Eggsy and Merlin (Mark Strong) follow the Doomsday protocol, which leads them to Statesman, a secret American organization posing as a Bourbon whiskey distillery in Kentucky. There, they discover that Harry survived Valentine's gunshot a year earlier but is suffering from amnesia. Eggsy and Merlin are briefed by Statesman head Champagne (Jeff Bridges) about a secret terrorist organization called The Golden Circle. They begin their mission by following Charlie's ex-girlfriend Clara Von Gluckfberg (Poppy Delevingne). When Statesman agent Tequila (Channing Tatum) develops blue rashes, he is replaced by agent Whiskey (Pedro Pascal) as Eggsy's partner. At the Glastonbury Festival, Eggsy manages to plant a tracking device inside Clara, but his revelation of the mission to Princess Tilde strains their relationship. After several failed attempts to cure Harry's amnesia, Eggsy triggers Harry's memories by threatening to shoot a Cairn Terrier that resembles Harry's late dog.Poppy Adams (Julianne Moore), head of world's largest drug cartel (& head of the Golden Circle), broadcasts a message telling the world about a toxin she laced within every recreational drug available, which causes users to develop blue rashes before progressing through mania, paralysis, and ultimately, death. She also demonstrates the antidote on a captive Elton John and offers it to the world if the President of the United States (Bruce Greenwood) ends his country's War on Drugs and offers her organization immunity.The President believes that this is a brilliant plan to get rid of the planet of all criminal elements & decides to pretend to cooperate with Poppy, but is reality decides to have every affected user quarantined so that they die in custody, including his Chief of Staff, Fox (Emily Watson). Eggsy, Harry, and Whiskey head to the antidote factory in Italy after intercepting a phone call to Charlie by Clara. Eggsy manages to steal an antidote sample, but it is broken by Whiskey during an ambush by The Golden Circle's henchmen. During the gunfight, Harry shoots Whiskey in the head, as he suspects that Whiskey is playing both sides, but Eggsy saves him with the same alpha-gel that Statesman had used to save Harry.Princess Tilde calls Eggsy in a state of mania, revealing that she has been affected by the blue rash. Eggsy, Harry, and Merlin discover the location of Poppy's hideout, \"Poppy Land\", in Cambodia and fly there to steal the remote control which deploys the antidote drones.Upon their arrival at Poppy Land, Eggsy steps on a land mine, but is saved by Merlin, who sacrifices himself while taking the lair's guards with him. Eggsy and Harry storm through the lair and Eggsy kills Charlie while Harry destroys Poppy's robotic attack dogs with the help of Elton.They secure the briefcase with the access code to the drones and inject Poppy with a more potent dose of her toxin. She gives them the password before succumbing to an overdose. Before they can activate the drones, they are stopped by Whiskey, who, having previously lost his wife to crossfire from two methamphetamine users, is revealed to be working alone to ensure that all drug users are eliminated. Eggsy and Harry battle and brutally kill Whiskey in a fight. They release the antidote drones, saving millions of lives around the world.In the aftermath, Chief of Staff Fox has the President impeached for conspiring to commit genocide on the drug victims. Champ announces that Statesman has acquired a distillery in Scotland to help rebuild Kingsman.\nTo avoid the confusion of two Kingsman agents using the code-name \"Galahad\", Champagne offers either Eggsy or Harry the agent title of Whiskey, but they decline and Statesman tech support Ginger Ale (Halle Berry) steps in to take the role. Eggsy marries Princess Tilde, and Tequila moves to London to work for Kingsman.",
	"links": [
		"https://www.amazon.com/Kingsman-Golden-Circle-Colin-Firth/dp/B075SM8KDQ"
	]
}