{
	"title": "The Fate of the Furious",
	"release_year": "2017",
	"runtime": "136",
	"tags": [
		"Action",
		"Crime",
		"Thriller",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Vin Diesel",
		"Jason Statham",
		"Dwayne Johnson",
		"Michelle Rodriguez",
		"Tyrese Gibson",
		"Ludacris",
		"Charlize Theron",
		"Kurt Russell",
		"Nathalie Emmanuel",
		"Luke Evans"
	],
	"staff": [
		"F. Gary Gray",
		"Gary Scott Thompson",
		"Chris Morgan",
		"Vin Diesel",
		"Michael Fottrell",
		"Chris Morgan",
		"Neal H. Moritz",
		"Brian Tyler",
		"Stephen F. Windon",
		"Paul Rubell",
		"Christian Wagner",
		"Christopher Gray",
		"Jeffrey Karantza",
		"John Papsidera",
		"Bill Brzeski"
	],
	"votes": 257647,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjMxODI2NDM5Nl5BMl5BanBnXkFtZTgwNjgzOTk1MTI@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "This eighth 'Fast & Furious' film opens in Havana, Cuba where Dominic \"Dom\" Toretto (Vin Diesel) and Letty (Michelle Rodriguez) are celebrating their honeymoon. They are checking out a car that has a boat engine in it when Dom's cousin Fernando (Janmarco Santiago) is getting his car towed by a guy named Raldo (Celestino Cornielle). Fernando tries to talk Raldo out of towing the car, but he reminds Fernando how much he owes to get it. Dom then steps in to defend his cousin and gets upset when Raldo talks back to Letty. Dom challenges Raldo to a street race - if he wins, he gets Raldo's car, but if Raldo wins, he gets Dom's nice low-rider Impala. Raldo agrees.Dom strips off the fenders and seats in Fernando's car to reduce weight and adds Nitrous Oxide (NOx). He races Raldo in Fernando's car in downtown Havana. The two go down the Cuban Mile, with Raldo outrunning Dom until Toretto hits the NOx and sends the car soaring through the streets. One of Raldo's guys tries to sabotage Dom by throwing his motorcycle in front of the car, but Dom continues to ride. However, the engine catches fire and only gets hotter the faster Dom goes. Dom spins and drives in reverse and manages to cross the finish line first, and jumps out of the burning car as it flies into the harbour by the Maracon. The crowd of people surrounds Dom and Raldo as they step up to each other. Raldo takes out his keys to the car and offers it to Dom, along with his respect. Dom tells Raldo to keep his car, as his respect is good enough. Dom apologizes to Fernando about the car and tosses him the keys to his Impala, which, according to Dom, is more fit for a Toretto. The crowd cheers.Later, Dom is going around town when he notices a mysterious blonde American woman named Cipher (Charlize Theron) trying to fix something in her car. Dom helps out, but Cipher then addresses Dom by name. He knows something is up, and she tells him she wants him to work for her. He initially refuses until she takes out a phone and shows Dom something that changes his mind instantly.We cut to Hobbs (Dwayne Johnson) giving a rousing speech to a highly-trained team of... girl soccer players. He is coaching his daughter's team and is trying to get them amped as they go up against the opposing team. They do the Polynesian Haka dance to frighten the other team. An agent, DS Allan (Patrick St. Esprit), approaches Hobbs and tells him about an EMP device in Berlin that has been detected with the potential to take out the power grid of entire cities. Hobbs agrees to the job, but only after his daughter scores a goal. He later calls Dom to round up the team for the job.Dom and Hobbs go to Berlin with Letty, Tej (Ludacris), Roman (Tyrese Gibson), and Ramsey (Nathalie Emmanuel). They quickly get the EMP in their possession and now have a number of goons on their tail. They take them out with a huge wrecking ball that Tej helped set up. When they get far enough, they split up. Hobbs rides next to Dom and thanks him for the help, promising beers when this is over. Dom doesn't say a word but then slams into Hobbs' truck, causing him to crash. Dom takes the EMP and leaves Hobbs to get arrested. Hobbs informs the others that Dom has gone rogue. Dom drives his car into a large jet that does a touch and go landing and briefly opens the rear cargo ramp.Before being taken to his cell, Hobbs meets with Agent Frank Petty, AKA \"Mr. Nobody\" (Kurt Russell), and his new partner, Eric Reisner, who is later nicknamed \"Little Nobody\" (Scott Eastwood). Mr. Nobody offers a job but not a clean record, but Hobbs doesn't quite trust him and thinks he can get out by due process. When Little Nobody mentions Hobbs' daughter, Hobbs holds the guy against the wall until Mr. Nobody calms him down. Hobbs is locked up in the same maximum security prison as Deckard Shaw (Jason Statham), with their cells right across from each other. The two continuously taunt each other.Meanwhile, the rest of the crew is hiding out at a garage, still in disbelief that Dom betrayed them. When Ramsey questions Dom's loyalty, Letty sticks up for him and reminds her that if it wasn't for him, she wouldn't be alive.In prison, Hobbs and Deckard exchange banter before Mr. Nobody has Hobbs's cell door open automatically. The guards come in to put Hobbs back, then in the confusion Deckard grabs one guard and uses his baton to escape from his own cell before freeing all the other prisoners. Hobbs and Deckard make a run for it, fighting off both guards and inmates. The two make it outside and are about to fight each other when they are met by a grinning Mr. Nobody and his armed men.Hobbs and Deckard join the rest of the crew at Nobody's HQ. Mr. Nobody informs Deckard and the team about a few details, including that Owen Shaw (Luke Evans), Deckard's brotheris not dead but locked up in an undisclosed prison. They are also briefed on the mysterious woman known as Cipher. Deckard knows her because she recruited his brother Owen to steal the Nightshade after he himself had turned her down, and was also involved in getting Mose Jakande to steal The God's Eye surveillance system. Since Dom foiled both those plans, it makes sense that she would go after him directly. Letty recognizes Cipher's henchman Connor Rhodes (Kristofer Hivju) from her days working with Owen. Cipher is known to fly around in a large command and control jet and can evade radar. Roman suggests they use God's Eye to locate Dom. When Ramsey tries to do so, they get hit with signals from all around the globe. With Tej, she removes the fake pings, they are left with one location - the very building they are standing in. An explosion goes off and knocks everyone down. Dom and Cipher come in and steal the God's Eye circuit board. As they are walking away, Letty calls Dom out and asks if he's really going to turn his back on his family. Dom doesn't say a word, but Cipher walks up to him and French kisses him in front of Letty and they walk out together.Back in the big jet, Dom asks Cipher why she kissed him. She says it is all about the choices they make, and he did not choose to turn her away even with Letty watching. The real reason Dom is working with her: she is keeping his former flame/Hobbs's ex-partner Elena (Elsa Pataky) prisoner, along with the son that Dom never knew about. Both are locked behind a clear partition. Elena takes the little boy out and says she calls him Marcus, but that's just his middle name as she wanted Dom to pick his first name. Rhodes then brings Cipher a gun, which she hands to Dom and gives him the choice of shooting her, but first warns him that they are being watched, and if he pulls the trigger, her men will storm in with orders to kill his son first. Dom clearly has no choice but to hand the gun back to Cipher. He tears up and places his crucifix on the cell wall.Back at the HQ, Hobbs finds out Deckard is actually a former British Army Captain who had been awarded the Victoria Cross, Britain's highest honor, the two become friends. Deckard finds some info on a laptop that points to New York.Cipher's next mission for Dom has him go to New York to pick up a briefcase with launch codes from a Russian ambassador. Dom makes a stop when he tells Cipher his motor is acting up. Knowing she has eyes on him, he manages to obscure himself in the right spot while he goes to visit Magdalene Shaw (Helen Mirren), mother of Owen and Deckard. Despite knowing what Dom did to both her sons, he approaches her with a request for help, appealing to her as a parent. Dom makes it back to the car before Cipher realizes what he did.The crew goes after Dom in the city. Cipher and her men hack into almost every car in the city and take control of them, causing them all to drive themselves and crash into other cars. She even makes cars drive themselves out of high parking garages so the car can come falling to the ground, sending the people into a frenzy. This stops the ambassador's limo so Dom can take the briefcase. He threatens to blow the limo up unless they hand it over, which they do. The crew catches up to Dom and after a wild car chase they try to take him in using hooks. Dom manages to pull them all off and evade them. When confronted by Deckard, he shoots him dead in front of Hobbs and Letty who are in shock. Letty goes after Dom herself and tries to remind him that he loves her. She grabs the briefcase and tries to get away, with Dom hesitating to go after her. Rhodes catches Letty and almost shoots her until Dom holds his gun up to Rhodes. Letty lets go of the briefcase, and Dom and Rhodes get away.Upon returning to the command jet, Cipher expresses disappointment at Dom nearly letting Letty get away. She is holding Marcus in her arms menacingly while Elena is tied up and has tape over her mouth. Dom is helpless as he watches Rhodes execute Elena in cold blood, and Marcus starts crying upon hearing loud gunfire.With the nuclear launch codes Mr. Nobody suspects Cipher will want a missile, the team deduce that a Russian separatist group in Siberia who have a Russian ICBM sub is the likely next target. The crew heads on over with cars given to them by Mr. and Little Nobody. Meanwhile Dom approaches the separatist base in another high powered car and uses the EMP to take out security then gets to the submarine to let Cipher hack into it.In the air, two men wearing jet-powered flying suits manage to lower the ramp and enter Cypher's big jet. These men are Owen and Deckard Shaw, alive and well. While Ramsey and Cipher have a fast and furious keyboard exchange as each tries to get control of the sub and the missile, Letty and Hobbs fight off goons in the Control Centre. Cipher wins the hacking battle and locks out Ramsey before setting the missile on countdown to launch.At the sub, Roman and Reisner frantically look to stop the missile launch as Tej is separated by a locked hatch. They manage to pull a circuit board with 4 seconds to go. Cipher is furious and now drives the sub by remote control out to sea. Hobbs and Ramsey see there is a submarine gate 10 kms away and the team races toward it over the icy harbor.Meanwhile, Dom is intently staring at his cell phone, awaiting a signal. It is then revealed through flashbacks that Dom made a deal with Magdalene Shaw to give her back her two sons in exchange for protecting his. He had help from Raldo in keeping hidden from Cipher during their meeting. He then faked Deckard's death so he could be picked up by Leo and Santos (Tego Calderon and Don Omar) before Magdalene revived Deckard herself. Magdalene then insisted that the brothers work together on the next part of the plan.The brothers go through the plane and take out the villains while Deckard safely recovers Marcus. He sends a message to Dom on his cell phone that his son is now safe. Rhodes is ready to shoot at the crew, until Dom steps out and starts fighting him. Dom slams Rhodes down onto his car and breaks his neck in retribution for trying to kill Letty. He also lets Cipher know that his son is safe and that he's going after her.Cipher takes control of the sub as her henchmen go after the crew. Roman, who took a Lamborghini Murcielago, starts to slide down into the icy water. Tej gets him out by hooking onto the front door and pulling Roman out. Roman uses the door as a shield to slam the villains riding in on snowmobiles before shooting them. He gets picked up by Hobbs. Cipher then launches torpedoes from the sub at the crew. Hobbs steps out and manages to move the torpedo with his own hands and send it at one of the villains' vans. Cipher then launches a heat-seeking missile at the crew. Dom comes to the rescue, slamming into one of the henchmen vans and causing it to fire missiles at the other goons, letting the crew know that Dom is back. Dom has them split up as the heat-seeking missile focuses on him and ride it back toward the sub. He jumps the car over the sub and causes the missile to hit the sub, blowing it up spectacularly. Dom jumps out of his car as it burns. The explosion nearly hits him until the crew rides in and shields Dom from the flames.As this happens, Deckard finds a disappointed Cipher in her plane after she finds out her sub is destroyed. Deckard reveals Dom's crucifix was actually a homing beacon. She jumps out of the plane with a parachute and forces Deckard to stay behind as he catches Marcus before he falls out of the plane. Dom and Letty then reunite and kiss.Dom and the crew return home to New York, now a whole family once again for a rooftop barbeque. Mr. Nobody tells Hobbs that Cipher is still on the loose and was rumored to be spotted in Athens. He and Little Nobody offer Hobbs his shield and job back, but he decides he wants to take a break and spend more time with his daughter. Deckard then arrives and brings Marcus to Dom. The two have a newfound respect for each other. With everyone seated at the table for supper, Dom introduces his son to everyone with his official first name: Brian. Dom then sits down to say grace.",
	"links": [
		"https://www.amazon.com/Fate-Furious-Vin-Diesel/dp/B06ZXRG946"
	]
}