{
	"title": "Bumblebee",
	"release_year": "2018",
	"runtime": "114",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Hailee Steinfeld",
		"Jorge Lendeborg Jr.",
		"John Cena",
		"Jason Drucker",
		"Pamela Adlon",
		"Stephen Schneider",
		"Ricardo Hoyos",
		"John Ortiz",
		"Glynn Turman",
		"Len Cariou"
	],
	"staff": [
		"Travis Knight",
		"Christina Hodson",
		"Michael Bay",
		"Tom DeSanto",
		"Lorenzo di Bonaventura",
		"Don Murphy",
		"Dario Marianelli",
		"Enrique Chediak",
		"Paul Rubell",
		"Denise Chamian",
		"Sean Haworth"
	],
	"votes": 192041,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjUwNjU5NDMyNF5BMl5BanBnXkFtZTgwNzgxNjM2NzM@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "On Cybertron, the Autobot resistance, led by Optimus Prime (Peter Cullen), are on the verge of losing the civil war with the Decepticons and prepare to evacuate the planet. A Decepticon force, led by Soundwave (Jon Bailey) (a Decepticon scientist) and Shockwave (Jon Bailey) (Decepticon communications officer, who houses his minion Ravage in his chest), intercept them during the evacuation, and Optimus sends Autobot scout B-127 to Earth on an escape pod in order to set up a base of operations where the Autobots can regroup. However, Decepticon seekers Starscream, Thundercracker, and Skywarp destroy the launch pad during the escape.In 1987, B-127 (Dylan O'Brien) reaches Earth alone, crash-landing in California and disrupting a training exercise by Sector 7, a secret government agency that monitors extraterrestrial activity on Earth. Colonel Jack Burns (John Cena) (Agent of sector 7) presumes B-127 to be a hostile invader and attacks, driving B-127 into the forest, where the Decepticon Blitzwing (David Sobolov) (a Decepticon who transforms into a red/white McDonnell Douglas F-4 Phantom II and is responsible for damaging Bumblebee's voice box) ambushes him. When B-127 refuses to reveal Optimus's whereabouts, Blitzwing tears out his voice box and damages his memory core; despite this, B-127 kills Blitzwing. Before collapsing from his injuries, B-127 scans a nearby 1967 Volkswagen Beetle.Meanwhile, teenage girl Charlie Watson (Hailee Steinfeld) remains traumatized by the death of her father, and resentful of her mother Sally (Pamela Adlon) for remarrying. Charlie finds a yellow Volkswagen Beetle in a scrapyard belonging to Hank (Len Cariou) (junkyard owner), who gives it to her as an 18th birthday present. Charlie unknowingly activates a homing signal that is detected by Decepticons Shatter (Angela Bassett) (a Decepticon triple-changer who transforms into a red Plymouth GTX and a Harrier Jump Jet) and Dropkick (Justin Theroux) (a Decepticon triple-changer who transforms into a blue AMC Javelin and a Bell AH-1 SuperCobra) as they interrogate and execute Autobot Cliffjumper (Andrew Morgado) on one of Saturn's moons. The pair head to Earth, and pretend to be peacekeepers, persuading Dr. Powell (John Ortiz) and Sector 7, despite Burns' misgivings, to help them find and capture B-127, whom they claim is a fugitive.While Charlie attempts to fix the Beetle, it transforms into the amnesiac B-127, whom she befriends and nicknames \"Bumblebee\". They unlock a message from Optimus urging Bumblebee to defend Earth in their absence, which restores some of his memories. Bumblebee is discovered by Charlie's neighbor Memo (Jorge Lendeborg Jr.), who agrees to protect their secret due to his feelings for Charlie. Left alone, Bumblebee accidentally destroys Charlie's home and causes an energy spike that attracts Sector 7's attention. When Sally blames Charlie for the destruction, Charlie angrily leaves with Bumblebee and Memo, only to be intercepted by Sector 7 and the Decepticons. Bumblebee is captured while Charlie and Memo are returned home. Charlie finally expresses her pain over her father's death and makes amends with her brother Otis (Jason Drucker), who helps Charlie follow Burns to the Sector 7 outpost where Bumblebee is being held. Shatter and Dropkick torture Bumblebee into revealing the Autobots' whereabouts, discovering that the Autobots are coming to Earth. They leave him for dead after revealing their plan to bring the Decepticons to Earth. After alerting Burns to the truth about the Decepticons, Dr. Powell is killed by Dropkick.Charlie Electro-shocks Bumblebee back to life, restoring his memories. After fighting past Burns' obstruction and attempt to re-secure Bumblebee, Charlie and Bumblebee set out to prevent Shatter and Dropkick from contacting the Decepticons using a radio tower at a nearby harbor (Through which they are sending a message using Earth's satellites calling all Decepticons). Burns and his men also intervene, but their helicopter crashes only to be saved by Bumblebee. While Bumblebee rips Dropkick apart with a chain, Charlie deactivates the Decepticon beacon, causing an enraged Shatter to pursue her. Bumblebee destroys a dam wall, triggering a flood that crushes Shatter under the rubble. Burns, having a change of heart, allows Charlie and Bumblebee time to escape before the army arrives.Charlie and Bumblebee arrive on a cliff overlooking the Golden Gate Bridge, where Charlie, realizing that Bumblebee has a greater purpose on Earth, says goodbye, and returns to her family. Bumblebee scans a 1977 Chevrolet Camaro and drives away.Bumblebee reunites with Optimus Prime in a forest and has decided to use Bumblebee as his name instead of B-127. More Autobots start to arrive through Earth's atmosphere. Charlie finally finishes repairing a Corvette she and her father were working on and drives off into the sunset.",
	"links": [
		"https://www.amazon.com/Bumblebee-Travis-Knight/dp/B0DJQY3ZB2"
	]
}