{
	"title": "Hidden Figures",
	"release_year": "2016",
	"runtime": "127",
	"tags": [
		"Biography",
		"Drama",
		"History",
		"amazon"
	],
	"rating": 7.8,
	"actors": [
		"Taraji P. Henson",
		"Octavia Spencer",
		"Janelle Monáe",
		"Kevin Costner",
		"Kirsten Dunst",
		"Jim Parsons",
		"Mahershala Ali",
		"Aldis Hodge",
		"Glen Powell",
		"Kimberly Quinn"
	],
	"staff": [
		"Theodore Melfi",
		"Allison Schroeder",
		"Theodore Melfi",
		"Margot Lee Shetterly",
		"Peter Chernin",
		"Donna Gigliotti",
		"Theodore Melfi",
		"Jenno Topping",
		"Benjamin Wallfisch",
		"Pharrell Williams",
		"Hans Zimmer",
		"Mandy Walker",
		"Peter Teschner",
		"Victoria Thomas",
		"Wynn Thomas"
	],
	"votes": 261007,
	"cover": "https://m.media-amazon.com/images/M/MV5BY2RhNDRhNzctZTllMy00NTc2LWJjZmUtMzg3MTNiNjhhODMxXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1961, mathematician Katherine Johnson (Taraji P. Henson) works as a \"computer\" in the segregated West Area Computers division of Langley Research Center in Hampton, Virginia, alongside her colleagues, aspiring engineer Mary Jackson (Janelle Monáe) and unofficial supervisor Dorothy Vaughan (Octavia Spencer).Following a successful Russian satellite launch, pressure to send American astronauts into space increases. Katherine's supervisor Vivian Mitchell (Kirsten Dunst) assigns her to assist Al Harrison's (Kevin Costner) Space Task Group. Katherine becomes the first African American woman in the team and in the building, which has no bathrooms for colored people.Katherine's new colleagues are initially dismissive and demeaning, especially head engineer Paul Stafford (Jim Parsons). Meanwhile Dorothy's request to be officially promoted to supervisor is rejected by Vivian. Mary identifies a flaw in the experimental space capsule's heat shields, encouraging her to more assertively pursue an engineering degree.\nAt a barbecue, Katherine meets U.S. Army officer Jim Johnson (Mahershala Ali) and they are attracted to each other, but she is disappointed when he voices skepticism at women's mathematical abilities. He later apologizes and they ultimately get married.Harrison invites his subordinates to solve a complex mathematical equation, and Katherine steps forward, leaving him impressed. The Mercury 7 astronauts visit Langley and astronaut John Glenn (Glen Powell) is cordial to the West Area Computers employees.\nOver time, Katherine becomes better acquainted with her colleagues. Harrison becomes upset when she is not at her desk, and she explains how far she has to walk to use the colored people's bathroom in another building. Harrison abolishes bathroom segregation, personally knocking down the Colored Bathroom sign. Despite Stafford's objections, he allows Katherine to be included in their meetings, in which she creates an elaborate equation to guide the space capsule into a safe re-entry. Despite this, Katherine is forced to remove her name from all the reports, which are credited solely to Stafford. Meanwhile, Mary goes to court and convinces the judge to grant her permission to attend night classes in an all-white school to obtain her engineering degree.Dorothy learns of the impending installation of an IBM 7090 electronic computer that could replace her co-workers. She visits the computer room and successfully starts the machine. Later, she visits a public library, where the librarian scolds her for visiting the whites-only section, to borrow a book about FORTRAN. After teaching herself FORTRAN and training her West Area co-workers, she is officially promoted to supervise the Programming Department and the others are transferred there. While congratulating Dorothy on her work, Vivian assures her that she never treated her differently due to the color of her skin; Dorothy is unconvinced.As the final arrangements for John Glenn's launch are made, Katherine is informed she is no longer needed at Space Task Group and is being reassigned back to West Area Computers. As a farewell gift, her colleagues buy her a pearl necklace, the only jewelry allowed under the dress code.\nPrior to the launch, however, discrepancies arise in the IBM 7090 calculations for the capsule's landing coordinates and Glenn requests that Katherine be called in to check the calculations. Katherine quickly does so and hurriedly deliver the results to the control room, only to have the door slammed in her face. However, Harrison brings her into the control room so they can relay the results to Glenn together.After a successful launch, the space capsule has a warning light indicating a heat shield problem; mission control decides to land it after three orbits instead of seven. Katherine understands the situation and suggests that they should leave the retrorocket attached to heat shield for reentry. Her instructions prove correct, and Friendship 7 successfully lands in the ocean.Following the mission, the mathematicians are laid off and ultimately replaced by electronic computers. Katherine is reassigned to the Analysis and Computation Division, Dorothy continues to supervise the Programming Department, and Mary obtains her engineering degree.\nAn epilogue reveals that Katherine calculated the trajectories for the Apollo 11 and Apollo 13 missions. In 2015, she was awarded the Presidential Medal of Freedom, and a new 40,000-square-foot Computational Research Facility at the Langley Research Center was renamed the Katherine G. Johnson Computational Research Facility in her honor the following year.Historical accuracy\nThe film, set at NASA in 1961, depicts segregated facilities such as the West Area Computing unit, an all-African American group of female mathematicians, who were originally required to use separate dining and bathroom facilities. However, in reality, Dorothy Vaughan was promoted to supervisor of West Computing in 1949, becoming the first African American supervisor at the NACA and one of the few female supervisors. In 1958, when the NACA made the transition to NASA, segregated facilities, including the West Computing office, were abolished. Dorothy Vaughan and many of the former West Computers transferred to the new Analysis and Computation Division (ACD), a racially and gender-integrated group.Mary Jackson completed her engineering courses and earned a promotion to engineer in 1958, becoming NASA's first African American female engineer.\nKatherine Johnson was assigned to the Flight Research Division in 1953, a move that soon became permanent. When the Space Task Group was formed in 1958, engineers from the Flight Research Division formed the core of the Group and Katherine moved along with them. She coauthored a research report in 1960, the first time a woman in the Flight Research Division had received credit as an author of a research report.The Space Task Group was led by Robert Gilruth, not Al Harrison, who was created to simplify a more complex management structure. Vivian Mitchell and Paul Stafford are composites of several team members reflecting common social views and attitudes of the time. Karl Zielinski is based on Mary Jackson's mentor Kazimierz \"Kaz\" Czarnecki.\nJohn Glenn did ask specifically for Johnson to verify the IBM calculations, although she had several days before the launch date to complete the process.",
	"links": [
		"https://www.amazon.com/Hidden-Figures-Taraji-P-Henson/dp/B01MS4V81A"
	]
}