{
	"title": "Bãhubali 2: The Conclusion",
	"release_year": "2017",
	"runtime": "167",
	"tags": [
		"Action",
		"Drama"
	],
	"rating": 8.2,
	"actors": [
		"Prabhas",
		"Prabhas",
		"Rana Daggubati",
		"Anushka Shetty",
		"Tamannaah Bhatia",
		"Sathyaraj",
		"Ramya Krishnan",
		"Nassar",
		"Subbaraju",
		"Meka Rama Krishna",
		"Rajsekhar Aningi"
	],
	"staff": [
		"S.S. Rajamouli",
		"Vijayendra Prasad",
		"S.S. Rajamouli",
		"C.H. Vijay Kumar",
		"Ajay Kumar",
		"Prasad Devineni",
		"Deepak Prajapat",
		"K. Raghavendra Rao",
		"Shobu Yarlagadda",
		"M.M. Keeravani",
		"KK Senthil Kumar",
		"Kotagiri Venkateshwara Rao",
		"Tammiraju",
		"Sabu Cyril"
	],
	"votes": 117513,
	"cover": "https://m.media-amazon.com/images/M/MV5BNTRhYTlhZTgtYmMyYy00NWI4LTk4MzItOWM2YjBmYTg2OTI2XkEyXkFqcGc@._V1_QL75_UY281_CR4,0,190,281_.jpg",
	"description": "Kattappa (Sathyaraj) continues to narrate how he ended up killing Amarendra Baahubali (Prabhas).\nAfter vanquishing the Kalakeyas, Amarendra Baahubali is declared as the future king of Mahishmati and Bhallaladeva (Rana Daggubati) is declared as the commander-in-chief. Before the coronation, Rajamatha Sivagami (Ramya Krishnan) begins to look for a bride for Amarendra. She instructs Amarendra and Kattappa to tour the kingdom to understand its current state and its people.\nAmarendra falls in love with Devasena (Anushka Shetty), a princess of the Kuntala kingdom (7.5 Yojanas in the North from Mahishmati) and the sister of the king of Kuntala. Bhallaladeva learns of Amarendra's attempts to woo Devasena and hatches a plot to drive a wedge between Amarendra and Sivagami by asking for Devasena's hand in marriage for himself. Sivagami, unaware that Amarendra is in love with Devasena, promises Devasena's hand in marriage to Bhallaladeva.Sivagami sends an emissary to the kingdom of Kuntala, who delivers the marriage proposal in a patronizing way. An insulted Devasena rejects the proposal with a scathing reply. Sivagami is enraged to hear Devasena's response and sends an order to Amarendra that Devasena be brought to Mahishmati as a captive.\nThe kingdom of Kuntala is attacked by Pindaris, a Dacoit-like army. Amarendra, with the help of Devasena's maternal uncle, Kumara Varma (Subbaraju), is able to nullify the attack and save Kuntala. Amarendra reveals who he is, promises Devasena that he will protect her honor no matter what and convinces her to come with him to Mahismati as his future bride.\nUpon reaching Mahismati, the misunderstanding comes to light. When Sivagami delivers an ultimatum to Amarendra that he must either chose the throne or Devasena, he chooses Devasena. Bhallaladeva is crowned king and Amarendra is made the new commander-in-chief. During the coronation ceremony the citizens of Mahishmati clearly display their preference for Amarendra over Bhallaladeva.At Devasena's baby shower, Bhallaladeva relieves Amarendra of his duties as commander-in-chief so that Amarendra can be with his wife. Devasena immediately speaks out against the King's manipulation and the mute inaction of Sivagami. Due to further clashes, Devasena and Amarendra are banished from the Palace. Amarendra and Devasena live happily among the people. Bhallaladeva notices that to the people, Amarendra is their king, and hatches a plot with his father Bijjaladeva (Nassar) to convince Sivagami that Amarendra is trying to assassinate him. Bijjaladeva has a mock fight with Bhallaladeva where Bijjal tries to stop Bhalla from hatching a plot to kill Bahubali. The whole scene is witnessed by Kumara Varma. Bhalla throws Bijjala aside. Later, Kumara Varma meets Bijjala, and Bijjala convinces him to attack Bhalla to save Bahubali. Kumara Varma does, not knowing that he has walked into a trap & is killed by Bhalla. Sivagami, convinced that Bhallaladeva's life is under threat and open action would result in factions and civil war, orders Kattappa to assassinate Amarendra. Kattappa, bound by his word to serve the Queen, lures Amarendra by feigning he is in trouble, and then stabs him in the back and kills him.Kattappa learns of Bhallaladeva's treachery and informs Sivagami. Devasena too arrives to learn of her husband's death with her son, in her arms. Sivagami announces the panicked hordes outside her palace that Amarendra is dead and the baby, Mahendra Baahubali, is the new King.\nAs Bhallaladeva and his men are about to seize the queen, she flees with baby Mahendra Baahubali. Devasena is taken prisoner for the next 25 years. The Kuntala Kingdom is destroyed completely by Bhallaladeva. The now ousted Kuntala King (Meka Ramakrishna), leads the rebel group that has indulged in guerrilla warfare against king Bhallaladeva.After listening to the whole story, Mahendra Baahubali alias Shivudu (Prabhas) decides to avenge his father's death by raising his own army with the help of Kattappa and returns to Mahishmati along with Avantika (Tamannaah) and the people of the city. Bhallaladeva once again kidnaps Devasena and seals the palace, but Baahubali, ingenious like his father, manages to enter the palace to capture Bhallaladeva.Bijjala Deva tries to brainwash Kattappa reminding him of his forefather's pledge of their allegiance to protect and defend the throne of Mahismati and their duty to be loyal to the king. Kattappa reminds him that Sivagami had declared Mahendra Baahubali king before her death 25 years back and hence his loyalties instead lie with the rightful king, Baahubali. Bhallaladeva is later defeated by Baahubali and burnt alive on a pyre prepared by Devasena. Ending the cruel regime of Bhallaladeva, Baahubali becomes the new King of Mahishmati with Avantika as his queen, declaring peace and harmony.\nIn the end credits, a child is heard asking an elder whether the son of Mahendra Baahubali will become the next king of Mahishmati. To which, the elder replies: \"Who knows what Lord Shiva is planning!\"",
	"links": []
}