{
	"title": "Jurassic World: Fallen Kingdom",
	"release_year": "2018",
	"runtime": "128",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Chris Pratt",
		"Bryce Dallas Howard",
		"Rafe Spall",
		"Justice Smith",
		"Daniella Pineda",
		"James Cromwell",
		"Toby Jones",
		"Ted Levine",
		"Jeff Goldblum",
		"BD Wong"
	],
	"staff": [
		"J.A. Bayona",
		"Derek Connolly",
		"Colin Trevorrow",
		"Michael Crichton",
		"Belén Atienza",
		"Patrick Crowley",
		"Frank Marshall",
		"Michael Giacchino",
		"Oscar Faura",
		"Bernat Vilaplana",
		"Nina Gold",
		"Andy Nicholson"
	],
	"votes": 350089,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzIxMjYwNDEwN15BMl5BanBnXkFtZTgwMzk5MDI3NTM@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Six months after the Jurassic World theme park incident on Isla Nublar (120 miles west of Costa Rica), a small team of mercenaries arrives on the abandoned island to collect DNA from the remains of the Indominus Rex, which lie at the bottom of the park's lagoon. The team arrives in submersibles, supported by a fleet of aerial craft.\nAfter successfully collecting a bone fragment, the Mosasaurus devours their submersible. The Tyrannosaurus attacks the helicopter, but the surviving members escape with the sample. This was a huge shock as the dinosaurs were expected to be dead by now. The Mosasaurus swims through the partially open underwater gates into the open ocean.During the emergency evacuation, the lagoon gate is inadvertently left open, allowing the Mosasaurus to escape into the ocean.Three years after the Jurassic World incident, a U.S. Senate hearing in Washington, D.C. debates whether Isla Nublar's dinosaurs should be saved from an impending volcanic eruption. The volcano which had been dormant was centuries is suddenly active. The eruption will kill off the last living dinosaurs on the island.Mathematician Dr. Ian Malcolm (Jeff Goldblum) (An expert in chaos theory who once consulted for InGen's Jurassic Park) testifies that the dinosaurs should be allowed to perish to correct John Hammond's mistake of cloning them long ago. Ian says that human altered the course of natural history by creating dinosaurs and this is their chance for self-correction. Ian says that humans have access to unprecedented technological power and yet they have proven incapable of handling that power responsibly.Meanwhile, Jurassic World's former operations manager, Claire Dearing (Bryce Dallas), has created the Dinosaur Protection Group to save the animals. When the Senate rules against their rescue, Claire is contacted by Benjamin Lockwood (James Cromwell), Hammond's former partner in developing the technology to clone dinosaurs.Soon after, Claire meets Lockwood and his aide, Eli Mills (Rafe Spall) (Lockwood's ambitious assistant who recruits Owen and Claire to rescue the dinosaurs), at his Northern California estate. Mills says that Hammond and Lockwood worked at the estate in an underground lab to extract the first Dinosaur DNA, before it all began. Mills says that he cares for what happens to those animals on Isla Nublar.They reveal a plan to relocate the dinosaurs to a new island sanctuary protected by natural barriers and fully self-sustaining. Mills says that their plan is to save at least 11 species. Mills wants to save the Velociraptor Blue as she is the last of her kind and the 2nd most intelligent species on the planet.\nClaire recruits Owen Grady (Chris Pratt), Jurassic World's former Velociraptor trainer, for the mission after Mills expresses concerns about locating Blue, the last living Velociraptor.The rescue group arrives on Isla Nublar and meets Ken Wheatley (Ted Levine), the mercenary commander. Claire and former park technician, Franklin Webb (Justice Smith), reactivate the park's dinosaur trackers, while Owen, Paleo-veterinarian Zia Rodriguez (Daniella Pineda), Wheatley and other mercenaries search for Blue. Upon finding her, the encounter escalates leading to a mercenary shooting Blue with live rounds (after Blue attacks the mercenaries who had fired a sedative at her) and Wheatley tranquilizing Owen. Zia works to keep Blue alive while Owen is left behind on the island.Claire and Franklin were locked in the control center, which was abandoned by the mercenaries after Blue was captured. The volcano starts pouring lava, which seeps into the control center from the roof, as Dinosaurs get into the center through the ventilation shaft.\nAfter surviving a Baryonyx attack, Claire and Franklin reunite with Owen (they escape through a hatch in the roof) as the volcano erupts. They flee from the Pyroclastic flow towards the Island port and then sneak aboard the mercenaries' ship, where they find Zia with Blue. Zia transfuse Blue with Tyrannosaurus blood to save her life.\nThe ship, filled with captured dinosaurs, departs for the U.S. mainland as the island's remaining animals die in the eruption.At Lockwood's estate, Lockwood's orphaned, Pre-teen granddaughter Maisie (Isabella Sermon) overhears Mills and auctioneer Gunnar Eversoll (Toby Jones) secretly planning to auction off the captured dinosaurs. Mills wants to use the $ 100MM from the auction to develop a new species the Indoraptor, a new genetically engineered dinosaur created by geneticist Dr. Henry Wu (B. D. Wong) using the DNA of the Indominus Rex and a Velociraptor. Wu needs Blue's DNA to create an improved Indoraptor that follows commands, unaware that her blood is no longer pure.\nMills plans to Weaponize the new dinosaur and sell it to the military for profits. Maisie informs Lockwood about the auction, and he confronts Mills, who murders him.The dinosaurs are transported to Lockwood's estate and caged. Zia and Franklin evade capture, but Owen and Claire are caught. Owen manipulates a Stygimoloch to break open their cell. They then encounter Maisie, who leads them to the auction where the Indoraptor is being bid on, despite Wu's protests that it is a prototype. The freed Stygimoloch disrupts the auction with Owen's guidance. In the ensuing chaos, Wheatley tranquilizes the Indoraptor and attempts to extract one of its teeth as a trophy, but it feigns sedation and escapes, killing him, Eversoll, and others.Mills reveals to Owen and Claire that Maisie was cloned from Lockwood's deceased daughter and is why John Hammond, who opposed human cloning, ended his and Lockwood's partnership. The Indoraptor hunts Owen, Claire, and Maisie through the mansion. Zia releases Blue, who attacks the Indoraptor, causing it to fall through a glass roof to its death.When a hydrogen cyanide gas leak threatens the caged animals, Maisie, unable to let them die, frees them against Owen's warning. Mills tries to escape with the Indominus Rex bone but is devoured by the Tyrannosaurus and Carnotaurus. Owen and Claire leave the estate with Maisie, while Blue and the other dinosaur's escape. In a new U.S. Senate hearing, Dr. Malcolm says that humans and dinosaurs will now need to coexist.\nThe closing scene shows dinosaurs roaming wilderness and urban areas.",
	"links": [
		"https://www.amazon.com/Jurassic-World-Kingdom-Chris-Pratt/dp/B07DR7V97S"
	]
}