{
	"title": "Ambulance",
	"release_year": "2022",
	"runtime": "136",
	"tags": [
		"Action",
		"Crime",
		"Drama",
		"amazon"
	],
	"rating": 6.1,
	"actors": [
		"Jake Gyllenhaal",
		"Yahya Abdul-Mateen II",
		"Eiza González",
		"Garret Dillahunt",
		"Keir O'Donnell",
		"Jackson White",
		"Olivia Stambouliah",
		"Moses Ingram",
		"Colin Woodell",
		"Cedric Sanders"
	],
	"staff": [
		"Michael Bay",
		"Chris Fedak",
		"Laurits Munch-Petersen",
		"Lars Andreas Pedersen",
		"Michael Bay",
		"Ian Bryce",
		"Bradley J. Fischer",
		"William Sherak",
		"Lorne Balfe",
		"Roberto De Angelis",
		"Doug Brandt",
		"Pietro Scalia",
		"Calvin Wimmer",
		"Denise Chamian",
		"Karen Frick",
		"Adam Henderson"
	],
	"votes": 103043,
	"cover": "https://m.media-amazon.com/images/M/MV5BZDZiY2RmNjgtYzYyZi00ZGEyLTlkOTUtZDc5OTUzY2NlMmEyXkEyXkFqcGc@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "War veteran Will Sharp (Yahya Abdul-Mateen II), desperately in need of $231,000 for his wife Amy's surgery, reaches out to Danny (Jake Gyllenhaal), his adoptive brother and a life-long criminal, who talks him into taking part in a $32 million bank heist. Danny need Will as a driver, since Will is an excellent driver and can drive anything.\nThough initially hesitant, Will agrees after Danny reaffirms that he is doing this for Amy. The plan nearly succeeds until Officer Zach (Jackson White), who goes to the bank to ask out a bank teller, discovers the situation and is held hostage by Danny. The money is stuffed into 4 bags, which means $8 million per bag.\nA shootout then occurs between one of the heist members and Zach's partner Officer Mark (Cedric Sanders).The Special Investigation Section (SIS) of the LAPD arrives and shoots down the whole crew except Will and Danny, who retreat towards the garage. The SIS was tracking Danny and his crew from the beginning but were late to the scene as Danny did not use the vehicle that the SIS had put a tracker on. Will and Danny escape with 1 bag each.\nZach attempts to escape and during a scuffle between him and Danny, he is accidentally shot by Will. Will wants to stop and help Zach, but Danny forces Will to leave Zach and run.\nMark finds Zach and calls in an Ambulance.Leaving Zach to die, the brothers attempt to exit through the back of the building but find it surrounded by police. They then hijack an ambulance with EMT Cam Thompson (Eiza González) on board, who is treating the injured Zach. Cam is known to be the best paramedic in town who can keep anyone alive for 20 minutes. But she has no friends.\nCam is held hostage by Danny. Danny forces Cam to convince the SIS team to let them through the barricade as she has a dying cop inside the ambulance. Meanwhile Mark finds the injured Ambulance driver and realizes that it has been hijacked.\nAfter a chase that leads them into an alleyway, Cam makes a desperate attempt to escape using a fire extinguisher but is quickly recaptured by Danny.SIS Captain Monroe (Garret Dillahunt) arrives on the scene and deploys helicopters to chase after the ambulance. Danny tells Will to keep driving towards their back up car location. Cam gets Danny to help her use a defibrillator and Will to transfer some of his blood to Zach, much to his confusion and frustration. Danny wants to keep Zach alive, as he knows that killing a cop would lead to dire consequences for him.\nMeanwhile Monroe orders using electronic sniping to figure out the communication units on board the ambulance. They find a satellite phone and police scanners on board.\nDanny then calls Papi (A Martinez), one of his father's criminal friends, for help losing the police in exchange for $8 million. Papi and his son Roberto start to outfit a car with heavy ammunition.When Cam stops Danny from shooting Mark, who has been chasing them, Danny threatens to throw her off the ambulance.\nThe police are forced to retreat when it is discovered that Monroe's dog is inside Mark's police vehicle. FBI Agent Anson Clark (Keir O'Donnell), a past friend of Danny's, is put on the case. Clark says that Danny has been robbing banks since he was 17 years old. And his father is a known psychotic. Clark says that Danny is looking for a way out since he did not kill the cop.\nWill tells Danny not to hurt Cam.Zach begins to bleed out; Cam, with Will's assistance, begins to perform surgery on Zach. Despite her inexperience and a ruptured spleen, Cam successfully performs the surgery with advise on phone from doctors who are specialists at this. Danny had taken over the driving as Will helped Cam. Cam tries to convince Will to stop Danny, to no avail. Will tells Cam that he will get her out alive. The phone line to the doctors got cut due to low battery as Zach's spleen burst while being taken out. In that scenario a patient has 60 seconds to live. Cam was able to block the artery with a clamp, but the doctors didn't know that.\nMonroe, unaware of the surgery's success, moves forward with the operation and prepares to snipe Will and Danny without negotiating for Cam's life.Clark calls Cam, on Zach's phone which was still on his person inside the ambulance and tells her to get down. Cam, wanting to save Zach's life, alerts Will and Danny about the snipers. Danny, having had enough of Cam, decides to shoot her but Will intervenes, causing the brothers to fight about their predicament. They later partially reconcile and listen to music together to ease the tension.In the Los Angeles River, helicopters chase the ambulance as Danny shoots at them. Will and Danny then drive on the opposite lane of the interstate, creating multiple accidents. Danny hides his ambulance under a bridge, where it is painted blue by Papi's men. Danny says that this is Will's window to walk away, but Will refuses to go. He won't leave Danny. Cam learns that Will has a daughter and that his wife has cancer and needs the money for her surgery.\nFrom under the bridge, many ambulances are driven away in different directions, to confuse Monroe's teams.On Papi's orders, his son, Roberto (Jesse Garcia), drives an empty ambulance towards the police after filling it with C-4 explosives and deploys machine guns on separate cars to cause additional damage, which ends up wounding Monroe in the crossfire. Mark had seen Roberto escape after jumping out of the loaded ambulance and gives chase.Mark chases down Roberto and fatally shoots him after a scuffle, leaving Papi angry and distraught. Will and Danny escape to Papi's hideout. Papi demands the brothers to leave Zach and Cam with them to deal with; Will refuses to cooperate and teams up with Danny to kill Papi and his crew. In the ambulance, Zach regains consciousness and gives his Partner's gun to Cam.In the chaos, Cam accidentally shoots Will using Zach's gun. Danny puts Will into the Ambulance. Will takes a bundle of cash and gives it to Cam, begging her to give it to his wife. Danny takes the ambulance to a hospital and discovers Zach's gun. He is enraged when Cam reveals that she was the one who shot Will. Danny says that Will was the one who saved Zach and Cam. Danny vows to kill Cam along with himself on live television, before confronting the police.Will, left with no other choice, shoots Danny in the back. Danny apologizes to Will before he dies from his injuries. The police arrest a heavily injured Will and take him inside for surgery after Cam says that he saved Zach's life. Cam secretly gives some of the heist money to Amy for her surgery, and Zach, when questioned by the police about his injuries, tells them that Will saved his life.",
	"links": [
		"https://www.amazon.com/Ambulance-Jake-Gyllenhaal/dp/B09PQTMGF8"
	]
}