{
	"title": "Lady Bird",
	"release_year": "2017",
	"runtime": "94",
	"tags": [
		"Comedy",
		"Drama",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Saoirse Ronan",
		"Laurie Metcalf",
		"Tracy Letts",
		"Lucas Hedges",
		"Timothée Chalamet",
		"Beanie Feldstein",
		"Lois Smith",
		"Stephen McKinley Henderson",
		"Odeya Rush",
		"Jordan Rodrigues"
	],
	"staff": [
		"Greta Gerwig",
		"Greta Gerwig",
		"Eli Bush",
		"Evelyn O'Neill",
		"Scott Rudin",
		"Jon Brion",
		"Sam Levy",
		"Nick Houy",
		"Heidi Griffiths",
		"Allison Jones",
		"Jordan Thaler",
		"Chris Jones"
	],
	"links": [
		"https://www.amazon.com/Lady-Bird-Saoirse-Ronan/dp/B07734STRN"
	],
	"votes": 338406,
	"cover": "https://m.media-amazon.com/images/M/MV5BNjk5MzcyOWQtNzE1Mi00NzdmLTlkM2QtOTdjZThhMDc2Y2NjXkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"description": "Christine \"Lady Bird\" McPherson (Saoirse Ronan) is a senior student at a Catholic high school in the suburbs of Sacramento, in 2002. She lives with her parents, with whom she has a strained relationship, her older brother, who is adopted, and his girlfriend. Lady Bird is best friends with Julianne \"Julie\" Steffans (Beanie Feldstein). Lady Bird and Julie join their school's theatre program, where Lady Bird meets a young man named Danny O'Neill (Lucas Hedges). They develop a romantic relationship, leading to Lady Bird joining Danny's family for Thanksgiving dinner rather than doing so with her own family. Their relationship is abruptly broken when Lady Bird finds Danny making out with a boy in a bathroom stall. At the behest of her mother, Lady Bird takes on a menial job at a coffee shop, where she meets an edgy musician named Kyle Scheible (Timothée Chalamet). He and Lady Bird begin a romantic relationship, and she begins to drift away from Julie in favor of a friendship with a popular girl named Jenna Walton (Odeya Rush).After Jenna is reprimanded by nun teacher Sister Sarah Joan (Lois Smith) for wearing a short skirt, Jenna bonds with Lady Bird by harmlessly vandalizing Joan's car. Lady Bird tells Jenna that she lives at an address which actually belongs to Danny's grandmother. Lady Bird drops out of the theatre program and is later confronted by Danny outside of the coffee shop, where she consoles him after he expresses his struggle to come out. She loses her virginity to Kyle after he falsely refers to himself as a virgin, leading her to find consolation in her mother. Jenna discovers that Lady Bird lied about her address, which essentially ends their friendship. Lady Bird is told that her father has recently lost his job and discovers that he is battling depression.Lady Bird begins applying to colleges, hoping to be accepted into one that is out-of-state (with an financial assistance letter provided by her father), despite her mother's insistence that the family could not afford it. She receives several rejections letters, but is elated to discover that she has been placed on the wait list for a university in New York. Despite her uneasy relationship with them, she sets out for her high school's prom alongside Kyle, his friend, and his friend's date but they decide to go to a party. Lady Bird asks them to drop her off at Julie's apartment, where the two rekindle their friendship and go to the prom together. Lady Bird passes her driving test and repaints her bedroom, removing drawings, photos, and writing from her walls. Her mother discovers that she has applied to out-of-state universities behind her back, causing her mother to give her the silent treatment.In 2003, on her eighteenth birthday, Lady Bird's father shares a cupcake with her and jokes that he and her mother cannot afford a divorce. Now of legal age, Lady Bird buys a pack of cigarettes, a scratch-off ticket, and an issue of Playgirl from a convenience store. Lady Bird eventually leaves for New York; her mother coldly drives her to the airport, where Lady Bird heads to the terminal with her father. Lady Bird believes her mother does not want to see her or say goodbye to her, but in reality, her mother does not want Lady Bird to see her cry. While driving, she has a change of heart and rushes back into the airport, but Lady Bird has already left.In New York, after finding thoughtful letters written by her mother and salvaged by her father, Lady Bird decides to go by the name Christine again. She is briefly hospitalized after drinking an excessive amount of alcohol at a party. After leaving the hospital, she observes a Sunday church service. Outside the church, Christine calls home with her cell phone and leaves an apologetic message for her mother."
}