{
	"title": "Moonlight",
	"release_year": "2016",
	"runtime": "111",
	"tags": [
		"Drama",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Mahershala Ali",
		"Naomie Harris",
		"Trevante Rhodes",
		"Alex R. Hibbert",
		"Shariff Earp",
		"Duan Sanderson",
		"Janelle Monáe",
		"Jaden Piner",
		"Herman 'Caheei McGloun",
		"Kamal Ani-Bellow"
	],
	"staff": [
		"Barry Jenkins",
		"Barry Jenkins",
		"Tarell Alvin McCraney",
		"Dede Gardner",
		"Jeremy Kleiner",
		"Adele Romanski",
		"Nicholas Britell",
		"James Laxton",
		"Joi McMillon",
		"Nat Sanders",
		"Yesi Ramirez",
		"Hannah Beachler"
	],
	"links": [
		"https://www.amazon.com/Moonlight-Mahershala-Ali/dp/B01MU9CMGJ"
	],
	"votes": 335514,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzQxNTIyODAxMV5BMl5BanBnXkFtZTgwNzQyMDA3OTE@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "I. LittleIn Liberty City, Miami, Cuban drug dealer Juan (Mahershala Ali) finds Chiron (Alex Hibbert), a withdrawn child who goes by the nickname \"Little\" (his real name is Chiron), hiding from a pack of bullies. Chiron is very skeptical to trust Juan at first, but Juan is friendly and not very pushy, and invites Chiron for a meal. Chiron is shy, reticent and quiet.\nJuan allows Chiron to spend the night with him and his girlfriend Teresa (Janelle Monáe) before returning him to his emotionally abusive mother Paula (Naomie Harris) the next day. Teresa is warm and inviting towards Chiron and knows that Juan can be an intimidating personality.Juan is a drugs supplier and has his network of dealers that work the streets. Business is good for Juan.\nJuan tells Paula that Chiron didn't tell him where he lived till the following morning and hence, he did not bring him home the previous night.Kevin is Chiron's only real friend as a kid. Kevin tells Chiron to stand up for himself and to not allow others to see that he is soft.\nChiron continues to spend time with Juan, who teaches him how to swim and advises him to make his own path. Juan sees Chiron as a little boy standing on the beach in Moonlight. An old lady once told Juan that African American boys look blue in Moonlight.One night, Juan observes Paula smoking crack with one of his customers near the location where the dealer sold the drugs to the customer. Juan berates her for her addiction while Paula rebukes him for selling crack in the first place. She implies that she knows why Chiron gets tormented by his peers, alluding to \"the way he walks\" before going home and taking out her frustration on Chiron. And she calls him a \"FA**OT\".The next day, Chiron admits to Juan and Teresa that he hates his mother and asks what a \"FA**OT\" is. Juan tells him it is \"a word used to make gay people feel bad.\" He tells Chiron there is nothing wrong with being gay and that he should not allow others to mock him. Juan and Teresa assure him that when it is time, Chiron would know whether he is gay or not.\nChiron then asks Juan whether he sells drugs and whether his mother does drugs. After Juan remorsefully answers yes to both questions, Chiron leaves as Juan hangs his head in shame.ii. ChironNow a teenager, Chiron (Ashton Sanders) juggles avoiding his classmate Terrel (Patrick Decile), who frequently bullies him, and spending time with Teresa, who has lived alone since Juan's death. Paula has become addicted to crack and prostitutes herself to support her addiction, frequently coercing Chiron into giving her money that Teresa loans him. Paula tells Chiron that Teresa is not his mother, and that Chiron has to support Paula as she is his blood relative. Chiron can see that Paula is simply exploiting his relationship with Teresa to score some cash.One night, Chiron has a dream in which his closest friend Kevin (Jharrel Jerome) has sex with a woman. Chiron tries to avoid going home after school and spends his time wherever he can (public transport, stations, the streets etc).\nOn another night, Kevin visits Chiron at the beach near his house. While smoking a blunt, the two discuss their respective ambitions and the nickname, \"Black\", that Kevin has given Chiron. After a charged moment, they kiss, and Kevin masturbates Chiron.The next morning, Terrel pressures Kevin into participating in a hazing ritual against the gays at school. Terrel chooses Chiron as the victim and tells Kevin to punch him up. Kevin starts punching Chiron, who is defiant and keeps getting back up.\nKevin reluctantly punches Chiron until he is unable to get up before Terrel and several others stomp on him, leaving him seriously hurt. Chiron feels betrayed by Kevin and feels let down as Kevin himself is gay.\nChiron later meets with a social worker, who urges him to reveal the identities of his attackers. He refuses, however, as he believes that reporting them will not solve anything. The next day, Chiron smashes a chair into Terrel's back. As the police arrest Chiron, he glares at a helpless Kevin.iii. BlackNow going by the name \"Black\" (Trevante Rhodes), an adult Chiron deals drugs in Atlanta. He receives frequent calls from Paula, who asks him to visit her at the drug treatment center where she now lives. One night, he receives a call from Kevin (Andre Holland), who apologizes for his behavior while in high school and invites Chiron to visit him in Miami.\nThe next day, he wakes up after dreaming about Kevin to find that he has had a wet dream.While visiting his mother at the drug treatment center, Chiron admits that he feels remorse for his lack of empathy towards her. Paula eventually apologizes for having been a bad mother and not supporting him when he needed her, and he forgives her. He then travels to Miami and reunites with Kevin, who now works in a diner, but Chiron is reluctant to speak or drink with Kevin.Kevin confesses that he is surprised by Chiron's new appearance, occupation, and motivation for seeing him. After dinner, the two drive to Kevin's home. Kevin tells Chiron that, although his life may not have turned out the way he hoped, he is still happy. Chiron admits he has never been intimated with another person since their encounter on the beach. As Kevin comforts him, Chiron remembers himself as Little, standing on a beach in the moonlight."
}