{
	"title": "Mission: Impossible - Fallout",
	"release_year": "2018",
	"runtime": "147",
	"tags": [
		"Action",
		"Adventure",
		"Thriller",
		"amazon"
	],
	"rating": 7.7,
	"actors": [
		"Tom Cruise",
		"Henry Cavill",
		"Ving Rhames",
		"Simon Pegg",
		"Rebecca Ferguson",
		"Sean Harris",
		"Angela Bassett",
		"Vanessa Kirby",
		"Michelle Monaghan",
		"Wes Bentley"
	],
	"staff": [
		"Christopher McQuarrie",
		"Bruce Geller",
		"Christopher McQuarrie",
		"J.J. Abrams",
		"Tom Cruise",
		"Christopher McQuarrie",
		"Jake Myers",
		"Lorne Balfe",
		"Rob Hardy",
		"Eddie Hamilton",
		"Mindy Marin",
		"Toby Whale",
		"Peter Wenham"
	],
	"votes": 383886,
	"cover": "https://m.media-amazon.com/images/M/MV5BOWQyZjAxOGItNjQ1ZS00NjZkLThiMGEtMWI2NzBjZDk0MDVjXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Two years after the capture of Solomon Lane (Sean Harris), the remains of his organization \"the Syndicate\" have reformed into a terrorist group known as \"the Apostles\". While the CIA's Special Activities Division has hunted the Syndicate members, many still remain unknown and at large and able to create chaos around the world. They are now a \"Terror for Hire\" outfit. They are responsible for a smallpox outbreak in the Indian controlled Kashmir.Ethan Hunt (Tom Cruise) is given a mission to intercept three stolen plutonium cores before the Apostles can sell them to an unidentified fundamentalist named John Lark. Apostles are in contact with elements of the Eastern European Underworld, who are in possession of 3 platinum cores stolen from a nuclear base in Russia. This means Lark and Apostles are working together to acquire functioning nuclear weapons.\nEthan is also told that Lark has abducted nuclear weapons expert Nils Debruuk to convert the cores into functioning weapons. The said weapons will be man portable and able to be deployed anywhere in the world in 24 hours.Ethan joins Benji Dunn (Simon Pegg) and Luther Stickell (Ving Rhames) for the mission. Ethan arranges to buy the Plutonium from the Eastern European underworld directly. But they fail when the Apostles hijack the exchange and Ethan chooses to save Luther's life and the plutonium is taken by the Apostles.\nThe team capture nuclear weapons expert Nils Debruuk (Kristoffer Joner) (a rogue nuclear weapons expert). They keep Nils in a simulated hospital and run news reels on TV indicating that 3 nuclear attacks have already taken place on Jerusalem, Mecca and Vatican. Nils agrees to give the pass-code to his phone, if they read Lark's manifesto on international TV. They learn that Nils built three portable nuclear weapons for the Apostles.CIA Director Erica Sloane (Angela Bassett) (the new Director of the Central Intelligence Agency replacing Hunley) instructs Special Activities Division operative August Walker (Henry Cavill) (a CIA assassin working for the Special Activities Division) to shadow Ethan as he attempts to retrieve the plutonium. Erica is blunt with Hunley that the IMF allowed the cores to escape once, and now she wants her own eyes on the team, so the same does not happen again.\nWalker is the agent who has gunned down every Syndicate operative that he was sent after. This is the reason nobody is left alive to positively identify John Lark or the Apostles.Ethan and Walker parachute into Paris, and Ethan saves his life, as he was knocked unconscious in a storm. Ethan grabbed Walker mid-air and helped him land safely.\nEthan and Walker infiltrate a fundraiser party in Paris where Lark is believed to be buying the cores from a black-market arms dealer known as the Alanna Mitsopolis/White Widow (Vanessa Kirby). If the white widow does not meet Lark before midnight, she will sell the cores to the highest bidder.\nThey track a man whom they suspect to be Lark (The guy attacks Ethan & Walker viciously in the loo and had almost won the fight) but he is killed when Ilsa Faust (Rebecca Ferguson) intervenes. Ilsa does not reveal who sent her to the location.Hunt can't finish 3D printing Lark's face as Isla shot at the head, so Ethan decides to be Lark without a disguise. Isla warns Ethan against meeting the White widow and tells him that people are looking for Lark and they will assume Ethan is Lark and will shoot him down.\nEthan impersonates Lark and meets the White Widow. He warns her that agents of the Apostles have been sent to kill her and the two evade their pursuers. Ethna offers to get White Widow to safety & does so under attack from the Apostles agents and with invisible help from Isla and Walker.In order to secure the plutonium, the White Widow tasks Ethan with extracting Lane from an armored convoy moving through Paris. White Widow says that she is just a broker, and the seller wants Lane as payment for the plutonium. She provides one of the plutonium cores as a payment in kind for the mission. Hunt admits that he is Lark, and he has no lines about killing cops. He also admits to releasing smallpox in Kashmir to kill innocent women and children.Walker passes evidence on to Sloane suggesting that Hunt has always been Lark. He argues that CIA knew that Lark was an American Agent. He says that the Syndicate were believers in a cause, and when the cause was betrayed, they turned against their masters. Same thing happened to Hunt, since he has been betrayed by his Government on numerous occasions and maybe he has had enough. Walker gives Sloane a phone, that he says came from the man they killed in Paris, who claimed to be Lark.Ethan and Walker attack Lane's convoy (but do it in such a way that White Widow's team is put out of action). Ethen pushes Lane's escort van into the river. He then leads the police and the White Widow's men on a chase across Paris while Benji and Luther secure Lane. All the players gather in a garage. Ilsa reappears and attempts to kill Lane to prove her loyalty to MI6 (but the car is bullet proof and Ethan is able to take Lane to White Widow).\nThe mission to extract Lane is successful and White Widow instructs the team to deliver Lane to London. White Widow also wants Lark/Hunt to bring Ilsa to her, as she says that Ilsa killed 4 of her men.\nHunt meets Ilsa and realizes that she was in Paris to protect Lark, and in the washroom, she killed whom she thought was Lark, to protect Hunt. Ilsa wanted Lark to break Lane out, as she wanted to kill Lane. Hunt realizes that Ilsa is working for the MI6, and they want her to prove her loyalty.At a safe-house in London, IMF Secretary Alan Hunley (Alec Baldwin) confronts Ethan about being John Lark. Hunley also tells Ethan that the White Widow is working with the CIA to capture Lark, Lane, and the Apostles. Ethan denies it and incapacitates him to continue the mission. Ethan wants to hand over Lane to White Widow to get his hands on the Plutonium.The team trick Walker into admitting he is the real John Lark. Ethan made a mask of Lane & put it on Benji to trade him to the White Widow in exchange for the plutonium and left the real Lane with Walker. Walker was against trying to trick the White Widow and risk losing the Plutonium, but Ethan was not willing to free Lane.\nWalker walks up to Lane to free him, proving that he is indeed Lark. Turns out the real Lane was taken by Hunt, and Benji was sitting in the safe-house, as Lane, and he was the one that Walker tried to free.\nThen Hunley (who was not actually incapacitated), captures Lark, working together with Benji.Walker is working with Lane and the Apostles as part of a plot to acquire the plutonium and have Ethan branded a nuclear terrorist. The IMF team inform Sloane about Walker being Lark, who instructs a CIA unit to detain everyone. The CIA unit has been compromised by the Apostles and Walker orders them to attack Hunley and his IMF men instead.\nWalker kills Hunley in the ensuing fight and escapes. Ethan chases him across the city but is unable to apprehend him. Walker threatens the life of Ethan's estranged wife Julia Meade (Michelle Monaghan) and departs for a medical camp in Kashmir with Lane.The team deduces that Lane plans to detonate the two remaining nuclear weapons (each of 5 megaton yield) over a glacier and contaminate the water supply of Pakistan, India, and China. With a third of its population affected, the world will descend into anarchy from which Lane hopes a new world order will emerge.\nEthan finds Walker (Benji had inserted a signal inside Lane) has arranged for Julia to be assigned to the medical camp, increasing the pressure on him. Ethan finds Julia at the camp and finds that she is married to a doctor named Eric.\nLane activates the weapons and gives the detonator to Walker (to diffuse the bombs Luther and Benji need the detonator and then need to diffuse the bombs simultaneously). Walker leaves the camp in a helicopter, while Lane stays next to the bombs telling Walker that this is the end of the line for him.Ethan pursues him in a helicopter, leaving Benji, Luther, and Ilsa to find the weapons. Luther and Julia find the first bomb and work to understand its mechanism, but they are unable to defuse it without the detonator. Ilsa and Benji locate the second weapon and subdue Lane after Ilsa has a brutal fight with Lane.\nAfter a lengthy chase Ethan uses his helicopter to ram Walker's aircraft out of the sky. The two fight on a cliffs edge and Walker is killed. Ethan gains control of the detonator, allowing Luther, Ilsa, and Benji to deactivate the bombs.In the aftermath, the remaining two cores are safely recovered. Sloane hands Lane over to MI6 through the White Widow, which earns Ilsa's exoneration. Ethan recovers from his injuries with the help of Julia while the rest of the team joins him in victory.",
	"links": [
		"https://www.amazon.com/Mission-Impossible-Fallout-Tom-Cruise/dp/B07FDNRPR5"
	]
}