{
	"title": "Split",
	"release_year": "2016",
	"runtime": "117",
	"tags": [
		"Horror",
		"Thriller",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"James McAvoy",
		"James McAvoy",
		"James McAvoy",
		"Anya Taylor-Joy",
		"Haley Lu Richardson",
		"Jessica Sula",
		"Betty Buckley",
		"Izzie Coffey",
		"Brad William Henke",
		"Sebastian Arcelus",
		"Neal Huff",
		"Ukee Washington"
	],
	"staff": [
		"M. Night Shyamalan",
		"M. Night Shyamalan",
		"Marc Bienstock",
		"Jason Blum",
		"M. Night Shyamalan",
		"West Dylan Thordson",
		"Mike Gioulakis",
		"Luke Ciarrocchi",
		"Douglas Aibel",
		"Mara LePere-Schloop"
	],
	"votes": 567863,
	"cover": "https://m.media-amazon.com/images/M/MV5BNTZjNmVjMzAtZjg2Mi00MWNmLTk5NTItOTExZDYwNTE2YmExXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Casey Cooke (Anya Taylor-Joy) is a withdrawn teenager, having been molested as a child by her uncle John, her legal guardian since her father died from a heart attack. After a pity invite to a birthday party, she is offered a ride home by her classmate Claire (Haley Lu Richardson) and Claire's father, along with Claire's friend Marcia (Jessica Sula). As the girls wait for Claire's father in the car, he is knocked unconscious and Casey, Claire, and Marcia, are kidnapped by Kevin Wendell Crumb (James McAvoy), a man suffering from Dissociative identity disorder (DID).Kevin is in therapy with Dr. Karen Fletcher (Betty Buckley), who has identified 23 distinct personalities of Kevin. In his mind, these personalities sit in chairs in a room, waiting for \"Barry\", the dominant personality, to grant them their turn \"in the light\" (in control). She has also found that Kevin's physiology changes with each personality. Recently, \"Barry\" has refused to allow \"Dennis\" or \"Patricia\" their turns, in part due to Dennis' tendencies towards bothering underage girls and Patricia's undesirable traits, and also because both appear to worship a mysterious entity known as \"The Beast\". Fletcher has found that she can bring back Kevin's own personality by speaking his full name.Kevin, as \"Dennis\", locks the girls in a cell in his underground quarters. They recognize his DID, and Claire attempts to use this to escape but is caught by \"Dennis\" and separated from the others. Kevin continues going to work and attending appointments with Fletcher. Fletcher soon recognizes that \"Dennis\" has displaced \"Barry\" as the dominant personality. It is revealed that when Kevin was a child, his father left on a train one day and never returned. As he grew up, Kevin was abused and terrorized by his mother, who suffered from obsessive-compulsive disorder (OCD). He later experienced an awkward incident with two teenage girls where they forced Kevin to touch their breasts, which Fletcher believes triggered \"Dennis\" to take over.Marcia attempts to escape but is caught by \"Patricia\". Casey befriends \"Hedwig\", another one of Kevin's personalities that is a 9 year-old boy, who reveals himself as the one to have taken control of \"the light\" from \"Barry\". Casey convinces \"Hedwig\" to let her out of her cell to see his bedroom, believing that there might be a means of escape through the window \"Hedwig\" has described in that room, but she finds that it is only a drawing of a window. She takes a Walkie-Talkie from Hedwig and uses it to call for help, but the man at the other end thinks it is a prank. \"Patricia\" takes over and subdues Casey.Fletcher visits Kevin's home, where he reveals that he has met \"The Beast\", in actuality a yet-to-manifest 24th personality. Realizing that \"Dennis\" may have abducted the three missing girls to serve as a sacrifice to \"The Beast\", Fletcher feigns going to the bathroom, searches the house, and finds Claire. \"Dennis\" suddenly appears, sedates Fletcher and locks her up as well. \"The Beast\": a grotesque and cannibalistic sociopath with superhuman capabilities, such as inhuman bodily strength, enhanced speed and agility, along with near-invulnerability and unnatural mobility, to the point of being able to scale walls and ceilings but resulting in his insatiable hunger for raw human flesh.\"Dennis\" goes to a train station, where he boards an empty train car, which allows \"The Beast\" to finally take over, giving Kevin superhuman abilities. Fletcher writes Kevin's full name on a piece of paper before \"The Beast\" arrives and kills her. Casey escapes from her cell, only to find that \"The Beast\" has already devoured Marcia and watches in horror as he devours Claire too. Casey finds Fletcher's body and the piece of paper. \"The Beast\" approaches her, but she calls out Kevin's full name, bringing Kevin forth.Upon learning of the situation and realizing that he has not been in control for two years, a horrified Kevin begs Casey to kill him with a shotgun he has hidden. This prompts all 24 personalities to fight for control of \"the light\" and \"Hedwig\" is the victor. He gives control over to the undesirable personalities-\"Dennis\" and \"Patricia\"-so nobody will ever make fun of him again and they once again let \"The Beast\" take hold. Casey retrieves the gun and ammunition before escaping into an underground tunnel, where she shoots \"The Beast\" twice to no effect. She locks herself in a caged area whose bars \"The Beast\" begins to pull apart. Then he sees faded scars across her body from cutting herself. Having previously declared his plans to rid the world of the \"impure\" and \"untouched\"-those who have never suffered-he considers Casey to be \"pure\" so he spares her and he runs off.Casey is rescued and learns that she was being held at the Philadelphia Zoo, where Kevin had been an employee. When Casey is asked if she is ready to return home with her uncle, she hesitates to answer. In another hideout, \"Dennis\", \"Patricia\", and \"Hedwig\" discuss the power of \"The Beast\" and their plans to change the world.In a diner, several patrons watch as a news correspondent reports that Kevin's numerous personalities have earned him the nickname \"The Horde\". One patron notes the similarity to the case of a wheelchair-bound criminal incarcerated 15 years earlier who was also given a nickname. As she tries to remember the nickname, the man sitting next to her, David Dunn (Bruce Willis), says it was \"Mr. Glass\".",
	"links": [
		"https://www.amazon.com/Split-James-McAvoy/dp/B01MYFLG5H"
	]
}