{
	"title": "Get Out",
	"release_year": "2017",
	"runtime": "104",
	"tags": [
		"Horror",
		"Mystery",
		"Thriller",
		"amazon"
	],
	"rating": 7.8,
	"actors": [
		"Daniel Kaluuya",
		"Allison Williams",
		"Bradley Whitford",
		"Catherine Keener",
		"Caleb Landry Jones",
		"Marcus Henderson",
		"Betty Gabriel",
		"LaKeith Stanfield",
		"Stephen Root",
		"Lil Rel Howery"
	],
	"staff": [
		"Jordan Peele",
		"Jordan Peele",
		"Jason Blum",
		"Edward H. Hamm Jr.",
		"Sean McKittrick",
		"Jordan Peele",
		"Michael Abels",
		"Toby Oliver",
		"Gregory Plotkin",
		"Terri Taylor",
		"Rusty Smith"
	],
	"votes": 722803,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjUxMDQwNjcyNl5BMl5BanBnXkFtZTgwNzcwMzc0MTI@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Photographer Chris Washington (Daniel Kaluuya) reluctantly agrees to meet the family of his white girlfriend Rose Armitage (Allison Williams), unsure of a warm reception. During their drive to the family's countryside estate, they hit a deer and report the incident. The white policeman asks for Chris's identification even though he was not driving, but Rose intervenes, and the encounter goes unrecorded.At the house, Rose's white parents, neurosurgeon Dean (Bradley Whitford) and psychiatrist/hypnotherapist Missy (Catherine Keener), and her brother Jeremy (Caleb Landry Jones) make discomfiting comments about black people. Chris notices that the black workers at the estate are uncannily compliant. Unable to sleep, Chris goes outside to smoke and sees groundskeeper Walter running from the woods. Missy catches Chris returning and talks him into a hypnotherapy session to cure his smoking addiction. In a trance, he recounts the death of his mother in a hit-and-run when he was a child, about which he feels guilty. He sinks into a void Missy calls the \"sunken place\". He awakens believing he had a nightmare but realizes cigarettes now revolt him. The black housekeeper Georgina (Betty Gabriel) unplugs his phone, draining his battery.Dozens of wealthy white people arrive for the Armitages' annual get-together. They take an interest in Chris, admiring his physique or expressing admiration for black figures such as Tiger Woods. Chris meets Logan King (Lakeith Stanfield), a black man who also acts strangely, and who is married to a much older white woman.Chris calls his friend, black TSA Officer Rod Williams (Lil Rel Howery), about the hypnosis and the strange behavior at the house. When Chris attempts to stealthily photograph Logan, the camera flash makes Logan hysterical; he implores Chris to \"get out\". Dean claims Logan suffered an epileptic seizure. Away from the house, Chris persuades Rose to leave with him, while Dean holds an auction with a picture of Chris on display.Chris sends Logan's photo to Rod, who recognizes him as Andre, a missing person. While packing to leave, Chris finds photos of Rose in prior relationships with black people, including Walter and Georgina. Rose and the family block his exit and Missy hypnotizes him. Suspecting a conspiracy, Rod goes to the police but is derided.Chris awakens strapped to a chair. A video presentation featuring Rose's grandfather Roman (Richard Herd) explains that the family transplants the brains of white people into black bodies; the consciousness of the host remains in the \"sunken place\", watching but powerless. Jim Hudson (Stephen Root), a blind art dealer, tells Chris he wants his body so he can gain sight and Chris's artistic talents.Chris plugs his ears with stuffing pulled from the chair, blocking the hypnotic commands. When Jeremy comes to collect him for the surgery, Chris bludgeons him, impales Dean with the antlers of a whitetail deer mount, and stabs Missy. Chris steals a car and drives away but hits Georgina.Remembering his own mother's death, he carries Georgina into the car, but she is possessed by Rose's grandmother Marianne; she attacks him, and he crashes, killing her. Rose and Walter, who is possessed by Roman, catch up with him. Chris awakens the real \"Walter\" with his phone flash; Walter takes Rose's rifle, shoots her, and kills himself. Chris begins to strangle Rose but cannot bring himself to kill her. Rod arrives in a TSA car and he and Chris drive away.",
	"links": [
		"https://www.amazon.com/Get-Out-Daniel-Kaluuya/dp/B06Y1H48K7"
	]
}