{
	"title": "Sicario: Day of the Soldado",
	"release_year": "2018",
	"runtime": "122",
	"tags": [
		"Action",
		"Crime",
		"Drama",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Benicio Del Toro",
		"Josh Brolin",
		"Isabela Merced",
		"Jeffrey Donovan",
		"Catherine Keener",
		"Manuel Garcia-Rulfo",
		"Matthew Modine",
		"Shea Whigham",
		"Elijah Rodriguez",
		"Howard Ferguson Jr."
	],
	"staff": [
		"Stefano Sollima",
		"Taylor Sheridan",
		"Basil Iwanyk",
		"Thad Luckinbill",
		"Trent Luckinbill",
		"Edward L. McDonnell",
		"Hildur Guðnadóttir",
		"Dariusz Wolski",
		"Matthew Newman",
		"Jo Edna Boldin",
		"Alejandro Reza",
		"Marisol Roncali",
		"Mary Vernieu",
		"Kevin Kavanaugh"
	],
	"votes": 170952,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTEzNjM2NTYxMjReQTJeQWpwZ15BbWU4MDU2NzAxNTUz._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "A suicide bombing in a Kansas City retail shop kills fifteen people. The Mexican cartels control the border crossings completely. The US Border Patrol had apprehended several terrorists during crossings, who blew themselves up rather than allow themselves to be captured by US Authorities.Grave interrogates African pirate Bashir (Faysal Ahmed). Graver knows that the terrorists are from Yemen who crossed over from Mexico. So, the terrorists went from Yemen to Mexico via ship, as they could not fly in. He wants to know who paid Bashir not to attack the ship carrying the terrorists. Bashir confirms that the money came from cartel leader named Reymi.The United States government (represented by Secretary of Defense James Riley (Matthew Modine) & CIA Director Cynthia Foards (Catherine Keener)) responds by authorizing CIA agent Matt Graver (Josh Brolin) to apply extreme measures to combat Mexican drug cartels, who are suspected of smuggling the terrorists across the border.Graver and the Department of Defense decide the best option is to instigate a war between the major cartels. Graver rules out killing the head of a cartel as that would split one cartel into 50. Graver says that to start a war, kidnap a prince, and the King will start the war for you.\nGraver recruits black operative Alejandro Gillick (Benicio Del Toro) for the mission. Graver also meets with PMC official Andy Wheeldon (Shea Whigham) to secure mercenaries, helicopters, and encrypted communication equipment in order for the U.S. to maintain plausible deniability while combating the Mexican cartels. Wheeldon charges $10 million a month for payroll and supplies, plus $150,000 for himself and immunity for his participation in the operation.Gillick assassinates a high-profile lawyer of the Matamoros cartel in Mexico City while Graver and his team kidnap Isabel Reyes (Isabela Moner), the daughter of the kingpin of their rival, in a false flag operation.Graver, Gillick, and their team take Isabel to Texas and stage a \"rescue\" with the DEA and local police to make her think she was kidnapped by her father's enemies. Gillick bonds with Isabel and the team makes plans to transport her back to Mexico, intending to leave her in territory controlled by her father's rivals in order to further escalate the conflict. However, the Mexican police escort for their trip back across the border double-cross them and attack the American vehicles after they have entered Mexican territory. Graver and his team kill 25 Mexican policemen to escape the ambush. Graver's team was also protected by a predator drone, which helps eliminate the threats to the US convoy.\nIsabel flees the scene in the middle of the chaos and Gillick goes after her alone. Graver orders Gillick to bring Isabel to the border. Graver and his remaining men have to retreat as back up Mexican police contingent was starting to move towards their position.Gillick finds Isabel on the side of the Highway, where she was going to be sexually assaulted by a random person.\nMeanwhile, the American government determines that at least two of the suicide bombers in Kansas City were actually domestic terrorists, not foreign nationals and thus were not smuggled into the United States by the cartels. Plus, the American citizens from Mexico can see bodies of dozens of Mexican policemen on Fox News, claiming to be shot in a US special operation.\nIn order to quell tensions with Mexico, the President orders the CIA to abandon the mission and erase all proof of American involvement by having Isabel & Gillick killed as part of the cover-up.Graver in turn orders Gillick to kill Isabel, but he refuses and turns rogue to keep her alive. Graver assembles his team to hunt them down in Mexico. Meanwhile, Isabel recognizes Gillick as the attorney, whose family was killed on orders of her father.Gillick and Isabel move to enter the United States disguised as illegal immigrants, as it would be illegal for the CIA to execute Isabel on American soil. Gillick inserts a GPS tracker inside Isabel's shoe. They reach a border cross point, where the transfers are executed by cartel agents who take people across the border.Miguel (Elijah Rodriguez), a Mexican American \"coyote\" who is the cartel person taking the people across the border, recognizes Gillick from a previous encounter, in a parking lot in Texas. Miguel knew that Gillick was with the US security agencies.\nHe alerts his boss and Gillick and Isabel are captured. Miguel is forced to execute Gillick. He shoots Gillick and the gang leaves him for dead. Miguel is disappointed with the gang and abandons them shortly.Graver and his team track down the Mexican gang and Isabel with the help of a GPS transmitter inserted into her shoe. Graver comes inside Mexican territory via helicopter and his team kill all the gang members. Graver takes pity on Isabel and decides to bring her back to the United States and put her in witness protection rather than following his orders to kill her.\nMeanwhile, Gillick wakes up finding the bullet went through his cheek, takes one of the gang members' cars and drives for the border. One year later, Gillick has recovered from his injuries. He finds Miguel and asks him if he wants to become a Sicario.",
	"links": [
		"https://www.amazon.com/Sicario-Day-Soldado-Josh-Brolin/dp/B07F6QN8BR"
	]
}