{
	"title": "Hush",
	"release_year": "2016",
	"runtime": "82",
	"tags": [
		"Horror",
		"Thriller",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"John Gallagher Jr.",
		"Kate Siegel",
		"Michael Trucco",
		"Samantha Sloyan",
		"Emma Graves"
	],
	"staff": [
		"Mike Flanagan",
		"Mike Flanagan",
		"Kate Siegel",
		"Jason Blum",
		"Trevor Macy",
		"The Newton Brothers",
		"James Kniest",
		"Mike Flanagan",
		"Anne McCarthy",
		"Kellie Roy",
		"Elizabeth Boller"
	],
	"votes": 156996,
	"cover": "https://m.media-amazon.com/images/M/MV5BZjQ0YTU4OTQtMTU3Zi00OTdlLTkzN2EtZjlmOTZhNjIwN2VkXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The movie centers around Maddie Young (played by Kate Siegel), a deaf and mute writer who lives alone in a secluded house in the woods. Maddie lost her hearing due to a bout of bacterial meningitis at the age of 13, and she communicates through American Sign Language (ASL). She lives a solitary life, her days filled with writing and her evenings spent video-chatting with her sister Max and her friend Sarah, who is also her neighbor.As the film begins, Maddie is struggling with writer's block and is working on her latest novel, which plays with multiple endings. Her friend Sarah visits her to return a copy of one of her books, and after she leaves, the evening seems to wind down quietly. However, the peace is abruptly shattered when a masked assailant murders Sarah outside Maddie's house. Maddie, unable to hear the commotion outside, continues her evening unaware of the danger lurking right outside her door.The killer quickly realizes that Maddie is deaf and decides to make her his next victim. He begins a terrifying game of cat and mouse, taking pleasure in the fact that Maddie cannot hear him as he breaks into her house and stalks her from the shadows. The tension builds as Maddie becomes aware of the killer's presence, first by feeling vibrations and then by seeing him through the windows of her house.Using her wits and the environment to her advantage, Maddie attempts to defend herself. She writes on her laptop screen that she hasn't seen his face, hoping to persuade him to leave. However, the killer is unfazed and makes his intentions clear by stepping into the light, removing his mask, and showing her that he is unafraid of being identified. His goal is not to escape undetected but to terrorize and ultimately kill her.What follows is a tense and brutal series of encounters between Maddie and the killer. Maddie tries several strategies to escape or outsmart the killer. She uses various tactics such as setting off her car alarm to attract attention, creating barricades, and even attempting to shoot the killer with a crossbow she keeps for self-defense. Each attempt brings its own set of challenges and setbacks, illustrating Maddie's resilience and ingenuity, as well as the killer's sadistic determination.One of the most pivotal scenes occurs when Maddie writes what she believes will be her last message on the door of her house, using her own blood to write \"Do it\" to the killer, in a final act of defiance and acceptance of her potential fate. This act of bravery changes the dynamic, shifting Maddie from prey to a determined survivor ready to fight back with all her might.In the climax of the film, Maddie uses her senses of sight and touch to turn the tables on her assailant. After a fierce struggle, she manages to kill him, using her skills, environment, and the element of surprise to her advantage. The movie ends with Maddie, severely injured but alive, sitting on the porch of her home as the police arrive, signifying her survival and resilience.",
	"links": [
		"https://www.amazon.com/Hush-Mike-Flanagan/dp/B0D69GYMVK"
	]
}