{
	"title": "Godzilla vs. Kong",
	"release_year": "2021",
	"runtime": "113",
	"tags": [
		"Action",
		"Sci-Fi",
		"Thriller",
		"max",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Alexander Skarsgård",
		"Millie Bobby Brown",
		"Rebecca Hall",
		"Brian Tyree Henry",
		"Shun Oguri",
		"Eiza González",
		"Julian Dennison",
		"Lance Reddick",
		"Kyle Chandler",
		"Demián Bichir"
	],
	"staff": [
		"Adam Wingard",
		"Terry Rossio",
		"Michael Dougherty",
		"Zach Shields",
		"Eric Pearson",
		"Alex Garcia",
		"Jon Jashni",
		"Eric McLeod",
		"Mary Parent",
		"Tom Holkenborg",
		"Ben Seresin",
		"Josh Schaeffer",
		"Sarah Finn",
		"Tom Hammock",
		"Owen Paterson"
	],
	"cover": "https://m.media-amazon.com/images/M/MV5BNjAxNDA2MjAtZjkyNS00MjcyLWI3ZTYtOTMyYmQzNDQ5OGEyXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"links": [
		"https://www.amazon.com/Godzilla-vs-Kong-Alexander-Skarsg%C3%A5rd/dp/B094BYCKWD",
		"https://www.max.com/movies/godzilla-vs-kong/f1c6ef16-40b2-4ef5-89ed-547decd9e620"
	],
	"votes": 249303,
	"description": "Five years after Godzilla defeated King Ghidorah, Kong is monitored by Monarch within a giant dome on Skull Island. Kong is visited by Jia (Kaylee Hottle), the last Iwi native (Deaf) and adopted daughter of Kong expert Ilene Andrews (Rebecca Hall) (A Monarch anthropological linguist), who is deaf and communicates with Kong via sign language. Kong is getting too big for the electronic dome under which he has been kept and Ilene knows that he won't last in there much longer. But if Kong leaves Skull Island, Godzilla will come for him, as there can't be 2 alphas.Bernie Hayes (Brian Tyree Henry), an employee of Apex Cybernetics and host of a Titan conspiracy theory podcast, extracts data suggesting sinister activities at a Pensacola facility (shipping manifests to Apex's facility in Hong Kong and designs of a massive machine). However, Godzilla suddenly attacks the facility, during the rampage, Bernie stumbles on a massive device.Madison Russell (Millie Bobby Brown), a fan of Bernie's podcast (The daughter of Monarch scientists Mark and the late Emma Russell. Madison believes there is a reason for Godzilla's erratic behavior, suspecting a conspiracy formulated by the Apex Cybernetics (She believes something at Apex provoked Godzilla)), enlists her friend Josh (Julian Dennison) to investigate Godzilla's attacks.Apex CEO Walter Simmons (Demián Bichir) (Maia's father, CEO, and founder of Apex Cybernetics, a tech organization invested in trying to solve the Earth's \"Titan problem,\" secretly creating Mechagodzilla to exterminate them) recruits Nathan Lind (Alexander Skarsgård) (A Monarch geologist and chief cartographer who works closely with Kong and charts the mission into the Hollow Earth), former Monarch scientist, and Hollow Earth theorist, to guide a search for a power source into the Hollow Earth, the home world of the Titans. Walter convinces Nathan that the new power source is required to keep the titans in check.Nathan is initially hesitant as his brother died in an expedition to the Hollow Earth due to a strong reverse-gravitational effect. He agrees after Walter reveals that Apex has developed HEAVs (Hollow Earth Aerial Vehicle), specialized crafts able to withstand the pressure exerted by the gravity field.Nathan meets with Ilene and convinces her to let Kong guide them through the Hollow Earth via an outpost in Antarctica. The entries to hollow earth can only be opened by a titan.\nNathan, Ilene, and an Apex team led by Walter's daughter Maia (Eiza González) board a modified barge escorted by the U.S. Navy that carries a sedated and restrained Kong. Kong is kept under control by Jia. Irene is astounded to learn that Kong understands sign language.Godzilla attacks the convoy and defeats Kong (Nathan releases Kong's shackles after Godzilla tilts the barge on which Kong and the entire Apex team was hosted. Kong manages to push back Godzilla enough to set the barge upright and save Jia) (Kong shifts the battle to the aircraft carrier to protect Jia. Godzilla uses his atomic breath to destroy the carrier. Kong can't breathe underwater and is defeated easily) but retreats after the ships disable their power and trick him into thinking they are destroyed. To avoid alerting Godzilla, Kong is airlifted to the Hollow Earth entrance, and Jia convinces him to enter the tunnel (as there is no way for Kong to survive in the cold Antarctic climate and fleet was destroyed getting there) while the team follows him in the HEAVs.Madison and Josh find Bernie (Madison tracks the sales of bleach as Bernie uses bleach to avoid all organic tracking technology), who joins their investigation. They sneak into the wrecked Apex base, discover a secret facility underground, and are inadvertently locked into an underground monorail transport to Apex headquarters in Hong Kong, where they unwittingly stumble on a test of Mechagodzilla. It is telepathically controlled by Ren Serizawa (Shun Oguri) (Apex's chief technology officer), the son of the late Ishiro Serizawa, through the neural networks from the skull of a severed Ghidorah head but is hobbled by its power supply's limitations. Ren is using home grown skull crawlers to train himself in using the Mechagodzilla (it has a laser breath). Walter intends to harness the Hollow Earth's energy to overcome Mechagodzilla's limitations.Inside the Hollow Earth, Kong and the team find an ecosystem similar to Skull Island (with flying skull crawlers, who destroy one of the HEAVs before Kong fights them off). They discover his species' ancestral throne room, where they find remains of an ancient war with Godzilla's kind and a glowing ax made from another Godzilla's dorsal plates. As they identify the power source, the Apex team sends its signature back to their Hong Kong base despite Ilene's protests.\nAttracted by Mechagodzilla's activation, Godzilla arrives in Hong Kong, and sensing Kong, he directly drills a shaft to the throne room with his atomic breath. Maia and the Apex team attempt to escape in the ensuing mayhem, but their HEAV is crushed by Kong. Kong, Ilene, Jia, and Nathan ascend to Hong Kong, where Kong engages Godzilla in a final battle. Kong initially gains the upper-hand; however, Godzilla emerges victorious after incapacitating Kong (Shoulder dislocation and cracked ribs).Madison, Josh, and Bernie are caught by security and taken to Walter. Despite Ren's concerns over the power source's volatility, Walter orders him to activate Mechagodzilla. Now possessed by Ghidorah's consciousness, Mechagodzilla kills Walter, electrocutes Ren, and then attacks Hong Kong. Godzilla and Mechagodzilla battle, but Godzilla is overwhelmed. The laser beam is more than a match for atomic breath and soon enough Godzilla is being thrown around like a toy.Nathan revives Kong by destroying the HEAV (Kong's heartbeat was weak, and Nathan uses the HEAVs engines to produce an electromagnetic pulse, large enough to give a kick start to Kong's heart), and Jia convinces him to help Godzilla. As Mechagodzilla overpowers both Titans, Josh short-circuits Mechagodzilla's controls with Bernie's flask of liquor, momentarily interrupting the Mecha. Godzilla charges Kong's ax with his atomic breath, allowing Kong to destroy Mechagodzilla. Madison, Bernie, and Josh reunite with Mark Russell, while Godzilla and Kong acknowledge each other before the two go their separate ways.Sometime later, Monarch has established an observation post in the Hollow Earth, where Kong now rules."
}