{
	"title": "Three Billboards Outside Ebbing, Missouri",
	"release_year": "2017",
	"runtime": "115",
	"tags": [
		"Comedy",
		"Crime",
		"Drama",
		"amazon"
	],
	"rating": 8.1,
	"actors": [
		"Frances McDormand",
		"Woody Harrelson",
		"Sam Rockwell",
		"Caleb Landry Jones",
		"Kerry Condon",
		"Alejandro Barrios",
		"Clarke Peters",
		"Darrell Britt-Gibson",
		"Abbie Cornish",
		"Riya May Atwood"
	],
	"staff": [
		"Martin McDonagh",
		"Martin McDonagh",
		"Graham Broadbent",
		"Peter Czernin",
		"Martin McDonagh",
		"Carter Burwell",
		"Ben Davis",
		"Jon Gregory",
		"Sarah Finn",
		"Inbal Weinberg"
	],
	"votes": 563647,
	"cover": "https://m.media-amazon.com/images/M/MV5BZGRlMDUxNDgtYzFlZS00MzlkLWIzNWYtMmE3OWFiZDgxMmJhXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "Mildred Hayes (Frances McDormand) is grieving the sexual assault and murder of her teenage daughter Angela (Kathryn Newton) seven months prior. Angry over the lack of progress in the investigation, she rents three abandoned billboards near her home, which in sequence read \"R***D WHILE DYING\", \"AND STILL NO ARRESTS?\", and \"HOW COME, CHIEF WILLOUGHBY?\" The billboards upset the townspeople, including Sheriff Bill Willoughby (Woody Harrelson) and racist officer Jason Dixon (Sam Rockwell). The open secret that Willoughby suffers from terminal pancreatic cancer adds to their disapproval (in addition to Willoughby being a good man). Mildred and her depressed son Robbie (Lucas Hedges) are harassed and threatened, but she stays firm, to Robbie's chagrin.\nWhile Willoughby is sympathetic to Mildred's frustration, he finds the billboards an unfair attack on his character. Angered by Mildred's lack of respect for his authority, Dixon threatens Red (Caleb Landry Jones), who rented her the billboards, and arrests her friend and coworker, Denise (Amanda Warren), on trivial marijuana-possession charges. Mildred is also visited by her abusive ex-husband Charlie (John Hawkes), who blames her for their daughter's death.Willoughby brings Mildred in for questioning after she injures her dentist in an altercation in his clinic. During the interview, Willoughby coughs up blood. He leaves the hospital against medical advice and spends an idyllic day with his wife Anne (Abbie Cornish) and daughters, before committing suicide. He leaves suicide notes for several people, including one to Mildred, in which he explains that she was not a factor in his suicide, and that he secretly paid to keep the billboards up for another month, amused at the trouble this will bring her. Mildred is threatened by a stranger in her store. Dixon reacts to the news of Willoughby's death by assaulting Red and his assistant. This is witnessed by Willoughby's replacement, Abercrombie (Clarke Peters), who fires him.\nThe billboards are destroyed by arson. Mildred retaliates by tossing Molotov cocktails at the police station, which she believes is unoccupied for the night. However, Dixon is there to read a letter left for him by Willoughby, advising him to let go of hate and learn to love as the only way to realize his wish to become a detective. Dixon escapes with Angela's case files, suffering severe burns. Mildred's acquaintance James (Peter Dinklage) witnesses the incident and provides Mildred with an alibi, claiming they were on a date.Discharged from the hospital, Dixon overhears the man who threatened Mildred bragging in a bar of an incident similar to Angela's murder. He notes the Idaho license plate number of the man's vehicle, then provokes a fight. At home, he removes a sample of the man's DNA. Meanwhile, Mildred goes on a date to thank James for the alibi; Charlie enters with his 19-year old girlfriend Penelope (Samara Weaving), and admits to burning the billboards. Mildred instructs Charlie to treat Penelope well and leaves.\nAbercrombie informs Dixon that the DNA sample does not match DNA found on Angela's body, and that the man was overseas on military duty at the time of the murder. Mildred and Dixon conclude that the man must be guilty of some other sexual assault, and set out for Idaho with a gun. On the way, Mildred confesses to him the police station fire; he replies without surprise. They express reservations about their mission, but agree to decide what to do on the way.",
	"links": [
		"https://www.amazon.com/Three-Billboards-Outside-Ebbing-Missouri/dp/B077PL4NPZ"
	]
}