{
	"title": "Dunkirk",
	"release_year": "2017",
	"runtime": "106",
	"tags": [
		"Action",
		"Drama",
		"History",
		"amazon"
	],
	"rating": 7.8,
	"actors": [
		"Fionn Whitehead",
		"Barry Keoghan",
		"Mark Rylance",
		"Tom Hardy",
		"Damien Bonnard",
		"Aneurin Barnard",
		"Lee Armstrong",
		"James Bloor",
		"Tom Glynn-Carney",
		"Jack Lowden"
	],
	"staff": [
		"Christopher Nolan",
		"Christopher Nolan",
		"Christopher Nolan",
		"Emma Thomas",
		"Hans Zimmer",
		"Hoyte Van Hoytema",
		"Lee Smith",
		"John Papsidera",
		"Toby Whale",
		"Nathan Crowley"
	],
	"votes": 751535,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTE0Mjg4MTMwMDZeQTJeQWpwZ15BbWU4MDAwMDQ1ODAy._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The narrative follows three inter-connected perspectives covering different but overlapping periods: on land covering one week, on the sea covering one day, and in the air covering one hour. The three parts interweave to create a non-linear narrative.An introductory text says that in 1940, after the invasion of France by Nazi Germany, hundreds of thousands of Allied soldiers retreated to the seaside town of Dunkirk. As the Allied perimeter shrinks and German forces close in, the soldiers await evacuation in a seemingly hopeless situation.I. The Mole:\nOn land, Tommy (Fionn Whitehead), a young British private, is the sole survivor of his section, after an ambush by unseen German soldiers in the streets of Dunkirk. He makes it to the beach, where he finds British and Allied troops waiting for evacuation. He meets Gibson, another young soldier, who appears to be burying a comrade. After a German Stuka dive-bomber attack, they happen upon a man left for dead. They rush his stretcher up to the front of the queue and onto a ship, hoping to evacuate with the wounded, but are denied passage themselves. Undeterred, they hide on the mole, hoping to sneak aboard the next vessel. However, this ship is attacked as it departs; in the chaos they save another soldier, Alex, from being crushed as it sinks. They embark on another departing ship that night, but this is sunk by a torpedo from a U-boat. Gibson (Aneurin Barnard) saves Tommy and Alex (Harry Styles) and they are taken to shore by a soldier (who later shows up as the shell-shocked soldier in The Sea plot-line).Commander Bolton (Kenneth Branagh) and Colonel Winnant (James D'Arcy) review the situation. Prime Minister Winston Churchill has said that he will not be seeking peace and has committed to evacuating 30,000 soldiers. Furthermore, the Navy has decided not to use larger capital ships in the evacuation in order to preserve them to defend against an anticipated invasion of Britain and has also decided not to evacuate French soldiers to maximize space. In order to evacuate more men, the navy has requisitioned smaller civilian vessels that can sail up closer to the beach.The next day, Alex, Tommy, and Gibson join a group of Scottish soldiers that has located a grounded fishing trawler in the inter-tidal zone outside of the Allied perimeter. They hide in it hoping to use it to evacuate when the tide rises. Its owner, a Dutch mariner who answered Britain's calls for civilian evacuation, returns and explains that he had left the boat to wait for the rising tide. Soon after, German troops start to shoot at the boat for target practice, unaware of the soldiers sheltering inside. When the tide rises, the bullet holes in the hull make it difficult to keep the boat afloat. Seeking to reduce their weight, Alex accuses Gibson, who has remained silent throughout, of being a German spy, and demands that he be put off. Tommy defends him, but Gibson reveals that he is French, and had stolen the identity of the soldier whom he had been burying, hoping to evacuate with the British. The ensuing physical altercation rocks the boat upright and the seaman is able to start the engine. However, they are unable to get very far before it sinks. The men abandon ship, except for Gibson, who becomes tangled in a chain and drowns. Alex and Tommy swim for a nearby minesweeper, but this is sunk by a bomber. They are narrowly rescued from a burning oil slick, after being taken aboard Mr. Dawson's (Mark Rylance) Moonstone.They cross the English Channel and are placed on a train in Weymouth. As the train enters Woking, Alex and Tommy expect that their retreat will earn them public scorn; instead, they receive a hero's welcome. While Alex embraces the welcome, Tommy is preoccupied by reading Churchill's address to the nation from a newspaper.Back on the beach, Commander Bolton watches the last British soldiers leave. He confirms that 300,000 have been evacuated, ten times the most positive initial estimate. He stays behind to oversee the evacuation of the French rearguard. Colonel Winnant renders a salute.II. The Sea:\nIn Weymouth, the Royal Navy is commandeering private boats for the evacuation. Mr. Dawson, a civilian, cooperates, but rather than let a navy crew take his boat, he and his son Peter (Tom Glynn-Carney) take her out themselves; their teenage hand George (Barry Keoghan) impulsively joins them as they leave, hoping to do something noteworthy to compensate for his poor performance in school. As they head towards Dunkirk, Mr. Dawson points out three Spitfires flying overhead. They encounter a shell-shocked officer on a wrecked ship, the sole survivor of a U-boat attack, and take him aboard. When he discovers that Dawson is sailing for Dunkirk rather than to England, he begins to panic. Intimidated by the soldier, Peter locks him below deck. After escaping, the soldier tries to wrest control of the boat, and in the scuffle, George falls, suffering a severe blow to the head. Peter treats George's wounds as best as he can, but his injury grows worse, causing him to go blind. Duty-bound to aid the evacuation, Dawson continues towards France.They see a Spitfire ditch in the ocean, and Dawson steers for it in case the pilot, Collins (Jack Lowden), can be rescued, despite not seeing a parachute. Collins is trapped in his Spitfire by the jammed canopy. Before Collins drowns, Peter breaks open the canopy and pulls Collins aboard. Peter reveals that his elder brother was a Hurricane pilot, killed in the opening weeks of the war. They encounter a minesweeper-turned-transport under attack from a Heinkel bomber. Dodging fire from the accompanying fighters, they maneuver to take on troops from the sinking ship, which is spilling oil. They get clear just before the oil is ignited by the bomber which has been shot down. Dawson and his crew pull as many survivors aboard as they can, among them Alex and Tommy. As the boat fills with men, Peter tells them to be careful around George, but a soldier reveals he has died. Peter returns above board, and the shell-shocked soldier asks him if George is all right. Peter holds back any anger and lies, telling him that George will be fine. Back in Weymouth, Dawson is congratulated for the number of men he has saved, as George's body is carried off the boat on a stretcher. The shell-shocked soldier sees this before he leaves for the train. Peter later gives a photograph of George and the details of his participation to the local newspaper, which leads to a front-page article commending him as a war hero.III. The Air:\nThree RAF Spitfires, piloted by Farrier (Tom Hardy), Collins and their Squadron Leader (Michael Caine) (callsign 'Fortis Leader'), head across the English Channel to provide air support to the operation at Dunkirk, knowing that the time they can spend there is limited by their fuel supply. They encounter German fighters and get into a dogfight, during which 'Fortis Leader' is shot down. Farrier assumes command, and although his fuel gauge is shattered, they continue towards France. They shoot down another Luftwaffe plane in their next skirmish, but Collins's Spitfire is badly damaged, and he opts to ditch in the Channel rather than bail out. Farrier assumes Collins is fine after seeing his waving hand and continues alone.Farrier sees a German bomber attacking a minesweeper-turned-transport near Mr. Dawson's yacht. Switching to reserve fuel, he engages both it and a fighter overhead. He shoots down the bomber after it damages the minesweeper, but it crashes into an oil slick spilling out of the ship, igniting it and several survivors.Flying on, Farrier reaches Dunkirk, his fuel tank exhausted, in time to shoot down a dive bomber while he is gliding, saving British ships and the troops squeezed onto the docks. He glides over the beach to cheers from the soldiers and sailors below. Farrier just manages to crank his landing gear down as the wheels touch the sand beyond the Allied perimeter. He sets fire to his plane with his flare gun to prevent it falling into German hands and is then taken prisoner by German soldiers.",
	"links": [
		"https://www.amazon.com/Dunkirk-Fionn-Whitehead/dp/B076QVB5HP"
	]
}