{
	"title": "Ocean's Eight",
	"release_year": "2018",
	"runtime": "110",
	"tags": [
		"Action",
		"Comedy",
		"Crime",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Sandra Bullock",
		"Cate Blanchett",
		"Anne Hathaway",
		"Mindy Kaling",
		"Griffin Dunne",
		"Deidre Goodwin",
		"Daniella Rabbani",
		"Brian J. Carter",
		"Gemma Forbes",
		"Katherine Hozier-Adams"
	],
	"staff": [
		"Gary Ross",
		"Gary Ross",
		"Olivia Milch",
		"George Clayton Johnson",
		"Jack Golden Russell",
		"Susan Ekins",
		"Steven Soderbergh",
		"Daniel Pemberton",
		"Eigil Bryld",
		"Juliette Welfling",
		"Shayna Markowitz",
		"Debra Zane",
		"Alex DiGerlando"
	],
	"votes": 245901,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjAyNDEyMzc4Ml5BMl5BanBnXkFtZTgwMjEzNjM0NTM@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Following release from prison, Debbie Ocean (Sandra Bullock), younger sister of the late Danny Ocean, meets with her former partner-in-crime Lou (Cate Blanchett) to convince her to join a heist that she planned while serving her sentence. Debbie and Lou assemble the rest of their team: Rose Weil (Helena Bonham Carter), a disgraced fashion designer who is deeply in debt with the IRS; Amita (Mindy Kaling), a jewelry maker and friend of Debbie's who is eager to move out of her mother's house and start her own life; Nine Ball (Rihanna), a computer cracker; Constance (Awkwafina), a street hustler and pickpocket; and Tammy (Sarah Paulson), a profiteer and another friend of Debbie's who has been secretly selling stolen goods out of her family's suburban home.Debbie plans to steal the Toussaint, a $150 million Cartier necklace, from the Met Gala in five weeks, and use Met Gala co-host Daphne Kluger (Anne Hathaway), a dim-witted and snobby actress, as an unwitting mule who will wear the necklace into the gala. After the team manipulates Daphne into choosing Weil as her stylist (by setting up Weil's meeting with Daphne's rival for met gala showcase), Weil and Amita go to Cartier to convince them to let Daphne wear the Toussaint, as well as surreptitiously digitally scan it to later manufacture a zircon duplicate.\nDebbie hunts down her ex-boyfriend Claude Becker (Richard Armitage), an art dealer who ratted her out to the police when they were discovered for art fraud, which led to her arrest and imprisonment. Debbie manipulates Daphne to invite Becker as her date to the gala. Lou realizes that Debbie is out for revenge on Becker, but Debbie reassures her that everything will be fine.Weil discovers a flaw in the plan: The Toussaint can only be removed using a special magnet carried by the bodyguards hired by Cartier. Nine Ball enlists her younger sister, Veronica, to build a similar magnet in time for the gala. As the gala begins, Daphne consumes soup that Lou spiked, causing her to vomit in the restroom, where Constance takes the necklace. When the necklace is discovered to be missing, the museum is evacuated and searched; Tammy \"finds\" the duplicate necklace in order to end the search. Meanwhile, Amita retrieves the real necklace and begins disassembling it. She retools it into several pieces of jewelry and gives them to Constance to slip it to each member of the team. One of the real diamonds is planted on Becker.Soon after the gala, the fake necklace is identified when returned to Cartier, and John Frazier (James Corden), an insurance fraud investigator, is called in. Frazier, who has a history with the Ocean family, notices Debbie's presence and suspects her involvement in the heist, but unable to find any evidence against her solid alibi. Debbie assures Frazier that she does not know where the necklace is, but she may know where part of it is. Dropping her dimwitted persona, Daphne is revealed to have been in on the plan, tipped off by Weil's bad acting, and Debbie and Lou invited her in to keep her from ratting them out.Daphne visits Becker for a romantic evening, where she finds the diamonds planted on him by Debbie during the gala and sends a picture to Frazier so that he can obtain a warrant to arrest Becker for stealing the necklace. To further frame Becker, Debbie sells pieces of the necklace to actresses disguised as elderly socialites, who in turn sell the jewelry and deposit the money into an account in his name. Becker is arrested.As the eight celebrate their victory, Daphne asks Debbie and Lou how they each made so much money from the sale of one necklace. Lou reveals that while the gala was being evacuated, Lou and \"The Amazing\" Yen were stealing some of the Crown Jewels on display during the Gala, which makes their cuts higher than expected.Each member of the team goes their separate ways with their money: Amita goes to Paris with a man she met on Tinder; Weil pays off her debts and opens her own store; Constance buys a spacious loft in the city and becomes a YouTuber; Tammy expands her business in selling stolen goods; Nine Ball opens a pool bar; Daphne becomes a director; Lou goes on a cross-country road trip; and Debbie returns to Danny's grave to raise a toast to him with a martini in his honor.",
	"links": [
		"https://www.amazon.com/Oceans-8-Sandra-Bullock/dp/B07FK57X8Q"
	]
}