{
	"title": "Isle of Dogs",
	"release_year": "2018",
	"runtime": "101",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"amazon"
	],
	"rating": 7.8,
	"actors": [
		"Bryan Cranston",
		"Koyu Rankin",
		"Edward Norton",
		"Bob Balaban",
		"Jeff Goldblum",
		"Bill Murray",
		"Kunichi Nomura",
		"Akira Takayama",
		"Greta Gerwig",
		"Frances McDormand"
	],
	"staff": [
		"Wes Anderson",
		"Wes Anderson",
		"Roman Coppola",
		"Jason Schwartzman",
		"Kunichi Nomura",
		"Wes Anderson",
		"Jeremy Dawson",
		"Steven Rales",
		"Scott Rudin",
		"Alexandre Desplat",
		"Tristan Oliver",
		"Edward Bursch",
		"Ralph Foster",
		"Andrew Weisblum",
		"Douglas Aibel",
		"Kunichi Nomura",
		"Paul Harrod",
		"Adam Stockhausen"
	],
	"votes": 193935,
	"cover": "https://m.media-amazon.com/images/M/MV5BZTVmZWFmYWYtZTY1NC00Yjg5LTkxZGItZjhiYTExNTExNjA3XkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "A thousand years ago, dogs were free to roam as they pleased. Historically, the Kobayashi family has been shown to fight the dogs for the last 10 centuries. The cat-loving Kobayashi Dynasty declared war on dogs, seeking to eradicate them. A child warrior sympathetic towards the threatened dogs decapitated the head of the Kobayashi Clan, ending the war, and was immortalized as the Boy Samurai of Legend. The boy restores security of dogs in all of Japan, where they thrive under human protection ever since. The Kobayashi clan never forgot this defeat and decided to bide their time.In 2038 a dystopian near-future Japan, a dog-flu virus spreads throughout the canine population of Megasaki. The dog-flu threatens to cross the species threshold and start infecting humans. Though one scientist, Professor Watanabe (Akira Ito), is close to finding a cure, but overruling him the authoritarian mayor of Megasaki City, Kobayashi (Kunichi Nomura), signs a decree banishing all dogs (both stray and domesticated) to Trash Island (now called the Isle of Dogs). Kobayashi has been Mayor of Megasaki for 6 consecutive terms.\nWatanabe is Kobayashi's political rival and says that dogs have served humans faithfully for centuries and should not be abandoned. He asks for only 6 months to deliver the serum.The first deported canine is a white and black-spotted male dog named Spots Kobayashi (Liev Schreiber), who served as the bodyguard of 12-year-old orphan Atari Kobayashi (Koyu Rankin), the mayor's distant nephew and ward. Only a rope-way connects the city to Trash Island.\nThe infected dogs have symptoms like weight loss, dizziness, insomnia and extreme aggressive behavior. 75% of them get snout-fever with symptoms like high temperature, low blood pressure, moodiness and spasmodic nasal expiration. The exiled canine populations gets more desperate with the passage of time.Atari had lost his parents in a tragic accident and Kobayashi adopted him on live TV. But Atari was treated a little more than a prisoner in the Mayoral household, with Spots being his 24-hour guard dog. Atari and Spots had started loving each other as Master and Dog, angering Kobayashi.Six months later, Atari steals a plane and flies to Trash Island to search for Spots. After a crash-landing, he is rescued by a pack of dogs led by a black dog, Chief (Bryan Cranston). They decide to help Atari locate Spots, although Chief, a former stray, is reluctant to fraternize with humans. With their help, Atari finds a locked cage that apparently contains Spots' skeleton but learns that it is not him.They fend off a rescue team sent by Kobayashi to retrieve Atari. Chief initially declines to continue helping the boy, but at the insistence of a female pure breed named Nutmeg (Scarlett Johansson) (Chief has a huge crush on Nutmeg and will do anything to impress her), Chief reluctantly decides to accompany the group on their search. They seek advice from two sage dogs, Jupiter (F. Murray Abraham) and Oracle (Tilda Swinton), who warn them of cannibal dogs on an isolated part of the island.Meanwhile, Watanabe finally develops a successful serum and shows the results to Kobayashi, who merely dismisses him. By order of the mayor's hatchet man Major Domo (Akira Takayama), the professor is placed under house arrest and assassinated with poisoned sushi. Tracy Walker (Greta Gerwig), an American exchange student and member of a pro-dog activist group, suspects a conspiracy and begins to investigate, in the process developing feelings for Atari. Kobayashi and his political party are revealed to be responsible for the dog flu outbreak and aim to succeed at exterminating dogs where Kobayashi's ancestors failed.She confronts Watanabe's former colleague Yoko Ono (Yoko Ono), who confirms Tracy's suspicions and gives her the last dose of the cure.During the journey, Atari and Chief are separated from the others. Atari bathes Chief, revealing that his coat is actually white. Noticing the similarity between Chief and Spots, Atari realizes that Chief is of Spots' breed, which is extremely rare. Chief recalls being part of a litter where all but one of his siblings died. He begins to bond with Atari as they continue their journey. They rejoin the group and locate the cannibal tribe but are ambushed by Kobayashi's men. Spots arrives with an army of dogs who fend off the assailants. He reveals that he was rescued by the cannibal tribe (who were simply misunderstood and weren't cannibals at all) and became their leader. Spots says that the tribe were test subjects from an abandoned secret lab, and also confirms that Chief is his brother.Spots became their leader and mated with a female tribe member named Peppermint, who is pregnant with their first litter. Because of these new responsibilities, Spots requests Atari replace him as his bodyguard with Chief; initially hesitant, both he and Atari accept. Word reaches the dog tribe that Kobayashi plans to euthanize all dogs with poison gas.An owl brings word that Kobayashi plans to order total extermination of all dogs on Trash Island. At Kobayashi's election ceremony, Kobayashi prepares to give the order, but Tracy presents her evidence of his corruption. Atari and the dogs also arrive and confirm the cure works. Atari addresses the crowd and recites a Haiku he wrote and dedicated to Kobayashi, rekindling the sympathy that once existed between dogs and humans.Kobayashi has a change of heart, but his right-hand man Major Domo (Akira Takayama) insists on triggering the extermination. A fight ensues in which the \"execute\" button is pressed, but the poison backfires on the captors due to Tracy's hacker friend.During the fight, Atari and Spots are gravely injured. Atari's only remaining kidney fails, but Kobayashi, admitting his mistakes, donates his own to save him. Kobayashi's crimes render him ineligible to hold office.By election law, mayor-ship of the city falls to Atari and he decrees that dogs be allowed to reintegrate into society. Tracy and Atari become a couple, and Chief reunites with Nutmeg and takes up the role of bodyguard for Atari. Presumed dead, Spots recovers and secretly raises his litter under the Kobayashi Manor.",
	"links": [
		"https://www.amazon.com/Isle-Dogs-Bryan-Cranston/dp/B07C4424P2"
	]
}