{
	"title": "Annabelle: Creation",
	"release_year": "2017",
	"runtime": "109",
	"tags": [
		"Horror",
		"Mystery",
		"Thriller",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Anthony LaPaglia",
		"Samara Lee",
		"Miranda Otto",
		"Brad Greenquist",
		"Lulu Wilson",
		"Talitha Eliana Bateman",
		"Stephanie Sigman",
		"Mark Bramhall",
		"Grace Caroline Currey",
		"Philippa Coulthard"
	],
	"staff": [
		"David F. Sandberg",
		"Gary Dauberman",
		"Peter Safran",
		"James Wan",
		"Benjamin Wallfisch",
		"Maxime Alexandre",
		"Michel Aller",
		"Rich Delia",
		"Jennifer Spence"
	],
	"links": [
		"https://www.amazon.com/Annabelle-Stephanie-Miranda-Anthony-LaPaglia/dp/B0771MJSJC"
	],
	"votes": 153707,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjA1MzIwMjMxNF5BMl5BanBnXkFtZTgwMDQ3NTc2MjI@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1946, a doll maker, Samuel Mullins (Anthony LaPaglia), is crafting a new piece of work - the doll that would later be known as Annabelle. While working, Samuel gets a small note from his daughter Annabelle/\"Bee\" (Samara Lee) to play hide-and-seek. Samuel finds her and starts tickling her, joined by his wife Esther (Miranda Otto).The Mullins family later goes to church. A patron asks Samuel when his next batch of dolls will be ready, and Esther says they are good to go. On the way home, the family gets a flat tire. Esther sees a car coming and tries to flag it down. As Samuel is removing the tire, a bolt comes loose. Bee goes to grab it but doesn't see the car coming, and it fatally strikes her.Twelve years later in 1958, a nun, Sister Charlotte (Stephanie Sigman), is traveling in a van with six orphaned girls - Janice (Talitha Bateman), Linda (Lulu Wilson), Carol (Grace Fulton), Nancy (Philippa Coulthard), Kate (Tayler Buck), and Tierney (Lou Lou Safran). Janice and Linda are best friends, but Janice is disabled due to suffering from polio. The girls arrive at the Mullins home as they have opened it up to them as their new home. We hear that Esther had suffered from an accident years earlier, and not much else is known about her. Samuel shows Janice a chairlift originally made for Esther so she can use to move up and down the stairs.The girls go pick out their rooms. Janice and Linda get a room to themselves. Janice tries to go into what used to be Bee's room, but Samuel sternly tells her that the room must stay locked at all times.The girls then go outside to explore around the area. Linda tries to stay behind so Janice won't be alone, but Janice doesn't want to be treated differently for her condition, so she lets Linda go play with the others. While alone, Janice senses a presence near her. We see what looks like something walking near her in the mirror, but there is nothing behind her when she turns around.At night, Janice is awake and she wanders outside of her room. Bee's room is unlocked, and she cautiously enters. She finds Bee's old dollhouse and some of her toys, plus a key that unlocks a hidden door in the room. Janice opens the door and finds it covered with pages from the Bible. Sitting in there is the doll that Samuel made earlier. Janice is creeped out by the doll, so she shuts the door. It opens up again and she locks it. It opens yet again, and Janice starts to leave. She sees Samuel from outside, and she runs back to her room before he catches her.During dinner, the girls catch a brief glimpse into Esther's room. Carol peeks in and sees Esther's silhouette as she reaches out to Samuel. Charlotte tells her to mind her own business.Later, Carol and Nancy mess around telling ghost stories about Esther, as if she were dead and that her spirit is haunting others. They hear the bell that Esther uses to summon her husband, and the girls start to get nervous when it's really quiet. They hear footsteps until it becomes dead silent. A hand then appears to grab Carol, and a ghostly woman appears next to both girls. Charlotte comes in when she hears the girls screaming.Charlotte apologizes to Samuel for any disturbances the girls may have caused. She shows him a picture of herself with her old convent. Samuel notices one person not previously seen by Charlotte - a ghostly nun (the same one from \"Conjuring 2\").Janice is once again awake while everyone else sleeps. She leaves her room once again and is caught by Linda going into Bee's room. Linda leaves for fear of getting in trouble. Janice then hears noises and sees a figure in the shadows. She attempts to escape it going down the chairlift. The entity pulls her chairlift back to the top before pulling Janice into the air and dropping her to the floor.Janice is hospitalized and she returns to the house after a brief while. Samuel goes into Esther's room to tend to her. He implies that something that they experienced before is happening again, though Esther tries to pass off what happened to Janice as an accident.The hauntings only get worse from there. Janice sees a girl in Bee's room - Bee herself. Janice asks her what she wants. Bee turns around with a demonic face and says \"YOUR SOUL.\" Janice tries to run but is grabbed by the ghost, who regurgitates black bile down her throat.Janice appears calm but Linda knows something is wrong with her. She confesses to Samuel that she and Janice were in Bee's room, but he only flips out when Linda mentions the doll. He orders Linda to never go near the doll.Samuel goes back inside the house and finds the doll sitting at the dining table. Next to it is a note that says \"Found you\". The apparition takes the form of Janice before hiding in the shadows and showing its true form to Samuel. He holds a cross up to it, only for the entity to break his fingers and kill him. Charlotte finds his body.Charlotte goes to Esther's room and asks her what the deal is with the doll. Esther is terrified when she sees it but she tells Charlotte the truth. After Bee died, she and Samuel were in despair and had hoped for a way to reach out and communicate to their daughter. They were answered by a spirit claiming to be Bee that asked if it can move into the doll. Samuel and Esther said yes, and they at first felt delighted to feel as though Bee was back in their lives, until the day that the entity attacked Esther and gouged her eye out. She takes off her porcelain mask to reveal her disfigurement to Charlotte. The doll was sealed in the room after the house was blessed by a priest. Esther makes it clear that the doll is bad news.Charlotte prepares to get the girls out, but they can't find Janice. The girls go searching for Janice, only to be haunted at every turn. Janice emerges and the demon within her levitates Charlotte and slams her against a mirror. Carol, Nancy, Kate, and Tierney go out by the barn, but Carol gets locked in and is haunted by a scarecrow that appears to grow demonic hands to rip the mask off its face. Carol gets out before the demon gets her.The girls find Esther dead with the top half of her body hung up on the wall. Moments later, the top half becomes possessed and tries to attack the girls.Linda grabs the doll and runs over to a well to get rid of it. Charlotte follows her as Linda throws it down the well. As she walks away, she hears a noise coming from the well. Linda looks down and is nearly pulled down by the demon, only to be rescued by Charlotte. She pushes the lid back onto the well as something tries to break out, but the two run back to the house.Janice tries to attack Linda with a knife until Charlotte runs into Bee's room with the doll. Janice stabs the doll, and Charlotte throws both Janice and the doll back into the closet.The police arrive and search Bee's room. Only the doll is left in the closet. There is a hole in the wall that Janice escaped through. She is nowhere to be found in the house. Charlotte and the girls leave the Mullins home, and Linda misses her best friend.Sometime later, Pete and Sharon Higgins (Brian Howe and Kerry O'Malley) arrive at an orphanage. They find Janice, who is now going as Annabelle. Pete and Sharon are taken by her and they adopt her. They even give her a Raggedy Ann doll (which is what the real-life Annabelle doll really looks like).Another twelve years pass into 1970. The Higgins' are sleeping until they hear a noise. Pete goes to investigate, only to have his throat slashed by Annabelle. Her boyfriend enters the room to kill Sharon. Next door, John and Mia Gordon (Ward Horton and Annabelle Wallis) wake up. John proceeds to head next door to investigate.DURING THE CREDITS:Annabelle is in a room with pages from the Bible all around the room. The camera focuses on her face and she turns her head to face the audience.Fade to black.AFTER THE CREDITS:The Nun from 'The Conjuring 2' is shown in Romania."
}