{
	"title": "Life",
	"release_year": "2017",
	"runtime": "104",
	"tags": [
		"Horror",
		"Sci-Fi",
		"Thriller"
	],
	"rating": 6.6,
	"actors": [
		"Jake Gyllenhaal",
		"Rebecca Ferguson",
		"Ryan Reynolds",
		"Hiroyuki Sanada",
		"Olga Dykhovichnaya",
		"Ariyon Bakare",
		"Jesus Del Orden",
		"Allen McLean",
		"Leila Grace",
		"Mari Gvelesiani"
	],
	"staff": [
		"Daniel Espinosa",
		"Rhett Reese",
		"Paul Wernick",
		"Bonnie Curtis",
		"David Ellison",
		"Dana Goldberg",
		"Julie Lynn",
		"Jon Ekstrand",
		"Seamus McGarvey",
		"Mary Jo Markey",
		"Frances Parker",
		"Mindy Marin",
		"Nigel Phelps"
	],
	"links": [
		"https://www.amazon.com/Life-Jake-Gyllenhaal/dp/B075TL5PTM"
	],
	"votes": 259357,
	"cover": "https://m.media-amazon.com/images/M/MV5BNWNkYWYzNGUtOWVjNS00MGY0LWIyY2YtODllNGIxOGRlOTgyXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The six-member International Space Station (ISS) crew capture a probe returning from Mars with a soil sample that might contain evidence of extraterrestrial life. The ISS has been in orbit for 30 years and has cost $200 Billion cumulatively.\nThe pilgrim capsule has been travelling for 8 months with the sample but was hit by debris and is currently off course. Astronaut and Engineer Rory Adams will venture outside the ISS in an attempt to capture the capsule using the station's robotic arm at great risk. Rory's instructions are to push the capsule into deep space if he cannot capture it.\nThe ISS fires Thrusters to move into position and Rory is able to capture the capsule.On day 2, the sample is moved to the quarantine lab for further experiments.\nExobiologist Hugh Derry (Ariyon Bakare) revives a dormant cell from the sample. The sample revives under an atmosphere or high CO2 and less oxygen, with a glucose growth medium and ambient temperature of 20 degrees Celsius. This is the first incontrovertible proof of life beyond Earth.\nIt quickly grows into a multi-celled organism that American school children name \"Calvin\", after Calvin Coolidge Elementary School. Astronaut David has been in orbit for 473 days, and his muscle atrophy has accelerated, and has had the maximum allowable dose of radiation.Day 12 and Hugh realizes that Calvin's cells can change their specialization, acting as muscle, neuron, and photo-sensory cells all at once. Calvin grows appendages and starts interacting with Hugh.\nOn Day 25, after an atmospheric accident in the lab, Calvin becomes dormant. Hugh had grown too attached to Calvin, while commander Katerina was relieved since Calvin was growing too fast.\nHugh revives Calvin with mild electric shocks, but Calvin immediately becomes hostile and attacks Hugh, crushing his hand. Calvin then uses a lab wand to puncture a hole in it container and escape into the lab.\nWhile Calvin devours a lab rat and grows in size, engineer Rory Adams (Ryan Reynolds) enters the room and rescues Hugh. However, Calvin latches onto Rory's leg and Physician David Jordan (Jake Gyllenhaal) locks Rory in the room to keep Calvin contained.\nAfter Rory unsuccessfully attacks Calvin with a flame thrower Calvin enters his mouth, killing him from the inside. Emerging from Rory's mouth even larger, Calvin escapes through a vent. Hugh theorizes that lack of breathable air on Mars is what kept the organism dormant.Finding their communication with Earth cut off, mission commander Katerina Golovkina (Olga Dihovichnaya) performs a spacewalk to fix the antenna. Calvin attacks her outside the ISS rupturing her spacesuit's coolant system in the process, causing liquid to fill her helmet. She refuses to open the airlock to seek help, keeping Calvin out of the station but causing her to drown in her spacesuit.Calvin attempts to enter the station through the Thrusters. The crew try to use the Thrusters to launch Calvin into deep space, but their attempt fails, and the station loses too much fuel. The ISS enters a decaying orbit, which will eventually cause the station to burn up in Earth's atmosphere. Pilot Sho Murakami (Hiroyuki Sanada) informs the crew that they need to use the remaining fuel to get back into a safe orbit, but the attempt would allow Calvin back into the station. The crew plan to make Calvin dormant by sealing themselves into one module and venting the atmosphere from the rest of the station.When Hugh enters cardiac arrest, the crew realize that Calvin had attached itself to Hugh's leg and was feeding off of him. Having grown into a larger tentacled creature, Calvin attacks the remainder of the crew. Sho seals himself inside a sleeping pod as Calvin attempts to crack the glass and get to him. David and quarantine officer Miranda North (Rebecca Ferguson) use Hugh's corpse as bait to lure Calvin away from Sho and trap it in a module to deprive it of oxygen.Having received a distress call prior to the damage to the ISS communication system, Earth sends a Soyuz capsule as a fail-safe plan to push the station into deep space. The capsule docks with the station and starts pushing it into deep space. Believing this to be a rescue, Sho leaves his pod and rushes to board the arriving ship, attempting to force open the capsule's hatch. Once he opens the hatch, Calvin attacks him and the Soyuz crew.\nThe crew tries to save Sho, but the encounter causes a docking breach that results in the capsule detaching and crashing into the ISS. David and Miranda, the only survivors, realize that the incident has again caused them to enter a decaying orbit. Aware that Calvin could survive re-entry, David recalls two escape pods, planning to lure Calvin into one pod and pilot it into deep space, allowing Miranda to escape to Earth in the other pod.David leads Calvin into his pod and launches into space as Miranda launches hers. One of the pods hits debris and is knocked off course. Calvin attacks David as he struggles to send his pod into deep space. The earthbound pod performs a controlled re-entry and lands in water near two fishermen. As they approach the pod, it is revealed to be David's, who is encased in a web-like substance. Meanwhile, Miranda's navigation system fails, and her pod is sent into deep space. David, still alive, tries to warn the fishermen not to attempt a rescue. The fishermen open the pod door as two other fishing boats arrive."
}