{
	"title": "Deadpool 2",
	"release_year": "2018",
	"runtime": "119",
	"tags": [
		"Action",
		"Adventure",
		"Comedy",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Ryan Reynolds",
		"Ryan Reynolds",
		"Ryan Reynolds",
		"Josh Brolin",
		"Morena Baccarin",
		"Julian Dennison",
		"Zazie Beetz",
		"T.J. Miller",
		"Leslie Uggams",
		"Karan Soni",
		"Brianna Hildebrand",
		"Jack Kesy"
	],
	"staff": [
		"David Leitch",
		"Rhett Reese",
		"Paul Wernick",
		"Ryan Reynolds",
		"Simon Kinberg",
		"Ryan Reynolds",
		"Lauren Shuler Donner",
		"Tyler Bates",
		"Jonathan Sela",
		"Craig Alpert",
		"Michael McCusker",
		"Elísabet Ronaldsdóttir",
		"Dirk Westervelt",
		"Marisol Roncali",
		"Mary Vernieu",
		"David Scheunemann"
	],
	"cover": "https://m.media-amazon.com/images/M/MV5BMDQ3ZWMzYjYtM2JiNS00MDQ4LWE1ZDItZjU5MmFhMWI0Zjg2XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"votes": 680693,
	"description": "After successfully working as the mercenary Deadpool for two years, Wade Wilson (Ryan Reynolds) (A wisecracking mercenary with accelerated healing but severe scarring over his body after undergoing an experimental regenerative mutation) fails to kill one of his targets (after he shuts himself inside a panic room and Wade was in a hurry to get to Vanessa) on his anniversary with his girlfriend Vanessa (Morena Baccarin).\nDeadpool is now friends with Dopinder (Karan Soni), a cab driver and part time waiter at the bar, but secretly wants to be a contract killer. Dopinder had started driving Deadpool to all his assignments in the US and was his getaway driver as well.That night, after the pair decides to start a family together (Vanessa officially puts aside her birth control device and tells Wade to pump a baby in her), the target tracks them down and kills Vanessa (Vanessa was pregnant at the time & Wade knew it). Wilson kills the man in revenge. He blames himself for her death and attempts to commit suicide six weeks later by blowing himself up.Before committing suicide, Wade spends a lot of time with Weasel (T. J. Miller) (Wilson's best friend and the owner of a bar frequented by mercenaries). Wade still lives with Blind Al (Leslie Uggams).Wilson has a vision of Vanessa in the afterlife who tells him that he is not yet ready for the afterlife (as his \"Heart's not in the right place), but the pieces of his body remain alive and are put back together by Colossus (Stefan Kapicic) (X-Man with the mutant ability to transform his entire body into organic steel). Wilson is left with only a Skee-Ball casino token made of lead, an anniversary gift, as a final memento of Vanessa.Recovering at the X-Mansion, Wilson agrees to join the X-Men as a form of healing. He, Colossus, and Negasonic Teenage Warhead (Brianna Hildebrand) (A teenage X-Man with the mutant power to detonate atomic bursts from her body) respond to a standoff between authorities and the unstable young mutant Russell Collins / Firefist (Julian Dennison) (A young mutant with Pyrokinesis who is being hunted by Cable) at an orphanage, labeled a \"Mutant Reeducation Center\".\nColossus had told Wade that during his recovery period Wade is not allowed to kill anyone. Colossus says that he has taken a huge risk by sticking his own neck out to protect Wade.\nThe orphanage is run by the brutal headmaster (Eddie Marsan) of the Essex Home for Mutant Rehabilitation.Wilson realizes that Collins has been abused by the orphanage staff and kills one of the staff members whom Collins identifies as his abuser. Colossus stops him from killing anyone else, and both Wilson and Collins are arrested. Restrained with collars that suppress their powers, they are taken to the \"Icebox\", an isolated prison for mutant criminals.\nCollins tells Wade how he wants to kill the headmaster, who takes pleasure in torturing the mutants at the orphanage.\nMeanwhile, a cybernetic soldier from the future, Cable (Josh Brolin), whose family is murdered by an older Collins, travels back in time to kill the boy before Collins ever becomes a killer.Cable breaks into the Icebox and attacks Collins. Wilson, whose collar has broken in the melee, attempts to defend Collins. Wade goes all out to defend Collins from Cable, who cannot understand why Wade would not die, despite being hit fatally multiple times during their battle across the prison.\nWade wants to understand why Cable wants to kill a 14-year-old boy and Cable explains his mission.\nAfter another battle, Cable takes Vanessa's token (Wade had given Vanessa a lead token as a gift just before they were attacked and Vanessa was killed), Wilson forces himself and Cable out of the prison, but not before Collins overhears Wilson deny that he cares for the young mutant.Near death again, Wilson has another vision of Vanessa in which she convinces him to help Collins. Wade comes back determined to save Collins.\nMeanwhile, in prison, Collins befriends the biggest mutant named Juggernaut, who is kept in a special cell and not allowed to meet/see anyone. Collins brings him food and introduces himself.\nWilson organizes a team called X-Force (X-Force team also includes Bedlam (Terry Crews), Shatterstar (Lewis Tan), Zeitgeist (Bill Skarsgard), Peter (Rob Delaney) and Vanisher (Brad Pitt)) to break Collins out of a prison-transfer convoy (all prisoners were being transferred to a new prison since the attack from Cable) and defend him from Cable.The team launches its assault on the convoy by parachuting from a helicopter, but all of the members except for Wilson and the lucky Domino die during the landing. While the pair fight Cable, Collins frees fellow inmate Juggernaut, who repays Collins by agreeing to help him kill the abusive orphanage headmaster. Juggernaut destroys the truck he and Collins are in and they escape.Cable offers to work with Wilson and Domino to stop Collins' first murder, which will eventually lead to more and one day will lead to Collins killing Cable's entire family, which is the reason he has traveled back in time to stop Collins from committing his first murder. He agrees to give Wilson a chance to talk Collins down before attempting to kill the boy again. They arrive at the orphanage and are overpowered by Juggernaut while Collins attacks the headmaster.Colossus, who had at first refused to help Wilson due to Wilson's murderous ways, arrives to distract Juggernaut so that Wilson and Cable can confront Collins. After Wilson appears to fail in talking down Collins, Cable shoots at the young mutant. Wilson leaps in front of the bullet while wearing the Icebox collar and dies, reuniting with Vanessa in the afterlife. Seeing this sacrifice, Collins does not kill the headmaster. This changes the future, in which Cable's family now survives.Cable uses the last charge on his time-traveling device, which he needed for returning to his family, to go back several minutes and strap Vanessa's token in front of Wilson's heart. Now when Wilson takes the bullet for Collins, it is stopped by the token, and he survives.\nCollins still has his change of heart, while the headmaster is run over by Wilson's taxi-driver friend Dopinder.In a mid-credits sequence, Negasonic Teenage Warhead and her girlfriend Yukio (Shioli Kutsuna) repair Cable's time-traveling device for Wilson. He uses it to save the lives of Vanessa and X-Force human member Peter; kill X-Men Origins: Wolverine's version of Deadpool; and kill actor Ryan Reynolds while he is considering starring in the film Green Lantern.",
	"links": [
		"https://www.amazon.com/Deadpool-2-Ryan-Reynolds/dp/B07D5KWFJ7"
	]
}