{
	"title": "The Big Sick",
	"release_year": "2017",
	"runtime": "120",
	"tags": [
		"Comedy",
		"Drama",
		"Romance",
		"amazon"
	],
	"rating": 7.5,
	"actors": [
		"Kumail Nanjiani",
		"Zoe Kazan",
		"Holly Hunter",
		"Ray Romano",
		"Anupam Kher",
		"Zenobia Shroff",
		"Adeel Akhtar",
		"Bo Burnham",
		"Aidy Bryant",
		"Kurt Braunohler"
	],
	"staff": [
		"Michael Showalter",
		"Emily V. Gordon",
		"Kumail Nanjiani",
		"Judd Apatow",
		"Barry Mendel",
		"Michael Andrews",
		"Brian Burgoyne",
		"Robert Nassau",
		"Gayle Keller",
		"Brandon Tonner-Connolly"
	],
	"votes": 144949,
	"cover": "https://m.media-amazon.com/images/M/MV5BYWQ4MWVkMTMtOTE4YS00Y2VmLWE5Y2YtMWJkOTMwZjIyZjY4XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Kumail (Kumail Nanjiani) is a young Chicago stand-up comedian who drives for Uber and performs at night. His parents are first-generation immigrants from Pakistan, who live in the suburbs. Though he has a one-man show about his Pakistani background, he has no faith in Islam, a fact he conceals from his Muslim family. His immigrant parents' father Azmat (Anupam Kher) and Mother Sharmeen (Zenobia Shroff) set him up with Pakistani women, hoping he will follow their example of an arranged marriage, but he is uninterested. Naveed (Adeel Akhtar) is Kumail's brother and Fatima (Shenaz Treasurywala) is Naveed's wife.CJ (Bo Burnham), Chris (Kurt Braunohler) and Mary (Aidy Bryant) are all stand-up comics and Kumail's friends. They are excited that a talent agent Bob Dalavan (Jeremy Shamos) is visiting their club, as he is scouting for comics for the upcoming Montreal Comedy Festival.During a show, Kumail is heckled by Emily (Zoe Kazan), a non-Muslim white woman in the audience. Emily is a graduate student from the University of Chicago.\nHe approaches her after the show and says that any form of heckling throws a comedian off their game. Emily counters that she was not heckling and was trying to be supportive. Kumail ends up taking Emily to his apartment, which he shares with a roommate. Kumail initiates sex while they were trying to watch a movie in his room. After sex, they connect and Kumail that he was very shy as a boy.Emily leaves soon after. Since Kumail is an Uber driver, he gets her booking and ends up dropping her home. After a bit of banter, they decide not to see each other anymore.Despite their previous assertion, their one-night stand develops into a relationship. They enjoy each other' company and their mutual banter. Kumail and Emily continue hooking up and eventually start dating. Emily confesses to him her past divorce, then reveals she feels strongly about him. Emily says that she got married in college, mainly because all of her friends were also getting married. And then a few years later Emily realized that she did not love her husband anymore.Kumail, however, dodges any requests to meet her parents.\nEmily watches Kumail's one man shows and finds that it is not very good or comic, as it focuses on Pakistan's history and culture, rather than the comedy elements needed for the Comedy Festival.Kumail does not tell his family about Emily, as they would disapprove. Emily finds pictures of the women Kumail's parents have set him up with, and she is livid that Kumail has not told his parents about her. Kumail admits he does not see a long-term future with her due to his family's expectations. He says that a cousin of his married an Irish woman and he was kicked out of the family. Emily ends their relationship.\nAlthough heartbroken, Kumail moves on, focusing on stand-up and securing an audition for the Montreal Comedy Festival after Bob watches his stand-up routine.Kumail's parents set him up with Khadija (Vella Lovell), daughter of Tina (Susham Bedi) and Farhan (Rahul Bedi). Kumail blows off the arranged meeting.Kumail learns that Emily has been taken to the hospital after having fainted. A common friend Jesse (Rebecca Naomi Jones) called Kumail and asked him to pick Emily from the hospital and to driver her home. Emily is ready to go home, she is shifted into a room instead as her condition gets worse.\nA doctor tells him that Emily has a serious lung infection and must be immediately placed in an induced coma with Tracheal Intubation. He signs the permission form and calls her parents, Beth (Holly Hunter) and Terry (Ray Romano), who arrive the following morning.Aware that Kumail hurt their daughter, they tell him he is not needed, but Kumail stays and the three become close as they deal with Emily's illness. There are 5 doctors attending to Emily's condition and none of them can tell the parents and Kumail about what is wrong with Emily and how long she will be in her Coma.Beth is downright hostile to Kumail, but Terry is more even handed and reciprocates to his peace gestures. Terry asks Kumail to accompany them to Emily's home as they come back from the hospital. At her apartment, Kumail sees that Emily still kept the souvenirs from their time together. Kumail decides to leave for his stand-up routine and Terry & Beth decide to join him for the show. During the show, one audience member heckles Kumail by calling him a member of ISIS based on his looks. Beth gets enraged and gets argumentative with the audience member and later tries to attack him. Terry pulls her back and takes her away and Kumail ends up driving them home.Back home, Beth opens a bottle of wine and bonds with Kumail, while Terry goes to sleep. Kumail admits that he messed up badly with Emily. Beth says that her family disapproved of Terry when she introduced him. Her father got so mad that he broke all the plates at home. But Terry stuck around and eventually changed their mind.Emily undergoes surgery (as the antibiotics are not being effective at removing her infection) for a rapidly spreading infection but fails to stabilize. Surgery is ineffective and the infection spreads to Emily's kidneys. Doctors are unable to diagnose her illness, and Beth ponders moving her to a better hospital.\nKumail and Terry disagree. Beth and Terry argue, and she brings up Terry's past. Terry stays with Kumail and reveals that he cheated on Beth and regrets it.Kumail's parents visit his apartment, angry that he is not taking their marriage suggestions seriously. Kumail tells them that he does not want an arranged marriage and has no interest in Islam and reveals his relationship with Emily; his parents disown him.As Kumail prepares for an audition for the Montreal Comedy Festival, he learns that the infection has reached Emily's heart. Distraught, Kumail spends the audition talking about his fears about Emily and fails the audition.Emily wakes from her coma. The doctors explain she has adult-onset Still's disease, a rare but treatable illness; Kumail inadvertently helped them diagnose when he mentioned she had an ankle that was slow to heal. Still bitter from their breakup, Emily tells Kumail to leave. Beth invites Kumail to Emily's homecoming party. Kumail asks Emily to take him back, but she refuses.Kumail decides to move to New York City with two comedian friends. He tells his family about his plans and refuses to allow them to disown him.Emily later watches a video of Kumail's Montreal audition. She realizes the extent of his efforts to keep seeing her despite family pressure and visits him at the local theater. Kumail informs her that he is moving to New York City to pursue stand-up. Emily is disappointed but wishes him luck. She tells Kumail she appreciates everything he did for her while she was in a coma.Kumail starts to patch his relationship with his family before leaving Chicago. In NYC, he performs at a local club and is heckled, albeit encouragingly, by a female audience member. He turns to see that it is Emily, and she hints that she is there to meet him. Later, we see Kumail's marriage with Emily, in which he reconciled with his parents.",
	"links": [
		"https://www.amazon.com/Big-Sick-Michael-Showalter/dp/B09T5NZ1FV"
	]
}