{
	"title": "Killers of the Flower Moon",
	"release_year": "2023",
	"runtime": "206",
	"tags": [
		"Crime",
		"Drama",
		"History",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Leonardo DiCaprio",
		"Robert De Niro",
		"Lily Gladstone",
		"Jesse Plemons",
		"Tantoo Cardinal",
		"John Lithgow",
		"Brendan Fraser",
		"Cara Jade Myers",
		"Janae Collins",
		"Jillian Dion"
	],
	"staff": [
		"Martin Scorsese",
		"Eric Roth",
		"Martin Scorsese",
		"David Grann",
		"Dan Friedkin",
		"Daniel Lupi",
		"Martin Scorsese",
		"Bradley Thomas",
		"Robbie Robertson",
		"Rodrigo Prieto",
		"Thelma Schoonmaker",
		"Ellen Lewis",
		"Jack Fisk"
	],
	"votes": 257801,
	"cover": "https://m.media-amazon.com/images/M/MV5BNTRhODE3NTYtOGEwOC00OGQ4LTgzYjItNDdhNGU4YTdmODcyXkEyXkFqcGc@._V1_QL75_UY281_CR19,0,190,281_.jpg",
	"description": "Osage Nation elders bury a ceremonial pipe, mourning their descendants' assimilation into White American society. Wandering through their Oklahoma reservation, in the midst of the annual \"flower moon\" phenomenon of fields of blooms, several Osage find oil gushing from the ground. The tribe becomes wealthy, as it retains mineral rights and members share in oil-lease revenues, though law requires white court-appointed legal guardians to manage the money of full and half-blood members, assuming them \"incompetent\".\nThe Native Americans of the Osage County have the highest per person GDP of any group of people around the world.In 1919, Ernest Burkhart (Leonardo DiCaprio) returns from World War I to live with his brother Byron (Scott Shepherd) and uncle William King Hale (Robert De Niro) on Hale's large reservation ranch outside the town of Fairfax. Hale is married to Myrtle (Katherine Willis).\nHale, a reserve deputy sheriff/cattle rancher popularly called \"King\", poses as a friendly benefactor of the Osage, speaking their language and bestowing gifts. Hale secretly considers the Native Americans as sickly people.\nOn Hale's watch there have been several deaths and murders of the Native American people, which were never investigated. These deaths were all of people who had head-rights.Ernest and Byron commit armed robbery against the Osage. Ernest meets Mollie Kyle (Lily Gladstone), an Osage whose family owns oil head-rights, via his day job as a cab driver. Mollie is having trouble with the Accountant Pitts Beatty (Gene Jones) to get access to her head-rights as her mother is sick and she has no legal guardian.\nErnest takes the time to learn all about Osage history and culture. Henry Roan (William Belleau) is Mollie's ex-husband and is now employed as a driver for Hale.\nA romance develops, and the two marry in a ceremony mixing Roman Catholic and Osage traditions. Over time, they raise three children.Hale secretly orders the contract killings of multiple wealthy Osage. He explains that Ernest will inherit more head-rights if more of Mollie's family dies. Mollie is diabetic, and her mother Lizzie (Tantoo Cardinal) is ill.\nMollie's sister Minnie (Jillian Dion) dies of a mysterious illness (she simply wasted away in front of everyone's eyes). Bill Smith (Jason Isbell) is Minnie's husband. After Minnie's death, her head-rights go to Bill. Hale tells Ernest that if Bill were to die, the Headrights would go to Mollie and from her to Ernest. After Minnie, there are 3 sisters Reta, Anna and Mollie.Hale orders Byron to kill Mollie's other sister, the rebellious Anna (Cara Jade Myers). Byron worked with Kelsie Morrison (Louis Cancelmi) and together they killed Anna in a canyon with a shot to her head.\nLizzie and the Osage council blame the reservation's white residents and urge the tribe to fight back. Barney McBride (Scott Shepherd), a white oilman, is selected by the Osage council to travel to Washington, D.C. to seek federal help in solving the murders. Barney is attacked in Washington and killed by unknown assailants.\nBill Smith marries Minnie's sister Reta.A newsreel of the 1921 Tulsa race massacre, in which white people destroyed a Native American community and killed numerous residents, causes further concern among the Osage that they could suffer similarly. Lizzie sees her ancestors welcome her to the afterlife as she dies.Hale orders Ernest to murder Mollie's last remaining sister and her husband. However, Ernest botches the assassination. Ernest makes a deal with Blackie Thompson (Tommy Schultz) to kill Reta and Bill Smith, by offering him his red Buick. Ernest says that the Buick is worth less than what it is insured for, and it is a win-win for them both. But Blackie gets arrested and spills the whole deal to Hale's cops.\nHale paddles Ernest inside a Masonic temple as punishment.Hale is the local political boss, and both the local sheriff and judges are in his pocket, so no investigations are made. The Osage Nation representative Barney seeking to lobby Congress is murdered in Washington, D.C. Mollie discreetly hires private detective William J. Burns (Gary Basaraba), but Ernest and Byron beat him and run him off of the reservation.Hale and Ernest team up to have Henry murdered and make it look like a suicide. But the shooter John Ramsey (Ty Mitchell) (who is a local Moonshie producer) that Ernest hires shoots Henry from the back of his head and forgets to leave a gun in his hands, making it look like a murder. The Native Americans start leaving town in droves as a result of this latest killing.\nHale orders Ernest to murder Reta (JaNae Collins), Mollie's last remaining sister, and her husband by having criminal Acie Kirby (Pete Yorn) blow up her house. Mollie inherits all her family's head-rights.\nDespite her illness, Mollie travels to Washington with an Osage delegation and asks President Calvin Coolidge for help. Because of this, Hale orders Ernest to poison Mollie's insulin to \"slow her down\". Mollie's condition worsens, and Ernest exhibits similar symptoms after taking the poison himself.Due to Mollie's lobbying, the Bureau of Investigation (BOI) sends Agent Thomas Bruce White Sr. (Jesse Plemons) and assistants to investigate; they quickly find out the truth.\nEyewitnesses tell White that they saw Kelsie enter a bar with Anna, on the night before her murder. Kelsie is arrested and admits to the entire truth.\nHale quickly tries to liquidate the properties he has to get out of town. Hale gives Blackie a tip to conduct a Bank robbery and simultaneously informs the cops about the heist. Hale hoped that Blackie would be killed in the shootout, but he is arrested instead.\nBlackie tells the agents about he was paid by Ernest to murder Reta and her husband.\nHale tries to cover his tracks by murdering his own hit-men, including Acie, but White arrests Hale and Ernest. While Ernest is being interrogated, two agents are sent to question Mollie and find her near death. They rush her to the hospital where the doctors discover, to their horror, that she has been repeatedly poisoned and quickly notify White and the other agents. Luckily, Mollie recovers under the care of the staff.White persuades Ernest Burckhart to confess and turn state's evidence against his uncle. W. S. Hamilton (Brendan Fraser), Hale's attorney, tries to convince Ernest to claim he was tortured and recant. However, after one of his daughters dies of whooping cough, Ernest testifies against his uncle, believing he needs to be there for his remaining family. Hale unsuccessfully tries to have his nephew murdered. Mollie meets with Ernest after he testifies but decides to leave him after he refuses to admit to poisoning her.A radio drama years later reveals the aftermath: Ernest and Hale were convicted and received life sentences. Both were paroled after years of incarceration, despite Osage protests to the parole board. Byron served no prison time due to a hung jury.\nThe Shoun brothers, who gave Ernest the heroin for Mollie and were implicated in other \"wasting deaths\", were never prosecuted due to lack of evidence.\nMollie divorced Ernest, married a man named John Cobb, and died of diabetes in 1937 at the age of 50. She was buried with her parents, sisters and daughter. Her obituary did not mention the Osage murders.\nThe film closes with an overhead view of a 21st-century Osage powwow dancing circle.",
	"links": [
		"https://www.amazon.com/Killers-Flower-Moon-Leonardo-DiCaprio/dp/B0CN4X14DQ"
	]
}