{
	"title": "Hustlers",
	"release_year": "2019",
	"runtime": "110",
	"tags": [
		"Comedy",
		"Crime",
		"Drama",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Constance Wu",
		"Jennifer Lopez",
		"Julia Stiles",
		"Mette Narrative",
		"Wai Ching Ho",
		"Emma Batiz",
		"Vanessa Aspillaga",
		"Jay Oakerson",
		"Trace Lysette",
		"Marcy Richardson"
	],
	"staff": [
		"Lorene Scafaria",
		"Lorene Scafaria",
		"Jessica Pressler",
		"Jessica Elbaum",
		"Will Ferrell",
		"Elaine Goldsmith-Thomas",
		"Jennifer Lopez",
		"Todd Banhazl",
		"Kayla Emter",
		"Gayle Keller",
		"Jane Musky"
	],
	"votes": 108753,
	"cover": "https://m.media-amazon.com/images/M/MV5BYzczZjhlODEtZDk5OS00MTdjLThlZWEtYzExY2IxNWVlMjk1XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 2014, former New York City-based stripper Destiny (Constance Wu) is invited for an interview with Elizabeth (Julia Stiles), a journalist working on a story involving Destiny's former friend and mentor, Ramona Vega (Jennifer Lopez).Seven years prior, Dorothy, known by her stripper name as Destiny, is working at Moves, a strip club, to support her grandmother (Wai Ching Ho) but is barely getting by. There is intense competition among the strippers for customers and many customers do not find Destiny that attractive. The owner of the club takes a 20% commission and $160 in fixed charges every day. Plus, she has to tip the bouncers and other waiters at the club to look after her. Mama (Mercedes Ruehl) is the club's den mother.Mesmerized by Ramona's performance on stage and the tips she earns, Destiny meets her on the roof of the club. Ramona agrees to take Destiny under her wing, and the two form a formidable team. Ramona teaches Destiny the tricks of performing a show on stage and how to engage her customers through the movement of her body and with her eyes.\nRamona also helps Destiny practice her private routines on the other girls at the club. Ramona asks Destiny to go slower during her performance and user her facial expressions to seduce.Ramona teaches Destiny about the 3 tier of customers and how to milk them for the most. The bottom tier, the middle (who have their limits) and the high rollers (who come through the back and take a private elevator to the only room without cameras. They don't leave unless they spend $10-15,000 in one night). Ramona teaches Destiny that stripping is a honest business transaction and nothing more. The trick is to figure out who you are dealing with and play with them at their level.Destiny enjoys newfound wealth and friendship with Ramona. Ramona and Destiny also end up becoming good friends. Ramona is designing her own swimwear branded Swimona.Destiny moves into her own place and repays her debts. She even goes back to school to complete her education. In one year, Destiny makes more money than a brain surgeon.\nA year later, the financial crisis of 2007-2008 strikes (Sep 29th, 2008), and both women find themselves short of cash. Destiny becomes pregnant. She kicks her boyfriend Johnny (Gerald Gillum) out of the house in 2011, shortly after their daughter Lily's birth, and she is unable to find a new job.With no other options, Destiny goes back to stripping. Moves has changed: the financial crisis has impacted their business, and the club is primarily staffed by immigrant women willing to perform sex acts for money, a line Destiny is unwilling to cross. The Russian girls are offering blow-jobs for $300 each. In desperation, Destiny agrees to giving a blow-job to a customer only to find later that he paid her in 3 20-dollar bills.She reconnects with Ramona, who introduces her to a new scheme. Ramona says that she was working in retail for a while but quit as she could not take care of her own kid. She went back to stripping, but the customers no longer found her attractive and went for the Russian girls.Along with her two proteges, Mercedes (Keke Palmer) and Annabelle (Lili Reinhart), Ramona targets rich men at bars, gets them drunk, and then escorts them to Moves where the girls steal their credit card numbers and charge them to their limit. This scheme is called fishing. The girls identified their targets by watching their shoes, watches, briefcases, or even wedding rings.\nAt first, the scheme worked, but then customers got wise and stopped biting.Destiny joins in and learns that Ramona uses a mix of Ketamine and MDMA to impair judgment and cause memory loss in their targets, a tactic deemed worthwhile since their victims will rarely admit to being robbed by strippers.The scheme works, and the women enjoy their new source of wealth. When some of the targets prove too aggressive for Mercedes and Annabelle to handle, Destiny suggests bringing in other girls, who are carefully trained to avoid drinking or using drugs. Ramona's partnership with Moves makes the credit card fraud lucrative for them. However, cracks start to show in their operation. Other strippers begin to emulate their strategies. Furious, Ramona cuts her business ties with Moves, and the group begins to service clients in hotel rooms or their own homes.Mercedes and Annabelle become increasingly unreliable with this new practice, so Ramona hires women with drug problems and criminal records to replace them, while Destiny balks at bringing in \"junkies and criminals\". Destiny's fears prove true when a client suffers a near-fatal accident, and she must bring him to the hospital. Meanwhile, Ramona is busy bailing out a particularly unreliable new hire, Dawn (Madeline Brewer). Destiny returns home to find her grandmother has died. At the funeral, Ramona makes amends and promises to take care of Destiny from now on.In 2014, Destiny becomes uncomfortable and stops the interview when Elizabeth insists on talking about Ramona. When Elizabeth returns home, Destiny calls and agrees to finish their conversation, recalling how her friendship with Ramona - and their crime ring - fell apart.Ramona's callousness drives a wedge between the women, and Destiny feels she can no longer justify her crimes. Dawn is picked up by the police and \"flips\" on her partners, while investigators manage to locate several victims and identify all of the girls. Destiny, Ramona, Annabelle, and Mercedes are arrested, but only Destiny (thinking of her daughter) takes a plea deal. Ramona is sentenced to five years' probation, while the others serve short jail sentences before being released on probation. A year later, Elizabeth visits Ramona, who is now working a retail job.Ramona muses that Destiny was the only person she could trust, revealing a picture of her friend that she keeps along with her most valued possessions. The article is published, and Elizabeth encourages Destiny to reach out to Ramona and make amends.",
	"links": [
		"https://www.amazon.com/Hustlers-Jennifer-Lopez/dp/B0BX22LD6G"
	]
}