{
	"title": "The Florida Project",
	"release_year": "2017",
	"runtime": "111",
	"tags": [
		"Drama",
		"max",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Brooklynn Prince",
		"Bria Vinaite",
		"Willem Dafoe",
		"Christopher Rivera",
		"Aiden Malik",
		"Josie Olivo",
		"Valeria Cotto",
		"Edward Pagan",
		"Patti Wiley",
		"Jasineia Ramos"
	],
	"staff": [
		"Sean Baker",
		"Sean Baker",
		"Chris Bergoch",
		"Sean Baker",
		"Chris Bergoch",
		"Kevin Chinoy",
		"Andrew Duncan",
		"Lorne Balfe",
		"Alexis Zabe",
		"Sean Baker",
		"Carmen Cuba",
		"Stephonik"
	],
	"links": [
		"https://www.max.com/movies/florida-project/c88d7058-561a-49e5-b8a0-66d90611398b",
		"https://www.amazon.com/Florida-Project-Willem-Dafoe/dp/B0764MS7GQ"
	],
	"votes": 131362,
	"cover": "https://m.media-amazon.com/images/M/MV5BNDBhM2MxYjAtMWFiYy00MWMwLThkMDYtN2M1ZWY3NjkxNGExXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Moonee, a six-year-old girl, lives with her young, single mother, Halley, at Magic Castle Inn and Suites, a budget motel in Kissimmee, Florida, near Walt Disney World. Moonee spends most of her summer days unsupervised and making mischief with her downstairs neighbor, Scooty (whom Halley is supposed to watch while his mother, Ashley, works as a waitress at a diner), and Dicky, who lives at the nearby Futureland Inn. After Stacy, a new Futureland resident, catches the trio spitting on her car, Dicky is grounded for a week, and Moonee and Scooty meet and befriend Stacy's granddaughter, Jancey, who lives with Stacy.Halley has recently lost her job as a stripper after refusing to have sex with clients, but this now affects her eligibility for TANF benefits; she begins relying on food that Ashley gets from work. Struggling to pay the rent, Halley begins selling knockoff perfume to tourists in the parking lots of upscale hotels. Meanwhile, Moonee and Scooty show Jancey around the neighborhood and teach her things, like how to get ice cream by begging. They regularly inconvenience Bobby, the Magic Castle's manager, once shutting off the motel's power. Despite this, he remains protective of them. Bobby's duties include preparing expense reports, ejecting drug dealers, and doing repairs; he sometimes enlists the help of his son, Jack, with whom he has a tenuous relationship.After Dicky's family moves to New Orleans, Scooty finds a lighter in a box that Dicky's family left behind; he, Moonee, and Jancey start a fire at an abandoned condominium complex. Seeing the fire, Ashley figures out that Scooty was involved, and forbids him from hanging out with Moonee or Jancey; she also stops talking to Halley.Without the free food from Ashley, and with security guards beginning to bother her at the hotels, Halley's financial situation declines even further. She begins soliciting sex work online, keeping Moonee in the bathroom with loud music when she has a client over. When Halley steals a client's Disney World resort passes to scalp them, he returns to demand them back. Bobby scares him off but applies restrictions on unregistered guests in Halley's room; he also warns her that he will evict her if she continues having clients over. In desperation, Halley approaches Ashley to apologize and ask for money. Ashley criticizes Halley for doing sex work; enraged, Halley viciously beats her in front of Scooty.The next day, DCF investigators show up and question Halley and Moonee separately about their lifestyle. In anticipation of another visit, Halley gives away her weed and has Moonee help clean their room. They go to a fancier hotel and have an extravagant meal, which Halley charges to a guest's room. When they return to Magic Castle, the investigators, having found evidence of Halley's sex work, are waiting with two police officers to take Moonee into foster care while they finish their inquiry. Not fully understanding what is happening, Moonee asks to say goodbye to Scooty, who lets slip that she is going to a new family. Upset, Moonee runs away from the investigators to bid Jancey goodbye. Seeing her friend's distress, Jancey grabs Moonee's hand and the two run away to Walt Disney World's Magic Kingdom theme park."
}