{
	"title": "Uncut Gems",
	"release_year": "2019",
	"runtime": "135",
	"tags": [
		"Crime",
		"Drama",
		"Thriller",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Adam Sandler",
		"Julia Fox",
		"Idina Menzel",
		"Mesfin Lamengo",
		"Sun Zhi Hua-Hilton",
		"Liang Wei-Hui-Duncan",
		"Sunny Wu Jin Zahao",
		"Deneke Muhugeta",
		"Habtunu Africho",
		"Warren Finkelstein"
	],
	"staff": [
		"Benny Safdie",
		"Josh Safdie",
		"Ronald Bronstein",
		"Josh Safdie",
		"Benny Safdie",
		"Sebastian Bear-McClard",
		"Eli Bush",
		"Scott Rudin",
		"Daniel Lopatin",
		"Darius Khondji",
		"Ronald Bronstein",
		"Benny Safdie",
		"Francine Maisler",
		"Jennifer Venditti",
		"Sam Lisenco"
	],
	"links": [
		"https://www.amazon.com/Uncut-Gems-Adam-Sandler/dp/B082L1F7XW"
	],
	"votes": 324445,
	"cover": "https://m.media-amazon.com/images/M/MV5BNmI0YjA5NjItYzExYi00NzkxLTkxNDctNGJjYTZhM2M0NDQ0XkEyXkFqcGc@._V1_QL75_UX190_CR0,8,190,281_.jpg",
	"description": "In 2010, an accident occurs in the mine-shafts of an Ethiopian Hebrew mining company. Two workers sense an opportunity and sneak back into the mine, while everybody outside is distracted with the accident. They retrieve a rare and valuable black opal. This is the uncut gem.In 2012, Howard Ratner (Adam Sandler) the KMH jewelry store in New York City's Diamond District while struggling to pay back gambling debts, particularly $100,000 to a loan shark named Arno (Eric Bogosian). Howard has recently undergone a colonoscopy. Arno and his men treat Howard very roughly for his failure to not being able to settle the loan and slap him in his shop, in front of his customers. They take away his $20,000 watch for not beating him up more.Howard has a well-paying job, but his habits are even more expensive. He has a gambling addiction, a fancy house on Long Island for his wife Dinah, an apartment in Manhattan for his mistress Julia, and a swimming pool that needs resurfacing.\nHis domestic life is split between his employee and mistress Julia (Julia Fox), and his estranged wife Dinah (Idina Menzel), who's agreed to divorce him after Passover.Although he has $100,000 in cash, he spends the money on a 600-carat black opal from Ethiopia's Welo mine, which he smuggles to America. He gambles that he can sell the opal for as much as $1 million.One day, Howard receives the rock containing the opal. Howard plans to auction it off. Demany (Lakeith Stanfield), one of his employees (an intermediary who recruits clients for him), secures basketball player Kevin Garnett as a customer, who becomes obsessed with the opal and wants to buy it. Howard refuses to sell the opal and says that he intends to auction it. Garnett insists on holding onto the opal for good luck at his game that night. Howard reluctantly agrees, taking Garnett's championship ring as collateral and immediately pawning (for $21,000) it in order to place a large bet on the game, planning to buy it back with his winnings. Howard had already paid his broker $19,000 for a different bet, and he scraps it and makes the new bet for $40,000.\nHe places a degenerate six-way parlay worth $600,000, betting that Garnett will play well. Unluckily for Howard, Arno's men see him placing a bet.Howard wins his bet on the game, but Demany informs him that Garnett wishes to keep the opal longer. Howard is later ambushed at his daughter's school play by Arno and his bodyguards, Phil (Keith Williams Richards) and Nico (Tommy Kominik). When Howard explains that he can pay him back with the money he won, Arno reveals that he placed a stop on the bet, as it was made with money owed to him. The trio then strip Howard naked and lock him in the trunk of his own car, forcing him to call Dinah to unlock it for him.Becoming desperate, Howard rushes that night to find the opal at a party hosted by The Weeknd (which Demany is attending) and ends up getting into a fight with the singer after discovering him and Julia together in a bathroom. Howard angrily chastises Julia and throws her out of his apartment.\nDuring Passover dinner it is revealed Arno is actually Howard's brother in-law. Dinah rejects Howard's plea to give their marriage another chance. When Howard brags about the opal to their father in-law Gooey (Judd Hirsch) and how much money it will bring, Arno notices and takes an interest in the upcoming auction.Garnett soon returns the opal and offers Howard $250,000 for it, but Howard refuses given the substantially larger appraisal. Howard lies that he left Garnett's ring at home.\nDemany quits when he learns that Howard pawned Garnett's ring, as well as other clients' collateral. Howard berates Demany for allowing Garnett to hold onto the opal for so long. Enraged, Demany trashes Howard's office.At the auction, Howard is devastated to discover the opal has been appraised for significantly lower than his estimate, for only $155,000. Desperate, he convinces Gooey to bid on the gem to drive up the price, but this backfires when Garnett bows out before the bid reaches $200,000 (Gooey was at $180,000) and Gooey wins. Arno, Phil, and Nico confront him outside of the auction, beat him up, and throw him into a fountain.Howard returns to his shop battered and emotionally broken, where Julia comforts him and the two repair their relationship. Immediately afterward Howard receives a call from Garnett's assistant informing him that Garnett still wants to buy the opal for $175,000. Howard retrieves Garnett's championship ring by exchanging his own 1973 Knicks championship ring as collateral, and finally completes the deal for the Opal and Garnett pays him $165,000 for it.\nGarnett visits KMH to pick up the ring and confront Howard about his auction scheme. Howard explains that he has an emotional need to chase the next big score. He is already planning his next big bet, and uses the confrontation to motivate Garnett to dominate the next game.However instead of immediately paying off his debts, Howard again becomes wrapped up in the idea of betting on Garnett's connection with the Opal. He gives the money to Julia, instructing her to put it all on Garnett's game that night. She takes the money and boards a helicopter to the Mohegan Sun casino to place the bet, barely escaping Arno, Phil and Nico who've come to collect.They become furious when they learn of the bet and try to pursue Julia, but Howard locks them in the vestibule of the store as they try to leave. Howard frantically watches the game with his money on the line, with Arno and his muscle watching alongside. Ultimately Howard's bet pays off, winning him over $1.2 million. While Howard celebrates and releases the trio from the vestibule, an angry Phil suddenly shoots Howard in the head. A horrified Arno protests and tries to escape, but Phil kills him as well. An overjoyed Julia leaves with the winnings on her way back to Howard, unaware that he's been murdered while Phil and Nico continue to loot the store of its contents with the police in route."
}