{
	"title": "Phantom Thread",
	"release_year": "2017",
	"runtime": "130",
	"tags": [
		"Drama",
		"Romance",
		"amazon",
		"netflix"
	],
	"rating": 7.4,
	"actors": [
		"Vicky Krieps",
		"Daniel Day-Lewis",
		"Lesley Manville",
		"Julie Vollono",
		"Sue Clark",
		"Joan Brown",
		"Harriet Leitch",
		"Dinah Nicholson",
		"Julie Duck",
		"Maryanne Frost"
	],
	"staff": [
		"Paul Thomas Anderson",
		"Paul Thomas Anderson",
		"Paul Thomas Anderson",
		"Megan Ellison",
		"Daniel Lupi",
		"JoAnne Sellar",
		"Jonny Greenwood",
		"Dylan Tichenor",
		"Cassandra Kulukundis",
		"Mark Tildesley"
	],
	"cover": "https://m.media-amazon.com/images/M/MV5BOTMzNWNhNDctMTM2MC00N2EwLThjYTEtMmQ2ZDAyNDVlNzgyXkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg",
	"links": [
		"https://www.amazon.com/Phantom-Thread-Blu-ray-Daniel-Day-Lewis/dp/B079781D68",
		"https://www.amazon.com/Phantom-Thread-Daniel-Day-Lewis/dp/B07943844F",
		"https://www.amazon.com/Phantom-Thread-UHD-Daniel-Day-Lewis/dp/B08NTDV2MP",
		"https://www.netflix.com/title/80195447"
	],
	"netflix": [
		"italy",
		"switzerland"
	],
	"votes": 147596,
	"description": "In 1954 London, renowned fashion designer Reynolds Woodcock (Daniel Day-Lewis) creates dresses and garments for members of high society. His charisma and genius are matched by his obsessive, controlling personality. Reynolds is extremely detailed oriented and cannot stand anything less than perfection. Reynolds has a staff of very experienced tailors that give shape to his designs.\nCyril (Lesley Manville), his sister, manages the day-to-day operations of his eponymous luxury fashion house and has significant influence over his life. Reynolds is haunted by the death of their mother, and stitches hidden messages into the linings of the dresses he makes.\nJohanna (Camilla Rutherford) is Reynolds current girlfriend and she complains as she can never get his attention on any topic. Cyril tells Reynolds that Johanna has become a distraction and the time has come to let her go. Cyril proposes that Reynold should take a break with a trip to the countryside.After designing a new gown for a revered client, Countess Henrietta Harding (Gina McKee), Reynolds visits a restaurant in the countryside and becomes interested in a waitress named Alma (Vicky Krieps). He asks her out on a date, and she accepts. Reynolds tells her the story of how he wanted to help sew the wedding dress of his nanny, Miss Blackwood when he was young. But Miss Blackwood was superstitious and said that nobody else should help her with her wedding dress, else she would never get married. Reynolds then worked alone to sew a wedding dress for the nanny, and as it turned out, she never got married, and neither did Cyril.Reynolds says that he was never meant to marry, and he is a confirmed bachelor. Reynolds makes a dress for Alma and wins her over. Cyril sits in on the sessions where Reynolds takes Alma's measurements. Cyril makes Alma very uncomfortable, and even more so when Reynolds comments that Alma has no breasts, and his dresses can give her shape.\nTheir relationship develops, and she soon moves in with him and acts as his muse, assistant, and love interest. Alma believes that she becomes perfect in Reynolds world.At first, Alma enjoys being a part of his creativity and seeing him work, but Reynolds proves hard to please and aloof. Reynolds positions Alma as the showstopper for one his shows at his shop. But Reynolds is extremely stressed on account of these shows.Reynolds would at time treat her like a princess, but then at times like an ordinary help of the household. Alma is overjoyed and dismayed simultaneously at this behavior.\nReynolds designs a dress for Barbara Rose (Harriet Sansom Harris), and Reynolds insists that Barbara not tinker with his design. In the stifling heat, Reynold makes Barbara wear a gown that covers her up to the neck and ends up suffocating her to the extent that she falls faint during the engagement dinner. Reynolds makes Barbara return the dress to him and makes Alma take it off her while she is sleeping in the dress, since she fell faint in it.\nCyril is initially distrustful of Alma but eventually gains respect for her willfulness and determination.When the Belgian Princess comes in for measurements, Reynolds makes Alma to stand with the other staff of his shop.\nThey bicker constantly; when Alma attempts to make him a romantic dinner, Reynolds lashes out over how the meal is prepared and repeats to her that he will not tolerate any deviations from the daily routines that he has worked hard at perfecting.Wanting to regain her power in their relationship, Alma decides to poison his tea with some wild mushroom shavings she has gathered outside the house. As he readies a wedding gown for a Belgian Princess Mona Braganza (Lujza Richter), Reynolds becomes gravely ill and later hallucinates the ghost of his mother, but Alma takes care of him. Cyril has to take over to fix the damage to the dress caused by Reynolds when he fell over it while inspecting it. Cyril brings in her Dr. Robert Hardy (Brian Gleeson) as she does not trust Alma. But Reynolds doesn't trust anyone other than Alma.\nHe soon recovers, finds himself deeply moved by Alma's devotion and asks her to marry him. She initially hesitates but agrees to marry.After Reynolds recovers, he tells Alma that a house that does not change \"is a dead house\" and asks her to marry him. Taken aback, she hesitates but then accepts. Following a pleasant honeymoon in Switzerland, however, Reynolds and Alma start bickering again as Reynolds's domineering personality reasserts itself. Cyril reveals to Reynolds that Lady Harding is now a client at a rival fashion house and suggests that his classic, conservative designs may be going out of style. Reynolds blames Alma for being more a distraction than an inspiration, and Alma overhears him telling Cyril that it may be time to end the marriage.Alma responds making Reynolds a poisoned omelet. As he chews his first bite, she informs him that she wants him weak and vulnerable with only her to take care of him. Only after Alma explains this does Reynolds swallow the omelet, accepting his fate and finally allowing Alma to completely fill the void left by his mother.\nAs he lies sick, Alma imagines their future with children, a rich social life, and her running the dressmaking business as a partner. She acknowledges that while there may be challenges ahead, their love for each other and their new arrangement can overcome them."
}