{
	"title": "Call Me by Your Name",
	"release_year": "2017",
	"runtime": "132",
	"tags": [
		"Drama",
		"Romance",
		"amazon"
	],
	"rating": 7.8,
	"actors": [
		"Timothée Chalamet",
		"Armie Hammer",
		"Michael Stuhlbarg",
		"Amira Casar",
		"Esther Garrel",
		"Victoire Du Bois",
		"Vanda Capriolo",
		"Antonio Rimoldi",
		"Elena Bucci",
		"Marco Sgrosso"
	],
	"staff": [
		"Luca Guadagnino",
		"James Ivory",
		"André Aciman",
		"Emilie Georges",
		"Luca Guadagnino",
		"James Ivory",
		"Marco Morabito",
		"Sayombhu Mukdeeprom",
		"Walter Fasano",
		"Stella Savino",
		"Samuel Deshors"
	],
	"votes": 324615,
	"cover": "https://m.media-amazon.com/images/M/MV5BNDk3NTEwNjc0MV5BMl5BanBnXkFtZTgwNzYxNTMwMzI@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "It is the summer of 1983. Elio (Timothee Chalamet), a seventeen-year-old Hebrew American-Italian boy, lives in the northern Italian countryside with his parents. His father (Michael Stuhlbarg), a professor of archaeology, invites an American Hebrew graduate student, Oliver (Armie Hammer), to live with his family and help with his academic paperwork. Oliver is going to spend 6 weeks with the family. Oliver belongs to a small town in New England.\nElio's mother is Anella (Amira Casar). Elio is a young teenager, while Oliver is a young man in his early thirties already.Elio, an introspective bibliophile and musical prodigy, finds little in common with Oliver, whose carefree and exuberant personality contrasts with his own. Elio also resents vacating his bedroom for the duration of Oliver's stay.\nThe town is beautiful, and Elio offers to show Oliver around. There is a lot of sunshine, and Anella has an orchard with all sorts of fruits such as peaches, apricots and pomegranates.\nElio spends much of the summer reading books and hanging out with his girlfriend, Marzia (Esther Garrel).\nDuring a volleyball match, Oliver touches Elio's back and ends up giving him a back massage, but Elio brushes it off.Oliver tries to find excuses to spend time with Elio. He also listens to one of Elio's piano recitals. Elio is dismissive towards Oliver, but then later reflects that perhaps he was being too harsh.Elio and Oliver begin to spend time with each other, and a seductive courtship emerges as they swim together, go for long walks in the town, and accompany Elio's father on an archaeological trip. The trip is extremely fruitful as the team discovers a near perfectly preserved metal statue in the ocean, where it went down with the ship.Oliver is attracted to one of the local girls Chiara (Victoire Du Bois), much to Elio's chagrin. Chiara is the talk of the town for landing Oliver as her catch for the summer. All the girls in town find Oliver cute and want to be in Chiara's shoes. At this point Oliver understands that Elio is not happy having Oliver in the house and Oliver is equally brusque towards him.Elio begins a sexual relationship with Marzia and brags about it in front of Oliver to gauge his reaction. Elio increasingly finds himself attracted to Oliver. He sneaks into Oliver's room to smell his bathing suit and thinks about him while masturbating.During a trip to the post office, Elio subtly confesses his feelings to Oliver, who gently tells him that he should not act on them. When they go swimming one day, Elio kisses Oliver on the lips. Oliver returns the kiss but is reluctant to go further. The pair subsequently grow distant during the next few days.In response to a note from Elio, Oliver leaves a note on Elio's desk telling Elio to meet him at midnight. Elio spends the day with Marzia, all the while longing to see Oliver. Finally, at midnight, he approaches Oliver on the patio. The two make love for the first time.\nDuring the next few days, they grow closer, having sex frequently while keeping their relationship secret. In bed, Oliver tells Elio, \"Call me by your name and I'll call you by mine\". They become more intimate both physically and emotionally.\nElio is briefly conflicted about their encounter and takes out his sexual frustration by masturbating with a peach. When Oliver discovers it, he tries to take a bite of the peach in front of a humiliated Elio, who begs him not to. Completely smitten with Oliver by this point, Elio starts avoiding Marzia.When Oliver finds him, Elio cries about how little time he and Oliver have left together. Marzia confronts Elio after not hearing from him for three days. He responds coldly, hurting her.With the end of Oliver's stay imminent, the couple find themselves overcome by uncertainty and longing. Elio's parents, conscious of the bond between the two, recommend they take a trip to Bergamo together before Oliver goes back to America. They spend three romantic days together, after which Oliver leaves, and a heartbroken Elio returns home. Elio calls his mother and asks her to pick him up from the train station and take him home.\nHe encounters a sympathetic Marzia, who still wants to be his friend, and his father, seeing how forlorn his son is, tells him that he was aware of Elio's affair with Oliver. He confesses to having had his own love affair with a friend in his youth, and urges Elio to find pleasure in the grief, since true love of the kind Elio and Oliver shared is rare.During Hanukkah, Oliver calls Elio's family to tell them he is engaged to be married to a woman he has been seeing for a few years. Elio calls Oliver by his name and Oliver responds with his; Oliver also says that he remembers everything. After the call, Elio sits down by the fireplace and stares into the flames, tearfully reflecting, as his parents and staff prepare the holiday dinner.",
	"links": [
		"https://www.amazon.com/Call-Your-Name-Armie-Hammer/dp/B0791VJLVB"
	]
}