{
	"title": "You Were Never Really Here",
	"release_year": "2017",
	"runtime": "89",
	"tags": [
		"Crime",
		"Drama",
		"Thriller",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Joaquin Phoenix",
		"Judith Roberts",
		"Ekaterina Samsonov",
		"John Doman",
		"Dante Pereira-Olson",
		"Larry Canady",
		"Vinicius Damasceno",
		"Neo Randall",
		"Frank Pando",
		"Edward Latham"
	],
	"staff": [
		"Lynne Ramsay",
		"Lynne Ramsay",
		"Jonathan Ames",
		"Rosa Attab",
		"Pascal Caucheteux",
		"Rebecca O'Brien",
		"Lynne Ramsay",
		"Jonny Greenwood",
		"Thomas Townend",
		"Joe Bini",
		"Billy Hopkins",
		"Ashley Ingram",
		"Blair Barnette",
		"Tim Grimes"
	],
	"votes": 129115,
	"cover": "https://m.media-amazon.com/images/M/MV5BYzM0MjBhYTUtMzY1My00OGQ5LTk4OWMtNWYwNmY3ZGFjMjViXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The film opens with Joe (Joaquin Phoenix) in a motel. He is a hired gun who recovers missing trafficked girls for a living. After finishing a job, he cleans himself up, removes any trace of him being there, and he leaves. Joe is attacked by a man in an alley, but Joe fights him off with ease. He then goes to find a phone to confirm to his handler that the job is done.Joe lives at home with his ailing mother (Judith Roberts) in New York City. She is the only person Joe has in his life. As a former FBI agent/Gulf War veteran, Joe experiences numerous PTSD flashbacks, including one where he saw a child get shot after giving that kid a candy bar, another where he finds a storage unit with a number of dead trafficked girls, as well as his own abusive childhood hiding from his abusive drunkard of a father. He often plays around with the idea of suicide, as he toys around with a knife or contemplates as he stands above train tracks in the city.Joe goes to a bodega to collect payment from Angel (Frank Pando), the middleman between Joe and the handler. He tells Angel that his son Moises (Vinicius Damasceno) saw him the previous night returning home, indicating the boy has some idea of what Joe does and where he lives. This displeases Joe and he chooses to cut ties with him.Joe later goes to meet with the handler, John McCleary (John Doman). He informs Joe of a new task in which he must recover the daughter of State Senator Albert Votto (Alex Manette) after she's run away. Votto doesn't want authorities involved since he's working with Governor Williams (Alessandro Nivola) and is willing to pay $50,000 for his daughter's return.Joe later meets with Votto personally to discuss what he knows about his daughter's whereabouts. He tells Joe her name is Nina (Ekaterina Samsonov) and that she may be located at a specific address known for housing trafficked girls. Joe gives Votto an address for them to meet when the job is done, and Votto requests that Joe hurt the men responsible.After spending a good part of the afternoon looking for supplies, Joe finds the location of the child trafficking house where Nina is kept. He attacks and interrogates a man going in and out of the place to know how many guards are in there. Joe enters and proceeds to kill the guards before he finds Nina. He takes her to a motel where he anticipated her fathers arrival, only to see on TV that Votto has apparently jumped to his death. Crooked cops then come into the hotel, attack Joe, and take Nina with them. After a moment, Joe fights the cop and kills him.Joe attempts to contact McCleary for help, only to find that he's dead, along with Angel and Moises. Joe returns home to find that his mother has been murdered as well in her bed. He discovers that the killers are still in the house, waiting for him. Joe manages to get the upper hand and shoot both of them. One of them is alive but moments away from death. Joe questions him as to which of them killed his mom, as well as if either of them killed Votto. The hit-man says \"Votto wanted out\", as he apparently conspired with Governor Williams, whom the hit-man says was most fond of Nina.Joe takes his mother's body to a lake where he buries her. He also attempts to drown himself by filling his pockets with stones. As he sinks deeper into the lake, he has a vision of Nina that snaps him out of his moment so that he may swim back to the surface and continue his job.In his head, Joe puts the pieces together. Votto and Williams were both involved in a child sex trafficking scheme in which Votto sold Nina to Williams to get in Williams' good graces. However, the guilt of doing so drove Votto to suicide. Joe then follows Williams around the city until he figures out where he's headed.Joe follows Williams to his home. He enters and kills the guards before making his way to Williams' room, only to discover that the man's throat was slit. Joe then finds Nina in the dining room eating with bloody hands a bloody razor set beside her.Joe then takes Nina to a diner for a meal. She goes to the bathroom, shortly after he shoots himself in the head and nobody seems to care. Nina returns and we see it was a fantasy, Joe is slumped over, tired and stressed. She tells him they should go because it's a beautiful day. He agrees and the we end with the booth now empty.",
	"links": [
		"https://www.amazon.com/You-Were-Never-Really-Here/dp/B089XVDTTF"
	]
}