{
	"title": "Escape Room",
	"release_year": "2019",
	"runtime": "99",
	"tags": [
		"Action",
		"Adventure",
		"Horror",
		"amazon"
	],
	"rating": 6.4,
	"actors": [
		"Taylor Russell",
		"Logan Miller",
		"Jay Ellis",
		"Tyler Labine",
		"Deborah Ann Woll",
		"Nik Dodani",
		"Yorick van Wageningen",
		"Cornelius Geaney Jr.",
		"Russell Crous",
		"Bart Fouche"
	],
	"staff": [
		"Adam Robitel",
		"Bragi F. Schut",
		"Maria Melnik",
		"Ori Marmur",
		"Neal H. Moritz",
		"John Carey",
		"Brian Tyler",
		"Marc Spicer",
		"Steve Mirkovich",
		"Bonnie Lee Bouman",
		"Tamara Hunter",
		"Christa Schamberger",
		"Edward Thomas"
	],
	"votes": 145430,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjQ2NDMwMTY3MF5BMl5BanBnXkFtZTgwNDg5OTc1NjM@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Six people from varied backgrounds are presented with a puzzle cube: Zoey (Taylor Russell), a physics student (Zoey's professor (Cornelius Geaney Jr.) encourages her to speak up more); Jason (Jay Ellis), a wealthy day trader (he makes his clients a lot of money. Charlie (Russell Crous), Jason's assistant); Ben (Logan Miller), a stock-boy (he is dirt poor and begs his boss Gary (Bart Fouche) for a shift at the checkout counter, but is refused); Mike (Tyler Labine), a truck driver; Amanda (Deborah Ann Woll), an Iraq War veteran; and Danny (Nik Dodani), an escape room enthusiast (he has done 93 escape rooms before).When they solve the puzzle, they are invited to take part in an escape room with a $10,000 prize. The participants arrive at an office block with no greeting, and when Ben tries to leave, the door handle falls off, revealing that the challenge has begun. The objective is to escape before the clock runs out.They escape the first two rooms, a giant heating oven and a winter cabin. After finding the key, however, the rooms become fatal. In the heating oven they find the escape hatch by pressing down on the coasters. But the coasters have to be kept pressed for the hatch to be open. Ben and Danny figure out to fill the glasses and keep them on coasters to press them down and keep the hatch open to escape.\nThey enter a room and encounter 2 locks. Ben helps figure out the clue to the 2nd lock, with the word \"Reindeer\". The clues come directly from the participants personal history. The group opens the door and figures they were in the winter cabin, as its icy winter outside. As the group steps out, the cabin shuts itself.Amanda finds a coat and gives it to Zoey, and she finds a compass inside. Mike finds a fishing rod and uses that on a fishing hole that Ben almost fell through. Zoey uses the compass to find a magnet and ties it to the fishing pole. They bring up a frozen ice box.\nDanny falls through the ice in an icy room and drowns; The group has to use their body heat to melt the ice box and get to the key embedded inside. Jason uses the key to open a door and the group escapes as the icy floor explodes all around them.The next room is an upside-down billiards bar where parts of the floor periodically fall into a deep shaft below; Jason finds a door, without a handle. Amanda takes initiative and climbs on the bar to find more clues, even as the floor of the room drops from under them and the group hangs on at the edges of the room. Amanda finds a safe, with an electronic code. Zoey finds a puzzle board and starts to solve it. She figures out the code, which opens the safe and reveals the knob to open the door. But Amanda is stuck on the other side of the room and falls while trying to cross it but manages to get the knob to Jason.The next room is a hospital room, which has beds for all the participants, exactly the way they encountered it when they were in a hospital. The room remind the players of them being sole survivors of various disasters (it has their medical dossiers); Mike escaped a mine cave-in, Zoey survived a plane crash, Danny survived when his family died of carbon monoxide poisoning, Amanda survived an IED blast, Jason survived a shipwreck in frigid weather, and Ben survived a car accident where his friends died.\nJason notices the room filling up with poison gas. Zoey decides to smash all the cameras so that she can figure out a different escape route. Zoey realizes that the purpose of the game is to determine which player is the luckiest.3 x rays reveal the clue to be an EKG. Jason reckons using the EKG to increase the heart rate would open the escape route. Jason decides to shock Mike to increase his heart rate, as his rate is already high. Mike dies and Jason figures that the key is find the low end of the heart rate. He drops his heart rate, like he did when he got hypothermia. The route opens at 50 BPM. Zoey refuses to leave, and it determined to find a different way out.Ben realizes that Jason killed his friend and took his jacket to survive the shipwreck. He accuses Jason of killing Mike.\nin a room with optical illusions, drugs and strobe lights, Ben kills Jason over an antidote required to escape. Ben found the antidote, but it had a single dose and Jason started to attack Ben, so Ben killed him.\nMeanwhile the cleanup crew arrives in the hospital room and Zoey attacks them to get their gun.Ben, after escaping the last room where a wall moves inwards to crush him, meets the Gamemaster (Yorick van Wageningen), who controls the game that the Puzzle Maker designed.\nThe Gamemaster explains that each year they lure in players with something in common - college athletes, savants, etc. - and wealthy viewers bet on the result, with the current game luring in sole survivors of previous disasters. The Gamemaster tries to kill Ben, but Zoey intervenes, and together they kill the Gamemaster.As Ben recovers, Zoey returns to the building with a detective Li (Kenneth Fok). The police do not believe Zoey, as all evidence of the game has disappeared. They do not believe Ben either, as he was found to have drugs in his system. While looking at the graffiti on the wall, Zoey notices the words \"Wootan Yu\" and realizes they are an anagram for \"No Way Out\", suggesting the game is not over. Six months later, Zoey meets up with Ben and shows him newspaper articles that passed off the other players' deaths as everyday accidents. When Ben suggests Zoey should move on, she refuses. She reveals clues to Ben that point to an unlisted building in Manhattan. Ben agrees to go with her. However, the Puzzle Maker is already preparing to make their flight a new deadly game of survival.",
	"links": [
		"https://www.amazon.com/Escape-Room-Tournament-Taylor-Russell/dp/B09D8SD94V"
	]
}