{
	"title": "Pokémon: Detective Pikachu",
	"release_year": "2019",
	"runtime": "104",
	"tags": [
		"Action",
		"Adventure",
		"Comedy",
		"amazon"
	],
	"rating": 6.5,
	"actors": [
		"Ryan Reynolds",
		"Justice Smith",
		"Kathryn Newton",
		"Bill Nighy",
		"Ken Watanabe",
		"Chris Geere",
		"Suki Waterhouse",
		"Josette Simon",
		"Alejandro De Mesa",
		"Rita Ora"
	],
	"staff": [
		"Rob Letterman",
		"Dan Hernandez",
		"Benji Samit",
		"Rob Letterman",
		"Derek Connolly",
		"Cale Boyter",
		"Hidenaga Katakami",
		"Don McGowan",
		"Mary Parent",
		"Henry Jackman",
		"John Mathieson",
		"Mark Sanger",
		"James Thomas",
		"Sarah Finn",
		"Jina Jay",
		"Nigel Phelps"
	],
	"votes": 185866,
	"cover": "https://m.media-amazon.com/images/M/MV5BNDU4Mzc3NzE5NV5BMl5BanBnXkFtZTgwMzE1NzI1NzM@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In the Pokémon universe, Tim Goodman (Justice Smith) (a former Pokémon trainer looking for his missing father; he is also Detective Pikachu's partner) is a 21-year-old insurance salesman who has given up Pokémon training due to the death of his mother and the absence of his father, Harry (Ryan Reynolds) (Tim's missing father and a veteran Ryme City police detective). While hanging out with his friend Jack (Karan Soni) (Pokemon Trainer), Tim learns that Harry has died in a car crash while investigating a case.He travels to Ryme City, a metropolis that outlaws Pokémon fighting and pushes the bonds of humans and Pokémon alike, to collect Harry's assets. Tim also meets Lucy Stevens (Kathryn Newton), a fluff columnist who wants to be a reporter and is suspicious of Harry's death, and her Psyduck. While reminiscing in his apartment, Tim encounters a deerstalker-clad Pikachu (Ryan Reynolds) (a world-class detective and exceptionally smart Pikachu whom only Tim can understand) that can speak and only he can somehow understand. They are attacked by a party of Aipom under the influence of a purple gas that Tim accidentally released (He found the tiny gas container in Harry's apartment), but they both escape.They take shelter at a cafe where Pikachu reveals that he is an amnesiac detective who was Harry's police partner and that they were investigating a case together when Harry disappeared; the only clue to Pikachu's identity and Harry's whereabouts being the deerstalker hat labeled with Harry's name. They look for Lucy, who reveals that while investigating she discovered that Harry was once at Ryme Wharf and set out to find clues. Lucy is also investigating claims that Pokemons are attacking humans in Ryme city, but can't get the story verified. She found similar gas containers like what Tim found in Harry's apartment, at every site of the attack).Tim and Pikachu interrogate a Mr. Mime (who used to be Harry's informant) who directs them to an illegal underground fighting arena owned by Sebastian (Omar Chaparro) (a Pokémon trainer who runs a battle arena for Pokémon and is accompanied by a Charizard), whose Charizard previously lost a battle to Pikachu. Sebastian demands a rematch, but Pikachu cannot remember his own moves and Sebastian gives Charizard the same mysterious gas labeled \"R\". While Tim attempts to save Pikachu, Sebastian accidentally releases R, causing the entire stadium to get affected alerting the authorities, but not before revealing to Tim that he got R from \"the doctor.\"Tim argues with police lieutenant Hideo Yoshida (Ken Watanabe) (a veteran Ryme City police lieutenant and friend of Harry who is accompanied by a Snubbull) that Harry may be alive, but Yoshida shows him the video of Harry's crash, explaining that it would have been impossible. Soon, Tim and Pikachu are met by Ms. Norman (Suki Waterhouse) (a disguise used by a modified shape-shifting Ditto that is Howard's accomplice) who takes them to see Ryme City's benefactor Howard Clifford (Bill Nighy), who had once tried to cure his ailing condition and instead created the humanitarian city. He shows him more revealing footage of Harry surviving the attack, apparently caused by the recently escaped Mewtwo (a human created powerful Pokemon built using the DNA of an ancient Mew), but that he was taken away by the Pokémon, leaving Pikachu with amnesia. Howard tells them to watch out for his son, Roger (Chris Geere), who he claims is in control of his company and the city. With this new information, Tim and Pikachu recruit Lucy and Psyduck.The group breaks into the lab facility Harry were investigating and learn that Dr. Ann Laurent (Rita Ora), the doctor Sebastian mentioned, was experimenting on Mewtwo, who had been recaptured after escaping 20 years earlier, and had apparently hired Harry to aid them. They are soon attacked by several Greninja who chase them out of the building but are fended off by Psyduck. They then escape a field of colossal Torterra, but Pikachu is gravely injured. Tim manages to communicate to a Bulbasaur and takes Pikachu to a clearing in the forest where they are greeted by Mewtwo, who heals Pikachu. Mewtwo attempts to reveal its intent but is captured by Roger. Thinking that he betrayed Harry to a vengeful Mewtwo, Pikachu leaves Tim while the others return to Ryme City to warn Howard.Pikachu comes across the area where Harry crashed his car and finds proof that it was not Mewtwo who attacked, but the Greninja. Tim reaches Howard but learns too late that he intends to transfer his consciousnesses into Mewtwo and use R so that the Pokémon can become docile enough for him to fuse them with their owners, thus allowing humans to evolve within their Pokémon. As Howard in Mewtwo's body releases the gas into the world, Pikachu arrives and finally summons his electricity powers to battle Mewtwo. Meanwhile, Tim finds out that \"Roger\", and in-turn Ms. Norman, was really a shape-shifting Ditto who was modified to transform into humans, with the real Roger having been tied up and hidden. Tim subdues and kills Ditto with R while Pikachu fends off Mewtwo long enough for Tim to free Mewtwo from Howard's control.Mewtwo restores everyone to normal while Howard is arrested by the police. Roger is impressed with Lucy and hires her as a full-time reporter. Mewtwo then reveals that Harry was in fact fused with Pikachu to heal him. The fuse erased Harry's memory while keeping his consciousness within Pikachu. After Mewtwo separates them with the help of Tim, a fully revived Harry offers Tim the chance to return home, but Tim decides to stay to learn how to become a detective and spend time with him and Pikachu.",
	"links": [
		"https://www.amazon.com/Pok%C3%A9mon-Detective-Pikachu-Ryan-Reynolds/dp/B07TJKW29H"
	]
}