{
	"title": "Ralph Breaks the Internet",
	"release_year": "2018",
	"runtime": "112",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"John C. Reilly",
		"Sarah Silverman",
		"Gal Gadot",
		"Taraji P. Henson",
		"Jack McBrayer",
		"Jane Lynch",
		"Alan Tudyk",
		"Alfred Molina",
		"Ed O'Neill",
		"Sean Giambrone"
	],
	"staff": [
		"Phil Johnston",
		"Rich Moore",
		"Phil Johnston",
		"Pamela Ribon",
		"Rich Moore",
		"Jim Reardon",
		"Clark Spencer",
		"Henry Jackman",
		"Nathan Warner",
		"Jeremy Milton",
		"Fabienne Rawley",
		"Jamie Sparer Roberts",
		"Cory Loftis"
	],
	"votes": 187484,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTYyNzEyNDAzOV5BMl5BanBnXkFtZTgwNTk3NDczNjM@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Wreck-It Ralph (John C. Reilly) and Vanellope Von Schweetz (Sarah Silverman) have been best friends since their misadventures six years prior, hanging out every night after work in Litwak's Family Fun Center and Arcade. While Ralph is content with his current life, Vanellope admits to being bored with her game's predictability and wishes for something new. The next day, Ralph attempts to fulfill her desires by creating a secret bonus track during a race. Vanellope overrides player control to test it out, but the resulting conflict between her and the player results with the cabinet's steering wheel being broken. Since the company that made Sugar Rush is defunct, one of the kids finds a replacement for Mr. Litwak (Ed O'Neill) on eBay. Unfortunately, Mr. Litwak finds it too expensive and has no choice but to unplug Sugar Rush, leaving the game's characters homeless.Later that night, after conversing with Fix-It Felix Jr. (Jack McBrayer), Ralph decides to enter the internet via Mr. Litwak's recently installed Wi-Fi router to obtain the new wheel on eBay. Ralph brings Vanellope with him, and although they win the bid to obtain the wheel, they are unable to pay and must make the purchase within 24 hours. The two turn to a pop-up advertiser named Spamley (Bill Hader) to quickly make money, receiving a lucrative job of stealing a valuable car belonging to Shank (Gal Gadot) from Slaughter Race. Ralph and Vanellope steal the car but are forced to return it when Shank chases them all over the game and forces them to stop. Shank compliments Vanellope's driving skills and points the duo towards Yesss (Taraji P. Henson) at BuzzzTube (an algorithm that determines the trending videos on BuzzzTube, a portmanteau of YouTube and BuzzFeed), where Ralph decides to make a series of viral videos playing off popular trends to get the money.As Ralph's videos become a viral sensation, an excited Vanellope joins Yesss's staff in spamming users with pop-up ads. A concerned Ralph convinces Yesss to send Vanellope to a Disney fan-site, where she meets the Disney Princesses (Jennifer Hale as Cinderella, Kate Higgins as Aurora, Jodi Benson as Ariel, Paige O'Hara as Belle, Linda Larkin as Jasmine, Irene Bedard as Pocahontas, Ming-Na Wen as Mulan, Anika Noni Rose as Tiana, Mandy Moore as Rapunzel, Kelly Macdonald as Merida, Kristen Bell as Anna, Idina Menzel as Elsa, Auli Cravalho as Moana, Pamela Ribon as Snow White) while escaping from First Order Stormtroopers. Vanellope befriends the princesses and is encouraged by them to address her sense of non fulfillment, reaching a musical epiphany when Ralph calls her upon earning the money to purchase the wheel. When Vanellope does not show up at eBay as he brought the item, Ralph's second call causes him to overhear her confessing to Shank she wants to stay in Slaughter Race because its unpredictability and challenges made her feel so alive. Horrified at the thought of Vanellope leaving him, Ralph turns to Spamley for a way to make Slaughter Race too boring for Vanellope by slowing everything down. Spamley takes Ralph to meet Double Dan, and he gives him an Insecurity Virus which replicates any flaw it finds. When Ralph unleashes the virus in Slaughter Race, it unexpectedly replicates Vanellope's glitch across the game, triggering a server reboot and forcing Ralph to rescue Vanellope before the reboot deletes her from the game.Vanellope assumes the crash was her fault, but a guilty Ralph confesses to her what he had done. Feeling betrayed, she takes the hero medal she made him six years prior and throws it away. While Ralph rushes to recover the medal, which was now broken in half, the Insecurity Virus scans him and duplicates his personality flaws. This results in a legion of Ralph clones that destroy the Internet on a rampant search for Vanellope. The real Ralph finds her, and they work with Yesss to lead the clones into an anti-virus software. However, the clones collect into a giant automaton of Ralph and foil their plan. Seeing that Ralph is fighting a losing battle, Vanellope surrenders herself, but Ralph refuses to accept this. He confronts his clones by admitting to his insecurities and tells the automaton a physical separation does not mean the end of their friendship. With his insecurities resolved, the clones disintegrate, and the Internet is restored, while Ralph is saved from falling to his death by the combined efforts of the Disney Princesses.Later, Shank arranges for Vanellope to re-spawn in Slaughter Race, allowing her to stay. Ralph gives her half of his broken medal and returns to the arcade. As Sugar Rush is plugged back in, Ralph comes to terms with Vanellope's absence as he begins participating in social activities with other game characters while staying in touch with Vanellope through video chats.",
	"links": [
		"https://www.amazon.com/Ralph-Breaks-Internet-John-Reilly/dp/B07KPN763J"
	]
}