{
	"title": "The Little Mermaid",
	"release_year": "2023",
	"runtime": "135",
	"tags": [
		"Adventure",
		"Family",
		"Fantasy",
		"amazon"
	],
	"rating": 7.2,
	"actors": [
		"Halle Bailey",
		"Jonah Hauer-King",
		"Melissa McCarthy",
		"Javier Bardem",
		"Noma Dumezweni",
		"Art Malik",
		"Daveed Diggs",
		"Jacob Tremblay",
		"Awkwafina",
		"Jessica Alexander"
	],
	"staff": [
		"Rob Marshall",
		"David Magee",
		"Hans Christian Andersen",
		"John Musker",
		"Ron Clements",
		"John DeLuca",
		"Rob Marshall",
		"Lin-Manuel Miranda",
		"Marc Platt",
		"Alan Menken",
		"Dion Beebe",
		"Wyatt Smith",
		"Tiffany Little Canfield",
		"Bernard Telsey",
		"John Myhre"
	],
	"votes": 159972,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTM4MWY0OTEtY2E4ZC00NDdhLThkY2ItYTlmNWQxNTNkZTRmXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Men believe that oceans are inhabited by mermaids, who come out during the full moon and lure men to their deaths with their siren voices. Eric is a prince of a sea faring people guided by his advisor Sir Grimsby (Art Malik) and adoptive mother Queen Selina (Noma Dumezweni).Ariel (Halle Bailey) is a mermaid princess and the youngest daughter of King Triton (Javier Bardem), ruler of the Mer-people of Atlantica. She is fascinated with the human world despite never having seen it, as Triton forbids all Merfolk from surfacing there after Ariel's mother was killed by a human.\nAriel keeps a collection of human artifacts that fall into the ocean from their ships. She also studies the human shipwrecks to satisfy her curiosity about their ways. Flounder and Scuttle and Ariel's best friends.\nAriel's sisters are Perla (Lorena Andrea), Indira (Simone Ashley), Mala (Karolina Conchet), Tamika (Sienna King), Karina (Kajsa Mohammar), and Caspia (Nathalie Sorrell).\nTriton assigns his advisor Sebastian to look over Ariel and to keep her safe. Meanwhile, Triton's banished sister Ursula watches the events from afar waiting and biding her time.One night, Ariel sees fireworks above the ocean and surfaces to see them better. They come from the ship of Eric (Jonah Hauer-King), the prince of a nearby island. Ariel overhears that Eric also longs to discover the new world and does not want to be shackled as the King of his Island.\nWhen a storm arrives, the ship crashes against rocks, forcing all to go for the lifeboats. Eric waits till everybody has left the ship, but by that time the ship lists dangerously in the water and Eric loses his balance to fall into the ocean.\nAriel saves Eric, brings him to shore, and sings with her siren voice to help save his life. She flees before he is rescued by the fellow survivors from the shipwreck.Ursula watches the events unfold over her magic orb, and vows to take back the powerful Trident back from Triton. She knows that soon Ariel will be alienated by Triton and driven into her tentacles.\nSebastian tries to tell Ariel about the treasures of the sea that she has not explored yet and tries to subconsciously nudge her not to explore the human world anymore. But Sebastian could not guess that Ariel was already in love with Eric.\nMeanwhile, Eric is obsessed with finding the woman who saved his life. Selina is concerned about the rising number of shipwrecks around the Island and bans Eric from undertaking any more voyages.Noticing Ariel's absent-minded behavior, Triton questions his advisor Sebastian the crab (Daveed Diggs), who reveals that she saved a human. Enraged, Triton travels to Ariel's grotto to confront her; when she refuses to swear to never return to the surface, he destroys her collection of human objects. Ariel is later approached by two moray eels sent by the sea witch Ursula (Melissa McCarthy), Triton's estranged sister and Ariel's aunt, who was banished from Atlantica 15 years prior.\nThe eels lure Ariel to Ursula's lair deep beneath the oceans. Ursula says that she understands love in a way that Triton never will.At Ursula's lair, Ariel is presented with a deal: she will turn into a human for three days, during which she must receive \"true love's kiss\" to remain human permanently. If Ariel fails, she will transform back into a mermaid and Ursula will claim her. To become human, Ariel must give up her tail, the ability to breathe underwater, and her siren voice, the last of which Ursula will keep in a nautilus shell. Ariel accepts the deal.\nAfter receiving human legs, she is taken to the surface by Sergeant Major Flounder (Jacob Tremblay), her best friend, and Sebastian. In the human world, she is rescued by fishermen and taken to Eric's castle. The maids of the castle take Ariel in and give her clothes and a bath to make her look presentable.\nEric, who has been searching for the woman who saved his life, rushes to meet Ariel. However, her lack of voice has him immediately turning away, though he does allow Ariel to stay in the castle for as long as she wants.\nSebastian, who has followed Ariel, realizes that Ursula has put a cheat in the spell that is causing Ariel to forget that she needs to kiss Eric.While exploring the castle, Ariel finds Eric's collection of items he accumulated over his travels. Eric spends time with her poring over his collection that has come from his voyages. Ariel fascinates Eric with her knowledge about the seas and its artifacts. Eric teaches Ariel about the human world in return.The next day, Eric takes Ariel sightseeing around the kingdom.\nAlong with Scuttle (Awkwafina), a northern gannet, and Flounder, Sebastian takes it upon himself to get the pair to kiss. Scuttle steals Eric's hat and flies towards the ocean, forcing Eric and Ariel to pursue it on a boat. Then Sebastian orchestrates the jungles and the oceans to produce a romantic and enticing tune to set the mood.\nThey are almost successful but are thwarted by Ursula's eels who tip the boat over. Enraged by the close call, Ursula turns into a human and uses Ariel's siren voice to hypnotize Eric.\nBack at Atlantica, Triton has the kingdom search for Ariel and begins to regret the way he treated her.The next morning, Ariel and her friends discover that Eric will be announcing his engagement to \"Vanessa\" (Ursula's alter ego) later that day. Scuttle hears Ariel's voice and follows it to Vanessa's room where he sees in the mirror that Vanessa is really Ursula and flies to warn Ariel.\nAriel rushes to the engagement party, confronts Ursula, and breaks the shell. She gains back her voice, and the enchantment on Eric is broken. However, before they can kiss, the sun sets, and Ariel transforms back into a mermaid. Reverting to her original form, Ursula drags Ariel back into the ocean.Wanting to save Ariel, Triton confronts Ursula. However, the deal that she made with Ariel is unbreakable. Triton trades himself for Ariel and is turned to dust by the eels, much to her horror. Ursula claims Triton's trident just before Ariel confronts her while Eric arrives.\nUrsula attempts to destroy Eric, but to save Eric the second time, Ariel intervenes and intentionally attacks Ursula, who unintentionally kills her eels. Enraged, she uses the trident to grow in size and summons a storm to threaten Ariel and Eric. Ariel gets on a surfaced ship.Ursula is about to kill Eric with the trident. Saving Eric the third time, Ariel kills Ursula and impales her with its splintered bowsprit. Once Ursula dies, Triton comes back to life. Ariel picks up Triton's trident and hands it back to Triton. Triton is proud of Ariel for saving Eric three times and killing Ursula. Triton and Ariel recognize the other's sacrifice for them.Ariel returns home, where she is unhappy without Eric. On Sebastian's advice, Triton transforms Ariel into a human permanently, and she marries Eric. The pair decide to travel together, with the blessing of both their parents and the support of people from both their worlds.",
	"links": [
		"https://www.amazon.com/Little-Mermaid-Bonus-X-Ray/dp/B0C8X67RQY"
	]
}