{
	"title": "Greyhound",
	"release_year": "2020",
	"runtime": "91",
	"tags": [
		"Action",
		"Drama",
		"History",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Tom Hanks",
		"Elisabeth Shue",
		"Stephen Graham",
		"Matt Helm",
		"Craig Tate",
		"Rob Morgan",
		"Travis Quentin",
		"Jeff Burkes",
		"Matthew Zuk",
		"Joseph Poliquin"
	],
	"staff": [
		"Aaron Schneider",
		"Tom Hanks",
		"C.S. Forester",
		"Gary Goetzman",
		"Blake Neely",
		"Shelly Johnson",
		"Mark Czyzewski",
		"Sidney Wolinsky",
		"Ruth Lambert",
		"Meagan Lewis",
		"Francine Maisler",
		"Robert McGee",
		"David Crank"
	],
	"votes": 117881,
	"cover": "https://m.media-amazon.com/images/M/MV5BZTU3YzY0NjktMmRhMC00MzYyLWI0YmUtZGJkMzJjMWYwZDZkXkEyXkFqcGc@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "Feb 1942.\nDuring the Battle of the Atlantic, convoy HX-25, consisting of 37 Allied ships, is making its way to Liverpool. The convoy's escort consists of the Fletcher-class destroyer USS Keeling DD-548, radio call sign \"Greyhound\", captained by Commander Ernest Krause (Tom Hanks) of the United States Navy; the British Tribal-class destroyer HMS James (Captain (Dominic Keating)), call sign \"Harry\"; the Polish Grom-class destroyer ORP Viktor (captain (Maximilian Osinski)), call sign \"Eagle\"; and the Canadian Flower-class corvette, HMCS Dodge K136 (Captain (Ian James Corlett)), call sign \"Dicky\" . Krause is overall commander of the escort ships, but despite his seniority and extensive naval education, it is his first wartime command.\nJust 2 months ago, Ernest is dating Evelyn Frechette (Elisabeth Shue) in NYC, exchanging Christmas gifts. She gives him news of his first command. She wants to wait till they are back together, before they get married.\nErnest's crew includes Lieutenant Commander Charlie Cole (Stephen Graham), Krause's executive officer. George Cleveland (Rob Morgan), Mess Attendant 2nd Class. Lieutenant Watson (Tom Brittney). Sonar man Red Eppstein (Karl Glusman). Officer of the deck, Lieutenant J. Edgar Nystrom (Matt Helm). Fire controller Melvin Lopez (Manuel Garcia-Rulfo). Depth charges expert Harry Fippler (Jake Ventimiglia).The convoy enters the \"Black Pit\"-the Mid-Atlantic gap where they will be out of range of protective air cover. They are 50 hrs away from regaining air cover on the other side. High-frequency direction finding from the convoy flagship intercepts several German transmissions, indicating the presence of U-boats. Greyhound identifies a surfaced sub heading towards the convoy and moves to attack. The submarine tries to slip under Greyhound, but Krause maneuvers his ship (he activates his sonar to locate the sub and positions the ship towards it) above the U-boat and sinks it with a full pattern of depth charges.The crew's jubilation is cut short as they soon receive reports of distress rockets at the rear of the convoy. A Greek merchant ship was attacked by another U-boat and is quickly sinking. Krause moves Greyhound to assist, evading torpedoes fired at his ship with careful maneuvering. The surviving Greek sailors are rescued, and Greyhound returns to the convoy just as the bridge receives multiple messages from the other escorts: a wolf-pack consisting of six U-boats is staying just out of firing range of the convoy; Krause suspects they are waiting for nightfall, when the escorts will have no visibility. 5 U-boats are at the front of convoy and 1 at the rear. 36 hrs to air cover.One U-boat torpedoes an oil tanker and escapes Greyhound by using an underwater decoy, tricking the crew into wasting most of their remaining depth charges. Krause chooses to rescue survivors from the burning oil tanker rather than go to the aid of the other ships first.\nThe attack commences from the front pack that evening with five merchant ships being torpedoed and sunk. There is respite in the morning. Ernest takes a call to abandon the Zig-Zag route and take a direct course, which will put them in range for air cover in 24 hrs.The next day, the wolf pack targets Greyhound. The captain of the lead submarine (Thomas Kretschmann) taunts the convoy and its escorts via radio transmission. Krause learns that Greyhound is down to just six depth charges. The U-boats launch multiple torpedo runs, which Greyhound is barely able to evade. Greyhound and Dicky combine to sink one of the U-boats in an exchange of surface broadsides. Dicky receives minor damage due to the close range of the engagement and Greyhound is hit on the port side by one of the U-boat's deck guns, which kills Krause's mess attendant, George Cleveland, and two sailors.\nDuring the funeral service, Eagle is attacked and eventually sinks. The night arrives, 14 hrs to air cover. Krause, aware that doing so might expose the shoddy state of the escort fleet, elects to break radio silence by transmitting a single word, \"help\", to the Admiralty. They are given a modified rendezvous point, which is only 4 hrs away, and they will have air cover from them on.With the convoy close to reaching air cover (3 hrs to air cover), the remaining U-boats mount an all-out assault on the destroyers. After heavy fighting, Greyhound sinks the lead U-boat with a full broadside. Air support deployed from British RAF Coastal Command arrives and Greyhound fires to mark the last visible U-boat, allowing a PBY Catalina bomber to sink the sub. The rest of the pack quickly flees before they can be discovered.While assessing damage, Krause receives radio contact from the head of the relief escorts, HMS Diamond, that his relief has arrived and Greyhound is due for repair and refitting in Derry alongside his two surviving companion vessels. The crew receives a \"job well done\" on their four U-boat kills. While setting the new course, passengers and crew of the remaining convoy ships cheer to salute Greyhound's crew while Krause retires to his cabin to rest.",
	"links": [
		"https://www.amazon.com/Greyhound-Aaron-Schneider/dp/B0D973NGGT"
	]
}