{
	"title": "Wonka",
	"release_year": "2023",
	"runtime": "116",
	"tags": [
		"Adventure",
		"Comedy",
		"Family",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Timothée Chalamet",
		"Gustave Die",
		"Murray McArthur",
		"Paul G. Raymond",
		"Bertie Caplan",
		"Isy Suttie",
		"Kobna Holdbrook-Smith",
		"Matilda Tucker",
		"Tom Davis",
		"Olivia Colman"
	],
	"staff": [
		"Paul King",
		"Roald Dahl",
		"Paul King",
		"Simon Farnaby",
		"Alexandra Derbyshire",
		"David Heyman",
		"Luke Kelly",
		"Joby Talbot",
		"Chung-hoon Chung",
		"Mark Everson",
		"Nina Gold",
		"Nathan Crowley"
	],
	"links": [
		"https://www.amazon.com/Timoth%C3%A9e-Chalamet-Life-Superfans-Things-ebook/dp/B0DJH8LQ8M"
	],
	"votes": 157808,
	"cover": "https://m.media-amazon.com/images/M/MV5BZmViNTU0OWItZDg4ZS00MzNiLThjYjMtMmVjMjgwMGZjMjM2XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "During the late nineteenth century, young William \"Willy\" Wonka is an American amateur chef, magician, scientist, and traveler who loves chocolate and aspires to open his own candy store in the United Kingdom after the death of his mother. A ship sails towards land and a young Willy Wonka stands on top of a mast, singing a song and when the ship ports in dock, Willy continues singing, but gives away all but one of his silver coins, the last of which he drops down a drain. Willy then goes to look at a store he plans to buy. That evening, Willy gets everything out and plans to sleep on a park bench, until a dog called \"Tiddles\" comes and sniffs his leg and a man tells him to come and spend the night in his sanctuary.Once inside Scrubbit and Bleacher's sanctuary, Willy heads for the fireplace to warm up. Mrs. Scrubit then shows Willy a contract to sign, and a girl who works there called Noodle tells him to read the contract carefully, but Willy just instantly signs. Mrs. Scrubit then tells Noodle off and throws her in a coup. The next day, Willy heads back to the Gourmet store and tells the public about his new flying chocolates and a trio of Chocolatiers see this and call the police, before going out and tasting some. After negatively criticizing Willy, the three start floating around and the police arrive. Willy asks the Chief of police for some money for his rent and he hands him a silver coin. Unfortunately however, Willy didn't read the contract properly and that coin wouldn't be enough and Mrs. Scrubit tells Willy he will have to work off the rest of the debt. Willy then goes down the laundry Shute and meets a bunch of other people who suffered similar fates to him.That night, Noodle comes into Willy's room and tells him she has never tasted chocolate, so Willy makes her a chocolate treat, using his chocolate making machine and tells her the story of his childhood. His mother used to make great chocolate and they had planned to take over the store in the Gourmet store that Willy wanted, but she had died soon after and he had never found out her secret. Noodle takes a bite of the chocolate and enjoys it, but is saddened by the fact that she won't be able to have more, so Willy offers her a lifetime supply of chocolate and Noodle tells Willy one way they can escape. Meanwhile, underneath the cathedral, the Chief of police is meeting with the Chocolatiers and through a song, encourage him to eliminate the competition and get rid of Wonka, by offering him 1,000 boxes of chocolate and he agrees.The next morning, Willy and Noodle attempt to get Scrubit and Bleacher to fall in love and Willy goes back down the Shute, and reveals an invention, which will do everyone's work for them and he and Noodle escape. Now on the streets, Willy tells Noodle about a \"little orange man with green hair\" who keeps stealing his chocolates, but Noodle doesn't believe him. Then Willy says that he needs to make more chocolate and he needs the milk from a giraffe to make it. At the zoo, they knock out the security guard by giving him a chocolate that goes through all sorts of alcoholic beverages and the two sneak in. Once inside the zoo, it is revealed that Willy cannot read as he opens the door to the tiger instead of the giraffe. Noodle opens the door to the giraffe and whilst Willy milks the giraffe Noodle tells him that her name isn't really Noodle, only assumed to be, when Scrubit found her in a basket, with an \"N\" on her necklace. On the way out of the zoo, Willy grabs hold of some balloons and floats to the roof of the Gourmet store, where he and Noodle sing and dance, but the police see them. The Chief of police has a conversation with Willy and the two sneak back into the workshop.One of them tells the story of how the Trio have been in cahoots for a long time and he used to work for one (Slugworth), but got fired for snooping around and Willy tells them he is a chocolate maker and his dream of owning the store. That night, Willy passes Noodle her chocolates and the gang have a conversation and agree to help Willy with his dream.The following day, Willy tries out all sorts of new delicious confectionery on the members of the public and the police follow him on bicycles. Eventually, the Chief of police finds a chocolate wrapper and figures out that he has been escaping through the drains in the road. That night, the Chief of police asks the Chocolatiers for more chocolate and they agree. Meanwhile in Willy's room, the little orange man comes back, but gets caught in a trap Willy had set and wakes him up. The man tells Willy that he is an Oompa Loompa named Lofty and he is disappointed at Willy for stealing cacao beans from Loompaland Land and that he will not go away until he has all the chocolate he requires, before hitting Willy with a frying pan and escaping with the chocolate.The next day, the friends showed Willy the keys to the store and open it up. At first it was a bit of a dump, but they soon got it all up to scratch. The grand opening went really well, until it is revealed that someone had sabotaged the treats and the customers all riot, burning down the store. The others leave Willy alone in the rubble and the three Chocolatiers arrive with a brief case full of money, which they will give to his friends, if he leaves town for good and Willy agrees. Later that evening, Willy arrives at the docks, shakes Slugworth's hand and sets sail. Also on board was the Oompa Loompa and he tells Willy he won't leave him alone until he gets the chocolate and Willy notices an \"A\" mark on his hand and realises that Noodle is in great danger. Willy and the Oompa Loompa go to see the captain, but see dynamite strapped to the wheel instead. The duo jump off and the Chocolatiers just stand and laugh as the boat explodes. Slugworth then goes to give Scrubit the money.The next morning, Mrs Scrubit and Mr. Bleacher let everyone go with their money, but tells Noodle that her money was to keep her there and Mrs Scrubit grabs her and throws her in the coup again. Suddenly, Willy appears and tells Noodle that they are going to go and steal the ledger and break Noodle free from the coup. At the cathedral, Noodle is disguised as a nun and asks the father for some chocolate, but he refuses. Willy and a couple others go to the zoo, steal the giraffe and let it loose in the cathedral. The father phones the \"zoo\", which is Willy and his friends on the other side of the phone and tells them to get rid of it. They do so, just before the Baron's funeral. After hearing what had happened, Slugworth calls the father and rushes to the cathedral. Meanwhile, Willy and Noodle had entered underneath the cathedral and started searching for the book. Finally, Noodle opened a trap door in the wall and got out the book. Unfortunately, Slugworth and his companions got them and throw them in a giant chocolate mixer. Slugworth then tells them that the \"N\" is actually a \"Z\", which belonged to his brother \"Zebedee\" and told Noodle that he told her mother she would be in good hands, but instead, threw her down the laundry Shute and told her mother that she had died, before locking the door, taking Willys chocolates for the Oompa Loompa, eating them and leaving Willy and Noodle to drown in a river of chocolate. Noodle however, had a plan to let the chocolate lift them and they could bang on the glass. Unfortunately, no one would help them and the two went under.Fortunately, the Oompa Loompa came to the rescue and the duo got out with the book. The now oversized Chief of police got out of the car and is told that he as well as the Chocolatiers are under arrest. The Chocolatiers then start floating again and Willy reveals that the chocolate they had eaten were actually the flying chocolates from earlier on. Slugworth claims they'll be back before floating away.Willy then finally finds out his mother's secret that it is the people you share the chocolate with that matters, not the chocolate itself, after receiving a message from his mother's spirit. Willy shares a piece with everyone, before telling Noodle that her mother lives at the local library and the two get reacquainted. Willy shows the Oompa Loompa to an old castle, which he plans to make into a factory, with the Oompa Loompa becoming Chief chocolate taster.As the credits roll, Lofty the Oompa Loompa reveals what happened to everyone, including Scrubbit and Bleacher, who were under arrest, but tried to get out of it by eating the poisoned chocolates and the two have one last kiss."
}