{
	"title": "Angel Has Fallen",
	"release_year": "2019",
	"runtime": "121",
	"tags": [
		"Action",
		"Thriller",
		"amazon"
	],
	"rating": 6.4,
	"actors": [
		"Gerard Butler",
		"Frederick Schmidt",
		"Danny Huston",
		"Rocci Boy Williams",
		"Piper Perabo",
		"Harry Ditson",
		"Linda John-Pierre",
		"Lance Reddick",
		"Ori Pfeffer",
		"Morgan Freeman"
	],
	"staff": [
		"Ric Roman Waugh",
		"Robert Mark Kamen",
		"Matt Cook",
		"Ric Roman Waugh",
		"Creighton Rothenberger",
		"Gerard Butler",
		"Yariv Lerner",
		"Matthew O'Toole",
		"Alan Siegel",
		"David Buckley",
		"Jules O'Loughlin",
		"Gabriel Fleming",
		"Daniel Hubbard",
		"Russell De Rozario"
	],
	"votes": 112729,
	"cover": "https://m.media-amazon.com/images/M/MV5BZmY4YTJlZjktNmVkYi00MzBjLTg3MTAtMGZiNWUwY2NiMmM5XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Secret Service agent Mike Banning (Gerard Butler) undergoes training at a private military facility owned by his friend Wade Jennings (Danny Huston), a former fellow Army Ranger who is currently the CEO of the paramilitary company Salient Global, and is recommended for the position of Secret Service Director by the President of the United States, Allan Trumbull (Morgan Freeman), to replace retiring Director David Gentry (Lance Reddick). Banning hides the fact that he is suffering from migraines and insomnia with regular visits to several doctors, and begins taking medication to cope with recurring back pain.While the President is on a rural fishing trip, armed drones attack his protection detail, with only Banning surviving and saving the President; both are incapacitated, with Trumbull in a coma. FBI Agent Helen Thompson (Jada Pinkett Smith) finds substantial evidence that Banning may be responsible for the attack, with the van used to carry out the attack containing Banning's hair and DNA & $10 MM transferred into his accounts mysteriously from a state owned bank in Moscow. Banning is subsequently arrested.En route to a detention facility, Banning and his transport are ambushed. He escapes after killing the assailants, revealed to be agents who took part in his training exercise; Banning realizes that Jennings has betrayed and framed him. Banning calls his wife Leah (Piper Perabo), letting her know he is alive. The call alerts Thompson to Banning's location, leading to a car chase. However, Banning escapes again before heading to his father's home in the woods.With Trumbull still comatose, Vice President Martin Kirby (Tim Blake Nelson) is sworn in as Acting President. Via surveillance cameras, Banning and his father Clay (Nick Nolte) observe Jennings' men approaching the house; Clay detonates explosives around the perimeter, killing the would-be attackers as he and Banning escape, and Banning reveals to his father that he has a wife and daughter. Leah and her daughter are on the verge of being kidnapped by Jennings' men when Clay saves them. Kirby reveals to the press that Banning is responsible for the assassination attempt with support from the Russian government.Finding the bodies around Clay's cabin, Thompson deduces that Banning was set up. Trumbull awakens from his coma, and Kirby is revealed to be involved with Jennings. Kirby plans to retaliate for the President's \"attempted assassination\" by attacking Russia. Thompson and another agent meet Jennings, who kills them both.Banning reaches Trumbull's hospital and is captured, but Trumbull orders his release. Banning leads Trumbull to safety with help from Gentry and other loyal agents, as Jennings destroys the hospital's Intensive Care Unit by increasing the oxygen and nitrogen supply to unstable levels, causing an explosion.\nBanning hides Trumbull and Gentry as Jennings' men pursue them. After a long gun battle, Jennings attempts to escape via helicopter, which Banning destroys. They face off hand-to-hand, and Banning mortally stabs Jennings. Banning is exonerated while Trumbull and Gentry arrest Kirby for treason due to the evidence uncovered by Jennings to deploy as an insurance policy.Clay decides to live with Banning and his family. Feeling guilty over his failure to protect Trumbull, as well as his undisclosed ailments, Banning offers his resignation, but Trumbull forgives his mistakes and offers Banning the promotion to Director of the Secret Service, which he accepts.",
	"links": [
		"https://www.amazon.com/Angel-Has-Fallen-Gerard-Butler/dp/B07YGMMFZY"
	]
}