{
	"title": "The Post",
	"release_year": "2017",
	"runtime": "116",
	"tags": [
		"Biography",
		"Drama",
		"History",
		"amazon"
	],
	"rating": 7.2,
	"actors": [
		"Meryl Streep",
		"Tom Hanks",
		"Sarah Paulson",
		"Bob Odenkirk",
		"Tracy Letts",
		"Bradley Whitford",
		"Bruce Greenwood",
		"Matthew Rhys",
		"Alison Brie",
		"Carrie Coon"
	],
	"staff": [
		"Steven Spielberg",
		"Liz Hannah",
		"Josh Singer",
		"Kristie Macosko Krieger",
		"Amy Pascal",
		"Steven Spielberg",
		"John Williams",
		"Janusz Kaminski",
		"Sarah Broshar",
		"Michael Kahn",
		"Ellen Lewis",
		"Rick Carter"
	],
	"votes": 164219,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTczODAwMzk1NV5BMl5BanBnXkFtZTgwMDc5NzA1NDM@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "In 1966 Vietnam, State Dept. military analyst Daniel Ellsberg (Matthew Rhys) accompanies U.S. troops in combat, documenting the progress of U.S. military activities in the region for Secretary of Defense Robert McNamara (Bruce Greenwood). On the return flight home, McNamara expresses to Ellsberg and President Lyndon Johnson his view that the war in Vietnam is hopeless, yet upon landing, McNamara expresses his confidence in the war effort. Ellsberg overhears this and becomes disillusioned. Years later, now working for a civilian military contractor, the RAND Corporation, Ellsberg surreptitiously photocopies classified reports documenting the progress of the ongoing Vietnam War, dating back to the Truman administration. He then leaks these documents to reporters at The New York Times.Newspaper heiress Katharine Graham (Meryl Streep) tries to balance her social life with her responsibility as owner and publisher of The Washington Post following the demise of her husband and her father. She is conflicted over preparations for the newspaper's IPO, a move she recognizes as important for strengthening the paper. She lacks experience and is frequently \"overruled\" by more assertive men who advise or work for her, such as editor in chief Ben Bradlee (Tom Hanks) and board member Arthur Parsons (Bradley Whitford). Arthur wants Katharine to give up more seats on the board, clearly saying that the bankers will not value the IPO fully with a woman running the show. The IPO has a clause that the bankers can pull their funding one week from the IPO listing, in case of a true disaster.Bradlee tries in vain to catch up with The New York Times ability to scoop headline stories. Meanwhile, McNamara, Graham's longtime friend, confides to her that he is about to be the subject of unflattering coverage by the Times. This turns out to be an expose of the government's long-running deception of the American public. However, the series is halted by a court injunction against further publication by the Times. Ben wants Katharine to ask McNamara to hand over a copy of the original study on the Vietnam war (which is the source of the expose on the Times). Ben theorizes that McNamara confided in Katharine as he wants her (as the owner of a national newspaper) to bail him out. Katharine refuses to ask McNamara, but later the same day an anonymous person drops off parts of the report at the office of the Post.The IPO is set for the next day. Katharine finds out about the lawsuit on the Times by the US attorney general. She calls Ben and Ben doesn't tell her that he already has a copy of the report and that his staff is working on a story. The next day Katharine rings the opening bell at the NYSE and the stock lists. The 1-week deadline starts.Post assistant editor Ben Bagdikian (Bob Odenkirk) tracks down Ellsberg as the source for the leak, who provides Bagdikian with copies of the same material given to the Times. A hand-picked team of Post reporters sort through the piles of papers looking for the headline stories. The Post's lawyers advise against publishing the material, lest the Nixon administration bring criminal charges against them. Graham conducts interviews with McNamara, Bradlee, and trusted Post chairman Fritz Beebe (Tracy Letts), agonizing over the decision of whether to publish. If the legal fallout goes badly, she could destroy the newspaper she sees as a family legacy (the banker pull-put clause in the IPO could be a killer). However, if it wins any legal challenge, she could instead establish the Post as an important journalistic institution. She chooses to run the story.The decision reaches another crucial juncture when the legal team find that the Post source could be the same as the source of the Times, which mean Katharine could be held in contempt of court and could be sent to jail. The board put pressure on Katharine by indicating that bankers might pull financing on the IPO and Ben re-iterates that the employees want this story to be published and the desire to uphold the freedom of speech. For Katharine, the decision is huge as she was thrust into this role by accident and now the fate of the entire paper depends on her. She finds courage to back her decision and gives the go ahead to print.The White House retaliates, and in short order the Post and Times are together before the Supreme Court to plead their First Amendment argument for the freedom to publish the material. Meanwhile, newspapers across the country pick up the story in solidarity with the Post and Times. The court rules 6-3 in the newspapers' favor, vindicating Graham's decision. Nixon demands that the Post be barred from the White House. Soon after, a security guard discovers a break-in in progress at the Watergate office complex.",
	"links": [
		"https://www.amazon.com/Post-4K-UHD-Meryl-Streep/dp/B08GSPGR8P"
	]
}