{
	"title": "Vice",
	"release_year": "2018",
	"runtime": "132",
	"tags": [
		"Biography",
		"Comedy",
		"Drama",
		"amazon"
	],
	"rating": 7.2,
	"actors": [
		"Christian Bale",
		"Amy Adams",
		"Steve Carell",
		"Sam Rockwell",
		"Alison Pill",
		"Eddie Marsan",
		"Justin Kirk",
		"LisaGay Hamilton",
		"Jesse Plemons",
		"Bill Camp"
	],
	"staff": [
		"Adam McKay",
		"Adam McKay",
		"Will Ferrell",
		"Dede Gardner",
		"Jeremy Kleiner",
		"Adam McKay",
		"Nicholas Britell",
		"Greig Fraser",
		"Hank Corwin",
		"Kathy Driscoll",
		"Francine Maisler",
		"Patrice Vermette"
	],
	"cover": "https://m.media-amazon.com/images/M/MV5BMTY1NjM0MzgxMV5BMl5BanBnXkFtZTgwNDc4NTY0NjM@._V1_QL75_UX190_CR0,8,190,281_.jpg",
	"links": [
		"https://www.amazon.com/Vice-Christian-Bale/dp/B07MD6QXHT"
	],
	"votes": 164646,
	"description": "Vice is narrated by Kurt (Jesse Plemons), a fictitious veteran of the Afghanistan and Iraq Wars. The film opens with Dick Cheney (Christian Bale) and other White House officials and staff responding to the September 11 attacks. The film then flashes back to Wyoming in 1963, where Cheney finds work as a lineman but struggles with alcoholism that led him to drop out of Yale (His girlfriend Lynne got him that scholarship at Yale). After Cheney is stopped by a traffic cop for driving while intoxicated, his wife Lynne Cheney (Amy Adams) convinces her husband to clean up his life (Lynne is smart and educated, but needs Dick in 1960's as back then women cant get successful without a man's help).The film flashes forward to 1969 when Cheney finds work as a White House intern during the Nixon Administration. Working under Nixon's economic advisor Donald Rumsfeld (Steve Carell), Cheney becomes a savvy political operative as he juggles commitments to Lynne and his two daughters Liz (Lily Rabe) and Mary Cheney (Alison Pill). Cheney overhears Henry Kissinger (Kirk Bovill) discussing the secret bombing of Cambodia with President Richard Nixon, revealing the true power of the executive branch to Cheney. Rumsfeld's abrasive attitude leads to him (Nixon sends Rumsfeld to Brussels as Permanent Ambassador to NATO) and Cheney being distanced from Nixon, which works in both men's favor; after Nixon's resignation, Cheney rises to the position of White House Chief of Staff for President Gerald Ford while Rumsfeld becomes Secretary of Defense.After Ford is voted out of office, Cheney runs to be representative for Wyoming. After giving an awkward and non charismatic campaign speech, Cheney suffers his first heart attack. While he recovers, Lynne campaigns on her husband's behalf, helping him to win a seat in the U.S. House of Representatives. During the Reagan Administration, Cheney supports a raft of conservative, pro-business policies favoring the fossil fuel industries. Cheney next serves as Secretary of Defense under President George H. W. Bush during the Gulf War. Outside of politics, Cheney and Lynne come to terms with their younger daughter Mary coming out as gay. Though Cheney develops ambitions to run for president, he decides to retire from public life to spare Mary from media scrutiny.During the presidency of Bill Clinton, Cheney becomes the CEO of Halliburton while his wife Lynne raises golden retrievers and writes books. A false epilogue claims that Cheney lived the rest of his life healthy and happy in the private sector and the credits roll, only for the film to continue.Cheney is invited to become running mate to George W. Bush (Sam Rockwell) during the 2000 United States presidential election. Recognizing that the younger Bush is more interested in pleasing his father than attaining power for himself, Cheney agrees on the condition that Bush delegates \"mundane\" executive responsibilities like energy and foreign policy to him. As Vice President, Cheney works with Secretary of Defense Rumsfeld, legal counsel David Addington (Don McManus), and Chief of Staff Scooter Libby (Justin Kirk) to exercise control of key foreign policy and defense decisions throughout Washington.As VP, Cheney still manages to have regular meetings with energy CEOs' with plans to acquire Iraqi oilfields should they become available.The film returns to the aftermath of the September 11 attacks, as Cheney and Rumsfeld maneuver to initiate and then preside over the US invasions of Afghanistan and Iraq, resulting in the killing of civilians and the torture of prisoners. As the War on Terror mounts, Cheney continues to struggle with persistent heart attacks. The film also covers various events from his vice presidency, including his endorsement of the Unitary executive theory, the Plame affair, the accidental shooting of Harry Whittington, and tensions between the Cheney sisters over same-sex marriage. Cheney's actions are shown to lead to thousands of deaths and the rise of the Islamic State of Iraq and the Levant, resulting in him receiving record-low approval ratings by the end of the Bush administration.While narrating Cheney's tearful deathbed goodbye to his family after another hospitalization, Kurt is killed in a motor accident while jogging. In March 2012, his healthy heart is transplanted into Cheney. A few months later, Cheney permits Liz to take a public stand against same-sex marriage as she runs for a Senate seat in Wyoming. She later wins election to her father's former Congressional position, leading to the fragmenting of the Cheney family. At the end of the film, an irate Cheney breaks the fourth wall and delivers a monologue to the audience, stating that he has no regrets about anything he has done in his career. A mid-credits scene depicts a focus group descending into chaos when a right-winger slams the film itself as biased and wrestles with a liberal panelist, while two younger panelists discuss the next Fast and Furious movie."
}