{
	"title": "Spider-Man: Far from Home",
	"release_year": "2019",
	"runtime": "129",
	"tags": [
		"Action",
		"Adventure",
		"Comedy",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Tom Holland",
		"Tom Holland",
		"Samuel L. Jackson",
		"Jake Gyllenhaal",
		"Jake Gyllenhaal",
		"Marisa Tomei",
		"Jon Favreau",
		"Zendaya",
		"Jacob Batalon",
		"Tony Revolori",
		"Angourie Rice",
		"Remy Hii"
	],
	"staff": [
		"Jon Watts",
		"Chris McKenna",
		"Erik Sommers",
		"Stan Lee",
		"Steve Ditko",
		"Kevin Feige",
		"Amy Pascal",
		"Michael Giacchino",
		"Matthew J. Lloyd",
		"Leigh Folsom Boyd",
		"Dan Lebental",
		"Sarah Finn",
		"Claude Paré"
	],
	"votes": 571063,
	"cover": "https://m.media-amazon.com/images/M/MV5BMzNhNTE0NWQtN2E1Ny00NjcwLTg1YTctMGY1NmMwODJmY2NmXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In Ixtenco, Mexico, Nick Fury (Samuel L. Jackson) and Maria Hill (Cobie Smulders) investigate an unnatural storm and encounter the Earth Elemental. A super-powered man, Quentin Beck / Mysterio (Jake Gyllenhaal) (A master of trickery and illusion who claims to be a superhero from Earth-833 in the Multiverse), arrives to fight the creature. In New York City, the Midtown School of Science and Technology restarts its academic year to accommodate the students who were among those resurrected in \"the Blip\" eight months prior.\nPeople who Blipped came back the same age, while everyone else aged 5 years in the meantime.The school organizes a two-week summer field trip to Europe for the academic decathlon team, where Peter Parker (Tom Holland), still distraught over Tony Stark's death, plans to confess his growing feelings for classmate MJ (Zendaya) and avoid heroics. Peter's best friend Ned (Jacob Batalon) tells Peter to avoid saying anything to MJ during the trip, since they have the chance to be bachelors in Europe.\nAt a fundraiser for the homeless coordinated by his Aunt May (Marisa Tomei), Parker is forewarned by Happy Hogan (Jon Favreau) (The head of security for Stark Industries and former driver and bodyguard of Tony Stark who looks after Parker) that he will be contacted by Fury, but Parker chooses to ignore the call. Parker leaves after being overwhelmed by questions about Stark.\nEven on the plane over to Europe, Peter tries to sit next to MJ, but his plan backfires when his teacher and class chaperon Roger (Martin Starr) takes charge of the seating arrangements on the plane and unknowingly scuttles Peter's plans. Julius (J. B. Smoove) is the other teacher on the trip. Ned spends the flight next to Betty (Angourie Rice), MJ's friend. While MJ sits with Brad (Remy Hii) a popular student whom Parker sees as competition for MJ's affection. Eugene (Tony Revolori) is Peter's rival for the academic decathlon.Parker and his friends travel to Venice, where the Water Elemental strikes and proceeds to wreak havoc on the city. Beck arrives and destroys the creature. Parker only helps in containing the damage by stopping the buildings from falling on top of people.\nParker is saving a Black Dahlia pendant to give to MJ on top of the Eifel tower in Paris, as the moment when he wants to confess his feelings to her.\nFury meets with Parker and gives him Stark's glasses, which were meant for his successor. The glasses are equipped with the artificial intelligence E.D.I.T.H. (Even Dead, I'm The Hero), which has access to all databases of Stark Industries and commands a large orbital weapons supply.\nFury takes Peter to an underground HQ where he introduces Peter to Beck and Hill. Beck says that 4 Elementals (Earth, Water, Fire and Air) were formed from fundamental elements inside black holes.\nBeck claims the Elementals killed his family and his planet, and that he hails from a different reality, one among many in the Multiverse.Parker rejects Fury's call to arms, opting to rejoin his class. Peter argues that Aunt May will not be happy if Peter leaves his class tour, and his friends will discover his secret identity if he is missing from his class and seen on TV fighting an alien entity as Spiderman.\nFury covertly redirects the school trip's itinerary to Prague, where the Fire Elemental is projected to strike. Fury is not convinced that Peter has the maturity to handle responsibility when he uses EDITH to stop Brad from squealing on him to MJ. Even Peter has doubts about himself and what he wants to be. Beck tries to bond with Peter and to embrace his superhero identity.\nTo keep his friends safe, Peter arranges for free Opera tickets to be delivered to the group. But MJ sees Peter going out of the Opera and follows him, who is followed by Ned and Betty.\nThe Fire Elemental appears at a carnival, but Beck, with Parker's help, destroys it. Peter helps save Ned and Betty from being killed. Peter was wearing a new black suit provided by Fury and hence was not identifiable as Spider-Man.Fury and Hill invite Parker and Beck to Berlin to discuss the formation of a new superhero team. Parker considers Beck worthy of being Stark's successor and bequeaths him the E.D.I.T.H. glasses. Peter believes that Tony wanted him to find the next person worthy enough for the glasses, and Peter believes it is Beck. Peter says that he just wants to go back to his normal life.Unbeknownst to him, Beck is revealed to be a former holographic-illusions specialist at Stark Industries who was fired for his unstable nature. He now leads a team of disgruntled ex-Stark employees, using advanced projector drones to simulate the Elemental attacks and masquerade as a hero.MJ deduces Parker is Spider-Man. They discover that a piece of debris she retrieved during the carnival battle is a projector that presents a simulation of the Air Elemental, leading the two to realize Beck is a fraud.\nParker travels to Berlin and meets with Fury, only to realize that the version before him is an illusion created by Beck. He battles multiple illusions before Fury apparently subdues Beck. Fury forces Parker to reveal anyone he told of Beck's deception (which included MJ and Ned) before being revealed as another illusion; ultimately hit by a train, Parker survives, albeit badly injured, and falls unconscious in a train car.Awakening in a jail cell in the Netherlands, he breaks out and contacts Hogan, who flies Parker to London and reveals a suit-manufacturing machine left behind by Stark, which Parker uses to synthesize a customized costume.\nIn London, Beck uses E.D.I.T.H. (and the weapons laden drones retrieved from orbit) to orchestrate his biggest illusion yet, a fusion of all four Elementals, using it as cover to kill MJ and any others to whom she might have revealed his secret. Parker breaks through the illusion, regains control of E.D.I.T.H., and defeats Beck, who dies by a misfired drone gunshot.\nParker returns to New York City and begins a relationship with MJ.In a mid-credits scene, reporter J. Jonah Jameson (J. K. Simmons) of TheDailyBugle blames Spider-Man for the Elementals' attacks, broadcasting doctored footage of the incident recorded by Beck, who incriminates Parker for his death and then reveals Parker's secret identity.In a post-credits scene, the Skrulls Talos and Soren are revealed to have been masquerading as Fury and Hill respectively the whole time, as directed by the real Fury, who commands a Skrull spaceship.",
	"links": [
		"https://www.amazon.com/Spider-Man-Far-Home-Tom-Holland/dp/B07TKZQFJC"
	]
}