{
	"title": "Creed II",
	"release_year": "2018",
	"runtime": "130",
	"tags": [
		"Action",
		"Drama",
		"Sport"
	],
	"rating": 7.1,
	"actors": [
		"Michael B. Jordan",
		"Sylvester Stallone",
		"Tessa Thompson",
		"Phylicia Rashad",
		"Dolph Lundgren",
		"Florian Munteanu",
		"Russell Hornsby",
		"Wood Harris",
		"Milo Ventimiglia",
		"Robbie Johns"
	],
	"staff": [
		"Steven Caple Jr.",
		"Juel Taylor",
		"Sylvester Stallone",
		"Sascha Penn",
		"Cheo Hodari Coker",
		"William Chartoff",
		"Sylvester Stallone",
		"Kevin King Templeton",
		"Charles Winkler",
		"Ludwig Göransson",
		"Kramer Morgenthau",
		"Dana E. Glauberman",
		"Saira Haider",
		"Paul Harb",
		"Lindsay Graham",
		"Mary Vernieu",
		"Franco-Giacomo Carbone"
	],
	"votes": 158013,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTBmYTg3YTItZjUzYi00MGU2LThiNDUtMDA3NjNmMTFiYzZkXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Three years after his loss to \"Pretty\" Ricky Conlan, Adonis Creed (Michael B. Jordan) scores a string of victories, culminating in a victory over Danny \"Stuntman\" Wheeler (Andre Ward) to win the WBC World Heavyweight Championship. Now a worldwide star, Adonis proposes to his girlfriend, Bianca Taylor (Tessa Thompson), who agrees to marry him. When Bianca suggests starting a new life together in Los Angeles, Adonis is reluctant to leave his life in Philadelphia behind.Meanwhile, Ivan Drago (Dolph Lundgren), a former Soviet boxer who killed Adonis' father, Apollo Creed, in the ring thirty-three years earlier, sees an opportunity to regain the glory that was taken from him as a result of his loss to Rocky Balboa in Moscow later that same year by pitting his son, Viktor Drago (Florian \"Big Nasty\" Munteanu) (with the assistance of Buddy Marcelle (Russell Hornsby), a promoter who has followed Viktor's career closely), against Adonis. When Rocky (Sylvester Stallone) refuses to support Adonis's decision to accept Viktor's challenge, Adonis, feeling betrayed, decides to leave for Los Angeles.Adonis and Bianca settle down in a luxurious apartment in Los Angeles close to Adonis's adoptive mother, and Apollo's widow, Mary Anne (Phylicia Rashad). As Adonis and Bianca adjust to their new life on the West Coast and prepare for the upcoming match with Viktor, Bianca learns that she is pregnant. Adonis recruits Tony \"Little Duke\" Evers (Wood Harris), son of his father's trainer and later Rocky's trainer as Mickey's replacement. Overwhelmed with all the recent developments in his life, Adonis rushes into the match, getting himself badly injured. Viktor is disqualified for hitting Adonis while he is down allowing Adonis to retain the World Heavyweight Championship. Viktor becomes extremely popular in Russia and wins a series of fights given top billing.His body and ego shattered, Adonis becomes increasingly disconnected from Bianca. Mary Anne reaches out to Rocky in hopes of having him come to help Adonis out of his slump; Rocky arrives, he and Adonis make up, and Rocky agrees to train Adonis (with Little Duke) properly for a rematch against Viktor, who is suffering near-torturous levels of physical tests by his father. Bianca gives birth to a baby girl, and they name her Amara. Adonis and Bianca's fears are realized when their child is born deaf, inherited from her mother's progressive degenerative hearing disorder.While Viktor continues to taunt Adonis publicly, he is constantly pressured by his father to regain their honor. Ivan appears to be enjoying the attentions of the media and various Russian delegates, with which Viktor appears uncomfortable. At a State Dinner, he and Ivan meet Ludmilla (Brigitte Nielsen), his mother, and Ivan's ex-wife, for the first time in several years after she abandoned both of them after the loss to Rocky. Viktor is immediately enraged at the sight of his mother and chastises Ivan for his interactions with the people who outcast them. Back in America, Rocky and Little Duke take Adonis to a decrepit location in the California desert to retrain, describing it as a place where fighters are reborn. Adonis undergoes a rigorous and brutal training regimen with Rocky and Little Duke, focusing on fighting from the inside and training his body to repeatedly absorb the heavy impact he knows he will receive from Viktor in the ring.The rematch in Moscow is considerably more balanced as a more controlled and focused Adonis exchanges equal blows with Viktor. Since Viktor is accustomed to winning all of his fights by knockout, his fights have never lasted beyond the fourth round, something that Adonis uses to his advantage as he endures Viktor's punishment deeper into the match, even after his ribs break again. In the tenth round after being knocked down again, Adonis unleashes a furious rage, managing to land sequence after sequence of effective blows, knocking Viktor down twice. Ludmilla, who had been sitting ringside with some of Viktor's supporters, departs when the tide of the fight shifts in Adonis' favor, knocking Viktor off-balance emotionally.Ivan notes this as well, coming to terms with Viktor's earlier statements on the fair-weathered nature of the same supporters who had run Ivan out of Russia. With Viktor cornered and receiving multiple strikes without defending himself, but unwilling to go down, Ivan throws in the towel, conceding the fight to Adonis to ensure his son isn't seriously injured or killed. Though Viktor is ashamed, Ivan assures Viktor it is okay that he lost, and embraces him. As Bianca enters the ring to celebrate with Adonis and Little Duke, Rocky rescues himself from joining them, telling Adonis \"it's your time\", and takes a seat to watch them from outside the ring.Viktor and Ivan are later training together back in Ukraine. Rocky travels to Vancouver to make peace with his own estranged son, Robert (Milo Ventimiglia), and meets his grandson Logan for the first time, noting how much he looks like Adrian. Adonis visits Apollo's grave where he makes peace with his deceased father and the burden of carrying on his legacy, as he and Bianca introduce him to his granddaughter, who is sporting a new hearing aid.",
	"links": []
}