{
	"title": "The Ballad of Buster Scruggs",
	"release_year": "2018",
	"runtime": "133",
	"tags": [
		"Comedy",
		"Drama",
		"Musical",
		"amazon",
		"netflix"
	],
	"rating": 7.2,
	"actors": [
		"Tim Blake Nelson",
		"Willie Watson",
		"Clancy Brown",
		"Danny McCarthy",
		"David Krumholtz",
		"Thomas Wingate",
		"Tim DeZarn",
		"E.E. Bell",
		"Alejandro Patiño",
		"Tom Proctor"
	],
	"staff": [
		"Ethan Coen",
		"Joel Coen",
		"Joel Coen",
		"Ethan Coen",
		"Jack London",
		"Stewart Edward White",
		"Ethan Coen",
		"Joel Coen",
		"Megan Ellison",
		"Robert Graf",
		"Carter Burwell",
		"Bruno Delbonnel",
		"Ethan Coen",
		"Joel Coen",
		"Ellen Chenoweth",
		"Jess Gonchor"
	],
	"votes": 171064,
	"cover": "https://m.media-amazon.com/images/M/MV5BOTc0MzZjYTktYzBlZC00MmViLTgyNDYtNjljNTcxMzdjODRkXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "\"The Ballad of Buster Scruggs\"Buster Scruggs (Tim Blake Nelson), a cheerful singing cowboy, arrives at an isolated cantina full of outlaws where he exchanges insults with another patron before effortlessly shooting everyone as they reach for their guns. He then heads to town and enters a saloon, leaving his guns at the door to comply with its no firearms policy. He joins a game of poker that a player has suddenly left, but discovers the player vacated the seat after being dealt the infamous dead man's hand, which the other players insist Buster play now that he has seen the cards. When Buster refuses, a large menacing player named Joe (Clancy Brown) stands and draws a concealed pistol. After failing to persuade Joe to end the confrontation, Buster repeatedly kicks a plank in the poker table, which tips Joe's gun hand so that his pistol points backwards and discharges into his face. Having shot himself three times, Joe falls dead.Buster breaks into a boisterous song about \"Surly Joe,\" much to the patrons' delight. Joe's brother arrives in dismay and challenges Buster to a gunfight in the street. Buster gladly obliges and proceeds to shoot off each of the fingers of his right hand before finishing him off with the sixth shot.Another young singing cowboy clad in black then rides into town and politely challenges Buster. Buster again happily obliges, but much to his surprise, the young man (Willie Watson) is an even faster draw and shoots him through his forehead. Buster examines the wound in disbelief before collapsing, admitting via voice-over that he should have foreseen that \"you can't be top dog forever.\" The young man and Buster then sing a bittersweet duet as Buster's spirit rises from his body and floats towards heaven, complete with angel wings and a lyre, and expressing hope of a place above where people are better than they are on Earth.\"Near Algodones\"A young cowboy (James Franco) robs an isolated bank on the prairie. As he is fleeing the jabbering bank teller shoots at him, forcing him to take cover behind a well. He returns fire, but the teller (Stephen Root) charges him while wearing a washboard and several pots and pans as armor, which deflect all the cowboy's bullets as the teller repeatedly cackles \"Pan shot!\" The teller knocks the cowboy out with his rifle butt, and when the cowboy regains consciousness, he is sitting upon his horse under a tree with his hands tied and a noose around his neck. The lawman (Ralph Ineson) and posse who captured him ask for his final words, since they \"convicted\" him and sentenced him to death while he was semi-conscious.The execution is interrupted by ambushing Comanche warriors who quickly slaughter the lawman and posse but leave the cowboy in place upon the horse. After a time, a drover (Jesse Luken) happens by and frees the cowboy, who then joins him on his drive. However, the drover is actually a rustler, and they are promptly chased down by another lawman's posse. The posse captures the cowboy and takes him into town, where the sheriff summarily orders him to hang. As the cowboy stands upon the gallows with three other men awaiting execution, he spots a beautiful young woman in the crowd and mutters, \"There's a pretty girl,\" before the hangman abruptly hoods him and pulls the trapdoor lever to cheers and applause.\"Meal Ticket\"An aging impresario (Liam Neeson) and his artist Harrison (Harry Melling), a young man with no arms or legs, travel from town to town in a wagon that converts into a small stage where Harrison theatrically recites classics such as Shelley's poem \"Ozymandias\"; the biblical story of Cain and Abel; works by Shakespeare, in particular Sonnet 29; and Abraham Lincoln's Gettysburg Address.The impresario collects money from the audience at the end of each performance, with profits dwindling as they visit increasingly remote mountain towns with smaller and more indifferent audiences. Following a performance that yields no profit, the impresario observes a man nearby drawing a crowd with a chicken that can ostensibly perform basic math by pecking at painted numbers to answer addition and subtraction equations that the audience calls out. After buying the chicken, the impresario drives the wagon through a mountain pass and stops by a bridge over a rushing river. He walks to the center of the bridge and drops a large stone to gauge the water's depth before returning to the wagon wearing a faint smile. In the final scene, the impresario has resumed driving the wagon, with the caged chicken as his only passenger.\"All Gold Canyon\"A grizzled prospector (Tom Waits) arrives in a pristine mountain valley and decides to dig for gold in a grassy meadow beside a river. Over the course of several days, he pans through shovelfuls of dirt to count the gold specks, and then begins digging a deeper hole once he has identified the likely source of the gold. After his first night camping at the site, he spots a great horned owl tending its treetop nest at the edge of the valley. When he climbs up and reaches the nest, the mother owl's watchful gaze from a nearby tree causes him to replace three of the four eggs he has taken for his meal.On his third day, he digs out gold nuggets of increasing size before finally reaching \"Mr. Pocket\", a large gold vein running through the quartz he has uncovered. But no sooner has he made his discovery than a shadow falls over him; a young man (Sam Dillon) who has been trailing the prospector and letting him do all the work has sneaked up to the edge of the hole. He shoots the prospector in the back and the prospector falls face down. When the young man jumps into the hole to steal the gold, the prospector, who has been feigning death, wrestles the young man's gun away, and kills him with it. The prospector then cleans and assesses his wound in the stream, confirming it is not lethal. He finishes mining the gold, pushes the young man's body back into the hole to serve as his grave, and departs the valley.\n\"The Gal Who Got Rattled\"Alice Longabaugh (Zoe Kazan) and her older brother Gilbert (Jefferson Mays), an inept businessman, are journeying in a wagon train across the prairie towards Oregon, where Gilbert claims a new business partner will marry his sister. Gilbert dies of cholera shortly after they embark, and the wagon train's leaders, Mr. Billy Knapp (Bill Heck) and Mr. Arthur (Grainger Hines), help Alice bury her brother. Though she has no definite prospects in Oregon, Alice decides to continue the trip rather than return east. Matt (Ethan Dubin), the young man Gilbert hired to lead their wagon, claims that Gilbert promised him $400, half of which he expects when they reach the halfway point at Fort Laramie, otherwise he will return home. Fearing Gilbert's money was buried with him, Alice conveys her predicament to Billy, who offers his support in contemplating how to proceed. He also does Alice the favor of first attempting to shoot Gilbert's small dog, President Pierce (named after Franklin Pierce), then scaring him off, because the dog's constant barking has drawn widespread complaint.Through the course of their conversations, Billy grows fond of Alice, and proposes to solve her dilemma by marrying her in Fort Laramie, assuming Gilbert's debt to Matt, and retiring from leading wagon trains to build a home and family with her upon the 640 acres in Oregon which he can claim according to the Homestead Act. Alice is surprised by Billy's proposal, but she has grown fond of him, so she accepts. Billy then informs Mr. Arthur that this will be their last ride together.The following morning, Mr. Arthur notices Alice missing, and rides over the hills to find her reunited with President Pierce and laughing as the dog barks at the antics of some prairie dogs. Mr. Arthur then spots an Indian sentinel and advancing war party and gives Alice a pistol so that if he is killed, she can shoot herself and avoid capture. Mr. Arthur twice drives back the charging warriors with his rifle, but a remaining warrior momentarily appears to kill him. He kills the Indian, then realizes that when he appeared to have died, Alice shot herself as he had instructed. Mr. Arthur sadly walks back to the wagon train with President Pierce, unsure of what to say to Billy Knapp.\"The Mortal Remains\"At sunset, five people, an Englishman (Thigpen (Jonjo O'Neill)), an Irishman (Clarence (Brendan Gleeson)), a Frenchman (René (Saul Rubinek)), a lady (Mrs. Betjeman (Tyne Daly)), and a fur trapper (Chelcie Ross) ride to Fort Morgan, Colorado in a stagecoach. Thigpen says that he and Clarence often travel this route \"ferrying cargo\", alluding to a corpse on the roof, but he does not specify the nature of their business.\nThe Trapper rambles about his past relationship with a Native woman in which neither knew the other's language but communicating through understanding each other's emotions led him to conclude that people are all alike in their basic needs, just like the animals he traps.Mrs. Betjeman, a devout Christian, indignantly rebuts that there are only two kinds of people, upright and sinning, and explains that she knows this because her husband, whom she is traveling to meet after having been apart for three years, is a retired Chautauqua lecturer on \"moral and spiritual hygiene.\" René challenges her dichotomy and the trapper's oversimplification with reflections on the unique and subjective nature of human experiences. As an example, René questions whether Mr. Betjeman conceives of love the same way Mrs. Betjeman does, conjecturing that if he does not, perhaps he has not remained faithful to her during their separation.Mrs. Betjamen becomes apoplectic, and René calls out the window for the coach to be stopped, but the driver does not halt. Thigpen explains that the driver's policy is not to stop for any reason. Clarence sings the bittersweet folk song \"The Unfortunate Lad\", which calms Mrs. Betjamen. He and Thigpen then reveal themselves to be \"reapers\" or bounty hunters. Thigpen tells the group that their usual method is for him to distract their targets with stories while Clarence \"thumps\" them. Thigpen remarks that he enjoys watching their prey die, especially the expression in their eyes as they \"negotiate the passage\" and \"try to make sense of it.\"The other three are visibly unsettled by this as they arrive at the foreboding hotel in Fort Morgan where they will all be staying. They remain in the stagecoach while Thigpen and Clarence carry the corpse into the hotel. They then slowly dismount, and the coach departs without any luggage being unloaded. René, Mrs. Betjeman, and the trapper then warily make their own way through the hotel's front door.",
	"links": [
		"https://www.amazon.com/Brother-Where-Art-Thou/dp/B00HMD8D8Y",
		"https://www.netflix.com/title/80200267"
	]
}