{
	"title": "Terminator: Dark Fate",
	"release_year": "2019",
	"runtime": "128",
	"tags": [
		"Action",
		"Adventure",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.2,
	"actors": [
		"Linda Hamilton",
		"Arnold Schwarzenegger",
		"Arnold Schwarzenegger",
		"Mackenzie Davis",
		"Natalia Reyes",
		"Gabriel Luna",
		"Gabriel Luna",
		"Diego Boneta",
		"Ferran Fernández",
		"Tristán Ulloa",
		"Tomás Álvarez",
		"Tomás Álvarez",
		"Tom Hopper"
	],
	"staff": [
		"Tim Miller",
		"David S. Goyer",
		"Justin Rhodes",
		"Billy Ray",
		"James Cameron",
		"James Cameron",
		"David Ellison",
		"Tom Holkenborg",
		"Ken Seng",
		"Julian Clarke",
		"Mindy Marin",
		"Lucinda Syson",
		"Tonucha Vidal",
		"Sean Haworth",
		"Sonja Klaus"
	],
	"votes": 196448,
	"cover": "https://m.media-amazon.com/images/M/MV5BOTU2OGFhYjktNDJhMC00NmU5LWE1OWItNzg5ODU1MzdmNTZkXkEyXkFqcGc@._V1_QL75_UX190_CR0,8,190,281_.jpg",
	"description": "In 1998, three years after averting the threat of Skynet, Sarah (Linda Hamilton) (the former future leader of the Human Resistance in the war against the machines (Skynet)). Now a battle-hardened senior woman and left alone after her son's death, Sarah hunts and kills Terminators to prevent Judgment Day and forestall the coming conflict. She later learns that despite of having destroyed the company Cyberdyne Systems, it only caused a setback to the US military's agenda on the development of autonomous weapon systems, results the creation of Skynet's successor Legion in the future. Due to her previous encounters with the machines, she is at odds with Carl and Grace.Being responsible for altering the future and after learning of Dani's destiny leading a new Resistance against Legion, she prepares her as she did John) and John Connor are enjoying life by a beach in Livingston, Guatemala, when they are suddenly attacked by a T-800 Terminator (Arnold Schwarzenegger) (an aging Terminator built by Skynet, and one of several sent back in time to kill John Connor. Having completed its mission, it gained autonomy and freed from Skynet, and integrated into human society, moving to Laredo, Texas, marrying a human, and raising a stepson. It later joins forces with Sarah and Grace to help protect Dani Ramos from Legion's Terminators. Though Sarah continues to hate Carl for her son's death, Grace and Dani respect and trust the old machine after learning its efforts to make amends to Sarah, and Dani befriends Carl after acknowledging its benevolence). Sent back through time by Skynet prior to its erasure, the Terminator murders John before disappearing.Twenty-two years later, an advanced Terminator, called Rev-9, is sent back in time to Mexico City, to murder Daniella \"Dani\" Ramos (Natalia Reyes) (a young woman who works for a Mexico City-based automobile industrial plant, Arius Motors, with her brother, Diego. Dani is being targeted for termination by the new advanced Terminator prototype Rev-9. Prior to the film's events, she and her brother are planning to emigrate legally to the United States in hope for a better life and opportunities, including the health-care their ailing father needs.\nAt some point in her childhood, Dani's mother abandoned her family and died after attempting to cross the border illegally. Sarah Connor initially believes that Dani, like herself, is the destined mother of the Resistance leader. Later, it is revealed that Dani is fated to take on a role akin to that of Sarah's deceased son John Connor, as the founding commander of the Resistance in the war against the machines of Legion, with Sarah as her mentor. Once she assumes her role as Resistance Commander, having survived the events that her younger self is going through, Dani has foreknowledge that Grace would meet Sarah Connor shortly after arriving in the past and instructs her to seek Skynet's T-800 for aid by tattooing its location's coordinates on her)while a Cybernetically enhanced soldier, Grace (Mackenzie Davis) (a soldier from the year 2042 taken in by Resistance commander Daniella Ramos as a teenager. Trained in military combat by Daniella, Grace was converted into a cyborg to save her life after she sustained fatal stab wounds following a security detail against a number of Rev-7s for the critically wounded commander.Augmented with Legion's technology, she has abilities equivalent to a Terminator during short periods of time and requiring constant medication and nourishment. Her augmentations give her the ability to sense Legion's machines when nearby (but not Skynet's due to the differences of their technologies). Daniella sends Grace to protect her younger self from Legion's new advanced Terminator prototype. She then learns about the initial time-line after meeting Sarah Connor and Skynet's surviving T-800 unit Carl. She and Sarah share a mutual distrust, due in parts because the latter sees her as a novice and being part-machine. Despite knowing that Carl is a Terminator and what he did to Sarah's son, she trusts him as a comrade and friend, mainly because of her fascination with his behavioral developments and awareness that he is not one of Legion's machines. She also briefs Sarah, Dani, and Carl about Legion), is sent to protect her.The Rev-9, disguised as Daniella's father, infiltrates the assembly plant where Dani and her brother Diego (Diego Boneta) work, but is thwarted by Grace, who escapes with the siblings. The Rev-9 (Gabriel Luna) (an advanced Terminator prototype that originated from Legion and was sent back in time to terminate Dani. Featuring a traditional solid Endoskeleton covered with a \"mimetic poly alloy\", the Rev-9 possesses the ability to separate these two components into two separate, fully autonomous units. In addition, the Rev-9 has the ability to exhibit intelligent behavior paralleling humans', including emotions, which enables it to outclass most of Skynet's Terminators in infiltration), revealing its ability to split itself into its Cybernetic Endoskeleton and shape-shifting liquid metal exterior, pursues them, killing Diego and cornering Grace and Dani. However, Sarah arrives and temporarily disables the Terminator with explosives.Dani, Grace, and Sarah retreat to a motel so Grace can recover. Sarah reveals that she found them because in the years since John's death, she has received encrypted messages detailing the locations of arriving Terminators; each ending with \"For John\". Grace notes that neither Skynet nor John exists in her time-line. Instead, humanity is threatened by an AI called Legion, developed by the SAC-NORAD for Cyberwarfare. Legion took control of servers worldwide and, in desperation, humanity tried to neutralize it with nuclear weapons, resulting in a nuclear holocaust and the AI creating a global network of machines to terminate the human survivors.Grace traces Sarah's messages to Laredo, Texas. Barely evading the Rev-9 and the authorities when crossing the Mexico-United States border, they arrive at their source, where they discover the same T-800 that murdered John. Having fulfilled its mission and with Skynet no longer existing, the T-800 was left aimless, and through learning it developed self-awareness. During that time, it learned from humanity and built a conscience, taking the name \"Carl\" and adopting a human family. After learning how its actions affected Sarah, and being able to detect temporal displacements, Carl decided to forewarn her of them to give her purpose. Carl offers to join them against the Rev-9 and they make preparations to destroy it. Sarah begrudgingly agrees to work together for Dani's sake. Anticipating the Rev-9's arrival, Carl bids its family farewell and tells them to escape. The group gives Dani tactical weapons training and plans how to ambush the Rev-9.In order to do so, they seek out a military grade EMP from an acquaintance of Sarah's. The Rev-9 catches up with them, forcing them to steal a C-5 Galaxy to escape, though the EMP's are destroyed in the resulting shootout. During the flight, Grace further reveals that Dani becomes the future founding commander of the Resistance, as well as her rescuer. Sarah and Carl realize that they were fated to meet Grace and Dani. The Rev-9 boards their airplane by using a KC-10 Extender and temporarily subdues Carl, forcing Grace, Sarah and Dani to jump from the plane into a river near a hydro-power plant, with Carl and the Rev-9 following close behind.Bludgeoned, the group makes a stand inside. In the ensuing battle, Carl and Grace force the Rev-9 into a spinning turbine, causing an explosion that critically damages the two Terminators and mortally wounds Grace. The damaged Rev-9's Endoskeleton then incapacitates Sarah, forcing Dani to confront it herself. A dying Grace tells Dani to use her power source to destroy the Rev-9. Dani tries to fight the Rev-9, but is quickly overpowered. Carl reactivates and restrains the Rev-9, allowing Dani to stab it with Grace's power source. Carl drags itself and the Rev-9 over a ledge and tells Sarah \"For John\", right before the power core explodes, destroying them both.\nSometime later, Dani and Sarah watch over a ten-year old Grace at a park with her family, the former determined to avert Grace's death. Sarah then tells Dani she needs to get ready, with Grace watching as the pair drives off.",
	"links": [
		"https://www.amazon.com/Terminator-Dark-Blu-ray-Linda-Hamilton/dp/B07YTDXGH4"
	]
}