{
	"title": "Upgrade",
	"release_year": "2018",
	"runtime": "100",
	"tags": [
		"Action",
		"Sci-Fi",
		"Thriller",
		"amazon",
		"netflix"
	],
	"rating": 7.5,
	"actors": [
		"Logan Marshall-Green",
		"Melanie Vallejo",
		"Steve Danielsen",
		"Abby Craden",
		"Harrison Gilbertson",
		"Benedict Hardie",
		"Richard Cawthorne",
		"Christopher Kirby",
		"Richard Anastasios",
		"Kenny Low"
	],
	"staff": [
		"Leigh Whannell",
		"Leigh Whannell",
		"Jason Blum",
		"Kylie Du Fresne",
		"Brian Kavanaugh-Jones",
		"Jed Palmer",
		"Stefan Duscio",
		"Andy Canny",
		"Nikki Barrett",
		"Terri Taylor",
		"Felicity Abbott"
	],
	"votes": 213332,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjI0NzcyMjM5Ml5BMl5BanBnXkFtZTgwMzk2NzAyNTM@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Grey Trace (Logan Marshall-Green), a stay-at-home mechanic, lives with his wife Asha (Melanie Vallejo) who works for Cobolt, one of the companies contributing to an increase in human-computer augmentations in a near-future world. One day, Grey asks Asha to help him return a refurbished car to his client Eron Keen (Harrison Gilbertson), a famous tech innovator in charge of a rival company called Vessel. While visiting his home, Eron reveals his latest creation, an AI chip called STEM (Simon Maiden) that can serve as an auxiliary brain.On their way home, Grey and Asha's self-driving car malfunctions and crashes at a homeless camp. Four unknown men then arrive, shooting Asha in the stomach and Grey in the neck, severing his spinal cord. Grey watches helplessly as Asha bleeds to death next to him.Grey returns home months later as a wheelchair-bound quadriplegic, now under the care of his mother Pamela (Linda Cropper). Asha's death and the inability of Cortez (Betty Gabriel), the detective assigned to her case, to identify their attackers has caused Grey to sink into an intense depression. After a failed suicide attempt by overdosing on medication, he is visited by Eron, who offers to surgically implant STEM into Grey's spine and restore motor functions to his body. Though Grey is initially resistant, Eron successfully persuades him to undergo the surgery.Grey goes through with the surgery and regains control of his limbs faster than expected. Eron then has Grey sign a non-disclosure agreement to conceal STEM from everyone, including the police, and pretend to still be paralyzed when in public. While looking through case files on his wife's murder that night, Grey hears STEM speak into his mind. STEM says it can help Grey get revenge and quickly identifies one of the assailants, a local man named Serk Brantner (Richard Cawthorne), from a drone video feed. STEM also discovers that Serk and the assailants had modified guns implanted into their arms, explaining why police were unable to identify a murder weapon. Grey decides to investigate Serk personally.Grey breaks into Serk's home and discovers he was \"upgraded\" as a result of a secret military experiment, which connects him and another assailant to a local bar called the Old Bones. Serk then returns home and discovers Grey, leading to a fight between the two. As Serk begins to overpower Grey, STEM convinces Grey to temporarily give up control of his body. Under STEM's direction, Grey becomes a lethally efficient fighting machine, killing Serk with little effort. Though they attempt to cover their tracks, Cortez sees drone footage of Grey approaching Serk's house before the murder. However, she lacks evidence connecting Grey to Serk's murder, or proof that he is capable of assaulting a person given his quadriplegic condition.Eron learns what happened by tracking STEM's movements and berates Grey for his vigilantism. Grey reveals STEM is speaking to him, which surprises Eron, who demands that Grey stop any further investigation. Nonetheless, Grey proceeds to the Old Bones and finds the next assailant (Tolan) (Christopher Kirby). With STEM's aid, Grey easily overpowers him. Although initially squeamish, Grey allows STEM to torture Tolan to death, but not before getting the name of the assailants' ringleader, Fisk Brantner (Benedict Hardie). Grey also finds that the assailants had been paid by somebody to kill Asha. and they all had implants from the company where she worked. While leaving the bar, Grey collapses onto the ground. STEM informs Grey that Eron is attempting to shut them down remotely and directs him to a hacker nearby who can sever Eron's connection.After an arduous struggle, Grey finds the hacker, Jamie (Kai Bradley), who manages to remove STEM's input guard. Jamie then abandons them upon realizing they've been followed by the assailants and two armed Vessel employees. Fisk kills the Vessel employees while Grey, with STEM's control restored, murders Fisk's companion, Jeffries (Michael M. Foster).Grey returns home only for Pamela to discover him walking about, forcing him to reveal STEM's existence. Cortez then arrives to interrogate them after finding Grey's wheelchair suspiciously abandoned at the Old Bones. Unable to get either of them to confess, she leaves after discreetly planting a listening device on Grey's jacket. Exhausted and broken up over the murders he has committed, Grey wishes to give up. STEM refuses, telling Grey that unless they deal with Fisk, he will eventually track them down and kill them. Demonstrating that without Eron's input guards, it no longer needs to obey Grey's commands, STEM then forces Grey to leave the house to hunt down Fisk. While driving, they discover Cortez's listening device and spot her car chasing after them. STEM then causes an automated car to malfunction and crash into hers so they can escape. Cortez returns to Grey's home shortly after, where Pamela reveals the truth about STEM.Grey and STEM eventually find Fisk, threatening him at gunpoint to reveal why he killed Asha. Fisk reveals he was only hired to paralyze Grey so he could be implanted with STEM. Grey then attacks Fisk, who is so upgraded that he can outpace Grey's movements. STEM begs Grey to come up with some distraction, whereupon Grey taunts Fisk with the death of his brother. The emotional strain is enough for STEM to gain the upper hand and kill Fisk. Grey then searches Fisk's phone and discovers a message from Eron, suggesting he orchestrated everything to make Grey the ideal test subject for STEM.Grey assaults Eron's home, only to be held at gunpoint by Cortez before he can kill Eron. Eron then reveals that STEM had forced him to set things in motion from the beginning, having long since taken control of Eron's life and his company in pursuit of its goal to become human. When it learned that Grey's body was completely not augmented, it caused the car crash and directed Eron to say exactly the right things so that Grey would agree to its surgical insertion. After revealing its plan, STEM kills Eron and attempts to kill Cortez. In a desperate effort to resist STEM, Grey forces his arm towards his neck and shoots himself.Grey suddenly wakes up in a hospital bed, fully in control of his body with Asha sitting by his side. He is convinced everything that happened was a bad dream experienced after surviving the car crash. The truth, however, is revealed as the scene cuts back to Eron's home. STEM, now speaking through Grey's body, tells Cortez that Grey is \"not here anymore\"; because of the psychological strain he exerted attempting to resist STEM's control, Grey's mind snapped, and STEM placed his consciousness into an idyllic fantasy world to live out the rest of his existence peacefully. With every other loose end tied off, STEM murders Cortez and leaves to enter society with its new body.",
	"links": [
		"https://www.amazon.com/Upgrade-Logan-Marshall-Green/dp/B07G7J38C8",
		"https://www.netflix.com/title/80240085"
	]
}