{
	"title": "Bad Times at the El Royale",
	"release_year": "2018",
	"runtime": "141",
	"tags": [
		"Crime",
		"Drama",
		"Mystery",
		"amazon"
	],
	"rating": 7.1,
	"actors": [
		"Jeff Bridges",
		"Jeff Bridges",
		"Cynthia Erivo",
		"Dakota Johnson",
		"Jon Hamm",
		"Jon Hamm",
		"Chris Hemsworth",
		"Cailee Spaeny",
		"Lewis Pullman",
		"Nick Offerman",
		"Xavier Dolan",
		"Shea Whigham"
	],
	"staff": [
		"Drew Goddard",
		"Drew Goddard",
		"Drew Goddard",
		"Jeremy Latcham",
		"Michael Giacchino",
		"Seamus McGarvey",
		"Lisa Lassek",
		"Carmen Cuba",
		"Martin Whist"
	],
	"votes": 167394,
	"cover": "https://m.media-amazon.com/images/M/MV5BOTk1Nzk1MDc1MF5BMl5BanBnXkFtZTgwNjU2NDExNjM@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1969, Catholic priest Daniel Flynn (Jeff Bridges) (a robber masquerading as a priest), singer Darlene Sweet (Cynthia Erivo), salesman Laramie Seymour Sullivan (Jon Hamm) (Dwight Broadbeck / Seymour 'Laramie' Sullivan, an undercover FBI agent posing as a home supplies salesman), and sarcastic Emily Summerspring (Dakota Johnson) arrive at the El Royale, where they meet the hotel's only employee, Miles Miller (Lewis Pullman) (who served as a sniper in the Vietnam War).Upon checking into the honeymoon suite, Sullivan (in reality an FBI agent named Dwight Broadbeck, sent to remove illegal FBI surveillance equipment in one of the rooms) discovers a passageway leading into a corridor looking onto one-way mirrors in each of the hotel's rooms, as well as a 16mm camera setup. Broadbeck sees Daniel digging around in the floorboards of the his room and finding nothing, he also witnesses an apparent kidnapping in progress in Emily's room (Emily is tying a girl from the trunk of her car to a chair in her room); Sullivan reports to his director (Hoover) & he is instructed not to interfere with the kidnapping, and to sabotage the guests' vehicles to prevent any of them from escaping.\nMeanwhile, Flynn invites Sweet to join him for dinner. She sees him drugging her drink and knocks him unconscious with a bottle, running out of the hotel to escape. Miles finds Flynn and reveals to him the secret passageway, afterwards explaining that \"management\" has instructed him to film the guests and send the footage to them. However, he chose to hold back one particularly incriminating film reel of a recently deceased public figure. Flynn forces Miles to hand over the film to him.Against orders, Broadbeck attempts to rescue Emily's hostage, who is revealed to be her younger sister, Rose (Cailee Spaeny). Emily opens fire on Broadbeck, killing him and accidentally injuring Miles who was watching from behind the mirror. Sweet attempts to escape in her car after witnessing the murder, but Flynn arrives. He reveals that he is really a criminal named Donald O'Kelly, who was imprisoned after a botched robbery ten years earlier. Recently freed on parole, O'Kelly has returned to the El Royale in priest garb to retrieve the money which his brother Felix (Nick Offerman) had hidden there before being killed in a double cross ten years earlier - but owing to his failing memory he can't recall which room it was in. He had attempted to drug Sweet to gain access to her room, believing the cash to be buried there. The two agree to split the cash among themselves. Sweet reluctantly agrees.In the lobby, Emily and Rose, having discovered the corridor, interrogate Miles about the surveillance operation. It is revealed that Emily has forcibly removed her sister from a cult led by Billy Lee (Chris Hemsworth), a charismatic and sadistic figure responsible for a string of murders in Malibu. However, Rose reveals that she has already called Billy about their location. As O'Kelly and Sweet attempt to leave with the money, Billy Lee and his cultists arrive and hold them hostage along with Emily and Miles.While interrogating and terrorizing the group, Lee learns of the money and the film, which he realizes is worth much more than the money. In a sadistic game of roulette, Lee kills Emily. Using a brief power outage to his advantage, O'Kelly attacks Lee as the hotel lounge catches fire. During the chaos, Miles reveals that he served as a sniper in Vietnam who killed 123 people. At Sweet's insistence, he picks up a gun and kills Lee and the other cultists. A distraught Rose stabs Miles, but is shot by O'Kelly afterwards. Before Miles dies, Sweet tells O'Kelly to absolve him of his guilt over his actions in Vietnam, which he does. O'Kelly and Sweet retrieve the money and Sweet tosses the film into the fire before the pair flee the hotel.Not long after, Sweet performs at a show in Reno for the crowd, as O'Kelly proudly looks on.",
	"links": [
		"https://www.amazon.com/Bad-Times-El-Royale-UHD/dp/B08GSDZS9L"
	]
}