{
	"title": "Guardians of the Galaxy Vol. 3",
	"release_year": "2023",
	"runtime": "150",
	"tags": [
		"Action",
		"Adventure",
		"Comedy",
		"amazon"
	],
	"rating": 7.9,
	"actors": [
		"Chris Pratt",
		"Chris Pratt",
		"Chukwudi Iwuji",
		"Bradley Cooper",
		"Pom Klementieff",
		"Dave Bautista",
		"Karen Gillan",
		"Vin Diesel",
		"Austin Freeman",
		"Austin Freeman",
		"Stephen Blackehart",
		"Terence Rosemore"
	],
	"staff": [
		"James Gunn",
		"James Gunn",
		"Jim Starlin",
		"Stan Lee",
		"Larry Lieber",
		"Kevin Feige",
		"John Murphy",
		"Henry Braham",
		"Greg D'Auria",
		"Fred Raskin",
		"Sarah Finn",
		"Beth Mickle"
	],
	"votes": 398035,
	"cover": "https://m.media-amazon.com/images/M/MV5BOTJhOTMxMmItZmE0Ny00MDc3LWEzOGEtOGFkMzY4MWYyZDQ0XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Peter is in depression ever since Gamora lost her memory from the last few years.At their new headquarters on Knowhere, the Guardians of the Galaxy are attacked by Adam Warlock (Will Poulter), a Sovereign warrior created by High Priestess Ayesha (Elizabeth Debicki), who seeks to destroy them for stealing from her. Adam easily defeats Rocket, Mantis, Peter Nebula and Groot. Kraglin's arrows cannot pierce Adam's metallic skin. Even Drax is no match for Adam's strength and is subdued.After critically wounding Rocket (Bradley Cooper), Adam is stabbed by Nebula (Karen Gillan), and flees. The Guardians' med-packs are useless at healing Rocket's wounds, who has a kill switch embedded in him by Orgocorp, a company led by the High Evolutionary (Chukwudi Iwuji), Rocket's creator. The code on Rocket's kill switch is 89P13.\nThe Guardians travel to Orgocorp's headquarters to find the switch's override code and save Rocket's life. Kraglin is left in charge of Knowhere with Cosmos, whom Kraglin considers an ugly dog.As Rocket lies unconscious, he recalls his past. He was found as a baby raccoon and was experimented on by the High Evolutionary, an alien cyborg scientist and CEO of OrgoCorp specializing in creating hybrid creatures and Rocket's creator, seeking to forcibly enhance all living beings into a \"special race\" where he has been credited as creating the Animen, the Humanimals, the Hell Spawn, the Sovereign, the Xeronians, and the Star Children, to create an ideal society called Counter-Earth.\nRocket befriended his fellow Batch 89 test subjects: the otter Lylla (Linda Cardellini), the walrus Teefs (Asim Chaudhry), and the rabbit Floor (Mikaela Hoover).\nThe High Evolutionary was impressed by Rocket's growing intelligence and used his insight to fix a defect in later Humanimal batches but planned to harvest Rocket's brain for further research and exterminate the obsolete Batch 89.\nThe High Evolutionary shows Rocket how he has perfected programmed evolution, but for some reason, the evolved organisms are violent by nature. Rocket is able to point out specific changes to the evolutionary program that would help control the level of violence tendency in the evolved organisms.After making the suggested changes, the programmed evolution sequence works. The High Evolutionary is amazed that Rocket, from batch 89, was able to figure this technology out, but could not figure out that batch 89 was only an experiment and not meant for the New World he was building.\nRocket attempted to free his friends, before the High Evolutionary killed Lylla and mocked Rocket for showing grief over her death. Enraged, Rocket mauled the High Evolutionary's face, whose henchmen killed Teefs and Floor in the ensuing firefight. Rocket fled in a spaceship.Back in the present, Ayesha is shown to be working for the High Evolutionary. High Evolutionary is livid with Ayesha for knowing of 89P13's existence for several years without alerting him. High Evolutionary wants 89P13 returned to him, else he promises to wipe out Ayesha's entire Sovereign race.The Ravagers (The Ravagers are an interstellar criminal syndicate that specialize in thievery, trafficking and piracy. There were nearly one hundred factions of Ravagers around the galaxy. Each faction has a captain of its own, leading their operations), including an alternate version of Gamora (Zoe Saldana), help the Guardians infiltrate Orgocorp.\nPeter tries to get Gamora to remember their life together, but she says that it was some future version of her, and not her who fell in love with Peter. Gamora also points out that the things Peter loves, it sounds like he is in love with Nebula.\nOrgocorp is completely made of organic material. Gamora gets them in via a decompression chamber, but the group is soon discovered.\nThey retrieve Rocket's file and fight off Orgacorp sentries to be picked up Groot who flies in with their spaceship.\nThe group discover that the code to override the kill switch was removed, with the likely culprit being Theel (Nico Santos), one of the High Evolutionary's advisers. High Evolutionary has used Orgocorp to fund his experiments that lie outside Inter-Galactic law.The Guardians, along with Gamora, depart for Counter-Earth to find him.\nGamora argues that this is a trap since the High Evolutionary is looking for Rocket and they are taking him straight to the High Evolutionary. Gamora signals the Ravagers to pick her up, but her communication is intercepted by Ayesha, who follows the Guardians with Adam.The Guardians reach Counter-Earth and are guided to the Arete Laboratories complex. Drax (Dave Bautista) and Mantis (Pom Klementieff) remain with Gamora and Rocket, while Peter Quill (Chris Pratt), Groot (Vin Diesel), and Nebula travel to Arete. Nebula is forced to wait outside the complex by guards as she is armed; Quill and Groot enter Arete to meet the High Evolutionary, while Drax tricks Mantis into pursuing Quill's group.\nAs Quill's group is engaged in banter by the High Evolutionary, he launches an attack by his guards on Quill's ship to retrieve Rocket.\nGamora saves Rocket from being captured by Adam and the High Evolutionary's guard War Pig (Judy Greer). Adam kills War Pig as he wanted to present Rocket to the High Evolutionary and save the Sovereign.Questioned by Quill, the High Evolutionary admits this version Counter-Earth's society is imperfect, so he bombards the planet, killing the Humanimals as well as Ayesha. This enrages Adam who considered Adam as his mother. Adam's ship is destroyed and he has no option but to take shelter with Gamora.Arete departs as a spaceship, with Nebula, Drax and Mantis boarding it to rescue Quill and Groot, who instead escape Arete with Theel, who they kill before retrieving the code from his corpse and being rescued by Gamora in their ship.\nAs Quill's group uses the code, Rocket flat-lines and has a near-death experience, in which he reunites with Lylla, Teefs, and Floor. He learns from Lylla that his time has not yet come, as Quill uses the code to disable the kill switch and restart Rocket's heart.Drax, Nebula, and Mantis encounter several genetically modified humanoid children on Arete before being captured by the High Evolutionary. The High Evolutionary wants Peter to bring Rocket to him in exchange for the captured trio. Peter contacts Kraglin on the Knowhere to help.\nThe High Evolutionary tells his advisers that in thousands of generations that he created, only one experiment led to true intelligence and that was Rocket, which is studying him is critical.The other Guardians stage a rescue, leading to a battle against the High Evolutionary's forces.\nKraglin (Sean Gunn) fires on Arete with Knowhere, dooming Arete. Kraglin and Cosmos then help to save Knowhere's citizens from a counter-attack by the High Evolutionary's Hellspawn. Cosmos is revealed to have Tele-Kinetic abilities. Intent on retreat, the High Evolutionary's crew mutiny only to be killed by their leader.Drax, Nebula, and Mantis befriend three monstrous Abilisks to escape and reunite with Quill's group. The Guardians delay leaving Arete, choosing to rescue the children created by the High Evolutionary, who escape to Knowhere via a tunnel constructed by Cosmo's telekinesis.\nRocket discovers imprisoned animals on the ship before being confronted by the High Evolutionary, whom the other Guardians defeat.Rocket spares the High Evolutionary, and the Guardians help the animals escape to Knowhere. Quill nearly dies trying to cross over, but is saved by Adam, who was saved from Arete by Groot as \"everyone deserves a second chance\".In the end, Quill decides to leave the Guardians, naming Rocket as captain, and travels to Earth to reunite with Jason (Gregg Henry), his grandfather. Mantis embarks on a journey of self-discovery with the Abilisks, Gamora rejoins the Ravagers, and Nebula and Drax remain on Knowhere to raise the rescued children.In a mid-credits scene, the new Guardians, consisting of Rocket, Groot, Kraglin, Cosmo, Adam, Phyla (one of the rescued children), and Adam's pet Blurp, take on a new mission.",
	"links": [
		"https://www.amazon.com/Guardians-Galaxy-Vol-Chris-Pratt/dp/B0B6QTP755"
	]
}