{
	"title": "Tenet",
	"release_year": "2020",
	"runtime": "150",
	"tags": [
		"Action",
		"Sci-Fi",
		"Thriller",
		"amazon"
	],
	"rating": 7.3,
	"actors": [
		"John David Washington",
		"Robert Pattinson",
		"Elizabeth Debicki",
		"Juhan Ulfsak",
		"Jefferson Hall",
		"Ivo Uukkivi",
		"Andrew Howard",
		"Rich Ceraulo Ko",
		"Rich Ceraulo Ko",
		"Jonathan Camp",
		"Wes Chatham"
	],
	"staff": [
		"Christopher Nolan",
		"Christopher Nolan",
		"Christopher Nolan",
		"Emma Thomas",
		"Ludwig Göransson",
		"Hoyte Van Hoytema",
		"Jennifer Lame",
		"John Papsidera",
		"Nathan Crowley"
	],
	"votes": 605704,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTU0ZjZlYTUtYzIwMC00ZmQzLWEwZTAtZWFhMWIwYjMxY2I3XkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "A CIA agent, the \"Protagonist\" (John David Washington), participates in an extraction operation at a Kyiv opera house. Ukrainian forces have made the CIA operative and have staged a hostage situation to kill the operative. The Protagonist's instructions are to bring him in or kill him. After seizing an artifact, A masked soldier wearing a red trinket saves his life by \"un-firing\" a bullet through a gunman.\nthe Protagonist is then captured by mercenaries. He is tortured and consumes cyanide. He awakens to learn the cyanide was a test of loyalty; his team has been killed and the artifact lost.The Protagonist is recruited by an organization called Tenet. Fay (Martin Donovan) is the Protagonist's CIA boss, and he recruits him into the Tenet. A scientist Barbara (Clémence Poesy) briefs him on bullets with \"inverted\" entropy, meaning they move backward through time. She believes they are manufactured in the future, and other inverted objects seem to be remnants of a war in the future. Barbara feels the future is planning something, and the past doesn't know it yet.\nThe Protagonist meets Neil (Robert Pattinson) through a CIA contact, and they trace the inverted bullets to arms dealer Priya Singh (Dimple Kapadia) in Mumbai. They learn that Priya is a member of Tenet, and her cartridges were purchased and inverted by Russian oligarch Andrei Sator (Kenneth Branagh). She says she sold Sator normal cartridges, but somehow, he is getting them inverted. Sator is suspected to be a broker between our time and the future.\nPriya gives him a connect to Sir Michael Crosby (Michael Caine), a British Intelligence officer. Crosby says that Sator grew up in one of the soviet \"secret\" cities Stalsk-12. In the 70's it had 200K people and then it was abandoned after some sort of accident. It was being used for some underground tests. One explosion showed up on sensors the same day as the day of the Kyiv siege.\nCrosby says that Sators wife Katherine authenticated a fake Goya, made by Arepo for her auction house and sold it to her husband Sator. Crosby thinks Kat is close to Arepo. Kat is now estranged from Sator, who has custody of their kid.In London, the Protagonist approaches Sator's estranged wife Kat (Elizabeth Debicki). She tells him that Sator purchased the drawing from the forger, Arepo, and is using Kat's authentication as blackmail to control her in their relationship. Until that painting is with Sator, she cannot help the Protagonist. Sator thinks Kat betrayed her, but she claims that she didn't know that the Goya was a fake. Protagonist offers to retrieve the painting in exchange for a meeting with Sator.\nThe Protagonist and Neil plot to steal the drawing from a free-port storage facility at the Oslo Airport. They use Mahir (Himesh Patel) to crash a plane into the rear wall of the free-port to gain access. Inside Sator's vault, they fend off two masked men who seemingly emerge from a strange device. Afterward, Priya explains that the device is a turnstile, a machine that can invert the entropy of objects and people, and that the masked men were the same person traveling in opposite directions through time. Sator has been given this machine by the future, but the purpose is unknown.On the Amalfi Coast, Italy, Kat introduces the Protagonist to Sator, and learns the drawing is intact (He had it removed from the vault before the attack). Sator plans to kill the Protagonist, but the Protagonist saves Sator's life after Kat attempts to drown him (while sailing). Sator and the Protagonist strike a partnership to retrieve a case that supposedly contains plutonium-241 (which was also the objective of Sator's attack in Kyiv). Sator reveals that he was assigned to collect plutonium from an exploded warhead in Stalsk-12 and that's where he found a box from the future for the first time (it is implied, but Sator doesn't reveal that to Protagonist). Protagonist secretly watches Sator, while on his yacht and sees how he gets coordinates on where to pick up artifacts and the sends his team to retrieve them, who deliver to Sator on his yacht.\nIn Tallinn, the Protagonist and Neil ambush a convoy and steal the case, which actually contains the artifact lost in Kyiv. They are ambushed by an inverted Sator holding Kat hostage. The Protagonist gives an empty case to Sator, who retreats after receiving it. The Protagonist rescues Kat but she is soon captured and taken to a warehouse with a turnstile.In the warehouse, the inverted Sator shoots Kat with an inverted round, while the non-inverted Sator demands the location of the artifact. Tenet operatives led by Ives (Aaron Taylor-Johnson) arrive and rescue the Protagonist, and Sator escapes into the turnstile. The group takes Kat through the turnstile, inverting them and reversing Kat's bullet wound. The now-inverted Protagonist travels back in time to the ambush site (he is briefed not to touch his regular self as if the particles come into contact, it means annihilation), where he attempts to retrieve the artifact but is intercepted by Sator. Sator gets the artifact from the reverse Protagonist (it was in the reverse Protagonist's car). The reversed Protagonist's car is overturned and catches fire, but reversed Neil saves him and reveals he is a member of Tenet.The Protagonist, Neil, and Kat travel back in time to the free-port in Oslo. The Protagonist fights his past self (The 2 guys who emerged strangely inside the free-port were basically Neils and the Protagonist), enters the turnstile, and reverts, followed by Neil and Kat.\nLater, Priya explains that Sator is collecting the artifacts to assemble an \"algorithm\" which is capable of catastrophically inverting the entropy of the Earth. For some reason the future wants to destroy the entire past of humanity. A Scientist in the future creates the algorithm to reverse the entropy of the world. However, she is concerned that by destroying the past, they destroy themselves, so she split the algorithm into 9 sections and hides it in 9 bombs in the past. Sator's lifelong mission was to re-assemble the algorithm, financed and guided by the future. The bomb at Stalsk-12 was the start of it.Kat reveals Sator is dying from pancreatic cancer. They learn that Sator is using a dead man's switch to trigger the algorithm (The health band on his wrist will trigger the algorithm the second his heart stops). Kat believes Sator will travel back in time to commit suicide during their vacation in Vietnam, so that the world will die with him at the last moment he was happy.\nThe Protagonist, Neil, Kat, and Tenet troops travel back in time to that day, where Kat disguises herself as her past self to keep Sator alive long enough for Tenet to secure the algorithm. Tenet tracks the algorithm to Stalsk-12 (the nuclear explosion noticed on the day of Kyiv siege was the one that triggered the algorithm), where it is heavily guarded. They launch a \"temporal pincer movement\", with non-inverted red team troops and inverted blue team troops making a simultaneous assault. At a critical moment, an inverted blue-team soldier wearing a red trinket sacrifices himself to save the Protagonist and Ives, as they get into the underground bunker to stop the nuclear explosion.\nMeanwhile, in Vietnam, Kat kills Sator (Sator calls Protagonist in Stalsk-12 and reveals that he is helping the future the past was responsible for the rising oceans and dry rivers. They had no choice but to reverse time) just as the Protagonist secures the algorithm.The Protagonist, Neil, and Ives break up the algorithm and part ways. The Protagonist notices that Neil is wearing the red trinket. Neil reveals he was recruited by the Protagonist in the future and this mission is, from his perspective, the end of a long friendship. Since she knows too much, Priya attempts to have Kat assassinated, but she is killed by the Protagonist, who realizes he is the mastermind behind Tenet.Scientific accuracy\nThe film's plot revolves around reversing the entropy of things and people, resulting in time reversibility. Tenet makes reference to physics concepts including annihilation, the second law of thermodynamics, Maxwell's demon, and Feynman and Wheeler's notion of a one-electron universe, but Christopher Nolan stated in the film's press notes: \"we're not going to make any case for this being scientifically accurate\".",
	"links": [
		"https://www.amazon.com/Tenet-John-David-Washington/dp/B08MWTC98G"
	]
}