{
	"title": "Gisaengchung",
	"release_year": "2019",
	"runtime": "132",
	"tags": [
		"Drama",
		"Thriller",
		"amazon"
	],
	"rating": 8.5,
	"actors": [
		"Song Kang-ho",
		"Lee Sun-kyun",
		"Cho Yeo-jeong",
		"Choi Woo-sik",
		"Park So-dam",
		"Lee Jeong-eun",
		"Jang Hye-jin",
		"Park Myeong-hoon",
		"Jung Ji-so",
		"Jung Hyun-jun"
	],
	"staff": [
		"Bong Joon Ho",
		"Bong Joon Ho",
		"Han Jin-won",
		"Bong Joon Ho",
		"Kwak Sin-ae",
		"Moon Yang Kwon",
		"Jung Jae-il",
		"Hong Kyung-pyo",
		"Jinmo Yang",
		"Lee Ha-jun"
	],
	"votes": 990240,
	"cover": "https://m.media-amazon.com/images/M/MV5BYjk1Y2U4MjQtY2ZiNS00OWQyLWI3MmYtZWUwNmRjYWRiNWNhXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Kim Ki-Taek (Song Kang-Ho), an unemployed driver, lives with his wife Choong-Sook (Jang Hye-Jin), son Ki-Woo (Choi Woo-Shik) and daughter Ki-Jeong (Park So-Dam) in a shabby semi-basement apartment. The family struggles to survive, working low-paying gigs such as folding pizza boxes. Ki-Woo's friend Min-Hyuk (Park Seo-Joon) visits the family and gifts them a large rock supposed to bring them wealth, before he leaves to study abroad. He suggests Ki-Woo take over his job as an English tutor for the wealthy Park family's youngest daughter, Da-Hye (Jung Ji-So).Min-Hyuk has feelings for Da-Hye and figures that she will be safe with Ki-Woo, till he graduates college. In the lavish Park mansion, Ki-Woo is interviewed by Mrs. Park (Cho Yeo-Jeong) to tutor Da-Hye and is hired after Mrs. Park sees his talents (His degrees which were faked by his sister Ki-Jeong who is a master at forgery) in action.\nLearning of Mrs. Park's struggle to find an art teacher for her younger child, Da-Song, Ki-Woo suggests a \"professional\" named Jessica, who in reality is Ki-Jeong. Once hired, Ki-Jeong gets Mr. Park's (Lee Sun-Kyun) driver fired (The driver hits on Ki-Jeong and she accuses him of sexual harassment by placing her panties in the back seat of the Mercedes he is in charge of) and replaced with her \"Uncle Kim\": Ki-Taek.The Kims soon get housekeeper Moon-Kwang (Lee Jung-Eun) fired (Moon-Kwang had a rule that the family could not eat peaches, but Ki-Jeong discovers that its because Moon-Kwang herself is severely allergic to it and the manipulate the Park family to believe that Moon-Kwang had Tuberculosis. This enrages Mrs. Park, who fires her), with Choong-Sook hired in her place, employing the entire Kim family.\nKi-Woo ends up kissing Da-Hye and both are attracted to each other.The Parks go on an overnight camping trip, leaving the mansion in Choong-Sook's care. The Kims take the opportunity to have a drunken party in the mansion, during which Ki-Woo confesses to his family that he is in love with Da-Hye. In the middle of their celebration, Moon-Kwang (Lee Jung-Eun) rings the bell and claims that she came to retrieve something in the basement. The other Kims hide, then Choong-Sook lets Moon-Kwang in. Heading to the basement, the former housekeeper opens a secret bunker, revealing that her husband, Geun-Sae (Park Myung-Hoon), has been hiding for 4 years to avoid loan sharks. As Choong-Sook threatens to call the police, the rest of the Kims, eavesdropping, accidentally stumble into view. Moon-Kwang quickly records footage of the new \"staff\" addressing each other as father and children, then threatens to send the clip to the Parks.The Parks call Choong-Sook to announce that the heavy rain has ruined their camping trip, and they will be home soon. The Kims scramble to confine Moon-Kwang and Geun-Sae, then clean up and hide, while Choong-Sook prepares some food requested by Mrs. Park. Moon-Kwang breaks free and runs up into the kitchen, but Choong-Sook pushes her down the basement stairs, severely wounding her head. While eating, Mrs. Park tells Choong-Sook that her son was traumatized one birthday by what he thought was a ghost coming up from the basement (he just saw Moon-Kwang's husband coming into the kitchen from the basement stairs).Moon-Kwang's husband is tied up by Ki-Taek and he reveals to him that he has been trying to communicate with Mr Park via Morse code for several years (a light in the dining room has a switch in the basement) (but Mr Park, never understood Morse code and hence never understood the message). After a few close calls, the other three Kims leave the mansion undetected. They run back to their apartment, which has been flooded by the storm. They salvage what they can, Ki-Woo carrying the large \"lucky rock\" Min-Hyuk gifted his family earlier. The three, along with other displaced citizens, sleep in a gymnasium. Meanwhile, Moon-Kwang dies from her concussion as Geun-Sae cries. but before dying she cuts off the tape that Ki-Taek had used to tie her husband up, thus freeing him.The following day, Mrs. Park throws a birthday party for Da-Song (Jung Hyun-Joon) and ask the Kims to come over and help with all the chores (the Kims are bummed as they feel that the Parks are totally oblivious to the lives of ordinary people. Ki-Taek is especially miffed when Mrs and Mr Park, both make insensitive comments about air quality improving from all the rain from the previous night). During the party, Ki-Woo carries the rock down to the bunker, intending to kill Geun-Sae. Geun-Sae ambushes Ki-Woo, cracks his head open with the rock, then crashes the party, where he stabs Ki-Jeong in the chest.\nGeun-Sae's sudden appearance triggers Da-Song's traumatic memory, causing the child to have a seizure. Ki-Taek rushes to stop Ki-Jeong's bleeding, while Mr. Park yells at him for the car keys, so Park can drive Da-Song to the hospital. The key lands under the fighting Choong-Sook and Geun-Sae, before Choong-Sook kills Geun-Sae with a meat skewer. Mr. Park retrieves the key, while recoiling from Geun-Sae's \"poor man's smell.\" Ki-Taek, witnessing Mr. Park's reaction to the smell, also his own, snaps, fatally stabs him, then flees.The ending is narrated by Ki-Woo, recounting that Ki-Jeong died from her wounds, while he required brain surgery and suffered a weeks-long coma; he and Choong-Sook went to trial and were sentenced to probation. Later, watching the Parks' mansion, Ki-Woo notices a light flickering in Morse code - a message from Ki-Taek, who managed to retreat into the bunker in the chaos, and has been hiding from and living off of the new owners. Ki-Woo promises that one day, he will earn enough money to buy the house and free his father. Fantasizing about the day of their reunion, Ki-Woo ends his letter sitting in the shabby semi-basement apartment where the movie began.",
	"links": [
		"https://www.amazon.com/Parasite-English-Subtitled-Kang-Song/dp/B07YM14FRG"
	]
}