{
	"title": "Glass",
	"release_year": "2019",
	"runtime": "129",
	"tags": [
		"Drama",
		"Horror",
		"Sci-Fi",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"James McAvoy",
		"James McAvoy",
		"James McAvoy",
		"Bruce Willis",
		"Samuel L. Jackson",
		"Anya Taylor-Joy",
		"Sarah Paulson",
		"Spencer Treat Clark",
		"Charlayne Woodard",
		"Luke Kirby",
		"Adam David Thompson",
		"M. Night Shyamalan"
	],
	"staff": [
		"M. Night Shyamalan",
		"M. Night Shyamalan",
		"Marc Bienstock",
		"Jason Blum",
		"Ashwin Rajan",
		"M. Night Shyamalan",
		"West Dylan Thordson",
		"Mike Gioulakis",
		"Luke Ciarrocchi",
		"Blu Murray",
		"Douglas Aibel",
		"Alan Lampert",
		"Chris Trujillo"
	],
	"links": [
		"https://www.amazon.com/Glass-James-McAvoy/dp/B07MJTJKKJ"
	],
	"votes": 281582,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTY1OTA2MjI5OV5BMl5BanBnXkFtZTgwNzkxMjU4NjM@._V1_QL75_UY281_CR4,0,190,281_.jpg",
	"description": "It has been three weeks after an infamous crime spree by super villain Kevin Wendell Crumb (James McAvoy), whom the press had nicknamed \"The Horde\" (A former Philadelphia Zoo employee with 23 different personalities whose body chemistry changes with each personality, resulting in a 24th personality known as \"The Beast\", a savage superhuman cannibal whose abilities include superhuman strength, speed, durability, and agility. Kevin's personalities also include Jade (a teenage girl), Orwell (a historian), Barry (an effeminate man), Patricia (a proper British woman), Hedwig (a nine-year-old boy), Ian and Mary Reynolds (Irish twins), Dennis (a perverted man suffering from OCD), Norma (a Southern woman), Luke (a Southern man who spoils movies), and Mr. Pritchard (a professor of Japanese cinema)).Vigilante superhero David Dunn (Bruce Willis) and his now-grown son Joseph (Spencer Treat Clark), who have been working together to take down criminals with David taking on the name of \"The Overseer\" (An indestructible security guard with superhuman strength and stamina, as well as an extrasensory ability to see the crimes people have committed by touching them), set out to save four cheerleaders Kevin has abducted. Kevin's malignant psychopathic psyche is on the verge of Cannibalistically feeding upon his captives until David comes across him, and his presently in control alter ego, \"Hedwig\".Discerning the cheerleaders' location using his extrasensory perception, David frees the cheerleaders but is attacked by Kevin's superhuman alter ego, \"The Beast\". Their ensuing fight reaches outside the warehouses on public streets, where a seemingly specialized branch of the Philadelphia Police Department, led by Dr. Ellie Staple (Sarah Paulson) (A psychiatrist specializing in delusions of grandeur who treats patients convinced they are superhuman beings. She is a member of a secret society that covers up the existence of super-humans from the rest of the world even resorting to murder if necessary), activates a machine that flashes a set of hypnotic lights, forcing \"The Beast\" to switch identities. Staple convinces David to surrender, and both David and Kevin are arrested.David and Kevin are sent to the mental institution for the criminally insane. Also being held there is Elijah Price (Samuel L. Jackson), David's sworn arch enemy, who is known as \"Mr. Glass\" (A super-humanly intelligent mass murderer and comic book theorist with Type I Osteogenesis Imperfecta, who was institutionalized after Dunn discovered his crimes). Staple, the head doctor of the mental institution, states that she specializes in working with patients who claim to have special powers, and that she has been given three days to persuade David, Kevin, and Elijah that they are \"normal\" people who simply believe they have superpowers. Staple also knows that David's alleged weakness is water and has the same machine that forces the Horde to switch identities installed in Kevin's room, automatically activating whenever hostility is detected, effectively disarming the Beast.Joseph, Mrs. Price (Charlayne Woodard) (Elijah's mother), and Casey Cooke (Anya Taylor-Joy) (who survived an attack from the Beast) all visit at separate times to aid their associates, but ultimately fail. As part of her final evaluation, Staple puts the three patients in one room and begins to slowly chip away at David and the Horde's belief in their abilities as being supernatural or superhuman. Though Elijah has been heavily sedated throughout his stay, Staple reveals that his MRI results show irregularities in the frontal lobe of his brain, which she believes could explain his obsession with proving the existence of super-powered humans.The evaluation attracts Elijah, who has been discreetly swapping out his medication with aspirin and faking his sedated state, to the Beast. That night, Elijah breaks into the Horde's cell to prepare them for the Beast's awakening but is captured and has laser surgery performed on his brain to lobotomize him. However, Elijah had anticipated this and had previously sabotaged the surgical laser, causing it to have no effect on him; he escapes captivity by slitting an orderly's throat, and sets off to awaken the Beast. Elijah convinces the Beast to battle David during the public unveiling of the city's new highest tower to revive the Horde's faith and reveal the existence of super-humans to the world, before turning his attention to David and forcing him to accept the truth of his superhuman abilities to escape, lest Elijah destroy the tower in place of the showdown. David, Kevin and Elijah are all able to escape from the hospital. David and the Beast face off again outside of the hospital and are evenly matched until Staple intervenes. Staple orders her team of Philadelphia Police Department officers to subdue each of the super-humans, but David and the Beast fend them off.Elijah informs the Beast that David's mortal weakness is water, but Joseph intervenes and reveals to the Beast Elijah orchestrated the terrorist train attack that murdered Kevin's father, the same train crash that Elijah caused to find David. After Kevin's father died, his abusive mother began torturing him, thus leading to the creation of The Beast and his other Dissociative identities. The Beast thanks Elijah for creating him, but because his purpose is to protect Kevin, the Beast mortally wounds Elijah and throws David into a water tank and begins to strangle him.David summons enough strength to escape but is critically weakened by the water. The Beast retreats and promises to finish him off at the tower. However, Casey confronts the Beast before he can escape and summons the real Kevin to take control by speaking his full name. Without the Beast's superhuman strength and durability to protect him, Staple orders an officer to shoot Kevin. Kevin is granted full custody of \"The Light\" by his other personalities and dies in Casey's arms.Staple's men then overpower the weakened David and drown him in a flooded pothole. Staple lets David touch her as he dies, granting him a vision of her being covertly part of a clandestine society that covers up the existence of superhuman beings from the rest of the world. Staple tells him that if she had successfully brainwashed him into thinking he was normal, she would have left him alone, but the Beast ruined that, and she will now resort to murder in order to silence him. As Elijah finally dies of his wounds, Staple reveals to him a global conspiracy that has masterminded the suppression, pacification and genocide of superhuman heroes and villains for over 10,000 years in order to protect modern civilization from what they fear would become the tyranny of living \"gods\" over \"men\". With Elijah, Kevin and David dead, Staple deletes the security footage and reports her mission as a success.Unbeknownst to Staple, the cameras around the mental institution had previously been hacked by Elijah and had been live streaming to a private network. Shortly thereafter, Mrs. Price, Joseph and Casey all receive a copy of the footage, and choose to release it online, bringing the existence of super-humans to the awareness of the public."
}