{
	"title": "Green Book",
	"release_year": "2018",
	"runtime": "130",
	"tags": [
		"Biography",
		"Comedy",
		"Drama",
		"amazon",
		"netflix"
	],
	"rating": 8.2,
	"actors": [
		"Viggo Mortensen",
		"Mahershala Ali",
		"Linda Cardellini",
		"Sebastian Maniscalco",
		"Dimiter D. Marinov",
		"Mike Hatton",
		"P.J. Byrne",
		"Joe Cortese",
		"Mary Agnes Nixon",
		"Von Lewis"
	],
	"staff": [
		"Peter Farrelly",
		"Nick Vallelonga",
		"Brian Hayes Currie",
		"Peter Farrelly",
		"Jim Burke",
		"Brian Hayes Currie",
		"Peter Farrelly",
		"Nick Vallelonga",
		"Kris Bowers",
		"Sean Porter",
		"Patrick J. Don Vito",
		"Rick Montgomery",
		"Tim Galvin"
	],
	"votes": 591626,
	"cover": "https://m.media-amazon.com/images/M/MV5BYTMxMzNlMDYtYzhlMS00ODMxLWFlM2MtY2U4NzJmOGM3ZTljXkEyXkFqcGc@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "In 1962, New York City bouncer Frank \"Tony Lip\" Vallelonga (Viggo Mortensen) is searching for new employment after the nightclub he works at is closed for renovations. Tony is racist (he refers to African Americans as eggplants), while his wife Dolores (Linda Cardellini) is not. Johnny (Sebastian Maniscalco) is Dolores' brother.\nTony lives in a small apartment, with a large joint Italian family.Tony made friends with mafia family head Gio Loscudo (Joseph Cortese) when he came to the club and check in his beloved hat with the coat check girl. Tony took the hat and later returned it to Loscudo after he had threatened to burn the club down. Loscudo thanks Tony and makes him a friend.\nTo make money Tony enters a hot dog eating competition at a local restaurant who is offering $50 to the winner. Tony eats 26 and wins.He is invited to an interview with \"Doc\" Don Shirley (Mahershala Ali), an African American pianist who is looking for a driver for his eight-week concert tour through the Deep South. Don proposes to hire Tony on the strength of his references and the fact that Tony had a wealth of experience across various professions and had the ability to deal with trouble. Amit (Iqbal Theba) is Don's servant.Tony lies that he has no issues working for an African American. The job pays $100 per week plus room and board. Don says that he wants Tony to be his driver, his personal assistant and his valet. Tony demands $125 per week and refuses to be Don's butler, but Don sends him back home.\nMeanwhile, a customer that Tony roughed up at the club turns out to be a big shot and the owner of the club is reluctant to let Tony back in. Tony has to pawn his watch for $50 to pay for expenses at home.\nThe next morning Don calls Tony's home and speaks to Dolores. Don agrees to Tony's terms and takes Dolores' permission to take Tony away for 8 weeks. Dolores asks Tony to write to her regularly.Oleg (Dimiter D. Marinov) is the cellist and George (Mike Hatton) is the bassist in Don's band.\nThey embark with plans to return to New York on Christmas Eve. Tony is given a copy of the Green Book by Don's record studio: a guide for African American travelers to find motels, restaurants, and filling stations that would serve African Americans.They begin the tour in the Midwest, and their first stop is Pittsburgh, before eventually heading further south. Tony and Don initially clash; as Tony feels uncomfortable being asked to act with more refinement, while Don is disgusted by Tony's habits (urinating by the wayside, not trusting Don at all, Gambling, Cursing, Diction, stealing, smoking). Tony decides to wait outside Don's performances when Don says that the organizers would want to introduce Tony, and his full name would be difficult for them. Don wanted Tony to shorten his surname, which he refused. Instead, Tony gathered all the drivers outside and started a gambling game.As the tour progresses, Tony is impressed with Don's talent on the piano, and increasingly appalled by the discriminatory treatment the latter receives by their hosts and the general public when he is not on stage.\nA group of white men threaten Don's life in a bar and Tony rescues him. He instructs Don not to go out without him for the rest of the tour.\nThroughout the journey, Don helps Tony write letters to his wife, which deeply move her. Tony encourages Don to get in touch with his own estranged brother, but Don is hesitant, observing that he has become isolated by his professional life and achievements.Don is found in a gay encounter with a white man at a YMCA pool and Tony bribes the officers to prevent the musician's arrest. Don is upset that Tony \"rewarded\" the officers for their treatment. Later, the two are arrested after a police officer pulls them over late at night in a sundown town and Tony punches him after being insulted.While they are incarcerated, Don asks to call his \"lawyer\", and uses the opportunity to reach Attorney General Robert F. Kennedy, who orders the governor to release them. Tony is amazed by the experience, while Don is humiliated. This leads to an argument where Tony angrily considers himself \"more African American\" than Don. Having reached his breaking point, Don laments to Tony that his affluence prevents him from identifying with people of his race while his race prevents him from being accepted by white people, making him feel truly alone in the world. They eventually find a hotel for the night and manage to reconcile.On the night of the final performance on tour in Birmingham, Alabama, Don is refused entry into the whites-only dining room of the hotel venue. Tony threatens the owner, and Don refuses to play since they refuse to serve him in the room with his audience. He and Tony then go to a predominantly African American blues club where Don rouses the crowd with his music, where Don joins the band on piano.The pair head north in an attempt to make it home by Christmas Eve but are caught in a blizzard. They are then once again pulled over by a police officer. Worried they are about to get the same treatment; both are surprised when the officer turns out to be friendly and only pulled them over because he noticed one of their tires was flat. The officer then helps them fix the tire (and Don takes over the driving duties when Tony is too tired) and they are able to make it home.Tony invites Don to have dinner with his family, but Don declines. Sitting alone at home, he changes his mind and returns to Tony's, where he receives a surprisingly warm welcome by Tony's extended family.Don continued to tour and create music, while Tony went back to his work at the Copacabana, and that they remained friends until dying months apart in 2013.",
	"links": [
		"https://www.amazon.com/Green-Book-Viggo-Mortensen/dp/B07KFRF1X5",
		"https://www.netflix.com/title/81013585"
	],
	"netflix": [
		"canada",
		"japan",
		"malaysia",
		"philippines",
		"singapore",
		"thailand",
		"turkey"
	]
}