{
	"title": "Mamma Mia! Here We Go Again",
	"release_year": "2018",
	"runtime": "114",
	"tags": [
		"Comedy",
		"Musical",
		"Romance"
	],
	"rating": 6.6,
	"actors": [
		"Lily James",
		"Amanda Seyfried",
		"Meryl Streep",
		"Cher",
		"Andy Garcia",
		"Celia Imrie",
		"Alexa Davies",
		"Jessica Keenan Wynn",
		"Dominic Cooper",
		"Julie Walters"
	],
	"staff": [
		"Ol Parker",
		"Ol Parker",
		"Richard Curtis",
		"Catherine Johnson",
		"Judy Craymer",
		"Judy Craymer",
		"Gary Goetzman",
		"Benny Andersson",
		"Anne Dudley",
		"Björn Ulvaeus",
		"Robert D. Yeoman",
		"Peter Lambert",
		"Kathleen Chopin",
		"Nina Gold",
		"John Frankish",
		"Alan Macdonald"
	],
	"votes": 111564,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjEwMTM3OTI1NV5BMl5BanBnXkFtZTgwNDk5NTY0NTM@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "Sophie Sheridan (Amanda Seyfried) is preparing for the grand reopening of her mother Donna's (Meryl Streep) hotel, who passed away a year earlier. She is upset because two of her fathers, Harry (Colin Firth) and Bill (Stellan Skarsgård), are unable to make it to the reopening and she is having trouble in her marriage to Sky (Dominic Cooper), who is in New York, over her memorializing her mother's life.In 1979, a young Donna is getting ready to travel the world (she is a bit angry that her mom Ruby didn't come to her graduation). Tanya and Rosie are her best friends from college, and they call themselves the \"Dynamos\". While in Paris, she meets and parties with Harry (she sleeps with Harry as well, as he admits he is a virgin). She later misses her boat to Kalokairi (Greece, where she admits to Tanya and Rosie that she thinks she will find her calling) but is offered a ride by Bill, and along the way, they are able to help a stranded fisherman make it in time to stop the love of his life from marrying another. Unbeknownst to Donna, Harry has followed her to Greece; but he arrived too late, and sadly watches the boat sailing off in the distance.In the present, Tanya (Christine Baranski) and Rosie (Julie Walters) arrive to support Sophie with the reopening, and it's revealed that Rosie and Bill have split up. Sophie then visits Sam (Pierce Brosnan), who is still grieving over the death of Donna.\nBack in the past, Donna arrives on the island and while exploring the farmhouse, a sudden storm causes her to discover a spooked horse in the basement. She goes in search of help only to find a young Sam riding his motorcycle and he helps her to save the horse.\nBack to the present, a storm has caused serious disruption to Sophie's plans for the grand reopening and prevented media coverage of the event.Back in the past, Donna and Sam are enjoying a whirlwind romance (Donna shares with Sam that she wants to stay on the Island and admits that she wants to share that life with Sam. Eventually Donna has sex with Sam) that ends when Donna discovers a picture of Sam's fiance in his drawer. A devastated Donna instructs Sam to leave the island.\nIn the present, Sam tells Sophie about her value to her mother. Meanwhile, Harry leaves his business deal in Tokyo to support Sophie, and separately Bill gets the same idea. Bill and Harry meet at the docks but are told there are no boats. However, Bill meets the fisherman Alexio (Gerard Monaco) and thereby secures boat passage for himself, Harry as well as the newly arrived Sky. Bill also ends up inviting the entire fishing village to Sophie's party.In the past, a depressed Donna is heartbroken over Sam but is able to channel her anger into singing with Tanya and Rosie. She meets Bill again, who has come to see Donna, and they go out on his boat (Rosie takes a liking to Bill and is secretly madly in love with him); while they are gone (and having sex), Sam returns, having recently ended his engagement for Donna, but is saddened to hear that she is with another man and leaves the island again. Donna discovers she is pregnant but has no idea which one of her three recent lovers is the father. Sofia (Maria Vacratsis), the mother of the owner of the bar where Donna and the Dynamos performed, overhears Donna's wish to stay on the island, and offers to let Donna live at her farmhouse and Donna happily accepts. It is there that she eventually gives birth to Sophie.Back in the present, the guests have arrived at the party and Sophie is reunited with her other two fathers and Sky. Sophie reveals to Sky she is pregnant and has never felt closer to her mother, having now understood what her mother went through. Bill and Rosie reunite over their grief for Donna. Sophie's estranged grandmother and Donna's mother, Ruby (Cher), arrives despite Sophie deciding not to invite her. She reveals that Sky tracked her down in New York and she wants to build a real relationship with Sophie. Sophie then performs a song with Tanya and Rosie in honor of her mother, with her grandmother tearfully telling her afterward how proud she is of her. It is then revealed that the manager of the hotel, Fernando, is Ruby's (Andy García) ex-lover from 1959 in Mexico, and the two are joyously reunited.\nNine months later, Sophie has given birth to a baby boy, and everyone has gathered for his christening where Tanya flirts with Fernando's brother. The ceremony takes place with Donna's spirit watching over her daughter with pride. All the characters, including Donna and the younger cast, sing \"Super Trouper\" at a huge party at Hotel Bella Donna.",
	"links": []
}