{
	"title": "A Simple Favor",
	"release_year": "2018",
	"runtime": "117",
	"tags": [
		"Comedy",
		"Crime",
		"Mystery",
		"amazon",
		"netflix"
	],
	"rating": 6.8,
	"actors": [
		"Anna Kendrick",
		"Blake Lively",
		"Henry Golding",
		"Andrew Rannells",
		"Ian Ho",
		"Joshua Satine",
		"Glenda Braganza",
		"Kelly McCormack",
		"Aparna Nancherla",
		"Jiah Mavji"
	],
	"staff": [
		"Paul Feig",
		"Darcey Bell",
		"Jessica Sharzer",
		"Paul Feig",
		"Jessie Henderson",
		"Theodore Shapiro",
		"John Schwartzman",
		"Brent White",
		"Ben Harris",
		"Allison Jones",
		"Jefferson Sage"
	],
	"votes": 168923,
	"cover": "https://m.media-amazon.com/images/M/MV5BODczZDMxNmItNjNlZi00ZmI4LTlkZWQtZDljNWZhZjc3OWNiXkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "Stephanie Smothers (Anna Kendrick) is a widowed single mother who runs a Vlog with crafts and recipes. Emily (Blake Lively) is a busy working mother, a PR director for a fashion company, whose son Nicky (Ian Ho) attends the same elementary school as Stephanie's son, Miles (Joshua Satine). Stephanie is an overeager parent and volunteers for all the school events and the other parents resent that this makes them look bad. Meanwhile, Emily is never even found near any of the school events.\nStephanie meets Emily when she comes to the school to pick up Nicky.Emily and Stephanie become fast friends, arranging play dates for the boys. Emily is flamboyant and every possession in her life has an adventurous story behind it. While Stephanie is a plain and simple housewife, and lives for the sake of her son.\nStephanie's husband died in a car accident and her brother Chris was in the passenger seat.They trade confessions, and Stephanie admits that as a teenager, she had sex with her half-brother, Chris (Dustin Milligan) at her father's funeral. She says that her husband had life insurance, but when Miles goes to college, the money would run out in 2020.\nEmily expresses her frustration at the lack of success of her husband, English professor Sean Townsend (Henry Golding), and their poor financial situation. Sean wrote a book 10 years ago and was the toast of the town, and that's when Emily fell in love with him. But he hasn't written anything ever since. They bought their house in the bubble at inflated prices and not cannot sell it without taking a substantial loss. Stephanie notices a portrait of Emily in her house that she claims was painted by Diana Hyland.Emily says that they are on the verge of bankruptcy. Stephanie offers to babysit Nicky anytime Emily needs. Stephanie takes Emily's picture, but she asks her to delete it.Emily has a work crisis and asks Stephanie to babysit Nicky, as Sean is in London. After two days of Emily not responding to calls, Stephanie calls her employer, Dennis Nylon (Rupert Friend), and he tells her she is in Miami and is gone for a few days. Stephanie calls Sean (who was in London taking care of his mother who had recently broken her hip), who calls the police.\nSean confirms that Emily had no siblings and her parents died when she was young. Emily had told both Stephanie and Sean that she hates having her picture taken, leading Stephanie to sneak into Emily's work and find a photo, which she uses to create missing person posters.Detective Summervile (Bashir Salahuddin) reports that Emily lied about Miami, and that she rented a car in Michigan. A fan of Stephanie's Vlog reports seeing Emily in Michigan, and the car is discovered near a summer camp, where police find her drowned body in the lake.\nSoon, Sean organizes a funeral for Emily and life moves on.\nStephanie and Sean develop a bond through grief and taking care of the boys, which turns into a relationship (as Stephanie and Sean end up having sex with each other) and Stephanie moves in with him. Detective Summervile later reveals to Stephanie that Emily had severe liver damage, a large amount of heroin in her system, and that Sean had recently taken out a $4 million life insurance policy on Emily.\nOne day Nicky says that he saw Emily at school. Stephanie is suspicious as she can smell Emily's perfume on Nicky as he has the friendship bracelet that she made for Emily.\nSean tells Stephanie that Emily was a pathological liar. She stole his mother's family engagement ring and refused to give it back. She lied to Stephanie about having a threesome with Sean and his Teaching Assistant. She took out the extra $ 4 million insurance policy when she learned from Stephanie that she was living off the insurance money.Emily, alive and in hiding, sends Stephanie an insulting message about her tryst with Chris, causing Stephanie to recall how her husband, Davis (Eric Johnson), suspected the relationship, and questioned the paternity of Miles. He confronted Chris during a car ride, which resulted in a crash that killed them both.Stephanie investigates Emily's past, speaking to Diana Hyland (Linda Cardellini), an artist who painted a portrait of Emily. Diana says the girl in the painting is Claudia, her muse, and describes her as a con artist who disappeared after making her pay for her college and related expenses during the time she modeled for Diana.\nStephanie asks about Michigan, and Diana gives Stephanie information that leads Stephanie to a yearbook showing that Emily has a twin sister, and that their real names are Hope and Faith McLanden. Stephanie meets with the twins' mother, Margaret (Jean Smart), who explains that when they were 16 years old, the twins set fire to a wing of the house.\nMeanwhile, Emily surprises Sean at a cafe and tells him about her plan to collect the insurance money to resolve their financial issues.Stephanie lures Emily into meeting her through cryptic messages on her Vlog. Emily explains that she is Hope, and that the twins set the fire to kill their abusive father. The two fled and planned to rejoin later, but Faith never appeared. Emily worked hard building a career and a family when, 16 years later, Faith contacted her.\nFaith attempted to blackmail her for a million dollars, threatening to confess about the arson, so Emily drowned Faith in the lake. Emily lies and tells Stephanie that Sean planned the insurance scam.Emily is angered by Sean's love for Stephanie, while Stephanie is angered by Sean's eagerness to protect Emily when Stephanie calls the Insurance agent to tell them that the body might be of Emily's twin sister.\nStephanie agrees to help Emily reappear to the public and frame Sean. Sean is arrested and released on bail. Stephanie has a change of heart and stages a fake argument with Sean in front of Emily to incriminate her, while police-planted microphones are recording. Emily predicts their ruse and has disabled the microphones.\nEmily confesses to the crimes, and holds the pair at gunpoint, telling them she will kill them and stage a murder-suicide. She shoots Sean in the shoulder and turns the gun on Stephanie - who reveals that she has a hidden camera live-streaming the entire event on her Vlog. Emily is arrested.Closing text explains that Emily was sentenced to 20 years in prison, Sean became a successful professor at a major university, Stephanie's Vlog has one million followers, and she has become a part-time private detective.",
	"links": [
		"https://www.amazon.com/Simple-Favor-Jean-Smart/dp/B07VNV7669",
		"https://www.netflix.com/title/80988896"
	]
}