{
	"title": "Once Upon a Time in... Hollywood",
	"release_year": "2019",
	"runtime": "161",
	"tags": [
		"Comedy",
		"Drama",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Leonardo DiCaprio",
		"Brad Pitt",
		"Margot Robbie",
		"Emile Hirsch",
		"Margaret Qualley",
		"Timothy Olyphant",
		"Julia Butters",
		"Austin Butler",
		"Dakota Fanning",
		"Bruce Dern"
	],
	"staff": [
		"Quentin Tarantino",
		"Quentin Tarantino",
		"David Heyman",
		"Shannon McIntosh",
		"Quentin Tarantino",
		"Robert Richardson",
		"Fred Raskin",
		"Victoria Thomas",
		"Barbara Ling"
	],
	"votes": 868789,
	"cover": "https://m.media-amazon.com/images/M/MV5BMzMzNmViNjYtN2ViNi00NDM3LWFlMmItNDYyMGIzY2EzZjE2XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In February 1969, Hollywood actor Rick Dalton (Leonardo DiCaprio), former star of 1950s Western television series Bounty Law, laments to his best friend and former stunt double, Cliff Booth (Brad Pitt), that his career is over. Dalton has lunch with Producer and Agent Marvin Schwarz who makes Dalton realize that playing a guest negative role in new network shows is going to ruin his career. Dalton realizes that he officially is designated as a \"has been\". Booth (a war veteran who lives in a trailer with his pit bull, Brandy) drives Dalton around town and relies on him for work due to rumors that Booth killed his wife (and hence no producer would directly work with Booth due to his reputation).\nMeanwhile, actress Sharon Tate (Margot Robbie) and her husband, director Roman Polanski (Rafal Zawierucha), have moved into the house next door to Dalton's. Dalton dreams of befriending the couple in order to restore his status as a movie lead. Later that night, Tate and Polanski join Jay Sebring (Emile Hirsch) (a Hollywood hairstylist and friend and ex-boyfriend of Tate) at a celebrity-filled party at the Playboy Mansion.At Dalton's house, Booth reminisces on a sparring match he had on the set of The Green Hornet with Bruce Lee (Mike Moh). Charles Manson (Damon Herriman) stops by the home of Polanski and Tate looking for record producer Terry Melcher, who used to live there, but is turned away by Sebring. Later, while driving Dalton's car, Booth picks up a young hitchhiker called \"Pussycat\" (Margaret Qualley), dropping her off at Spahn Ranch, where Booth once filmed Bounty Law. \"Pussycat\" tries to persuade Booth to stay, but he is suspicious of the large number of hippies squatting on the property, and suspects they are taking advantage of the owner, George Spahn (Bruce Dern) (an 80-year-old nearly blind man who rented his ranch out for Westerns. Charles Manson convinced Spahn to allow him and his followers to live on the ranch). Booth insists on checking on Spahn despite \"Squeaky\"'s (Dakota Fanning) objections; Spahn dismisses Booth's fears.Returning to the car, Booth discovers that Clem Grogan (James Landry Hébert) has slashed the front tire; Booth brutally beats Grogan and forces him to change the tire. One of the Manson girls, Sundance (Cassidy Vick Hice), goes to fetch Tex Watson (Austin Butler), but by the time Watson arrives on horseback Booth is driving away. Tate goes for a walk and decides to stop at a movie theater to watch herself in The Wrecking Crew.Dalton lands the role of a villain in a new series, Lancer where he strikes up a conversation with his eight-year-old co-star, Trudi (Julia Butters). During one of his scenes, Dalton struggles with his dialogue due to his alcoholism. After having an emotional breakdown in his trailer, Dalton returns to the set and delivers a powerful performance that impresses the director, Sam Wanamaker (Nicholas Hammond), and Trudi, bolstering Dalton's confidence.After watching Dalton's guest performance on an episode of The F.B.I., casting agent Marvin Schwarz (Al Pacino) offers Dalton the opportunity to shoot a Spaghetti Western in Italy. Dalton, who considers Spaghetti Westerns to be the bottom of the movie industry, reluctantly agrees, bringing Booth with him for the six-month stint. Dalton films four movies, including Nebraska Jim with Sergio Corbucci, and gets married.Returning to Los Angeles, Dalton informs Booth he can no longer afford his services, and they agree to go their separate ways. They go out for drinks and return to Dalton's home, where Booth smokes an acid-laced cigarette and takes Brandy for a walk. Meanwhile, Tex Watson, Susan Atkins (Mikey Madison), Linda Kasabian (Maya Hawke), and Patricia Krenwinkel (Madisen Beaty) park outside, in their loud 1959 Ford Galaxie, in preparation to murder everyone in Tate's house (their cult leader apparently had told Tex Waton to go to \"Terry's old house\" (where Tate now stays) and kill everyone inside). Dalton hears the car, comes out, and angrily orders them to leave.They drive off, but Atkins hatches a plan to return and kill Dalton instead. Kasabian deserts the group and the remaining three proceed with Atkins' plan. They break into Dalton's house and confront Booth, who recognizes them from Spahn Ranch. Booth orders Brandy to attack, and together they kill Krenwinkel and Watson and severely injure Atkins. Atkins, gun in hand, stumbles outside, alarming Dalton, who was listening to music on headphones and oblivious to the mayhem inside. Dalton retrieves a flamethrower he had kept from a film shoot and incinerates Atkins. Booth is taken to the hospital for injuries. Sebring engages Dalton in conversation and Tate, over the intercom, invites Dalton up to her house for drinks with her still-alive house-guests, Sebring, Abigail Folger (Samantha Robinson) and Wojciech Frykowski (Costa Ronin).",
	"links": [
		"https://www.amazon.com/Once-Upon-Hollywood-Leonardo-DiCaprio/dp/B07VF3XQCW"
	]
}