{
	"title": "The Zone of Interest",
	"release_year": "2023",
	"runtime": "105",
	"tags": [
		"Drama",
		"History",
		"War",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Christian Friedel",
		"Sandra Hüller",
		"Johann Karthaus",
		"Luis Noah Witte",
		"Nele Ahrensmeier",
		"Lilli Falk",
		"Anastazja Drobniak",
		"Cecylia Pekala",
		"Kalman Wilson",
		"Medusa Knopf"
	],
	"staff": [
		"Jonathan Glazer",
		"Jonathan Glazer",
		"Martin Amis",
		"Ewa Puszczynska",
		"James Wilson",
		"Mica Levi",
		"Lukasz Zal",
		"Paul Watts",
		"Simone Bär",
		"Alexandra Montag",
		"Magdalena Szwarcbart",
		"Chris Oddy"
	],
	"links": [
		"https://www.amazon.com/Zone-Interest-Christian-Friedel/dp/B0CQKQM8D8"
	],
	"votes": 109541,
	"cover": "https://m.media-amazon.com/images/M/MV5BNjk4MTQ3MGEtZmI4OS00N2NhLWI5ZjgtYWE5ZWVkZGExYTQ1XkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg",
	"description": "In 1943, Rudolf Höss, commandant of the Auschwitz concentration camp, lives with his wife Hedwig and their five children in an idyllic home next to the camp. Höss takes the children out to swim and fish, and Hedwig spends time tending the garden. Servants handle chores and the prisoners' belongings are given to the family. Beyond the garden wall, gunshots, shouting and sounds of trains and furnaces are audible. Höss approves the design of a new crematorium, which will soon become operational. Höss notices human remains in the river. He gets his children out of the water and sends a note to camp personnel, chastising them for their carelessness. It is implied that he has sexual relations with prisoners in his office. Meanwhile, a Polish girl who lives nearby sneaks out every night, hiding food at the prisoners' work sites for them to find and eat. Höss receives word that he is being promoted to deputy inspector of all concentration camps and must relocate to Oranienburg, near Berlin. He objects to no avail and withholds the news from Hedwig for several days. Hedwig, deeply attached to their home, begs him to convince his superiors to let her and the children remain. The request is approved and Höss moves. Hedwig's mother comes to stay but is horrified at the sight of the crematorium flames at night and departs, leaving behind a note that an irate Hedwig burns after reading. Months after arriving in Berlin, in recognition of his work, Höss is tasked with heading an operation named after him that will transport 700,000 Hungarian Jews to Auschwitz to be killed. This allows him to move back to Auschwitz and reunite with his family. He vacantly attends a party celebrating the operation and confesses to Hedwig over the phone that he spent his time there thinking about the most efficient way to gas the room. As Höss leaves his Berlin office descending a stairway, he stops and retches repeatedly and stares into the darkness. In the present day, a group of janitors clean the Auschwitz-Birkenau State Museum. Back in 1943, Höss proceeds downstairs."
}