{
	"title": "BlacKkKlansman",
	"release_year": "2018",
	"runtime": "135",
	"tags": [
		"Biography",
		"Comedy",
		"Crime",
		"amazon"
	],
	"rating": 7.5,
	"actors": [
		"John David Washington",
		"Adam Driver",
		"Laura Harrier",
		"Topher Grace",
		"Alec Baldwin",
		"Isiah Whitlock Jr.",
		"Robert John Burke",
		"Brian Tarantina",
		"Arthur J. Nascarella",
		"Ken Garito"
	],
	"staff": [
		"Spike Lee",
		"Charlie Wachtel",
		"David Rabinowitz",
		"Kevin Willmott",
		"Spike Lee",
		"Jason Blum",
		"Spike Lee",
		"Raymond Mansfield",
		"Sean McKittrick",
		"Terence Blanchard",
		"Chayse Irvin",
		"Barry Alexander Brown",
		"Kim Coleman",
		"Curt Beech"
	],
	"votes": 295409,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjUyOTE1NjI0OF5BMl5BanBnXkFtZTgwMTM4ODQ5NTM@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In the early 1970s, Ron Stallworth (John David Washington) is hired as the first African American officer in the Colorado Springs, Colorado police department. Stallworth is initially assigned to work in the records room, where he faces racial slurs from his coworkers. Stallworth requests a transfer to go undercover and is assigned to infiltrate a local rally at which national civil rights leader (African American guy) Kwame Ture (Corey Hawkins) (birth name Stokely Carmichael) is to give a speech. Police is worried that Kwame will instigate the local African Americans in the area to fight for their civil rights. At the rally, Stallworth meets Patrice Dumas (Laura Harrier), the president of the African American student union at Colorado College. While taking Ture to his hotel, Patrice is stopped by patrolman Andy Landers (Frederick Weller), a corrupt, racist officer in Stallworth's precinct, who threatens Ture and sexually assaults Patrice.After the rally, Stallworth is reassigned to the intelligence division (after he reports the sexual assault of Patrice to his chief and he brushes him away saying he is a rookie). While reading the paper, he finds an advertisement to join the Ku Klux Klan. Stallworth calls and pretends to be a European American man, and speaks with Walter Breachway (Ryan Eggold), the president of the Colorado Springs chapter. Stallworth recruits (has to go back to his chief again and beg for white man to play him in person, with the Klan) his Hewbrew coworker, Flip Zimmerman (Adam Driver), to act as him in order to meet the Ku Klux Klan members in person. Zimmerman attends a meeting and meets Walter, along with the more reckless member Felix Kendrickson (Jasper Pääkkönen). Zimmerman also speaks with another member named Ivanhoe (Paul Walter Hauser), who cryptically refers to an upcoming attack.Zimmerman and Stallworth continue to cultivate their relationship with the local Klan chapter. Calling Klan headquarters in Louisiana to expedite his membership, Stallworth speaks with David Duke (Topher Grace), the Grand Wizard, with whom he begins regular conversations on the phone. At that point, David Duke is considered to be one of the men running for the President of the USA and hence a BIG deal. Kendrickson suspects Zimmerman of being Hebrew and plans to make him take a polygraph test at gunpoint, but Stallworth throws a rock through the Kendrickson family window to distract the Klansmen. Stallworth begins dating Patrice but does not tell her that he is a police officer. After passing on information to the Army CID about active-duty members, he learns from a meeting with an FBI agent that two of the chapter's members are military personnel stationed at NORAD headquarters.\nStallworth and Zimmerman have a lucky escape when one day Felix turns up at the real Stallworth's apartment, after looking up at the address in the phone-book. But Zimmerman is able to talk his way out of it.Duke visits Colorado Springs for Stallworth's induction into the Klan; over the real Stallworth's protests, he is assigned to a protection detail for Duke. After Zimmerman, masquerading as Stallworth, is initiated, Felix's wife Connie (Ashlie Atkinson) leaves the ceremony to place a bomb at Patrice's house during the civil rights rally. Stallworth realizes her intentions and alerts local police officers. Acting on Felix's backup plan, Connie tries to plant the bomb in Patrice's mailbox; finding that it will not fit, she leaves it under Patrice's car instead. Stallworth tackles her as she tries to flee, but uniformed officers detain and beat him despite his protests that he is working undercover. Felix, Ivanhoe, and bomb maker Walker (Nicholas Turturro) (who had recognized Zimmerman from a prior arrest and conviction) arrive and park next to Patrice's car. They set off the bomb, not knowing where Connie had hidden it, and are killed in the explosion. Zimmerman arrives and frees Stallworth, and Connie is arrested. While celebrating the closed case that night, Stallworth wears a hidden microphone and tricks a drunken Landers into bragging about his assault on Patrice; with the confession on tape, Landers is arrested.Police Chief Bridges congratulates the team for their successful operation but orders them to end it and keep all details from the public. As he is packing up, Stallworth receives one last call from Duke. Stallworth reveals to Duke that he is a African American man before hanging up as Zimmerman and the others watch on, laughing at their victory. Later, Patrice and Stallworth discuss their future together. They are then interrupted by a knock on the door, but no one is there. Through the hallway window, they see a large flaming cross on a distant hillside surrounded by Klan members.\nThe film closes with footage from the 2017 Unite the Right rally in Charlottesville, Virginia, including footage of the white supremacists, David Duke giving a speech to the attendees, counter-protesters, the car attack, and President Trump's statements after the events.",
	"links": [
		"https://www.amazon.com/BlacKkKlansman-Spike-Lee/dp/B07G7DBTSN"
	]
}