{
	"title": "Sound of Freedom",
	"release_year": "2023",
	"runtime": "131",
	"tags": [
		"Biography",
		"Crime",
		"Drama",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"Jim Caviezel",
		"Mira Sorvino",
		"Bill Camp",
		"Cristal Aparicio",
		"Javier Godino",
		"Lucás Ávila",
		"Yessica Borroto Perryman",
		"Yessica Borroto Perryman",
		"Manny Perez",
		"Eduardo Verástegui",
		"Samuel Livingston"
	],
	"staff": [
		"Alejandro Monteverde",
		"Rod Barr",
		"Alejandro Monteverde",
		"Eduardo Verástegui",
		"Javier Navarrete",
		"Gorka Gómez Andreu",
		"Brian Scofield",
		"Deanna Brigidi",
		"Carla Hool",
		"Carlos Lagunas"
	],
	"votes": 121704,
	"cover": "https://m.media-amazon.com/images/M/MV5BNDljODMwODMtZDhhYi00OGUwLTg2YWEtNGJmY2Q2OGM0NWExXkEyXkFqcGc@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "In Tegucigalpa, Honduras, Roberto, a poor father of two, is approached by a former beauty queen, Gisselle. Gisselle offers to sign his young children, Miguel and Rocío, to child modeling contracts. He accepts and takes them to the photoshoot. However, when he returns to pick his children up, they are gone. It is revealed that the children were sold to be used as sex slaves.In Calexico, California, Tim Ballard is a Special Agent for the Homeland Security Investigations (HSI), where he arrests people who possess and distribute child pornography. The painful work takes a great toll on his personal life, and this is only worsened when another agent, Chris, points out that they have arrested many child predators, but have failed to save even a single child from being exploited. Tim explains that this is because most of them are in other countries, but Chris's words stick with him. He speaks to a predator he arrested, Ernst Oshinsky, and pretends to be a pedophile himself. Once he gains Ohinsky's trust, he sets up a meeting with a trafficked child, and is able to arrest the man who purchased the boy, Earl Buchanan.Tim rescues the boy, who says his name is Miguel. Tim befriends the child and asks him for information, hoping to find the other children. Tim learns that Miguel's sister is still missing, and the boy asks him to save her. Tim arranges for Roberto to get his son back, and Roberto breaks down because his daughter is still missing. Miguel and Roberto go home, but not before Miguel gives Tim his sister's Saint Timothy necklace. Tim starts looking for Rocío, and his search leads him to Cartagena, Colombia. He meets with former Cartel accountant, Vampiro, who now works to save children from sex trafficking.After reading about a child sex club in Thailand that was shut down, Tim decides that this is the perfect cover story to acquire a large number of Gisselle's children in a sting operation. Vampiro gets a Colombian police officer, Jorge, and a wealthy citizen named Paul to help with Tim's mission. Tim's HSI supervisor, Frost, is unable to provide funding for the operation, and asks him to return. Tim, unwilling to abandon the search for Rocío, resigns. However, Frost is eventually able to convince the Colombian U.S. Embassy to assist with Tim's rescue operation. Undercover, they convince Gisselle to sell them 54 children, successfully arrest all of the conspirators and free the children. However, Rocío is not with them.After interrogating one of Gisselle's associates, Jorge learns that Rocío was sold as a slave to the Revolutionary Armed Forces of Colombia, entrenched deep in the Amazon natural region behind enemy territory. Jorge informs Tim that there is no way to retrieve the girl, because the region is largely unmapped jungle wilderness, and any rebel territory is a no-fly zone for the Colombian government. However, Vampiro suggests that doctors can get into the region for medical purposes, which gives Tim the idea to pose as doctors. Jorge reluctantly agrees to the risky operation. Tim and Vampiro attempt to enter enemy territory in disguise, but the rebels refuse to let both of them enter, leaving Tim to complete the mission alone.Tim successfully gains access to the enemy camp where Rocío is being held. He learns that she is being used as the personal sex slave for the rebel leader, El Alacrán (\"the scorpion\"), and is also being forced to mash coca leaves to produce cocaine to fund the rebel war against the Colombian government. Tim manages to save Rocío, but is forced to kill El Alacrán in the process. Despite being shot at by the rebels, Tim narrowly manages to save Rocío and gives her the necklace Miguel gave him earlier. Rocío is finally returned her to her father and brother, and the family returns to Honduras.An epilogue reveals that Tim Ballard never returned to his career in federal law enforcement. He credits his wife with inspiring him to create Operation Underground Railroad, which continues to save children from sexual slavery to this day, and has convinced the United States Congress to pass laws that require the government to cooperate with foreign countries on sex trafficking investigations. The epilogue also states that there are more people enslaved today than in any other time in history, including when slavery was legal. Many of these slaves are children, and the United States is one of the top consumers of child sex slaves.",
	"links": [
		"https://www.amazon.com/Sound-Freedom-Jim-Caviezel/dp/B0CPV9P51K"
	]
}