{
	"title": "Searching",
	"release_year": "2018",
	"runtime": "102",
	"tags": [
		"Drama",
		"Mystery",
		"Thriller",
		"amazon"
	],
	"rating": 7.6,
	"actors": [
		"John Cho",
		"Debra Messing",
		"Joseph Lee",
		"Michelle La",
		"Sara Sohn",
		"Alex Jayne Go",
		"Megan Liu",
		"Kya Dawn Lau",
		"Dominic Hoffman",
		"Sylvia Minassian"
	],
	"staff": [
		"Aneesh Chaganty",
		"Aneesh Chaganty",
		"Sev Ohanian",
		"Timur Bekmambetov",
		"Sev Ohanian",
		"Natalie Qasabian",
		"Adam Sidman",
		"Torin Borrowdale",
		"Juan Sebastian Baron",
		"Nicholas D. Johnson",
		"Will Merrick",
		"Nicholas D. Johnson",
		"Will Merrick",
		"Lindsey Weissmueller",
		"Angel Herrera"
	],
	"votes": 182264,
	"cover": "https://m.media-amazon.com/images/M/MV5BYjA2ZTk3NDEtZDQ2Mi00MzhjLTgwZWYtOTBkMjUyMGYwMjI4XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In San Jose, California, David Kim (John Cho) looks through old photographs and videos of his daughter Margot (Michelle La) and his late wife Pamela (Sara Sohn). Pamela died from lymphoma nearly two years ago (Pamela went through a long illness and for a while it looked like she was in remission and she would survive), after which David and Margot became distant. Margot is a big fan of Pokemon and piano.As a regular teen attending High School, Margot has an online presence through social media and is digitally connected to all her friends. Margot spends more time with her friends and even David interacts with her through video calls and so on.\nDavid reads news on the internet how a trapped hiker survived 9 days in the mountains.One night, Margot goes to a friend's house for her study-group. While David sleeps, Margot attempts to call him three times.The next morning, David is unable to reach Margot but assumes she has risen early and gone to school. David's texts to Margot are unanswered and Margot's laptop is at home. Later, David calls Margot's piano instructor but is informed that Margot had canceled her lessons six months ago.\nDavid searches social media and finds that he doesn't have access to Margot's profiles, and so he logs in from Pamela's old laptop and finds that she has access.\nDavid discovers that Margot had been pocketing the money for the lessons, before suddenly transferring $2,500 to a deleted account on Venmo.Realizing that Margot is missing, David calls the police, and the case is assigned to Detective Rosemary Vick (Debra Messing), who asks for information about Margot's personality and friendships. David manages to access Margot's Facebook and speaks to her contacts but discovers that Margot has not had close friends since Pamela's death. Vick calls to report that Margot made a fake ID for herself and shows traffic-camera footage of Margot's car at a highway-juncture outside of the city, suggesting that Margot may have deliberately run away.David, unconvinced, discovers that Margot has been using a \"Vlogging\" site called YouCast and that she frequently spoke to a working-class girl named Hannah under the username \"fish-and-chips\". Vick investigates this, and reports back that fish-and-chips is innocent, having been sighted in Pittsburgh. From Margot's Instagram, David finds that Margot frequently visited Barbosa Lake, which is near the highway-juncture. He drives to the lake and finds Margot's Pokemon key-chain on the ground. The police arrive and discover Margot's car underwater and an envelope containing $2,500.A sweep of the surrounding area is conducted by the police and volunteers, but a thunderstorm slows the progress. Margot's body, however, is not found. After David has an altercation with a boy who claims to know where Margot is, Vick tells him he can no longer participate in the investigation.Undeterred, David visits TMZ, which displays the crime scene photographs. David reviews the crime-scene photographs and notices his brother Peter's (Joseph Lee) jacket in the car. He then discovers text messages between Peter and Margot suggesting that they were having an affair.When David drives to Peter's house to confront him, the latter explains that they were smoking marijuana together and accuses David of being an incompetent father who did not notice that his daughter was suffering from depression. The meeting is interrupted when Vick calls David, telling him that a former convict named Randy Cartoff (Ric Sarabia) has confessed in an online video to sexually assaulting and killing Margot, afterwards seemingly killing himself. An empty-casket funeral is arranged for Margot.As David is uploading photographs to a funerary video service, he notices that the website's stock photograph features the same woman as fish-and-chips' profile-picture, implying that fish-and-chips is a false identity. Discovering Hannah is a stock model, he contacts her, and she reveals she does not know Margot and the police never called her.Attempting to call Vick to report this, David instead reaches a dispatcher who inadvertently reveals that she volunteered to take the case, rather than was assigned to it. David searches for Vick using Google and finds that Vick knew Cartoff through a volunteer program for ex-convicts. He proceeds to report this to the sheriff, and at the funeral, Vick is arrested.A few days later, Vick has agreed to confess to murder and other crimes in exchange for leniency toward her son Robert (Steven Michael Eich), who was using the online identity fish-and-chips to get close to Margot, as he was attracted to her. Margot sent Robert $2,500, thinking that Robert was a working-class girl whose mother was hospitalized due to cancer. Ashamed for lying, Robert wanted to return the money in person and followed her to Barbosa Lake to reveal himself. During this meeting they fought, and Robert pushed Margot off a fifty-foot ravine.\nVick assumes that the accident was fatal and could be perceived as manslaughter or even first-degree murder.\nVick decided to cover up the incident, shoving the car into the lake and falsifying the story of the fake ID and of fish-and-chips in Pittsburgh. When David found the car, thereby invalidating the story of Margot having run away, Vick was forced to turn Cartoff into a scapegoat.Vick is arrested. As she is being transported to the jail, David asks her where Margot's body is, and Vick responds that Margot is in the ravine, and that even if she had survived the fall, she couldn't have lived without water for five days. David tells the police to turn the car around, pointing out that a storm occurred on the third day which would have provided Margot with water. At the ravine, the rescue crew discovers Margot severely injured but alive.Two years later, Margot applies for college to major in piano. David tells her Pamela would have been proud of her. Margot changes her desktop picture from one of Pamela and her to the one David sent her of the two of them in the hospital waiting room after the rescue, reflecting a closer relationship between them.",
	"links": [
		"https://www.amazon.com/Searching-John-NON-USA-Format-Region/dp/B07G1YNC3P"
	]
}