{
	"title": "Death on the Nile",
	"release_year": "2022",
	"runtime": "127",
	"tags": [
		"Crime",
		"Drama",
		"Mystery",
		"amazon"
	],
	"rating": 6.3,
	"actors": [
		"Tom Bateman",
		"Annette Bening",
		"Kenneth Branagh",
		"Russell Brand",
		"Michael Rouse",
		"Alaa Safi",
		"Orlando Seale",
		"Charlie Anson",
		"Danny Hughes",
		"Sam James Page"
	],
	"staff": [
		"Kenneth Branagh",
		"Michael Green",
		"Agatha Christie",
		"Kenneth Branagh",
		"Judy Hofflund",
		"Ridley Scott",
		"Kevin J. Walsh",
		"Patrick Doyle",
		"Haris Zambarloukos",
		"Úna Ní Dhonghaíle",
		"Lucy Bevan",
		"Jim Clay"
	],
	"votes": 193281,
	"cover": "https://m.media-amazon.com/images/M/MV5BYjBkMTRkMmUtNGQ5Ni00YjkwLThhMmMtZjI1M2U2NzRhNjkwXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In World War I (Oct 1914), a young Hercule Poirot (Kenneth Branagh) devises a successful strategy to advance his Belgian company, but a booby trap mutilates his face. His fiance, nurse Katherine (Susannah Fielding), does not recoil, but tells him he will grow a mustache to hide his scars. In 1937, at a London club, Poirot watches blues singer Salome Otterbourne (Sophie Okonedo) perform and sees Jacqueline \"Jackie\" De Bellefort (Emma Mackey) dancing passionately with her fiance Simon Doyle (Armie Hammer). Jackie's childhood friend, heiress Linnet Ridgeway (Gal Gadot), enters, and is introduced to Simon. Jackie asks Linnet to hire Simon as her estate manager.Six weeks later, in Egypt, Poirot encounters his friend Bouc (Tom Bateman) and Bouc's mother, Euphemia (Annette Bening), a painter. Bouc invites Poirot to join them at the hotel to celebrate the wedding of a surprising couple - Linnet and Simon. Others join their honeymoon trip: Linnet's maid Louise Bourget (Rose Leslie); Salome and her niece/manager Rosalie (Letitia Wright), & Linnet's school-friend; Linnet's godmother Marie Van Schuyler (Jennifer Saunders) with her nurse Mrs. Bowers (Dawn French); Linnet's cousin Andrew Katchadourian (Ali Fazal), who manages her accounts; and doctor Linus Windlesham (Russell Brand). Linnet asks Poirot for protection from the obsessive Jackie, who has stalked them to Egypt; he cannot dissuade Jackie, who shows him she carries a gun.To escape Jackie, the group boards the cruise ship S.S. Karnak. Linnet tells Poirot she does not trust her guests. During an excursion to Abu Simbel, Bouc confesses that he is dating Rosalie, despite his mother's disapproval; Poirot is interested in Salome. After a boulder nearly crushes Linnet and Simon, the guests return to the Karnak to discover Jackie has boarded. Poirot, overcome by champagne, confides to Jackie that he renounced romance after Katherine died in a mortar explosion. Linnet goes to bed and Simon confronts Jackie, who shoots him in the leg and attempts to shoot herself. Rosalie and Bouc intervene. They bring Jackie to Mrs. Bowers, while Windlesham treats Simon. The following morning, Louise discovers Linnet has been shot in the head, and her valuable necklace has been stolen.\nPoirot has the captain dredge the areas around the boat to find the murder weapon.Poirot, assisted by Simon and Bouc, interrogates the guests, who each bear a grudge against Linnet:Louise was to leave Linnet's employment to be married, but Linnet ended the engagement by paying off the debt of her fiance. Linnet wanted Louise at all costs.\nWindlesham was engaged to Linnet until she left him for Simon. He was along with Simon all night and after sedating him had a clear window of opportunity to attack Linnet.\nAndrew was embezzling from Linnet.\nBowers' formerly wealthy family was ruined by Linnet's father, during the Great Depression.\nVan Schuyler is a beneficiary of Linnet's will. She and Bowers are lovers.\nSalome was the target of Linnet's racist remarks, years ago.\nEuphemia finds Linnet's necklace. Poirot suspects she resented Linnet for introducing Bouc to Rosalie.\nJackie was monitored by Bowers all night. Her gun is dredged from the Nile, wrapped in Van Schuyler's missing scarf and a bloody handkerchief.Poirot reveals that Euphemia hired him to investigate Rosalie. He concludes that she is more than worthy of her son's affection. Rosalie, angry at being investigated, storms off and discovers Louise's body. Her throat has been slit. She has money, so Poirot suspects that she witnessed Linnet's murder and blackmailed the killer.\nHe sees a possible witness' outline in the blood spatter from Louise on the walls of the ship.\nInterrogating Bouc with Simon, Poirot deduces that Bouc found Linnet dead and stole her necklace to gain financial freedom from his mother. He was going to return the necklace, but then saw Louise being killed and panicked and put it in Euphemia's belongings. Bouc witnessed Louise's murder and got blood on his coat, which he threw over the railing, but before he can reveal the killer, he is shot dead; Poirot chases the killer, but only finds the abandoned gun.Locking the surviving guests in the boat's bar, Poirot reveals that Simon killed Linnet, with Jackie acting as mastermind. They are still lovers, and arranged Simon's romance with Linnet to inherit her wealth. Jackie drugged Poirot's champagne and pretended to shoot Simon with a blank. Simon faked his injury with paint stolen from Euphemia. While Jackie distracted Bouc and Rosalie, Simon killed Linnet and then shot his own leg, muffled by Van Schuyler's scarf.\nJackie killed Louise with Windlesham's scalpel (Louise had seen Simon entering Linnet's cabin and was later told by Simon that he would take care of her financially), and Bouc with Andrew's gun. Faced with the proof of Simon's paint-stained handkerchief (in the water blood turns to brown, while red color changes to pink), Jackie-knowing that there is no escape-embraces Simon and shoots him through the back, killing them both with one shot.As the passengers disembark, Poirot is unable to voice his feelings to Salome. Six months later, a clean-shaven Poirot visits her club to watch her rehearse, alone in the dark.",
	"links": [
		"https://www.amazon.com/Death-Nile-Tom-Bateman/dp/B09RWCF9HK"
	]
}