{
	"title": "Ready or Not",
	"release_year": "2019",
	"runtime": "95",
	"tags": [
		"Action",
		"Comedy",
		"Horror",
		"amazon"
	],
	"rating": 6.9,
	"actors": [
		"Samara Weaving",
		"Adam Brody",
		"Mark O'Brien",
		"Henry Czerny",
		"Andie MacDowell",
		"Melanie Scrofano",
		"Kristian Bruun",
		"Elyse Levesque",
		"Nicky Guadagni",
		"John Ralston"
	],
	"staff": [
		"Matt Bettinelli-Olpin",
		"Tyler Gillett",
		"Guy Busick",
		"R. Christopher Murphy",
		"Bradley J. Fischer",
		"William Sherak",
		"James Vanderbilt",
		"Tripp Vinson",
		"Brian Tyler",
		"Brett Jutkiewicz",
		"Terel Gibson",
		"John Buchan",
		"Jason Knight",
		"Yesi Ramirez",
		"Andrew M. Stearn"
	],
	"votes": 189670,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTViMDA4YjgtZDQ4NC00ZDk2LTg0MWItOTc4MTkwMmVkZWRmXkEyXkFqcGc@._V1_QL75_UX190_CR0,1,190,281_.jpg",
	"description": "Young brothers Alex (Mark O'Brien) and Daniel Le Domas (Adam Brody) witness the killing of a man on the night of his wedding to their Aunt Helene (Nicky Guadagni). Thirty years later, Alex has returned home to marry his fiance, Grace (Samara Weaving), a former foster child eager to finally have a family. On their wedding night, he tells her that, as tradition, every outside addition to the family must play a game. Grace has to draw a random card, and the game they have to play will be written there.The family includes Alex, his alcoholic brother, Daniel, and drug-addicted sister, Emilie (Melanie Scrofano); their father, Tony (Henry Czerny) and mother, Becky (Andie MacDowell); Daniel's snobbish wife, Charity (Elyse Levesque); Emilie's whiny husband, Fitch (Kristian Bruun); and the somber Helene. It is explained that their ancestor, Victor Le Domas, made a deal with a man named Le Bail. Le Bail would build the Le Domas fortune in exchange for the Le Domases observing this tradition. Grace draws a card labeled \"Hide and Seek.\" Unaware of the truth, she hides while the Le Domases arm themselves with antique weapons to hunt her down.When Grace witnesses Emilie accidentally killing one of the maids believing it to be her, Alex confesses that the \"hide and seek\" card is the only game that requires the family to kill the recipient. They believe that if Grace survives until dawn, the entire family will die, as per the agreement with Le Bail. He kept the truth from Grace, knowing she would leave him if she knew. The last time someone pulled that card was thirty years ago when Helene's husband was killed. Shocked, scared, and angry, Grace becomes determined to survive. She is discovered by Daniel, who is disillusioned with the bloody family tradition and gives her a head start. To prevent his family tracking Grace, Alex destroys the security monitors before being restrained by Daniel and Tony.Grace escapes the mansion and hides in the barn, only to be shot in the hand by Emilie's young son, Georgie (Liam McDonald). Furious, she knocks Georgie out, but accidentally falls into a pit filled with the decaying corpses of the previous sacrifices. She climbs out, though not without more wounds, and is pursued by the butler, Stevens (John Ralston). She fights him and escapes in his car, but the car is quickly reported stolen and shut down. Stevens catches up and tranquilizes her. While being driven back, Grace awakens and attacks Stevens, causing the car to crash. However, she is captured again and restrained on the symbol of a pentagon as the family prepares to sacrifice her. They drink from a ceremonial cup and start to vomit blood. Daniel releases Grace, revealing he non-lethally poisoned its contents. Charity, however, shoots Daniel in the throat, causing him to bleed to death; Grace thanks Daniel for helping her after pistol-whipping Charity and bludgeoning Tony with an oil lamp, inadvertently starting a fire.Becky attacks Grace; having had enough, Grace snaps and bludgeons Becky to death with Le Bail's wooden game box. Alex finds Daniel's body before finding Grace and his mother. Realizing that Grace no longer trusts him and will not be with him after all this, Alex subdues her. The group hails Satan as Alex prepares to stab her. At the last moment, Grace twists, taking the stab to her shoulder and freeing herself. Dawn breaks, but when nothing happens, the family believes their tradition was a lie, and all of this was for nothing. However, Helene suddenly explodes. One by one, the remaining family members explode in bloody messes. Alex pleads for Grace's forgiveness out of cowardice; she rebukes him, and he explodes. As the mansion burns, Grace sees Le Bail's ghost, realizing there was truth to the tale.\nAs the police arrive, Grace sits on the patio steps, exhausted and traumatized, her wedding dress turned red from blood, and smokes a cigarette.",
	"links": [
		"https://www.amazon.com/Ready-Not-Samara-Weaving/dp/B07WH7J6SF"
	]
}