{
	"title": "Sex Education",
	"release_year": "2019",
	"runtime": "60",
	"tags": [
		"Comedy",
		"Drama",
		"Romance",
		"netflix"
	],
	"rating": 8.2,
	"votes": 361657,
	"actors": [],
	"staff": [],
	"cover": "https://m.media-amazon.com/images/M/MV5BOTE0MjQ1NDU3OV5BMl5BanBnXkFtZTgwNTI4MTgwNzM@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "The title of this British series is derived from the education of the main character (Otis Milburn played by Asa Butterfield) and his classmates in high school. His mother (Jean Milburn played by Gillian Anderson) is a sex therapist. Through a series of events, Otis becomes a sex therapist in school - for his fellow high students.This accidentally happens and is recognized by Maeve Wiley (Emma Mackey). Maeve sees the financial potential so she forms an agreement where she will find the sexually needy customers for Asa and handle all the business aspects (collecting the money). Asa only has to counsel his classmates in the same manner as his mother does for adults. His mother is very blunt with Asa so dealing with uncomfortable situations comes naturally for Asa as he grows into becoming a therapist.Completing the cast are Connor Swindells playing Adam Groff, Alistair Petrie as his father Mr. Goff, headmaster at Moordale Secondary School. The film uses the sex therapy theme to introduce classmates of Otis and Maeve but the film is really a high school 'Coming of Age' story.It's a 'Coming of Age' TV series presented in 45-minute episodes. Appearing are other members of the high school: One character Eric (Ncuti Gatwa) needs to come to grips with his homosexuality. Another: Lily (Tanya Reynolds) is eager to end her status as a virgin. Plus Aimee Lou Wood (who solves her problem by taking things in her own hands), Mimi Keene (frustrating\nher lesbian partner), Kedar Williams-Stirling (sex symbol whose two mommies are having marital difficulty) - all high school students with various sexual problems who go to Asa for sex therapy.",
	"links": [
		"https://www.netflix.com/title/80197526"
	]
}