{
	"title": "Enola Holmes",
	"release_year": "2020",
	"runtime": "123",
	"tags": [
		"Action",
		"Adventure",
		"Crime",
		"netflix"
	],
	"rating": 6.6,
	"actors": [
		"Millie Bobby Brown",
		"Henry Cavill",
		"Sam Claflin",
		"Helena Bonham Carter",
		"Louis Partridge",
		"Burn Gorman",
		"Adeel Akhtar",
		"Susan Wokoma",
		"Hattie Morahan",
		"David Bamber"
	],
	"staff": [
		"Harry Bradbeer",
		"Jack Thorne",
		"Nancy Springer",
		"Arthur Conan Doyle",
		"Millie Bobby Brown",
		"Paige Brown",
		"Alex Garcia",
		"Ali Mendes",
		"Daniel Pemberton",
		"Giles Nuttgens",
		"Adam Bosman",
		"Ana García",
		"Jina Jay",
		"Michael Carlin"
	],
	"votes": 224730,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTRlYmI1NTMtYTVkYi00MjJkLWE3ZGItOThkYTdhNzBhMThhXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Enola Holmes (Millie Bobby Brown) is the youngest sibling in the famous Holmes family. She is extremely intelligent, observant, and insightful, and defies the social norms for women of the time. Her mother, Eudoria (Helena Bonham Carter), has taught her everything from chess to jujitsu and encouraged her to be a strong-willed and independent thinking young woman.On the day of her sixteenth birthday, Enola awakens to find that her mother has disappeared, leaving behind only some birthday gifts. A week later, she rushes to the train station to meet her brothers, Mycroft (Sam Claflin) and Sherlock (Henry Cavill), who fail to recognize her at first, not having seen her in many years. Sherlock finds her to be an intelligent girl, whereas Mycroft finds her troublesome. As her legal guardian, Mycroft intends to send her away to a finishing school run by the stern Miss Harrison (Fiona Shaw). Mycroft is aghast to find that Eudoria has been padding her living expenses to seek ever more money from him. Enola is disgusted with Miss Harrison's ancient views and dreads going to finishing school with her. Enola begs Sherlock to save her, but he is firm that its out of his hands.The flower cards left by her mother reveal secret messages and lead to hidden money, which Enola uses to escape disguised as a boy. On the train, she finds the young Viscount Tewkesbury (Louis Partridge) hidden in a travel bag. She thinks he is a nincompoop but warns him that a man in a brown bowler hat (named Linthorn (Burn Gorman)) is on the train searching for him (She had seen Linthorn get on the train while Tewkesbury's Uncle, Mother and Grandmother tried to stop the train to search for him). Linthorn tries to kill Tewkesbury, so they jump off the train to escape. Neither having any food, Tewkesbury forages for edible plants. They travel to London, where they part ways.Disguised as a proper Victorian lady (Since Mycroft has the police looking for a 16 yr old girl), she continues to trace Eudoria and leaves cryptic messages in the newspaper personal advertisements. She also visits an address that Eudoria frequently wrote letters to. She meets Edith (Susie Wokoma), who runs a woman's self-defense class. Edith knows of Enola but won't reveal anything about Eudoria. From clues in Edith's office, Enola discovers pamphlets and a safe-house containing explosives and learns that Eudoria is part of a radical group of suffragettes (women fighting for the right to vote).She is attacked by Linthorn, who tortures her for information about Tewkesbury, attempting to drown her. They fight, but she is able to ignite the explosives and escape. Enola decides to pause the search for her mother and instead find Tewkesbury again to save him because he is not capable of defending himself. Enola visits the Tewkesbury estate at Basilwether Hall to learn more. She meets Sir Whimbrel (David Bamber), Tewkesbury's uncle, his mother (Hattie Morahan) and Grandmother (Frances De La Tour), but none of them trust her. So, she poses as Sherlock's assistant to gain their attention.\nMycroft has Inspector Lestrade (Adeel Akhtar) of Scotland Yard search for Enola.Enola looks into the grounds around Tewkesbury estate and finds his tree-house. There she finds some obvious clues planted by him to lead his pursuers astray, but Enola finds the clues to his real location. Enola finds Tewkesbury selling flowers in Covent Garden and warns him of the danger. She helps him escape but is herself caught by Lestrade and imprisoned in Miss Harrison's finishing school by Mycroft. Sherlock visits her and admits he is impressed by her detective work.\nTewkesbury sneaks into the school, and they escape together, stealing Miss Harrison's motor car.They reach a fork in the road and, rather than returning to London, Enola decides they must go to Basilwether Hall and face Tewkesbury's uncle, who she has deduced was trying to kill him (her family didn't hire a detective to find him, instead they sent a killer. Tewkesbury was in favor of the reform bill in the house of Lords, like his father and his uncle knew that. Also, if Tewkesbury dies, the estate goes to the uncle). The estate is seemingly deserted, but Linthorn ambushes them, firing a shotgun. Enola trips him using a jujitsu move, causing a fatal head injury. Tewkesbury's grandmother is revealed as the real villain; a traditionalist, she did not want him to take his father's place in the House of Lords and vote for the Reform Bill. She shoots her grandson in the chest, but he survives thanks to a plate of armor he had hidden under his clothes. Sherlock arrives at Scotland Yard and Lestrade asks him two questions: first, how he managed to solve the case, and second, how his sister solved it first.Enola shares a tearful goodbye with Tewkesbury. She finds and deciphers a message in a newspaper but deduces that it was not sent by her mother & it was sent by Sherlock instead who wanted to lure her out of hiding. At the meeting point, Sherlock and Mycroft discuss Enola, and Sherlock suggests becoming her guardian. They decide to leave, and Sherlock notices a clue, but chooses not to look for Enola. All the while Enola has been watching disguised as a newsboy. Returning to her lodgings, Enola finds her mother waiting there. They embrace, and Eudoria explains why she had to leave (She was working to get the reform bill passed, but Enola did that much better than Eudoria), and why she must leave again, but she is impressed by what Enola has become. Enola has found her freedom and her purpose-she is a detective and a finder of lost souls.",
	"links": [
		"https://www.netflix.com/title/81277950"
	]
}