{
	"title": "Jumanji: The Next Level",
	"release_year": "2019",
	"runtime": "123",
	"tags": [
		"Action",
		"Adventure",
		"Comedy",
		"amazon"
	],
	"rating": 6.7,
	"actors": [
		"Dwayne Johnson",
		"Jack Black",
		"Kevin Hart",
		"Karen Gillan",
		"Awkwafina",
		"Nick Jonas",
		"Alex Wolff",
		"Morgan Turner",
		"Madison Iseman",
		"Ser'Darius Blain"
	],
	"staff": [
		"Jake Kasdan",
		"Jake Kasdan",
		"Jeff Pinkner",
		"Scott Rosenberg",
		"Chris Van Allsburg",
		"Dany Garcia",
		"Hiram Garcia",
		"Dwayne Johnson",
		"Jake Kasdan",
		"Henry Jackman",
		"Gyula Pados",
		"Steve Edwards",
		"Mark Helfrich",
		"Tara Timpone",
		"Nicole Abellera",
		"Jeanne McCarthy",
		"Bill Brzeski"
	],
	"votes": 290908,
	"cover": "https://m.media-amazon.com/images/M/MV5BYWFjODExZWEtYzIwYS00M2YwLTk4YTktNDQ5ZmVmOThiNmI1XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Three years after the events of the previous film, Spencer, Fridge, Martha, and Bethany have gone their separate ways but make plans to meet up in Brantford. However, Spencer is apprehensive about meeting up with everyone, especially Martha whom he put his relationship with on hold, due to thinking they have better lives. On his first night there, he realizes that his time within Jumanji was what made him feel relevant and sets out to return.\nThe next day, Fridge, Martha, and Bethany become concerned when Spencer fails to show up. Heading to his house, they meet Spencer's grandfather Eddie, who's staying at the house while recovering from hip surgery, and his former friend Milo Walker. While there, the group discover that Spencer deliberately kept the broken pieces of the Jumanji game and resolve to go in and get him, but the malfunctioning game sucks in only Fridge and Martha, along with Eddie and Milo, forcing Bethany to reach out to fellow Jumanji player Alex Vreeke to help get in.In the game, Martha finds she's back in the Ruby Roundhouse (Karen Gillan) (a commando with talents in martial arts and is now able to wield Nunchucks while still having a weakness to venom) avatar, but Fridge winds up in Professor Oberon's (Jack Black) (Fridge's avatar (formerly Bethany's); a paleontologist, archaeologist, cartographer, cryptographer and now a Geometrician, with a weakness for endurance and new weakness for heat, sun, and sand) form while Eddie and Milo get Bravestone (Dwayne Johnson) (Eddie's avatar (formerly Spencer's); a strong, confident archaeologist, explorer, and the leader of the team; his only weakness is now a man named Switchblade) and Mouse (Kevin Hart) (Milo's avatar (formerly Fridge's); a diminutive zoologist, weapons specialist and currently linguist, who has a weakness to cake and with the lack of speed and strength) respectively. After Fridge gets eaten by a python, costing him his first life, NPC guide Nigel Billingsley (Rhys Darby) informs them the game has changed: a warlord named Jurgen the Brutal (Rory McCann) (The new villain of Jumanji, an iron-fist person and arrogant warlord who killed Smolder Bravestone's parents a long time ago. He is shown to have a weakness to the Jumanji Berry), who in this game is responsible for the deaths of Bravestone's parents, recently stole a magic necklace called the Falcon's Heart. As its magic provides fertility to the land so long as it stays in the sun, a drought struck the land when Jurgen stole the jewel. They must retrieve it before he sells it to a crime syndicate so both groups can combine and show it to the sun in order to end the drought and save Jumanji.Nigel drops the group in a desert called the Dunes, where they discover that they have a new set of strengths and weaknesses. After escaping a flock of ostriches, at the cost of Eddie's first life, they stop at a nearby oasis. While there, they find Spencer, in the body of a new avatar, a female thief named Ming Fleetfoot (Awkwafina) (a new avatar with skills of burglary, pick-pocketing and lock picking who has a weakness to pollen), who loses his first life and apologizes to the group for his mistake of re-entering the Jumanji.After an encounter with a former lover of Bravestone's and her husband Switchblade (Massi Furlan) (A man who is the latest weakness of Bravestone), Fridge and Martha retrieve an in-game required Jumanji Berry. They also discover a pool of water with a green glow that makes them switch avatars until reentering the water. Eddie, Milo, and Spencer secures some dromedary camels to get them through the desert. But after escaping the oasis, Switchblade uses a rocket launcher to take out a life from every teammate after Eddie gets too overconfident on defeating Switchblade and thus delays the escape of the team.Problems plague the group: Fridge feels that Oberon's status as a field guide is detrimental to their survival, Spencer is too self-conscious to use Ming's skills properly, Milo's casual attitude keeps him from revealing key info in a timely manner, and Eddie's pure acts of carelessness lead to everyone, including himself, losing several lives. Their problems are made worse as Eddie blames Milo for selling their diner behind his back, forcing him into retirement. An argument between the two leads to Milo getting crushed by a giant boulder, costing him his second life.After escaping a troop of mandrills at a series of revolving bridges, with Martha losing her second life in the process, the group, now on their last lives, reunites with Alex and Bethany, whose avatar is now a black horse named Cyclone. They eventually find a river with water similar to what Fridge and Martha found by the Jumanji Fruit Tree. Spencer, Fridge, and Bethany get their original avatars back, while Eddie and Milo end up as Ming and Cyclone respectively, but they are captured by Jurgen's men shortly after.In Jurgen's fortress, Fridge and Bethany stall the mercenaries while Spencer and Martha save Eddie, and Alex rescues Milo at the cost of 2 lives. While the group holds Jurgen's men off, Spencer gets in a fight with Jurgen inside an airship and uses the Jumanji Berry (Jurgen's only weakness) to incapacitate him long enough to send Jurgen falling to his death. Milo's avatar is revealed to have retractable wings and with Eddie riding him they fly to help Spencer. He gets the Falcon's Heart to Eddie and Milo, who expose it to sunlight and save Jumanji. Eddie, Spencer, Fridge, Martha, Bethany and Alex return to the real world. Due to the fact that he was dying and was only there to make up with Eddie, Milo elects to stay behind and protect Jumanji.In the aftermath, Spencer starts teaching his grandfather about video games and reunites with his friends at Eddie's old diner where Eddie uses Bravestone's \"smoldering intensity\" to convince the new owner Nora Shepperd (a character from the first film, played by Bebe Neuwirth) to bring him on as a manager.In a mid-credits scene, a heating mechanic Spencer's mom hired finally shows up. They find the game in the basement and the mechanic's tinkering presumably sucks them both into the game and releases a flock of ostriches into the real world, which Spencer, Fridge, Martha and Bethany witness from outside the diner.",
	"links": [
		"https://www.amazon.com/Jumanji-Next-Level-Dwayne-Johnson/dp/B0828CKL87"
	]
}