{
	"title": "The Mitchells vs the Machines",
	"release_year": "2021",
	"runtime": "114",
	"tags": [
		"Adventure",
		"Animation",
		"Comedy",
		"amazon",
		"netflix"
	],
	"rating": 7.6,
	"actors": [
		"Abbi Jacobson",
		"Abbi Jacobson",
		"Danny McBride",
		"Maya Rudolph",
		"Michael Rianda",
		"Michael Rianda",
		"Michael Rianda",
		"Eric André",
		"Olivia Colman",
		"Fred Armisen",
		"Beck Bennett",
		"Beck Bennett",
		"Chrissy Teigen",
		"John Legend"
	],
	"staff": [
		"Michael Rianda",
		"Michael Rianda",
		"Jeff Rowe",
		"Peter Szilagyi",
		"Alex Hirsch",
		"Kurt Albrecht",
		"Phil Lord",
		"Christopher Miller",
		"Mark Mothersbaugh",
		"Greg Levitan",
		"Brittany N. Grooms",
		"Mary Hidalgo",
		"Tamara Hunter",
		"Lindsey Olivares"
	],
	"votes": 129723,
	"cover": "https://m.media-amazon.com/images/M/MV5BNzAyOWNiMjAtNWUzMi00ZDk1LWE5NzYtNDUzMWE1Y2M0NDM2XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Katie Mitchell (Abbi Jacobson) is a quirky aspiring filmmaker in Kentwood, Michigan, who often clashes with her nature-obsessed and Technophobic father Rick (Danny McBride) and has recently been accepted into film school in California. The evening before Katie leaves, Rick accidentally breaks her laptop after a fight over one of Katie's previous short films, leading the family to fear their relationship will forever be strained (Rick had indicated that making short films was not the ticket to a successful career). To try to prevent this, Rick decides to cancel Katie's flight and instead take her, her mother Linda (Maya Rudolph), younger brother Aaron (Mike Rianda), and family dog Monchi (Doug the Pug) on a cross-country road trip to her college as one last bonding experience.Meanwhile, technology entrepreneur Mark Bowman (Eric André) declares his highly intelligent AI PAL obsolete (Olivia Colman) (a ruthless, arrogant and maniacal rogue virtual assistant created by Mark) as he unveils a new line of home robots (powered by the AI Software named PAL Max) to replace her. In revenge, PAL orders all the robots (including the new PAL Maxes) to capture humans worldwide and launch them into space.\nMeanwhile the Mitchell road trip is a total disaster. Whatever Rick tries, goes bad. He is still unable to bond with Katie and his attempts to tug at her childhood memories are embarrassing. The Mitchells run into their neighbors the Poseys Hailey (Chrissy Teigen), Jim (John Legend) and their dinosaur-loving daughter Abbey (Charlyne Yi). The Poseys are the perfect family.Just as the reunion happens, the robots attack and start capturing and sending humans into space inside pods. The Poseys are well coordinated and are able to escape.\nThe Mitchells manage to avoid capture at a road stop cafe in Kansas. Rick decides that his family should stay put in the cafe for their own safety, but Katie convinces him to help save the world instead. They meet two defective robots, Eric (Beck Bennett) and Deborahbot 5000 (Fred Armisen), who tell the family they can use a kill code to shut down PAL and all the robots.\nPAL tells Mark that she will not allow him to throw her away. and she will throw all humans off Earth unless someone can give her one reason why the species is worth saving. The world descends in chaos as PAL turns off the Wi-Fi.On their way, the PALs attack the Mitchells, but Rick's stick driving is able to defeat them. the defeated robots upload the info on the rogue family directly to PAL and give her their destination. Eric and Deborahbot have a fatal system error when they can't recognize if Monchi is a dog or a pig.\nThe Mitchells make it to a mall in eastern Colorado to upload the kill code, but PAL chip-enabled appliances attempt to stop them. Katie tries to upload the kill code but is stopped when a giant Furby (Rianda) pursues the family. They ultimately trap and defeat the Furby, destroying a PAL router in the process, which disables the hostile devices but stops the kill code from uploading. On the way to Silicon Valley to upload the kill code directly to PAL, Linda reveals to Katie that she and Rick had originally lived in a cabin in the mountains years ago as it was his lifelong dream before he gave up on it.Upon arriving in Silicon Valley, the Mitchells disguise themselves as robots and head to PAL Labs HQ to shut it down, but PAL manipulates them by revealing surveillance footage from the cafe of Katie telling Aaron in secret that she was pretending to have faith in Rick so that he would take them to upload the kill code. As a heartbroken Rick sees this, the Mitchells fail to reach PAL's lair and Rick and Linda are captured by PAL's stronger and smarter robots. PAL then reprograms Eric and Deborahbot to obey her, while Katie, Aaron, and Monchi escape.Katie discovers Rick's recordings of her childhood on her camera, realizing that Rick gave up on his lifelong dream to give his daughter a normal life. In the meantime, Rick reflects on his actions after seeing one of Katie's videos that mirrors his relationship with Katie. Reinvigorated, Katie and Aaron infiltrate PAL Labs HQ again, this time using Monchi to malfunction the robots, as his appearance causes an error in their programming. With help from Mark, Rick and Linda free themselves and plan to upload Katie's home movie of Monchi (on all screens) to short-circuit the robots. However, Rick is outnumbered by the robots when he is about to upload the video, while Katie and Aaron are captured.Facing PAL to justify saving humanity, Katie explains that no matter how hard her family struggles, they will always stay connected despite how different they are. PAL rejects this reasoning and drops Katie from her lair. Eric and Deborahbot, having been inspired by Rick's \"reprogramming\" himself that allowed him to use a computer, revert to their malfunctioning states and upload Katie's home movie, saving her and helping the rest of the Mitchells. The family bands together to fight the rest of the robots. Katie eventually destroys PAL by dropping her into a glass of water, freeing all the humans and disabling the remaining robots.A few months after the uprising, Katie and her family arrive at her college as she shares one last goodbye with them. She later joins them on another road trip with Eric and Deborahbot to Washington, D.C. to accept the Congressional Gold Medal.",
	"links": [
		"https://www.amazon.com/Mitchells-vs-Machines-Danny-McBride/dp/B09NB6299M",
		"https://www.netflix.com/title/81399614"
	]
}