{
	"title": "The Mule",
	"release_year": "2018",
	"runtime": "116",
	"tags": [
		"Crime",
		"Drama",
		"Thriller",
		"amazon"
	],
	"rating": 7.0,
	"actors": [
		"Clint Eastwood",
		"Patrick L. Reyes",
		"Cesar De León",
		"Gustavo Muñoz",
		"Jackie Prucha",
		"Richard Herd",
		"Adam Drescher",
		"Christi McClintock",
		"Keith Flippen",
		"Alison Eastwood"
	],
	"staff": [
		"Clint Eastwood",
		"Nick Schenk",
		"Sam Dolnick",
		"Clint Eastwood",
		"Dan Friedkin",
		"Jessica Meier",
		"Tim Moore",
		"Arturo Sandoval",
		"Yves Bélanger",
		"Joel Cox",
		"Geoffrey Miclat",
		"Kevin Ishioka"
	],
	"votes": 155301,
	"cover": "https://m.media-amazon.com/images/M/MV5BMTc1OTc5NzA4OF5BMl5BanBnXkFtZTgwOTAzMzE2NjM@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 2005, Earl Stone (Clint Eastwood), in his 80s, is an award-winning horticulturist and Korean War veteran in Peoria, Illinois. In 2005 Earl missed his daughter Iris' wedding so he can receive a lifetime award celebrating his professional accomplishments. Enraged that her father once again chose his career over her, Iris stops speaking to him and his wife Mary files for divorce.By 2017, He is facing financial ruin and is estranged from his ex-wife Mary (Dianne Wiest) and daughter Iris (Alison Eastwood), for always putting work before family. He's still on friendly terms with his granddaughter Ginny (Taissa Farmiga) and attends her wedding rehearsal. Mary is super angry with Earl for missing Iris's wedding in 2005 and now is angry as she thinks Earl wants to mooch off Ginny as he has nowhere else to go.\nEarl has not told his family that the only reason he's there is because his flower farming business has gone bankrupt, and his home has just been foreclosed on by the bank.Earl is desperate for money as he had promised to pay Ginny's wedding. While there, he is spotted by a member of a drug cartel (who is the boyfriend of one of Ginny's bridesmaids) who had been tipped off by one of Earl's former employees as to his financial problems. Earl accepts the gangster's offer and becomes a \"mule\", transporting cocaine through Illinois for the cartel.\nFacing little suspicion due to his age, race, spotless criminal history, and strict adherence to driving laws, Earl is soon trusted with huge amounts of drugs and paid large amounts of cash. Over time, Earl gets more involved with the cartel and becomes one of their best mules.With the money he obtains from drug-running, he buys a new truck, settles his financial problems, pays for renovations of the local VFW Post that had been damaged in a fire, and his granddaughter's wedding and education. He becomes friendly with the cartel members, who call him Tata (\"grandfather\").\nThere are only 2 rules, don't look at the cargo and always answer the phone.Meanwhile, Special Agent Colin Bates moves to the Chicago DEA office and assigned Agent Trevino as his partner. They are tasked with closing in on the cartel's deliveries to Chicago.\nWith details from an informant, a Drug Enforcement Administration (DEA) task force made of Agent Colin Bates (Bradley Cooper), his partner Agent Trevino (Michael Pena) and their boss (Lawrence Fishburne), is narrowing in on the cartel's deliveries to Chicago. They start looking for the cartel's most profitable driver, Tata (\"grandfather\")As Earl gets more successful, cartel boss Laton assigns him bigger loads and assigns Gustavo to handle Earl. Gustavo doesn't like Earl as he has no family ties, doesn't listen to him, does whatever he wants. But Latin values Earl and asks Gustavo to put up with him.Unknown to all a snitch has given Earle's name to the DEA agents as their top mule. Earl keeps making bigger drops and earns a meeting with Laton at his home in Mexico. Earl mistakenly believes that the cartel considers him their friend. At a late-night party Earl suggests to Gustavo that Laton doesn't really care for him.\nTensions within the cartel erupt when Gustavo (Clifton Collins Jr.), a power-hungry cartel lieutenant, assassinates cartel boss Laton (Andy García), and subsequently demands Earl be kept under tighter control.Earl follows instructions given to him and the snitch gives his exact route and stopping points to the DEA agents, but they simply don't suspect an old man like Earl to be the mule and keep on arresting the wrong people.\nIn the middle of a $12 million cocaine shipment, Earl winds up in a diner with Bates. Neither man recognizes the other, and the elderly Earl gives Bates advice to try and mend fences with his wife and not make the mistakes Earl has made.Earl then leaves to conclude the delivery of the shipment but then gets a call from Ginny, who informs him that Mary is gravely ill. Earl initially tells Ginny there's nothing he can do until she rebukes him for his perceived lack of care. Earl relents and disobeys Gustavo, making peace with Mary and staying with her in her final moments. Mary dies peacefully days later.\nAfter attending the funeral and finally reconciling with Iris and the rest of his family, Earl resumes the delivery as the DEA and the cartel close in on him.The cartel's enforcers catch him and upon discovering that he disobeyed them to care for his ex-wife, they call Gustavo to request leniency. Gustavo agrees to this request and allows Earl to continue. Earl continues driving toward the drop point, but the DEA agents set up a roadblock and arrest him; Bates has a pleasant aside with Earl before sending him away.In court, Earl's lawyer starts to give an impassioned plea, asking for mercy for Earl due to his age and military service. However, a clearly guilt-ridden Earl interrupts her to plead guilty to all charges and is promptly sent to federal prison. His family lend him their support and promise to visit him. In prison, he returns to horticulture.",
	"links": [
		"https://www.amazon.com/Two-Mules-Sister-Sara-4KUHD/dp/B0DJDFK5ND"
	]
}