{
	"title": "Yesterday",
	"release_year": "2019",
	"runtime": "116",
	"tags": [
		"Comedy",
		"Fantasy",
		"Music",
		"amazon"
	],
	"rating": 6.8,
	"actors": [
		"Himesh Patel",
		"Lily James",
		"Sophia Di Martino",
		"Ellise Chappell",
		"Meera Syal",
		"Harry Michell",
		"Vincent Franklin",
		"Joel Fry",
		"Michael Kiwanuka",
		"Karma Sood"
	],
	"staff": [
		"Danny Boyle",
		"Richard Curtis",
		"Jack Barth",
		"Bernard Bellew",
		"Tim Bevan",
		"Danny Boyle",
		"Richard Curtis",
		"Daniel Pemberton",
		"Christopher Ross",
		"Jon Harris",
		"Courtney Bright",
		"Nicole Daniels",
		"Gail Stevens",
		"Patrick Rolfe"
	],
	"links": [
		"https://www.amazon.com/Yesterday-Himesh-Patel/dp/B07T32VW3S"
	],
	"votes": 171114,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjQ0NTI0NjkyN15BMl5BanBnXkFtZTgwNzY0MTE0NzM@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Jack Malik (Himesh Patel) is a struggling singer-songwriter from Lowestoft. His manager and childhood friend Ellie Appleton (Lily James) encourages him not to give up on his dreams. After Jack is hit by a bus during a global blackout, he sings \"Yesterday\" for his friends, and discovers they have never heard of the Beatles. After realizing the world no longer remembers the band (google has no record of the Beatles), Jack begins performing their songs, passing them off as his own.Ellie has Jack record a demo with a local music producer Gavin (Alexander Arnold). Following a performance on local television, Jack is invited by pop star Ed Sheeran to play as his opening act in Moscow. Ellie declines to join him, saying she must work at her day job as a schoolteacher, so Jack's roadie friend Rocky (Joel Fry) travels with him instead. After the gig, Sheeran challenges Jack to a songwriting duel; he loses to Jack's \"The Long and Winding Road\". In Los Angeles, Sheeran's ruthless agent Debra Hammer (Kate McKinnon) signs him to her label and engineers his rise to global fame.The movie is interspersed with absence of famous things like Coca Cola, Harry Potter or a cigarette, all ideas that would make Jack a multi-billionaire.At Jack's going-away party, Ellie confesses that she has always been in love with him. Jack goes back to Los Angeles and starts recording the album at EastWest Studios, but fails to come up with lyrics for the songs. Hoping to trigger memories through association, Jack goes to the Beatles' hometown of Liverpool, visiting landmarks such as Strawberry Field, Penny Lane, and \"Eleanor Rigby's grave\". Ellie joins him in Liverpool, and they spend a drunken evening and kiss, but Ellie tells him she is not interested in a one-night stand. The next morning, Jack and Rocky pursue Ellie to the train station, where she congratulates Jack but tells him she cannot be a part of his celebrity life. Jack returns to Los Angeles, heartbroken.The record label prepares to launch Jack's debut album. The producers reject his suggested titles, taken from Beatles records, and name the album One Man Only, pushing his talent. Jack persuades them to launch the album with a rooftop concert in Gorleston. Backstage, two fans approach him and tell him they know he plagiarized the songs, but thank him, fearing the music was gone forever. They give him the address of John Lennon, who has survived into old age, out of the public spotlight. Jack asks Lennon if he has led a successful life; Lennon replies that he has lived happily with his wife. He advises Jack to pursue the one he loves and always tell the truth.Sheeran arranges for Jack to perform at Wembley Stadium. Jack confesses to the crowd that he plagiarized the music and that he loves Ellie, and has Rocky upload the songs free to the internet, sabotaging the record release. Jack and Ellie marry and have a family together, and Jack becomes a music teacher."
}