{
	"title": "Hustle",
	"release_year": "2022",
	"runtime": "117",
	"tags": [
		"Comedy",
		"Drama",
		"Sport",
		"netflix"
	],
	"rating": 7.3,
	"actors": [
		"Adam Sandler",
		"Queen Latifah",
		"Juancho Hernangomez",
		"Ben Foster",
		"Kenny Smith",
		"Anthony Edwards",
		"Robert Duvall",
		"Jordan Hull",
		"María Botto",
		"Ainhoa Pillet"
	],
	"staff": [
		"Jeremiah Zagar",
		"Taylor Materne",
		"Will Fetters",
		"Maverick Carter",
		"Allen Covert",
		"LeBron James",
		"Jeff Kirschenbaum",
		"Dan Deacon",
		"Zak Mulligan",
		"Tom Costain",
		"Keiko Deguchi",
		"Brian Robinson",
		"Kim Coleman",
		"Perry Andelin Blake"
	],
	"links": [
		"https://www.netflix.com/title/80242342"
	],
	"votes": 148211,
	"cover": "https://m.media-amazon.com/images/M/MV5BMzA4ODRlMjktMDEyNS00NTg5LWEwYTAtNTExODI1ZDE2ZmYwXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Stanley Sugerman, a seasoned foreign scout for the NBA's Philadelphia 76ers, spends his life traveling and looking for up-and-coming talent. His wife Teresa and daughter Alex suffer as a result of his frequent travels. 76ers owner Rex Merrick likes him, but he does not get along with Rex's son Vincent. Stanley is given the opportunity to stay at home with his family when Rex elevates him to assistant coach. However, Rex passes on that same evening, leaving Vince in command. Three months later, Stanley is sent abroad after being demoted to scout once more by Vince. Leon Rich, a former teammate from college, urges him to quit the 76ers and sign with a player agency. Stanley is astounded by an exceptionally gifted unknown player in a local pick-up game after his plan to scout a player in Spain fails.The guy, Bo Cruz, rejects Stanley's attempts to communicate with him until he calls Dirk Nowitzki over FaceTime to establish his credentials. According to Bo and his mother Paola, he was a gifted musician from a young age and was asked to perform in America when he was fifteen. However, he chose to remain in Spain after his girlfriend became pregnant with his daughter Lucia. Bo currently works in construction and hustles basketball to supplement his income. Stanley wants the 76ers front office to sign Cruz right away following an amazing workout with members of the Spanish national team, but Vincent is not convinced. Stanley decides to take matters into his own hands and purchases Cruz's transportation to the United States, promising him a Sixers contract or a spot in the NBA draft. Bo is being held at the airport due to an aggravated assault conviction he was given in Spain. A warning that he may be deported if he is detained in the United States is given to him after he is freed.Leon arranges a showcase, which Stanley takes Bo to play at. Kermit Wilts, the presumed second overall choice, also attends. Stanley tells Bo that his reputation with the Sixers will improve dramatically if he can effectively defend Wilts. Cruz displays flashes of skill during the exercise, but he struggles defensively and offensively against Wilts, who discredits him and disrupts his play. In order to get Cruz ready for the NBA Draft Combine six weeks away, Stanley leaves the 76ers after Vince passes on Bo. He strengthens his mental toughness by telling Bo that his sensitivity is his lone vulnerability. Alex and Teresa help with the training by recording exercises and cooking meals. After Vince spreads the word about Bo's assault accusation, Leon is unable to get him into the Draft Combine, despite Bo's significant improvement under Stanley's tutelage.After a battle with Lucia's mother's boyfriend after she attempted to seek sole custody of Lucia, Bo, who is furious with Stanley, finally admits that the allegation was the result of several arguments. Stanley acknowledges that a drunk driving accident during his undergraduate years caused his wounded hand, ending his basketball team's season and landing him in a six-month jail sentence. Stanley puts up every effort to get Bo into the combine, but to no avail, once their confidence has been restored. In order to generate interest, the Sugermans hired Julius Erving to make a viral video called \"the Boa Challenge,\" in which players, including Tobias Harris of the 76ers, try to score on Bo in exchange for cash. Stanley flies Lucia and Paola to the United States to encourage Cruz once he is ultimately admitted into the combine. Although Bo does well in the physical aspects of the combine, he still has to play Wilts in a five-on-five exhibition match. He gives a good performance at first, but Kermit starts disparaging Bo's mother and daughter. Eventually, he loses his cool and slams Kermit to the ground. Then Bo bursts from the combine.Stanley follows Bo to the airport, believing their trip is ended. But before Bo's flight departs for Spain, Stanley gets a call from Leon telling him that Bo and Kermit have both been asked to play in a special game for players and front desk staff. Cruz plays freely, securing Wilts on defense while showcasing his attacking prowess. Stanley gets rehired by Rex's daughter Kat, who acknowledges his brilliance and declares she is taking over from Vince. Five months later, with Bo playing for the Boston Celtics and Stanley as the 76ers' assistant coach, the two teams square off and face each other."
}