{
	"title": "6 Underground",
	"release_year": "2019",
	"runtime": "128",
	"tags": [
		"Action",
		"Thriller"
	],
	"rating": 6.1,
	"actors": [
		"Ryan Reynolds",
		"Mélanie Laurent",
		"Manuel Garcia-Rulfo",
		"Ben Hardy",
		"Adria Arjona",
		"Dave Franco",
		"Corey Hawkins",
		"Lior Raz",
		"Payman Maadi",
		"Yuri Kolokolnikov"
	],
	"staff": [
		"Michael Bay",
		"Paul Wernick",
		"Rhett Reese",
		"Michael Bay",
		"Ian Bryce",
		"David Ellison",
		"Dana Goldberg",
		"Lorne Balfe",
		"Bojan Bazelli",
		"Roger Barton",
		"William Goldenberg",
		"Calvin Wimmer",
		"Denise Chamian",
		"Miranda Davidson",
		"Abeera Sheikh",
		"Jeffrey Beecroft"
	],
	"votes": 200213,
	"cover": "https://m.media-amazon.com/images/M/MV5BNTNmZDgzMmMtMzJhMy00NGI3LWI5YTktYjg5MTllZmYyYTMxXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Four years after witnessing the horrors of a brutal regime in the Middle Eastern nation of Turgistan, an unnamed American billionaire and philanthropist who made his fortunes from inventing Neodymium magnets fakes his own death to form an anonymous vigilante squad to take down criminals and terrorists that governments will not touch.\nNeodymium are micro magnets which One can control using electronic devices and turn into a weapon.\nOne realized that the Governments don't help people who need it, and his billions were not going to be enough. So, he decided to solve the root of the problem by himself.Now known as \"One\" (Ryan Reynolds), he recruits five other people to abandon their pasts and join his cause as \"Ghosts\": Two (Melanie Laurent) (Camille), a spy; Three (Manuel Garcia-Rulfo) (Javier), a hit-man (he was a Colombian assassin working for the drug mafia); Four (Ben Hardy) (Billy), a Parkour runner and thief (One met him after he had stolen a really expensive diamond set & was betrayed by his partners after the robbery and left for dead); Five (Adria Arjona) (Amelia), a doctor; and Six (Dave Franco), a driver.\nOne stores all their past records inside the hulk of an abandoned plane in the California desert, which is also their base of operations.One establishes a set of ground rules such as not sharing names. Leave the laggards behind.On their first mission in Florence, Italy, the team kills the lawyer of Turgistan's four generals before they are chased across the city by the Mafia and the police. The lawyer was covering for the ruler and his 4 generals by denying that any atrocities took place on their watch. Six (the driver) is killed just as they manage to get away. The getaway leaves a trail of mayhem and destruction through the entire city. The team works together as a single unit to get out of numerous tight situations, even though each member on their team has their own stress and pressure points.Days later, One recruits former Delta Force sniper Blaine and renames him \"Seven\" (Corey Hawkins). Blaine had correctly spotted a terrorist van disguised as a UN vehicle in Afghanistan (The UN was spelled backwards on top of the van) but failed to report it on time which led to the death of his entire squad when it blew up.\nOne tells Seven that this is his chance to do some good in the world by fighting some world class evil people. As the rest, Blaine fakes his own death to turn into a Ghost.One plans a mission to stage a coup to topple the government of Turgistan dictator Rovach Alimov (Lior Raz) and install his imprisoned brother Murat (Peyman Maadi) as the country's new leader during the Day of the Dead. As an ad distributor in Turgistan,\nRovach's war on his people created a million refugees, many of whom sought shelter in camps on the Turgistan border. One was visiting one of the refugee camps as part of a PR tour. He just wanted to cut the check, click a few PR photos and be on his way.\nOne had seen first-hand Rovach bomb his own population with phosphorous bombs, which burnt their bodies from the inside. One only managed to survive as he got to a mask in time. In minutes, a refugee camp with 80,000 people was reduced to a rubble. From that day on, One cared to bring the perpetrators to justice.Through the mission in Italy, the team gets their hands on the lawyer's phone, which they unlock through his eyeball, and gain access to all secure communications and travel plans of Rovach's generals. They learn that Rovach is sending them to Las Vegas for an arms deal.The team assassinates Rovach's generals in Las Vegas, but the generals have already made the deal for 2 tons of Sarin gas. One gets the information on where Rovach has hidden his brother Murt (who was delivered to him by the CIA, specifically by Two).\nRovach had hidden Murat in Hong Kong. Murat tells Rovach that the throne belongs to the people, and his atrocities will only make Murat more popular with the people.The team successfully extract Murat from the Ni Hai tower in Hong Kong. When Four is cornered by hit-men during Murat's release, Seven insists to save him (as he does not want one more death on his hands that he can avoid). Seven forces One to abandon his rule of leaving the laggards behind. Seven comes from Delta forces, who never leave one of theirs behind in a war zone.Following an argument between One and Seven, the Ghosts break their code of anonymity and reveal each other's names.\nOne also learns that Two and Three are having sex with each other.In Turgistan, One sets his plan in motion by hacking the state-run television station during Rovach's address to give Murat a voice to the people. Murat's impromptu speech inspires the citizens to revolt while strategic explosions in the city force Rovach to evacuate to his private yacht and Murat occupies the palace.\nThe Ghosts storm through the yacht and One activates a magnetic pulse to incapacitate the guards. When the yacht is immobilized in the middle of the ocean, Rovach flees in helicopter, only to discover it to be commandeered by the Murat and the Ghosts, who drop him near the border to feed him to the refugees.In the aftermath of the revolution, Murat becomes Turgistan's new president and the Ghosts part ways until they are once again needed. One travels to New York City and sees his illegitimate son, whom he will pass his fortunes should he die in the next mission.",
	"links": []
}