{
	"title": "RRR (Rise Roar Revolt)",
	"release_year": "2022",
	"runtime": "187",
	"tags": [
		"Action",
		"Adventure",
		"Drama",
		"netflix"
	],
	"rating": 7.8,
	"actors": [
		"N.T. Rama Rao Jr.",
		"Ram Charan",
		"Ajay Devgn",
		"Alia Bhatt",
		"Olivia Morris",
		"Shriya Saran",
		"Ray Stevenson",
		"Alison Doody",
		"Samuthirakani",
		"Chandra Sekhar"
	],
	"staff": [
		"S.S. Rajamouli",
		"Vijayendra Prasad",
		"S.S. Rajamouli",
		"Sai Madhav Burra",
		"Madhan Karky",
		"D.V.V. Danayya",
		"Anna Palenchuk",
		"M.M. Keeravani",
		"KK Senthil Kumar",
		"A. Sreekar Prasad",
		"Tarun Chaturvedi",
		"Jogi Mallang",
		"Sarah Trevis",
		"Sabu Cyril"
	],
	"votes": 171186,
	"cover": "https://m.media-amazon.com/images/M/MV5BNWMwODYyMjQtMTczMi00NTQ1LWFkYjItMGJhMWRkY2E3NDAyXkEyXkFqcGc@._V1_QL75_UY281_CR11,0,190,281_.jpg",
	"description": "In 1920, British Governor Scott (Ray Stevenson) and his wife Catherine (Alison Doody) visit a forest in Adilabad and forcefully take away Malli (Twinkle Sharma), a young girl with a gift for singing, from the Gond tribe. Edward (Edward Sonnenblick) is the special PA to the Governor.\nThe tribe's protector Komaram Bheem (N. T. Rama Rao Jr.) (A Gond tribal leader from Telangana who fought against the Nizam of Hyderabad for the liberation of Hyderabad State) tracks her down to Delhi, disguising himself as Akhtar, a Muslim with the help of a family in search of her. Bheem's companions include Jangu (Chatrapathi Sekhar) and Peddanna (Makarand Deshpande)The Nizamate of Hyderabad (via Venkat Avadhani (Rajeev Kanakala), special advisor to the Nizam) warns Scott's office about Bheem's mission. Police officer Alluri Sitarama Raju (Ram Charan) volunteers to catch Bheem in order to get a promotion. Ram is a staunch and upright police officer and has put his life on the line to serve the crown but has never received due credit for his work and dedication. He always overlooked for promotion opportunities which are instead given to British officers.\nThe British are in a fix over Bheem as they have no file on him, and don't even know what he looks like. So, Catherine announces that the officer who arrests him will be promoted to the rank of special officer. Ram fixates on a strategy to let Bheem come to him, by posing as an enemy of the crown.\nRam attends a meeting of independence activists and proposes to assassinate Scott. Bheem's aide Lachhu (Rahul Ramakrishna) asks Ram to join them. However, he flees after realizing that Ram is a police officer.Ram and Bheem coincidentally meet, working together to save a boy caught in a train crash. They bond with each other while hiding their original identity. Ram helps Bheem to get close to Scott's niece Jenny (Olivia Morris). Bheem had noticed that Jenny is kind to Indians and plans to use her to infiltrate the Governor's palace. Ram punctures Jenny's car tires and gets her to ask for a lift with Ram, to help him get close to her.\nBheem visits the governor's palace on Jenny's invitation, where he silently meets Malli and assures her rescue.Ram figures out that Lachhu works in a painting shop and tracks him down. He captures Lachhu, torturing him in vain to find information about Bheem. Lachhu gets hold of a banded Krait snake and throws it onto Ram. Lacchu warns Ram that its bite will quickly kill him without anti-venom, known only to the Gond people. Ram finds his way to Bheem, who treats him and confesses his true identity and mission to him.\nBheem and his men break into the palace with a truck full of wild animals. Ram arrives as an officer and confronts Bheem who fights him off and attempts to rescue Malli. Ram stops him while Scott holds Malli hostage at point-blank range, forcing Bheem to surrender.In a flashback, Ram's father, Venkata Ramaraju (Ajay Devgn), is shown to be a rebel (A revolutionary leader from Andhra Pradesh who waged an armed campaign against the British Raj) who sacrificed his life fighting the British. Sarojini (Shriya Saran), Rama Raju's mother. Venkata was raising a rebel army and was training it but lacked arms and ammunition to wage a war. Before this can be arranged, the British attack his training camp and Venkata only has 1 rifle to battle them. Venkata fights valiantly and keeps the Brits at bay while the camp evacuates. The Brits manage to shoot his fingers. Ram joins Venkata and proves that he is an expert sharpshooter. Sarojini dies during the escape, but Venkata and Ram keep on fighting and allowing more and more villagers and campers to escape. Eventually, the British retreat.\nRam promised a dying Venkata that he would deliver guns to everyone taking part in the rebellion, and then infiltrated the colonial police in an attempt to secure those weapons.Ram is promoted for capturing Bheem, who is sentenced to death via public execution. During a brutal public flogging session conducted by Ram, Scott offers Bheem mercy if he kneels and recants his crimes but Bheem refuses despite being heavily injured. He sings a defiant song that inspires a popular uprising.\nRam is informed that he will be placed in charge of a large arms shipment, granting him the opportunity to steal a large number of British guns. However, Ram feels guilty and decides to use the opportunity to save Bheem and Malli instead. He asks Scott to execute Bheem on the outskirts of the city, during which he stages an ambush. Scott recognizes this ploy (when Scott shook Ram's hand, he felt grease which came when Ram tampered with the firing pins of the guns) and injures Ram. Bheem frees himself and fights the remaining guards while Ram shoots and kills a guard menacing Malli. Misinterpreting this to be an attack, Bheem knocks out Ram and escapes with Malli.A few months later, Bheem and his men are hiding in Hathras. When British soldiers arrive looking for Bheem, Sita (Alia Bhatt), Ram's cousin and fiance, senses the danger and drives away the British by telling them that the building is housing smallpox patients. She tells Bheem that Ram now faces a death sentence for saving his best friend. Bheem regrets his actions and promises Sita that he will rescue Ram.Bheem sneaks into the barracks with the help of blueprints given by Jenny. He frees Ram from the prison, mounting him on his shoulders (since Scott had ordered his legs broken) to transport him. Together, they fight the police and escape. As Bheem treats Ram in the woods, they are ambushed by police and special forces soldiers. Ram takes a bow and arrows from a shrine of Lord Rama and retaliates. Bheem joins him with a spear. They fight off the soldiers and head towards the palace, eventually destroying the building by blasting a motorcycle into a room full of TNT. Bheem retrieves a massive cache of guns and delivers them to Ram. Catherine is killed in the chaos while Scott is killed by Ram and Bheem.They reunite with Sita, Jenny, and their allies. Ram promises to educate Bheem. Ram returns to his village and delivers the weapons, fulfilling his promise, while Bheem returns to his hamlet, reuniting Malli with her mother.",
	"links": [
		"https://www.netflix.com/title/81476453"
	]
}