{
	"title": "The Hunt",
	"release_year": "2020",
	"runtime": "90",
	"tags": [
		"Action",
		"Horror",
		"Thriller",
		"amazon"
	],
	"rating": 6.6,
	"actors": [
		"Betty Gilpin",
		"Hilary Swank",
		"Ike Barinholtz",
		"Wayne Duvall",
		"Ethan Suplee",
		"Emma Roberts",
		"Christopher Berry",
		"Sturgill Simpson",
		"Kate Nowlin",
		"Amy Madigan"
	],
	"staff": [
		"Craig Zobel",
		"Nick Cuse",
		"Damon Lindelof",
		"Jason Blum",
		"Damon Lindelof",
		"Nathan Barr",
		"Darran Tiernan",
		"Jane Rizzo",
		"Terri Taylor",
		"Matthew Munn"
	],
	"links": [
		"https://www.amazon.com/Hunt-Ike-Barinholtz/dp/B085N5RWKZ"
	],
	"votes": 131691,
	"cover": "https://m.media-amazon.com/images/M/MV5BMjVmMDY4NGMtZTk3Yi00Zjg1LTkxOWYtNGFmNTdjNzYzNDkwXkEyXkFqcGc@._V1_QL75_UX190_CR0,10,190,281_.jpg",
	"description": "A group of \"elites\" discusses the upcoming hunt of \"deplorables\".\nThe elites include Ted The Doctor (Steve Coulter), Athena Stone (Hilary Swank), Richard (Glenn Howerton), Captain O'Hara (Jim Klock), Liberty (Teri Wyble), Martin (Dean West), Sgt Dale (Steve Mokate) (a consultant to the elites), Miranda / Ma, Julius / Pa, Peter (Vince Pisani), Crisis Mike (Usman Ally).On Athena's private jet, a flight attendant talks to Richard but is interrupted by one of the strangers who was supposed to be on the hunt, Randy (Jason Kirkpatrick). Randy staggers out from the cargo hold. Ted claims to be a doctor and subdues Randy before Athena kills him. It is made clear that the strangers were transported to the manor by elites on Athena's private plane, and Randy woke up before he was supposed to.12 strangers mysteriously wake up in a clearing in the middle of an area referred to only as Manor House. The strangers are Gary (Ethan Suplee), Don (Wayne Duvall), Yoga Pants (Emma Roberts), Moses / Staten Island (Ike Barinholtz), Trucker / Shane (Justin Hartley), Crystal Creasey (Betty Gilpin), Caroline / Dead Sexy (Sylvia Grace Crim), Boxer / Target (Christopher Berry), Molly / Big Red (Kate Nowlin), Bandana Man (Walker Babington).They do not know where they are or how they got there. They all woke up with a gag in their mouths, which is locked from behind. Yoga Pants finds the keys in a small envelope kept over a wooden platform and uses that to open the gag locks.\nThey discover that they have seemingly been chosen to be hunted in a game devised by a group of wealthy elites. The group of people chosen, however, are not picked at random, but are chosen based on their conservative leanings.\nThey get weapons from a stash in a clearing. Yoga Pants is the first to be taken out by a long-range rifle. Dead Sexy is impaled on a booby trap as she runs from the gunfire. Trucker Shane goes when he steps on a landmine. The fire seems to be coming from the command bunker a fair distance away from the clearing, but with a clear line of sight.Some of the strangers come across a fence that circles the clearing the surrounding woods.\nTarget, Big Red, Vanilla Nice & Staten Island find a street across a fence and think they are near civilization. Target dies by being hunted by arrows (and subsequently killed with a grenade), while the others get on the other side of the fence.\nThe group comes across a gas station manned by 2 elites Ma and Pa who are pretending to be gas station attendants at a normal street. Ma and Pa tell the strangers that they are on route 31, near the town of Elaine in Arkansas.\nStaten Island makes a 911 call using their phone and says that a group of people has been abducted and is in the Manorgate scenario. The 911 call receiver turns out to be an elite.\nThey are shot down by Ma (Amy Madigan) & Pa (Reed Birney), who tell the strangers that climate change is real.\nMa and Pa then proceed to clean up the gas station, just in case any other strangers come by.The hunters' sport is derailed when one of the hunted, Crystal Creasey (Betty Gilpin), fights back and starts killing them one by one. She walks into the gas station and murders Ma and Pa, when she realizes that they are lying to her face (they got the cost of cigarettes wrong in the state of Arkansas, as they cost only $6 in that state).\nInspecting the pickup truck outside and removing fake license plates, Crystal learns she is in Croatia.\nShe also takes the Walkie Talkie from Ma and Pa to keep track of their communications. She notices that the strangers are being tracker by drones and manages to hide from them.She also discovers a booby-trap wired to the driver's-side door and warns Gary, a conspiracy theorist pod-caster. They board a train full of refugees, whom Gary believes to be crisis actors; the train is then raided by Croatian soldiers.\nWhen Gary tries to convince them of Manorgate and the refugees' perfidy, refugee \"Crisis Mike\" admits that he is indeed one of the hunters but the other refugees are innocent. The raid by the soldiers was unplanned, and he offers a head start for Gary's cooperation. Gary wrests a grenade from Mike and uses it to kill him. Crystal is taken to a refugee camp where she meets Don.\nOliver / Fauxnvoy (Macon Blair), an envoy from the Croatian U.S. Embassy, arrives to extract them but during the drive Crystal becomes suspicious of his comments, kicks Oliver out of the car and runs him over.She and Don find Gary's body in the trunk with a box marked \"bribe money\" and a map of the Manor. Crystal tells Don the story of \"the Jackrabbit and the Box Turtle\", in which the Jackrabbit kills the Box Turtle after losing a race with him.\nAt Oliver's intended destination, Crystal kills Richard, Ted, Martin, Peter, Liberty, and injures their tactical consultant Sgt. Dale. Athena calls out to Don via radio, asking if he killed Crystal. Don refuses to disarm aiming his gun at Crystal, who kills him.\nShe tortures Sgt. Dale to get Athena's location - revealing during their exchange that she previously served in Afghanistan - then kills him. In reality, Athena's group text exchange was a joke. However, it was leaked on the internet, creating furor over \"Manorgate\". Subsequently, the group's participants, whose careers were ruined, decide to make Manorgate a reality and abduct those responsible for spreading the conspiracy theory.Athena had insisted that Crystal be included after seeing a social media post from Crystal that offended her. When they confront each other, Crystal claims that Athena has confused her with another woman from the same city in Mississippi, with a differently spelled middle name, Mae. The two fight and impale one another on the blades of a food processor; Athena dies, but Crystal sees a jackrabbit near the body and regains some strength.\nShe cauterizes her wound, takes Athena's clothes and bag, and leaves on her jet, talking to the same flight attendant from the start of the film."
}