{
	"title": "The Two Popes",
	"release_year": "2019",
	"runtime": "125",
	"tags": [
		"Biography",
		"Comedy",
		"Drama",
		"netflix"
	],
	"rating": 7.6,
	"actors": [
		"Jonathan Pryce",
		"Jonathan Pryce",
		"Anthony Hopkins",
		"Anthony Hopkins",
		"Juan Minujín",
		"Luis Gnecco",
		"Cristina Banegas",
		"María Ucedo",
		"Renato Scarpa",
		"Sidney Cole",
		"Achille Brugnini",
		"Federico Torre"
	],
	"staff": [
		"Fernando Meirelles",
		"Anthony McCarten",
		"Jonathan Eirich",
		"Dan Lin",
		"Tracey Seaward",
		"Bryce Dessner",
		"César Charlone",
		"Fernando Stutz",
		"Javier Braier",
		"Barbara Giordani",
		"Nina Gold",
		"Francesco Vedovati",
		"Mark Tildesley"
	],
	"votes": 134212,
	"cover": "https://m.media-amazon.com/images/M/MV5BN2NlYjdkOGEtMGYyOC00MzM5LWE5MzYtYzUyZjE3NTM5NGIyXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In April 2005, Cardinal Jorge Mario Bergoglio (Jonathan Pryce), the Archbishop of Buenos Aires, is called to Vatican City after the death of Pope John Paul II to elect a new pope. Bergoglio is a famous Cardinal in Argentina and has a mass following among the people of the country. Bergoglio uses his interest in football to connect with the masses and to get them excited about the church.\nJohn Paul was a liberal Pope, but his death brought back the condemnation of homosexuality, abortion, contraception and the ordination of women and married men.\nRatzinger is a conservative but was considered a natural successor to John Paul. An inherent animosity is implied between Ratzinger and Bergoglio. Other prominent figures are Francis Cardinal Arinze (Willie Jonah) from Nigeria and Carlo Maria Cardinal Martini (Achille Brugnini) from Italy.\nGerman Cardinal Joseph Ratzinger is elected Pope Benedict XVI (Anthony Hopkins) by 115 cardinals from 52 countries; Bergoglio receives the second highest vote count. 77 votes are needed for an election and Ratzinger reaches the count by the third scrutiny.Bergoglio didn't want to be Pope but is disappointed that the church voted not to implement long overdue reforms. He returns to Argentine dejected.\nSeven years later, the Catholic Church is embroiled in the Vatican leaks scandal, and Benedict's tenure has been tainted by public accusations regarding his role in the cover-up. Controversy rages over how the Church handled pedophile priests, especially Peter Hullermann, who Cardinal Ratzinger had personally relocated to a different parish where he continued abusing children.\nPeople and abandoning the church in record numbers on Ratzinger's watch.Bergoglio has submitted his resignation as Archbishop, but the Vatican has not responded. As he prepares to go to Rome and personally deliver his resignation letter to the Pope, he receives a request to come to Vatican.\nBergoglio and Pope Benedict meet at the Palace of Castel Gandolfo (his summer residence), the Pope's summer residence. Benedict is meeting a Cardinal at this residence for the first time.\nThe two debate the roles of God and the church. Benedict does not agree with Bergoglio's views on Benedict pardoning the priests caught in child sex offenses. Benedict is not happy with Bergoglio offering communion to the divorced. Bergoglio says that the Jesus was a face of mercy, and that a communion is not a reward, but food for the mercy.\nHe also says that Bergoglio's resignation will be seen as a direct attack on the Benedict's leadership of the church as Bergoglio had the 2nd highest number of votes. The 2 end up having a heated argument about everything and the direction in which the church is heading. Bergoglio's believes that the church is distancing itself from the people. Bergoglio says that he changed his views with the times, and the church simply refuses to.\nBenedict says that the church defends 2000 years of tradition, but Bergoglio recounts the many ways in which the church has also changed and evolved.After dinner, Bergoglio shares his love for football, and says that the next year Germany and Argentina could be in the final together.\nBergoglio recounts what led him to the priesthood (In 1956, he had a girlfriend in his youth, and a chance meeting with a priest led him down the path of priesthood. Bergoglio is convinced that God himself spoke to him that day through the priest) and talks about his personal interests. The two watch Benedict's favorite TV show, Kommissar Rex, which further delays their discussion about Bergoglio's resignation.Bergoglio recounts his early life and path into the church. He ended his marital engagement and joined the Jesuits. He was met by Father Franz Jalics (Lisandro Fiks) and Father Orlando Yorio (German De Silva), who become his spiritual friends.\nBenedict rejects Bergoglio's resignation, saying the world would perceive it as a vote of no confidence in his leadership and weaken the Catholic Church. Benedict and Bergoglio put aside their differences and chat informally, gradually warming to each other. Benedict plays the piano for Bergoglio. Bergoglio is insistent about Benedict signing his resignation, but Benedict refuses.The next day, the two are helicoptered to the Vatican, during which Benedict again avoids discussing Bergoglio's resignation. Benedict notices that Bergoglio is very popular when the gardener gives him oregano herbs from the Pope's Garden.\nBenedict meets with Bergoglio in the Room of Tears within the Sistine Chapel where he confides his intention to resign the papacy. Shocked, Bergoglio objects and argues for church tradition and continuity. Benedict says that there is precedence for Pope's resigning. Benedict says that he wants Bergoglio to be there for the next conclave, and hence he cannot grant his request for retirement.Bergoglio says that a Pope must be a personification of the crucified Christ, and hence cannot resign.\nBenedict says his opinions regarding tradition are different now and believes change is essential. Benedict says Bergoglio could be his successor, but Bergoglio rejects the idea, citing the perception that he had collaborated with the Argentine military dictatorship in 1976 and his failure to protect his Jesuit friends & priests (in their mission to save the Peronists, the people who resisted the Junta). Bergoglio's failure to confront the Junta may have damaged his reputation. 30,000 people were killed. The Junta arrested the Jesuit priests, and refused to listen to Bergoglio, even though he had cooperated with them in every way.\nFollowing the \"Dirty War\", following the return of Democracy to Argentina, Bergoglio was removed as head of the Argentinians Jesuits in 1983. The Order exiled him to Cordoba and serve as an ordinary parish priest to the poor, serving them for the next ten years.Over time, Father Jalics reconciled with Bergoglio, but Bergoglio carries guilt over never reconciling with Father Yorio. Memories of his actions and inaction during the dictatorship continually haunt him. Benedict comforts Bergoglio and gives him absolution. Benedict makes his own confession, saying he no longer hears God's words and affirms his wishes to abdicate. Bergoglio comforts the Pope and offers him absolution as well. The two emerge from the room, surprising tourists. Benedict goes outside to greet the masses and take selfies with them. Bergoglio departs for Argentina.One year later, Pope Benedict XVI delivers his resignation to the world. Cardinal Bergoglio is elected Benedict's successor in the 2013 papal conclave and becomes Pope Francis. The two popes watch the 2014 FIFA World Cup Final between Germany and Argentina together.",
	"links": [
		"https://www.netflix.com/title/80174451"
	]
}