{
	"title": "Portrait de la jeune fille en feu",
	"release_year": "2019",
	"runtime": "122",
	"tags": [
		"Drama",
		"Romance"
	],
	"rating": 8.1,
	"actors": [
		"Noémie Merlant",
		"Adèle Haenel",
		"Luàna Bajrami",
		"Valeria Golino",
		"Christel Baras",
		"Armande Boulanger",
		"Guy Delamarche",
		"Clément Bouyssou",
		"Michèle Clément"
	],
	"staff": [
		"Céline Sciamma",
		"Céline Sciamma",
		"Bénédicte Couvreur",
		"Jean-Baptiste de Laubier",
		"Arthur Simonini",
		"Claire Mathon",
		"Julien Lacheray",
		"Christel Baras",
		"Thomas Grézaud"
	],
	"votes": 112835,
	"cover": "https://m.media-amazon.com/images/M/MV5BZjJlYWJlYmMtNjMyMS00ZDgxLTlmNjAtOTJhMzBiZWM5N2VmXkEyXkFqcGc@._V1_QL75_UY281_CR1,0,190,281_.jpg",
	"description": "At the end of the eighteenth century, Marianne (Noemie Merlant), a young painter, is teaching painting lessons. One of her students asks her about a painting of hers, which Marianne calls \"Portrait of a Lady on Fire\".Years prior, Marianne arrives on an isolated island in Brittany. Marriane is very passionate about her art. She travels to the Island by a small rowboat and one of her canvasses falls overboard. Marriane jumps into the water herself to retrieve it.\nShe is hosted in the reception room of the mansion, which also doubles up as a studio. Marianne is shown to be a modern woman for her era, and she smokes a pipe.She had been commissioned to paint a portrait of a young woman named Heloise (Adele Haenel), who is to be married off to a Milanese nobleman. Marianne is informed that Heloise has previously refused to pose for portraits as she does not want to be married. The marriage will proceed once Heloise's portrait is sent to the Milanese nobleman and if he approves, The Countess and Heloise will be called for.\nHeloise has arrived on the Island just a few weeks ago from the Benedictines where she served in the Convent. She was brought home after her sister died, and the sister was the one originally supposed to marry the Milanese nobleman. The sister committed suicide by jumping off the cliffs.\nIn the studio, Marianne finds an unfinished portrait of Heloise, with a full body, but no face.Marianne acts as Heloise's hired companion for her walks, to be able to paint her in secret and accompanies her on daily walks to memorize Heloise's features.\nMarianne tries to study Heloise's features such as the cartilage of her ears, her hands and her blonde hair. Heloise always stays ahead of Marriane on her walks, and so she is never able to get a good look at her.Try as hard as she may, Marianne struggles to recall Heloise's features from her memory.\nThe Countess (Valeria Golino) fears for Heloise as her sister had recently died when she was betrothed against her will. The house maid Sophie (Luàna Bajrami) believes she committed suicide.On her walks Marianne starts talking to Heloise. Heloise tells her that is not willing to marry as she knows nothing about the man, she is supposed to spend her life with. Marianne tells Heloise that she does not intend to marry ever. Heloise is jealous that Marianne has a choice in the matter.Marianne finishes the portrait but finds herself unable to betray Heloise's trust and reveals her true reason for arriving. She also burns the unfinished painting of the previous artist.\nAfter Heloise criticizes Marianne's painting saying that it looks nothing like her, Marianne destroys the work. Heloise's mother is shocked to hear that Heloise is willing to pose for Marianne over the next few days (when she had decided to fire her on want of incompetence). While her mother leaves for Italy, Heloise and Marianne's bond grows.Sophie confides to Marriane that she hasn't had a period for 3 months now.\nMarianne knows Heloise very well by now. She knows the movements Heloise makes when she is angry, she bites her lips when she is embarrassed, and she doesn't blink when she is annoyed.\nHeloise also knows Marriane equally well. She touches her face when she doesn't know what to say, she raises here eyebrows when she loses control, and she breathes through her mouth when she is troubled.One evening, they read the story of Orpheus and Eurydice while debating the true reason why Orpheus turned around to look at his wife. The pair help Sophie, a maid, have an abortion using homemade remedies, and later go to a gathering where women sing and dance, during which Heloise's dress briefly catches fire. Meanwhile, Marianne is haunted throughout the house by visions of Heloise in a wedding dress.The next day, Marianne and Heloise go to a cave and share their first kiss, and passionately make love later that night. Over the next few days, their romance grows stronger. However, it is cut short by the inevitable return of Heloise's mother. Marianne sketches drawings of each of them to remember each other and bids a short farewell. As Marianne runs out of the house, she hears Heloise say, \"Turn around\". She turns around and sees Heloise in her wedding dress.In the present, Marianne reveals that she saw Heloise two more times. The first time she sees Heloise at a gallery in the form of a portrait, where Heloise is shown to be with a child-but also surreptitiously holding onto the book that has the sketch of Marianne.\nThe second time Heloise is seen at a concert, overwhelmed with emotions as the orchestra plays Vivaldi's Four Seasons, which Marianne once played for her on a harpsichord.",
	"links": []
}