{
	"title": "tick, tick...BOOM!",
	"release_year": "2021",
	"runtime": "115",
	"tags": [
		"Biography",
		"Comedy",
		"Drama",
		"netflix"
	],
	"rating": 7.5,
	"actors": [
		"Andrew Garfield",
		"Alexandra Shipp",
		"Robin de Jesus",
		"Vanessa Hudgens",
		"Joshua Henry",
		"Jonathan Marc Sherman",
		"Michaela Jaé (MJ) Rodriguez",
		"Ben Levi Ross",
		"Judith Light",
		"Bradley Whitford"
	],
	"staff": [
		"Lin-Manuel Miranda",
		"Steven Levenson",
		"Jonathan Larson",
		"Brian Grazer",
		"Ron Howard",
		"Lin-Manuel Miranda",
		"Julie Oh",
		"Alice Brooks",
		"Myron Kerstein",
		"Andrew Weisblum",
		"Kristian Charbonier",
		"Bernard Telsey",
		"Alex DiGerlando"
	],
	"votes": 121331,
	"cover": "https://m.media-amazon.com/images/M/MV5BOGYyNGJmNzctYzZjZi00MzUzLTg3YTYtYjk0OTNjMzA1OTE4XkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 1992, Jonathan Larson (Andrew Garfield) performs his rock monologue Tick, Tick... Boom! at New York Theatre Workshop, accompanied by friends Roger (Joshua Henry) and Karessa (Vanessa Hudgens). He describes an incessant ticking noise he hears in his head and begins to tell his story. An unseen narrator explains the film is the true story of Jonathan Larson, \"except for the parts that [he] made up.\"In early 1990, Jonathan juggles work at the Moondance Diner in SoHo with preparing for a workshop of his musical and passion project Superbia (That he has been writing and rewriting for the last 8 years). He feels pressure to be successful before he turns 30: with his birthday just over a week away, he sees the workshop as his last chance. He has a party at home with friends, including his former roommate Michael (Robin De Jesús), his girlfriend Susan (Alexandra Shipp), and fellow waiters Freddy (Ben Levi Ross) and Carolyn (Mj Rodriguez). Jonathan is organizing a workshop on his musical (in a week's time), and this will be the first time someone will see their work, other than themselves.Susan (who is a dancer) tells Jonathan about a teaching job at Jacob's Pillow (she was about to join a theatre company full time when she fractured her ankle) and asks him to come. The job is in Berkshire and far away from NYC.\nMichael (who was passionate about theatre and featured in every high school play), who previously left theater (he was sick of waking up at 5 am each day and then begging the producer to even consider someone who was non-union) for a lucrative advertising career, sees Susan's offer as an opportunity for Jonathan to consider a serious future, and invites Jonathan to join an advertising focus group at his company. Michael wants Jonathan to write ad jingles and get paid for once.Jonathan's producer Ira (Jonathan Marc Sherman) asks him to write a new song for Superbia because the story needs it. This troubles him, as his idol Stephen Sondheim (Bradley Whitford) told him the same at a composing workshop some years ago, but he can't come up with anything and he only has a week. Jonathan finds himself unable to concentrate on preparing for the workshop as he thinks about Michael and Susan's offers. His anxieties are only compounded when he learns from Carolyn that Freddy, who is HIV-positive, has been hospitalized. Jonathan has to cover for Freddy at the diner, where he is a cook. It's a Sunday brunch time and the diner is full like crazy, and the tension is high with customers.\nSuperbia is Jonathan's musical, its a satire based in the future where emotions are outlawed. The masses spend their time glues to their media devices, looking at the actions of a few elites, while film their entire lives as a TV show. The first musical for the MTV generation.Susan, frustrated by Jonathan's indecisiveness and obsession with his career (he refused to given Susan anytime to discuss the job offer with Jacoc's pillow. Everything is postponed till after the workshop and Susan has a deadline to return with an answer), breaks up with him. To get money to hire a full band for the workshop, Jonathan attends the advertising focus group. However, he deliberately sabotages it, angering Michael, who feels Jonathan is wasting the privilege to have a life with the person he loves on a financially unstable theater career, something Michael cannot do as a gay man in the AIDS crisis. After receiving an encouraging call from his agent Rosa (Judith Light) (she says she has lined up every producer in New York for the presentation of his final workshop. if the presentation goes well, the musical might earn a big fat check from a producer), Jonathan tries to write the new song the night before the workshop, but his power gets cut off. He heads to a swimming pool to vent his frustrations over the workshop and his personal life, before finally coming up with the new song.At the workshop presentation are friends, family, and industry professionals, including Sondheim. Jonathan receives praise but no offers to produce Superbia. Rosa encourages him to continue writing, telling him that rejection is the life of a Broadway writer. Discouraged, Jonathan begs Michael for a corporate job, but Michael, having changed his mind after seeing the workshop, urges Jonathan to continue in musical theater, revealing he is HIV-positive. Realizing that his career obsession has cost him Susan and harmed his friendship with Michael, Jonathan wanders through New York before finding himself at the Delacorte Theater. He finds a piano and reflects on his friendship with Michael and the sacrifices he must make for his career. He and Michael reconcile.On the morning of Jonathan's 30th birthday, Sondheim calls, congratulating him and wanting to talk more about Superbia, lifting his spirits. Holding his birthday party at the Moondance Diner, he is relieved to hear Freddy is to be discharged from the hospital. Susan gifts him blank sheet music paper to help in his career and they part on amicable terms. She narrates that his next project was Tick, Tick... Boom!, before he returned to working on a previous project, which became Rent (which ran on Broadway for 12 years). She reveals he died of an Undiagnosed aortic aneurysm the night before Rent began previews Off-Broadway (he was only 35 years old). He never experienced the success he desired, but his work lives on. In 1992, Jonathan performs the final song from Tick, Tick... Boom! as he optimistically looks to the future.",
	"links": [
		"https://www.netflix.com/title/81149184"
	]
}