{
	"title": "Knives Out",
	"release_year": "2019",
	"runtime": "130",
	"tags": [
		"Comedy",
		"Crime",
		"Drama",
		"amazon"
	],
	"rating": 7.9,
	"actors": [
		"Daniel Craig",
		"Chris Evans",
		"Ana de Armas",
		"Jamie Lee Curtis",
		"Michael Shannon",
		"Don Johnson",
		"Toni Collette",
		"LaKeith Stanfield",
		"Christopher Plummer",
		"Katherine Langford"
	],
	"staff": [
		"Rian Johnson",
		"Rian Johnson",
		"Ram Bergman",
		"Rian Johnson",
		"Nathan Johnson",
		"Steve Yedlin",
		"Bob Ducsay",
		"Mary Vernieu",
		"David Crank"
	],
	"votes": 788203,
	"cover": "https://m.media-amazon.com/images/M/MV5BZTkxYjVmNDMtOGY5Yi00N2RlLWJhNGUtNjhkNTA3Zjg2N2IyXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Wealthy crime novelist Harlan Thrombey (Christopher Plummer) invites his family to his mansion for his 85th birthday party. The next morning, Harlan's housekeeper Fran (Edi Patterson) finds him dead, apparently having slit his own throat. An anonymous party pays private detective Benoit Blanc (Daniel Craig) to investigate.Blanc learns that Harlan had alienated much of his family: he had threatened to expose his son-in-law Richard (Don Johnson) (Harlan's son-in-law and Linda's husband, who helps run his wife's company) for having an affair; cut off his daughter-in-law Joni's (Toni Collette) (widow of Harlan's deceased son Neil, who is a lifestyle guru and influencing person) allowance for stealing money meant for her daughter's tuition; fired his youngest son Walt (Michael Shannon) (Harlan's youngest son, Donna's husband, and the CEO of his father's publishing company) from his publishing company; and cut his lazy grandson Ransom (Chris Evans) (Harlan's grandson, Linda and Richard's son, and a spoiled playboy) out of his will.\nNobody in the family respects Walt, although he is proud to call himself a \"self-made man\".Linda Drysdale (Jamie Lee Curtis) (Harlan's eldest daughter and Richard's wife. She is a real estate mogul who runs her own company with her husband's support). Megan \"Meg\" Thrombey (Katherine Langford) (Harlan's granddaughter, Joni and Neil's daughter, who studies at a prestigious liberal arts college). Jacob Thrombey (Jaeden Martell) (Harlan's grandson, Walt and Donna's son, who holds alt-right views and is always on his phone). Donna Thrombey (Riki Lindhome) (Harlan's daughter-in-law and Walt's wife). Wanetta \"Great Nana\" Thrombey (K Callan) (Harlan's elderly mother)Detective Lieutenant Elliot (Lakeith Stanfield) (a local detective involved in the investigation) & Trooper Wagner (Noah Segan) (a police officer involved with the investigation) are conducting the initial investigation and the family is upset as it is a suicide case.Unknown to Blanc, after the party Harlan's nurse Marta Cabrera (Ana De Armas) (Harlan's nurse and caretaker who had a close relationship with him), giving Harlan his daily medications, had a fatal mix-up between similar-looking bottles of Ketorolac and morphine. Recognizing that he was likely minutes from death from an overdose, Harlan told Marta how to avoid suspicion by making it appear he was still alive after she had driven home, and then slit his own throat to save her from any suspicion.Basically, Harlan asked Marta to leave publicly and then come back through climbing a side pipe. Then he made her dress like himself and go downstairs where Walter saw her and acknowledged her as Harlan. She then goes back up and leaves through the same pipe route that she came in. Carrying out Harlan's instructions, Marta was seen escaping the house by Harlan's very elderly mother, who mistook her for Ransom.Marta cannot lie without vomiting, so she gives technically true but incomplete answers when Blanc questions her. Blanc asks her to assist in his investigation. As they search the property, Marta attempts to conceal evidence (She uses a magnet to erase the security tapes, she steps over her foot-marks in the mud from where she re-entered the house at night). The family is shocked to learn from Harlan's lawyer that Harlan left everything to Marta. They turn on her, but Ransom helps her escape. At a restaurant, Ransom tricks Marta into confessing to him, and offers to help her in exchange for his share of the inheritance. The other Thrombeys realize that, under the slayer rule, Marta will lose the inheritance if she is found guilty of killing Harlan, but Blanc tells them that they all are still suspects. They try to persuade Marta to renounce her inheritance.Marta receives a blackmail note with a partial photocopy of Harlan's toxicology report. She and Ransom drive to the medical examiner's office, but it has been destroyed in a fire. Marta receives an email with a time and address to meet the blackmailer. When Blanc spots her and Ransom, Marta speeds away. The police catch them and arrest Ransom. Blanc explains to Marta that Harlan's mother had seen Ransom climbing down from Harlan's upstairs rooms on the night of his death.Marta goes to the address in the email and discovers Fran drugged. She performs CPR and calls 911. Marta confesses everything to Blanc, but Ransom has already informed on her. At the house, Marta finds a copy of the full toxicology report hidden in Fran's cannabis stash. Marta is about to confess to the family, but Blanc interrupts her after reading the report. He brings Marta, Ransom and the police to a room to reveal his deduction.After Ransom learned at the party that Harlan was leaving everything to Marta, he swapped the contents of Marta's medication vials so she would kill Harlan with an overdose of morphine, making her ineligible to claim his inheritance. However, Marta, an experienced nurse, administered the correct medicine without reading the labels, and is thus innocent of Harlan's death. After the death was reported as suicide, Ransom anonymously hired Blanc to discover Marta's guilt. Fran later saw Ransom swapping the vials back and sent him the blackmail note. Realizing that Marta had given Harlan the correct medication, Ransom passed on the blackmail note to Marta, removing the address and time. He destroyed the evidence of Marta's innocence by burning down the medical examiner's office and burning Fran's copy of the toxicology report. He drugged Fran with morphine and emailed her location to Marta, planning to frame Marta for Fran's murder.Marta receives a call from the hospital and says that Fran is alive. Believing that Fran will implicate him, Ransom angrily confesses and vows revenge. However, Marta vomits on Ransom; she lied that Fran had survived in order to trick Ransom into confessing. He attacks her with a knife, but discovers it is a retractable stage knife. As Ransom is taken into custody, Marta watches the Thrombeys from what is now her mansion.",
	"links": [
		"https://www.amazon.com/Knives-Out-Ana-Armas/dp/B081W544J7"
	]
}