{
	"title": "Extraction",
	"release_year": "2020",
	"runtime": "116",
	"tags": [
		"Action",
		"Crime",
		"Thriller",
		"netflix"
	],
	"rating": 6.8,
	"actors": [
		"Chris Hemsworth",
		"Bryon Lerum",
		"Ryder Lerum",
		"Rudhraksh Jaiswal",
		"Shivam Vichare",
		"Piyush Khati",
		"Sara Rumao",
		"Randeep Hooda",
		"Aarti Kulkarni",
		"Aarti Kulkarni",
		"Umakant Patil"
	],
	"staff": [
		"Sam Hargrave",
		"Joe Russo",
		"Ande Parks",
		"Anthony Russo",
		"Fernando León González",
		"Eric Gitter",
		"Chris Hemsworth",
		"Mike Larocca",
		"Anthony Russo",
		"Alex Belcher",
		"Henry Jackman",
		"Newton Thomas Sigel",
		"Ruthie Aslan",
		"Peter B. Ellis",
		"Sarah Finn",
		"Philip Ivey"
	],
	"votes": 268947,
	"cover": "https://m.media-amazon.com/images/M/MV5BNDBhMmI3OWYtZTA2Ny00Y2RjLTliMWQtYWY5MGIwN2RlZGFjXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Tyler Rake is fighting Bangladesh security forces on a bridge in the middle of downtown Dhaka. Tyler is heavily injured as he is again shot by a bullet from an unseen gun. Tyler takes a moment to gather himself as he ponders his next move.2 days ago, in Mumbai India. After a day at school, Ovi Mahajan (Rudhraksh Jaiswal) - son of an incarcerated Indian drug lord - sneaks out of his house to visit a club. Ovi leads an extremely protected and isolated life and the only time he gets to interact with people his own age is when he goes to school. Ovi's friends had convinced him to join a party at a club, which was attended by a girl from school that Ovi is interested in.\nOvi is kidnapped by police officers working for rival drug Bangladeshi lord Amir Asif (Priyanshu Painyuli).\nSaju Rav (Randeep Hooda), a former Indian Special Forces soldier and Ovi's protector, visits Ovi's father in prison.\nUnwilling to pay the ransom as it will hurt the prestige of Ovi's father, Ovi Mahajan Sr. (Pankaj Tripathi) orders Saju to retrieve his son, threatening Saju's own family if he fails.Tyler Rake (Chris Hemsworth), a black-market mercenary and former Australian Special Air Service Regiment soldier, is recruited by fellow mercenary Nik Khan (Golshifteh Farahani) to rescue Ovi from Dhaka, Bangladesh. Tyler was backpacking in Kimberly, Australia when he got the call from Nik. Tyler has some sort of a death wish and takes on the most dangerous missions from Nik. Asif owns an army in Dhaka and extracting Ovi is going to be near impossible.\nTyler is shown to have extreme physical endurance and an ability to hold his breath underwater for extended periods of time.Rake and Khan's team prepare to extract Ovi, with his father's men set to pay them once Ovi is recovered. Tyler poses as a ransom payer for Ovi and is taken to his location to exchange the boy for money.\nRake rescues Ovi kills his captors and takes him to the extraction point. Tyler had one sniper Gaetan \"G\" (Sam Hargrave), posted outside, who made sure that all threats from outside the apartment are also eliminated.\nLearning of Ovi Jr.'s escape, Asif orders the head of the local police, Colonel Rashid (Shataf Figar), to initiate an immediate lock-down of Dhaka, securing all bridges and travel points out of the city.Tyler takes Ovi to an abandoned factory to prepare him for extraction and re-arms himself. He also gives Ovi something to eat to bring his blood sugar levels back up. The extraction point is a boat about 2400 meters away and Tyler starts going towards it.\nOvi's father's men intentionally fail to transfer the funds. Instead, Saju kills Rake's teammates on the boat, and intends to bring Ovi back himself to avoid any payment to the mercenary group. Khan was monitoring the whole situation via a satellite and alerts Tyler to the presence of another shooter near the boat. Tyler manages to escape with Ovi, as Dhaka police finds the boat.Saju yells out to Ovi and says that he is working on behalf of his father to bring him back. Ovi begs Tyler to let him go, but Tyler senses that something is wrong, as he was the one supposed to be working for Ovi Sr. Tyler notices that Saju is working with Dhaka police to pursue Tyler. But in reality, Saju was disposing of the Dhaka police forces, so he could get his hands on Ovi himself.After a lengthy car chase, Tyler takes Ovi into an apartment building, pursued by Saju and Dhaka Police. Tyler eliminates Dhaka police commando forces in brutal one to one close combat. Lastly, Saju attacks Tyler before he can escape with Ovi. Saju manages to get his hands on Ovi when a car plows into Tyler, but then Tyler drives a truck into Saju and throws him off, to get Ovi back.\nTyler then stages an accident of the truck (Tyler and Ovi had jumped off it, moments before it crashed) to convince Dhaka police that they were dead.\nTyler is heavily injured and takes refuge in a factory office to do some basic first aid on himself.Khan (who is working out of a command-and-control center in Dhaka) arranges for a helicopter to extract Rake outside the city (4 Kms from his current location). Nik says that they were played as Ovi Sr got them to do the heavy lifting and had no intention to pay. Nik tells him to abandon Ovi as they will not get paid for Ovi's extraction contract. He refuses, haunted by memories of his own son, who died at a young age when he left.Saju meanwhile calls his wife and tells her to disappear with his son, if he does not call back again within 12 hours.Nik confirms the location of the helicopter on the other side of a Dhaka bridge. As Tyler exits the factory with Ovi, he then fights off a gang of boys led by Farhad (Suraj Rikame), who is a young criminal determined to impress Asif. Tyler swats the kids off, and hides with Ovi in the sewers as the police approach the location.\nRake calls his friend Gaspar (David Harbour), a retired squad-mate living in Dhaka, and he and Ovi lay low at Gaspar's home.\nGaspar reveals Asif has placed a $10 million bounty on Ovi, which he offers to share if Rake allows him to kill Ovi. Rake refuses and fights Gaspar, who gains the upper hand but is fatally shot by Ovi.Rake calls Saju and asks for his help, forcing them to team up to escape Dhaka. Rake draws attention away from a disguised Saju and Ovi as the two make their way through a bridge checkpoint, then follows to cover their escape. Khan and her remaining mercenaries' approach from the opposite side of the bridge, as Asif watches from afar with binoculars.\nIn the ensuing firefight, Saju is sniped by Asif's colonel, who is in turn sniped by Khan. Wounded, Rake instructs Ovi to run to Khan's waiting helicopter. As Rake follows, he is shot in the neck by Farhad and, seeing Ovi is safe, falls into the river. Ovi, Khan, and the extraction team escape to Mumbai.Eight months later, Khan encounters Asif in a restroom and promptly shoots him to death. Meanwhile, Ovi Jr, who's returned to Mumbai, jumps into his school's swimming pool to practice holding his breath, mirroring the scene where Tyler is introduced chronologically in the film. He surfaces to see a blurred vision of a man resembling Tyler watching him.",
	"links": [
		"https://www.netflix.com/title/80230399"
	]
}