{
	"title": "Eternals",
	"release_year": "2021",
	"runtime": "156",
	"tags": [
		"Action",
		"Adventure",
		"Fantasy"
	],
	"rating": 6.3,
	"actors": [
		"Gemma Chan",
		"Richard Madden",
		"Angelina Jolie",
		"Salma Hayek",
		"Kit Harington",
		"Kumail Nanjiani",
		"Lia McHugh",
		"Brian Tyree Henry",
		"Lauren Ridloff",
		"Barry Keoghan"
	],
	"staff": [
		"Chloé Zhao",
		"Chloé Zhao",
		"Patrick Burleigh",
		"Ryan Firpo",
		"Kaz Firpo",
		"Kevin Feige",
		"Nate Moore",
		"Ramin Djawadi",
		"Ben Davis",
		"Dylan Tichenor",
		"Craig Wood",
		"Sarah Finn",
		"Eve Stewart"
	],
	"votes": 393917,
	"cover": "https://m.media-amazon.com/images/M/MV5BZTBiZjI2M2UtZTNiNy00NmU4LWJiMjYtZjk4MDIzMzhlMjFlXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "In 5000 BC, ten super-powered Eternals\n1. Ajak (Salma Hayek) (The wise and spiritual leader of the Eternals, who has the ability to heal and is the \"bridge\" between the Eternals and the Celestials),\n2. Sersi (Gemma Chan) (An empathetic Eternal with a strong connection to humans and the Earth, who can manipulate and transform matter through physical contact. Loves Ikaris),\n3. Ikaris (Richard Madden) (An Eternal who can fly and project cosmic energy beams from his eyes, and is determined to fulfill his purpose),\n4. Kingo (Kumail Nanjiani) (An Eternal who can project cosmic energy projectiles from his hands. Enamored with fame, Kingo becomes a popular Bollywood film star),\n5. Sprite (Lia McHugh) (An Eternal who can project life-like illusions. Sprite has the physical appearance of a 12-year-old child. an \"old soul\" dissatisfied with humanity),\n6. Phastos (Brian Tyree Henry) (An Eternal and an intelligent weapons and technology inventor),\n7. Makkari (Lauren Ridloff) (An Eternal who can move at superhuman speed),\n8. Druig (Barry Keoghan) (An aloof Eternal who can manipulate the minds of others),\n9. Gilgamesh (Don Lee) (The strongest Eternal, with a deep connection to Thena), and\n10. Thena (Angelina Jolie) (An elite warrior Eternal who can form any weapon out of cosmic energy and develops a close bond with Gilgamesh over the centuries)\nare sent by the Prime Celestial Arishem (David Kaye) (who created the first sun) to Earth on their star-ship from the planet Olympia, the Domo, to exterminate the invasive Deviants (who destroy intelligent life). The last of the Deviants are killed in 1521, and the group's opinions differ over their continued responsibilities and their relationship with humankind. Over the next five hundred years, they mostly live apart from each other, awaiting Arishem's return.In 1521, the team was in Tenochitalana. Thena starts attacking everyone and is diagnosed with the Mahd Wy'Ry. Ajak says her mind is crumbling under the weight of her memories, and the only cure is to wipe her memories clean. Meanwhile Druig is distraught at humans attacking each other, and questions Ajak's policy of not interfering in human wars. Druig leaves with the humans. And Gilgamesh offers to stay with Thena, without wiping her memories. Ajak allows everyone to go their own way.In the present day, Sersi and Sprite live together in London. After Sersi was left by her partner Ikaris centuries earlier, she is now in a relationship with human Dane Whitman, who works at the Natural History Museum. The trio is attacked by the Deviant Kro (Bill Skarsgård), with Ikaris arriving and chasing the creature away. Realizing the Deviants have returned (And the latest version has the power to heal itself, which they could never do before), they travel to South Dakota to reunite with their leader, Ajak, only to find that she had been killed by Kro.Sersi is posthumously chosen by Ajak as her successor, granting her the ability to communicate with Arishem. Sersi goes about bringing the team back together. Kingo is a Bollywood star. They find Gilgamesh and Thena in Australia. Gilgamesh says that Thena talk about everyone on Centauri-6 (her home planet) being killed in a giant Earthquake. Sersi knows that she experienced an earthquake in London, just before the deviant attack.Sersi figures out how to contact Arishem, who reveals that the mission of the Eternals was not to fight the Deviants but to prepare Earth for the \"Emergence\". Arishem explains that for millions of years, the Celestials have been planting their seeds on populated planets for new Celestials to be born, with the Deviants sent by them to destroy the apex predators of each planet to ensure the development of intelligent life. However, when the Deviants (who were also created by Arishem) evolved and began hunting the planets' native populations (and Arishem lost control of them), the Celestials created the Eternals to cull them. With the reversal of the Blip, Earth has reached the necessary population (whose energy the Celestial will absorb in order to be born) for the birth of the Celestial Tiamut, which will result in Earth's destruction. The mission was to grow the human population to feed the birth of a Celestial.Arishem explains that Celestials use the energy of the host planet to create new starts, keeping on the circle of life in the Universe. Arishem says that there is no Olympia and that Ajak and Sersi have helped the birth of many Celestials over millions of yrs. The Eternals are programmed (they are not alive) in the world forge, controlled by Arishem. The memory of each eternal is erased and reset after each emergence.Having learned to love humanity, the Eternals reassemble and decide to prevent the Emergence. They also realize that Thena is not mad and her past memories are from the previous Emergences. The plan is to put the Celestial to sleep till they can figure out how to let it emerge without destroying the planet.They reconvene with Kingo, Thena, and Gilgamesh before heading to Druig's residence in the Amazon rain-forest, where they are attacked by Kro and the Deviants. The group successfully kill most of them, only for Kro to kill Gilgamesh (And absorbing its power. and turning more humanoid with each killed Eternal) before fleeing (Gilgamesh was protecting Thena, who was having a Mahd Wy'Ry episode in the middle of the Deviant attack). After cremating him, they visit Phastos (who had given up on humanity after his technology had helped the humans explode the atomic bomb on Hiroshima in 1945), who proposes for Druig to put Tiamut to sleep by amplifying his mind-control powers with the Uni-Mind, a connection between all the Eternals (thereby pooling the powers of all Eternals into a single Eternal). The team also finds Makkari, who has been living in the Domo.Ikaris reveals he was informed of the Emergence by Ajak centuries before and, choosing to remain loyal to Arishem (He believed in Arishem's design for the planet), fed Ajak to the Deviants six days prior to prevent her from stopping it (Ajak wanted to stop it as she believed in humans as they were able to fight Thanos and resurrect half the population of the Universe), before planting her body back at her house to feign ignorance. Sprite joins Ikaris as he flees due to her unrequited love for him, while Kingo also leaves the group as he does not wish to face Arishem or fight his teammates.Sersi doubts why she has been chosen as the leader since without Ikaris the team is weak. Thena tells Sersi that she loves the humans, the most and hence naturally she will be the most inclined to protect them. As such, she is the right leader for the Eternals. Phastos uses the sphere inside Sersi (which she uses to communicate with Arishem), to create the Uni-mind.Makkari locates the place of the Emergence at the foot of an active volcano in the Indian Ocean, and the Eternals battle Ikaris and Sprite before being attacked by Kro, who is then killed by Thena. Druig knocks out Sprite after she attempts to kill Sersi, and the remaining Eternals work together to subdue Ikaris while Phastos activates the Uni-Mind. Ikaris breaks free of his restraints and approaches Sersi to kill her but finds himself unable to do so due to his love for her. As both he and Sprite join the Uni-Mind, Sersi gains enough power to turn Tiamut to marble. Guilt-ridden, Ikaris flies into the Sun, while at Sprite's request, Sersi uses the remaining energy from the Uni-Mind to turn Sprite into a human, ending her permanent childlike state.Thena, Druig, and Makkari depart on the Domo to find other Eternals, while Sersi, Phastos, Kingo, and Sprite remain on Earth. Dane professes his love for Sersi and is about to reveal a secret about his family history when she, along with Phastos and Kingo, are remotely dragged into space by Arishem. Arishem states he is displeased with their treason but elects to spare humanity if the Eternals' memories show that humans are worthy of living. Vowing to return for judgment, he disappears into a singularity, taking the trio with him.In a mid-credits scene, Thena, Makkari, and Druig are visited by the Eternal Eros (Harry Styles), Thanos' brother, and his assistant Pip the Troll, who offer their help. In a post-credits scene, Dane opens an old chest inherited from his ancestors that contains the legendary Ebony Blade when an unseen person questions him whether he is ready for it.",
	"links": []
}