{
	"title": "El Camino",
	"release_year": "2019",
	"runtime": "122",
	"tags": [
		"Action",
		"Crime",
		"Drama",
		"amazon",
		"netflix"
	],
	"rating": 7.3,
	"actors": [
		"Aaron Paul",
		"Jonathan Banks",
		"Matt Jones",
		"Charles Baker",
		"Todd Terry",
		"Julie Pearl",
		"Gregory Steven Soliz",
		"Larry Hankin",
		"Jesse Plemons",
		"Tom Bower"
	],
	"staff": [
		"Vince Gilligan",
		"Vince Gilligan",
		"Melissa Bernstein",
		"Vince Gilligan",
		"Mark Johnson",
		"Charles Newirth",
		"Dave Porter",
		"Marshall Adams",
		"Skip Macdonald",
		"Sharon Bialy",
		"Sherry Thomas",
		"Judy Rhee"
	],
	"votes": 300249,
	"cover": "https://m.media-amazon.com/images/M/MV5BYTYxMjI2YzUtODQ5Mi00M2JmLTlmNzItOTlkM2MyM2ExM2RlXkEyXkFqcGc@._V1_QL75_UY281_CR18,0,190,281_.jpg",
	"description": "In a flashback, Jesse Pinkman (Aaron Paul) and Mike Ehrmantraut (Jonathan Banks) discuss their departure from Walter White's Meth business. Jesse asks Mike where he would go to start over and Mike says if he was younger, he would go to Alaska, an idea Jesse finds appealing. Jesse expresses a desire to make amends for past wrongdoing, but Mike cautions that starting over will make it impossible.In the present, Jesse flees the Brotherhood compound in Todd Alquist's (Jesse Plemons, one of Jesse's captors and a member of the Neo-Nazi group that forces Jesse to cook Meth) El Camino. He goes to the home of Skinny Pete (Charles Baker) and Badger (Matt Jones), who hide the car and give Jesse a place to sleep. The next morning, Jesse calls Old Joe (Larry Hankin, the owner of a local junkyard who previously helped Jesse and Walter with several activities connected to their Meth business) to dispose of the El Camino, but Joe leaves after finding its LoJack (a tracker device which means that the police is on the way). Pete and Badger give Jesse the money they got from Walt and Badger gives Jesse his Pontiac Fiero. Badger then drives Pete's Ford Thunderbird several hours south to make it appear Jesse fled to Mexico. Pete stays home and awaits police, intending to cover for Jesse by claiming he traded the Thunderbird for the El Camino. Jesse learns from the news that Walt died at the compound and Lydia Rodarte-Quayle is critically ill from being poisoned.In a flashback to Jesse's captivity, Todd takes Jesse to his apartment to help dispose of his cleaning lady, who he killed after she discovered his hidden money. They sidestep Lou, Todd's busybody neighbor, and bury the corpse in the desert. In the present, Jesse sneaks into Todd's apartment and searches for the cash. After seeing a news report with his parents begging him to surrender, he falls back against Todd's refrigerator in frustration and hears something shift, leading him to the new hiding place inside its door. Neil (Scott MacArthur, a welder involved in Jesse's captivity) and Casey (Scott Shepherd) identify themselves as police to Lou and enter the apartment to search. Jesse hides but holds Casey at gunpoint after Casey finds him. Neil disarms Jesse, who realizes they are not police, but thugs also looking for Todd's money. To save himself, Jesse reveals he found the cash, and Casey distracts Lou while Jesse and Neil bargain over dividing it. As they depart, Jesse recognizes Neil as the welder who built the tether he was fastened to while forced to cook Meth for the Brotherhood.Jesse finds Saul Goodman's \"Disappearer\", Ed Galbraith (Robert Forster, a vacuum cleaner store owner who relocates people running from the law and gives them new identities), who wants $125,000 to aid Jesse plus $125,000 for the previous occasion Jesse was supposed to use his services but failed to appear. Jesse is $1,800 short and Ed refuses to help. Knowing they are being monitored, Jesse calls his parents and feigns willingness to surrender, drawing them and police away from the Pinkman house. Jesse enters unseen and takes a Colt Woodsman and an Iver Johnson Hammerless from his father's safe.Jesse drives to Neil's shop, where Neil, Casey and three friends celebrate with escorts and cocaine. He asks for $1,800 and Neil refuses. Upon seeing the Woodsman in Jesse's waistband, Neil challenges Jesse to a duel for his share of the cash. Jesse agrees and Neil reaches for his gun, but Jesse shoots him with the Hammerless, which was concealed in his coat pocket and already aimed at Neil. Casey attempts to fire at Jesse, but Jesse kills him. Jesse collects the driver's licenses of the remaining men and lets them leave after threatening to return and kill them if they tell police. He recovers Neil's cash and departs after setting an explosion to cover his tracks.In a flashback, Walt (Bryan Cranston) and Jesse have breakfast after a multi-day Meth cook. Estimating they will make more than $1 million, Walt laments having waited his entire life to do something \"special\", and says Jesse is \"lucky\" because he will not have to wait.\nEd provides Jesse a new identity and smuggles him to Haines, Alaska. Jesse hands Ed a letter for Brock Cantillo and says there is no one else he wants to say goodbye to. As Jesse drives off, he has a flashback to his time with Jane Margolis (Krysten Ritter, Jesse's deceased girlfriend). He tells her he admires what she said about going wherever the universe takes her, but she dismisses it as \"metaphorical\" and encourages him to make his own decisions. Jesse drives on, smiling at the prospect of a new life.",
	"links": [
		"https://www.amazon.com/Breaking-Bad-Complete-El-Camino/dp/B0BRYRN36X",
		"https://www.amazon.com/El-Camino-Breaking-Movie-Blu-ray/dp/B08FKTWS8R",
		"https://www.netflix.com/title/81078819"
	]
}