{
	"title": "Shang-Chi and the Legend of the Ten Rings",
	"release_year": "2021",
	"runtime": "132",
	"tags": [
		"Action",
		"Adventure",
		"Fantasy",
		"amazon"
	],
	"rating": 7.4,
	"actors": [
		"Simu Liu",
		"Simu Liu",
		"Awkwafina",
		"Tony Leung Chiu-wai",
		"Ben Kingsley",
		"Meng'er Zhang",
		"Fala Chen",
		"Michelle Yeoh",
		"Wah Yuen",
		"Florian Munteanu",
		"Andy Le"
	],
	"staff": [
		"Destin Daniel Cretton",
		"Dave Callaham",
		"Destin Daniel Cretton",
		"Andrew Lanham",
		"Steve Englehart",
		"Kevin Feige",
		"Jonathan Schwartz",
		"Joel P West",
		"Bill Pope",
		"Elísabet Ronaldsdóttir",
		"Nat Sanders",
		"Harry Yoon",
		"Sarah Finn",
		"Sue Chan"
	],
	"votes": 445267,
	"cover": "https://m.media-amazon.com/images/M/MV5BZmY5MDcyNzAtYzg3MC00MGNlLTg3OGItNmRjYThkZGVlNzAyXkEyXkFqcGc@._V1_QL75_UX190_CR0,0,190,281_.jpg",
	"description": "Around a thousand years ago, Xu Wenwu (Tony Leung) discovers the mystical ten rings which grant immortality and godly powers. Legend says that Wenwu found the rings in a crater or in a tomb.\nHe establishes the Ten Rings organization, conquering kingdoms and toppling governments throughout history. In 1996, Wenwu searches for Ta Lo, a village said to harbor mythical beasts. The people of Ta Lo are rumored to practice a martial arts style from the Gods.\nHe travels through a magical shape shifting forest to the village entrance but is stopped by guardian Ying Li (Fala Chen). Wenwu is not able to defeat Ying Li even with the rings.\nThe two fall in love, and when the Ta Lo villagers reject Wenwu, Li chooses to leave with him. They marry and have two children, Shang-Chi (Simu Liu) and Xialing (Meng'Er Zhang). Wenwu abandons his organization and locks away the ten rings. When Wenwu removes the rings he also loses his immortality and starts aging naturally.\nLi gives Shang-Chi a pendant to help him find his way home, if he is ever lost.When Shang-Chi is seven years old, Li is murdered by Wenwu's enemies, the Iron Gang. Wenwu dons the ten rings once again, massacres the Iron Gang, and resumes leadership of his organization. He makes Shang-Chi undergo brutal training in martial arts but does not allow Xialing to train with the others, prompting her to secretly teach herself. When Shang-Chi is 14, Wenwu sends him to assassinate the Iron Gang's leader (The one who killed his mom). After completing his mission, a traumatized Shang-Chi runs away to San Francisco and adopts the name \"Shaun\".In the present day, Shang-Chi works as a parking valet with his best friend Katy (Awkwafina), who does not know about his past. Shang has a normal life and spends his time with Mrs. Chen (Jodi Long), Katy's mother; Ruihua (Dallas Liu), Katy's brother and Katy's grandmother (Tsai Chin)\nThey are attacked on a bus by the Ten Rings (led by Razor Fist (Florian Munteanu), A member of the Ten Rings who has a machete blade for his right hand), who steal a pendant that Li gave to Shang-Chi. Katy realizes that Shang is a skilled martial arts warrior.\nRazor Fist had mentioned Shang's sister to him and so he knew that Razor was going after her next.Shang-Chi flies out to meet his sister, fearing that the Ten Rings will go after her matching pendant. He reveals his past to Katy, who insists on helping him. They find Xialing at an underground fight club in Macau, which she founded after escaping from Wenwu at sixteen. Jon Jon (Ronny Chieng) is Xialing's announcer and her right-hand man at the fight club. Xialing is super angry at Shang-Chi for abandoning her with their father. The Ten Rings attack the fight club and Wenwu arrives to capture Shang-Chi, Katy, Xialing, and her pendant.They are taken to the Ten Rings' compound, where Wenwu uses the pendants to reveal a mystical map leading to Ta Lo (the village is protected by a shape shifting forest, but once every year it creates a direct path through the forest to Ta Lo).\nWenwu explains that he has heard Li calling to him and believes she has been held captive in Ta Lo behind a sealed gate. Wenwu says that the elders of Ta Lo are punishing Li for defying their wishes and for leaving with Wenwu. He plans to destroy the village unless they release her. When his children and Katy object, he imprisons them.\nThe three meet former actor Trevor Slattery (Ben Kingsley), whom the Ten Rings imprisoned for impersonating Wenwu. Trevor ended up becoming a \"court jester\" or Shakespearean fool for Wenwu, and his Hundun companion (a magical creature that Li captured from in front of the entrance of the village) Morris (Dee Baker), who offers to guide them to Ta Lo.The group escapes and goes to Ta Lo (Morris guides them through the open pockets in the shape shifting forest), which exists in a separate dimension with various Chinese mythological creatures. Guang Bo (Yuen Wah) is one of the leaders of Ta Lo and wants Shang and Xialing to return.\nThey meet Ying Nan (Michelle Yeoh), Li's sister, who explains the history of Ta Lo: Four thousand years ago, the universe containing the village was attacked by the soul-consuming Dweller-in-Darkness and its minions.\nAfter conquering the other Universe and their planets and cities, the dark forces wanted to attack Earth's universe and Ta Lo's armies tried to stop it from reaching the portal to Earth's universe. They were saved by a Chinese dragon called the Great Protector who helped seal the Dark Gate to the Dweller's world. The dark gate is now protected by the Village and all the mystical creatures living in it.According to Nan, the Dweller-in-Darkness has been impersonating Li so that Wenwu will use the ten rings to open the Gate (only the ten rings have the power to open the gates). Shang-Chi, Xialing, and Katy join the villagers in training and preparing for Wenwu's arrival, using outfits and weapons crafted from dragon scales.\nThe villagers have access to Dragon scales which powers all of their weapons. The siblings are also given special suits made from dragon scales. Katy is trained in archery and Xialing is given a dragon scale knife as her weapon. Nan trains Shang in martial arts.Wenwu and the Ten Rings arrive and attack. Wenwu overpowers Shang-Chi and forces him into the nearby lake, then attacks the Gate with the rings. This allows some of the Dweller's minions to escape, and the Ten Rings join forces with the villagers to fight them. The Great Protector revives Shang-Chi and bears him from the lake to battle the minions. Wenwu and Shang-Chi fight once more and Shang-Chi gains the upper hand but chooses to spare Wenwu. The Dweller-in-Darkness escapes the weakened Gate and attacks Shang-Chi. Wenwu saves Shang-Chi, bequeathing him the rings before being killed by the Dweller-in-Darkness.\nShang-Chi, the Great Protector, Xialing, and Katy manage to kill the Dweller-in-Darkness.\nAfterward, Shang-Chi and Katy return to San Francisco, where the sorcerer Wong (Benedict Wong) summons them to Kamar-Taj.In a mid-credits scene, Wong introduces Shang-Chi and Katy to Bruce Banner and Carol Danvers while researching the rings' origin. They discover that the rings are acting as a beacon to something.\nIn a post-credits scene, Xialing becomes the new leader of the Ten Rings, training women alongside men, despite having told Shang-Chi that she was going to disband the organization.",
	"links": [
		"https://www.amazon.com/Shang-Chi-Legend-Ten-Rings-Simu/dp/B09LKGZ943"
	]
}